{
    "id": "2094d7b6782437064283cb64b5d8dca151e0807c",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602602F"
        },
        "ProgramElementTitle": {
            "val": "Conventional Munitions"
        },
        "R1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "86.328"
            },
            "CurrentYear": {
                "val": "99.851"
            },
            "BudgetYearOne": {
                "val": "109.649"
            },
            "BudgetYearOneBase": {
                "val": "109.649"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "114.114"
            },
            "BudgetYearThree": {
                "val": "116.214"
            },
            "BudgetYearFour": {
                "val": "123.950"
            },
            "BudgetYearFive": {
                "val": "131.390"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program investigates, develops, and establishes the technical feasibility and military utility of guidance and ordnance technologies for conventional air-launched munitions.  Program supports core technical competencies of fuze technology; energetic materials; damage mechanisms; munitions aerodynamics, guidance, navigation, and control; terminal seeker sciences; and munition systems effects.  Technologies to be developed include blast, fragmentation, penetrating and low-collateral damage warheads, hard-target fuzing, precise terminal guidance, and high performance and insensitive explosives.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  \n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "87.387"
                },
                "CurrentYear": {
                    "val": "99.851"
                },
                "BudgetYearOne": {
                    "val": "101.043"
                },
                "BudgetYearOneBase": {
                    "val": "101.043"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "86.328"
                },
                "CurrentYear": {
                    "val": "99.851"
                },
                "BudgetYearOne": {
                    "val": "109.649"
                },
                "BudgetYearOneBase": {
                    "val": "109.649"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.059"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "8.606"
                },
                "BudgetYearOneBase": {
                    "val": "8.606"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.118"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.941"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.606"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.606"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2017 due to increased emphasis on technologies for distributed, low-cost seekers and weapon guidance."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "622068"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Guidance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.317"
                        },
                        "CurrentYear": {
                            "val": "46.822"
                        },
                        "BudgetYearOne": {
                            "val": "52.733"
                        },
                        "BudgetYearOneBase": {
                            "val": "52.733"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "56.056"
                        },
                        "BudgetYearThree": {
                            "val": "49.982"
                        },
                        "BudgetYearFour": {
                            "val": "62.079"
                        },
                        "BudgetYearFive": {
                            "val": "70.211"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, develops, and evaluates conventional munitions guidance technologies to establish technical feasibility and military utility of innovative munition seekers, weapon aerodynamics, navigation and control, and guidance subsystem integration\/simulation.  Project payoffs include adverse-weather, Global Positioning System (GPS)-degraded and GPS-denied, networked, and autonomous precision munition guidance capability; increased number of kills per sortie; increased aerospace vehicle survivability; improved weapon reliability and affordability; and improved weapon survivability and effectiveness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Seeker Technologies"
                                    },
                                    "Description": {
                                        "val": "Develops seeker technologies for air-delivered munitions to provide high confidence target discrimination and classification, precise target location, and robust terminal tracking."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "Completed an experimental initial proof-of-concept wide-field-of-view seeker based on bio-inspired research activities which increased options for countermeasure resistance and alternate navigation concepts and concurrently reduced design complexity.  Developed adverse weather and high-speed applications that simplify, increase the flexibility, and reduce the cost of advanced seekers.  Developed algorithmic approaches to integrate weapons into the kill chain and enable flexible targeting with or without an operator in the loop.  Developed mathematical techniques that enable distributed seeker imaging and targeting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.500"
                                            },
                                            "Text": {
                                                "val": "Continue to refine wide-field-of-view seeker proof-of-concept with emphasis on high-resolution sensors, particularly with bio-inspired and high-rate processing characteristics to allow precise munition terminal guidance in degraded, contested environments.  Continue to develop technologies that simplify, increase the flexibility, and reduce the cost of advanced seekers (passive and active electro-optical, infrared, and radar munition) with focus on combat operations in adverse weather and in high-speed applications.  Continue to develop algorithmic approaches to integrate weapons into the kill chain and enable flexible targeting with or without an operator in the loop.  Continue to develop mathematical techniques that enable distributive seeker imaging and targeting.  Explore terminal seeker technologies that enable innovative air-to-air engagements for fifth generation aircraft and beyond.  Explore incorporation of open architecture principles to reduce cost and technology refresh within seeker subsystems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.582"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.582"
                                            },
                                            "Text": {
                                                "val": "Continue to emphasize technology development of multi-function sensors, rapid data compression for targeting, bio-inspired information processing and data fusion, and low-power computation.  Continue to develop technologies that simplify, increase flexibility, and reduce the cost of advanced seeker concepts.  Continue to develop algorithmic and mathematical approaches to integrate weapons into the kill chain and enable distributive, flexible seeker imaging targeting with or without an operator in the loop.   Continue to explore terminal seeker technologies that enable innovative air-to-air engagements for fifth generation aircraft and beyond.  Continue to explore incorporation of open architecture principles to reduce cost and technology refresh within seeker subsystems.  Develop distributed, low-cost seeker technology hardware.  Conduct research on integrated processing techniques to enable networked systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerodynamics, Navigation and Control Technologies"
                                    },
                                    "Description": {
                                        "val": "Develops weapon aerodynamic, control, navigation, and networking technologies for air-delivered munitions to provide precise, agile flight, networked effects, and immunity to countermeasures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.560"
                                            },
                                            "Text": {
                                                "val": "Completed hardware-in-the-loop tests of an adaptive autopilot for a boosted penetrator concept.  Completed flight experiments demonstrating navigation using optical aiding.  Developed linked aero-structural-thermal computational tools to predict flight performance of hypersonic weapons and tools to develop prototype concepts for further analysis.  Developed algorithms for guidance and control of advanced weapons concepts in a contested electromagnetic environment.  Matured technologies for precision weapon navigation in the absence of GPS.  Demonstrated navigation in GPS jamming scenarios, geo-locating, and homing on emitting ground targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.212"
                                            },
                                            "Text": {
                                                "val": "Continue to mature linked aero-structural-thermal computational tools to predict flight performance of hypersonic weapons and tools to develop prototype concepts for further analysis.  Continue to mature algorithms for guidance and control of advanced weapons concepts in a contested electromagnetic environment.  Continue to develop technologies that achieve precision navigation in contested electromagnetic spectrum and under GPS-degraded and GPS-denied conditions.  Continue to develop weapon navigation and control networking technologies that provide enhanced mission capability in denied or anti-access environments, facilitate agile and maneuverable weapons, foster autonomy, trust, and networking, and enable precise munition control and actuation.  Integrate technologies for weapon-platform interfaces, including advanced high capacity carriage and release technology  to enable flexible, reprogrammable load-outs and achieve hardware and software modularity.  Integrate algorithms to support distributed, multi-strategy weapon concept-of-operations to defeat enemy defenses.  Develop airframe and control technologies that enable innovative air-to-air engagements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.891"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.891"
                                            },
                                            "Text": {
                                                "val": "Continue to mature linked aero-structural-thermal computational tools to predict flight performance of hypersonic weapons and tools to develop prototype concepts for further analysis.  Continue to mature algorithms for guidance and control of advanced weapons concepts in a contested electromagnetic environment.  Continue to develop technologies that achieve precision navigation under GPS-degraded and GPS-denied conditions.  Continue development of weapon-platform interfaces, including advanced high capacity carriage and release technology.  Continue to integrate algorithms to support distributed, multi-strategy weapon concept-of-operations to defeat enemy defenses.  Continue to develop airframe and control technologies that enable innovative air-to-air engagements.  Conduct flight demonstrations of precision navigation of weapons without GPS using optical aiding techniques.  Conduct experiments to demonstrate precision navigation using celestial aiding for long range flights at high and low altitudes.  Conduct experiments to demonstrate algorithms implementing cooperation and collaboration between multiple surrogate weapon platforms.   Develop and demonstrate component modular and service oriented weapon architectures for seeker, navigation, and data services that use reconfigurable weapon sensors.  Conduct flight experiments to characterize innovative air-to-air high off-bore sight missile maneuverability and hit-to-kill agility.  Conduct ground tests of rocket motor component technologies to evaluate their ability to increase weapon range and reduce size and weight."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guidance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develops guidance subsystem integration and evaluation technologies to provide open and closed loop ground testing, flight test risk reduction, and digital simulation of novel concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.757"
                                            },
                                            "Text": {
                                                "val": "Developed technologies for precision weapon navigation independent of GPS availability.  Demonstrated navigation techniques for contested electromagnetic environment scenarios, including geolocation\/homing on ground based systems.  Conducted joint flight experiments demonstrating optical aided navigation.  Conducted hardware-in-the-loop tests of an adaptive autopilot that expands the flight envelope for penetrator applications.  Developed integrated computational tools to predict performance of hypersonic weapons used to shape concepts for further analysis.  Developed algorithms and analysis tools to explore collaboration and autonomy concepts in advanced threat environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.110"
                                            },
                                            "Text": {
                                                "val": "Continue to develop technologies for precision weapon navigation independent of GPS availability to include celestial navigation and optical aiding techniques.  Continue to develop integrated computational tools to predict performance of hypersonic weapons used to shape concepts for further analysis.  Continue to develop algorithms and analysis tools to explore distributed collaboration and autonomy concepts in advanced threat environments.  Develop improved simulation technologies that evaluate innovative air-to-air engagements.   Develop a real-time radar\/millimeter wave signature generation capability for testing algorithms in real-time software and hardware in-the-loop environments.  Develop simulation technologies that evaluate cooperative, flexible munition target engagements.  Develop a modular radio-frequency hardware-in-the-loop capability to support munitions concepts with high speed target engagement.  Develop new infrared projection capabilities to evaluate a new class of multi-aperture sensor systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.260"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.260"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and conduct experiments leading to demonstration of precision navigation using celestial aiding.  Continue to develop and conduct demonstrations of weapons navigation using optical aiding techniques.  Continue to develop and conduct experiments demonstrating autonomy algorithms to implement distributed\/collaboration\/coordination behaviors of multiple weapons.  Continue to develop improved simulation technologies that evaluate innovative air-to-air engagements.  Continue to develop a real-time radar\/millimeter wave signature generation capability for testing algorithms in real-time software and hardware in-the-loop environments.  Continue to develop simulation technologies that evaluate cooperative, flexible munition target engagements.  Continue to develop a modular radio-frequency hardware-in-the-loop capability to support munitions concepts with high speed target engagement.  Continue to develop new infrared projection capabilities to evaluate a new class of multi-aperture sensor systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622502"
                    },
                    "ProjectTitle": {
                        "val": "Ordnance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "46.011"
                        },
                        "CurrentYear": {
                            "val": "53.029"
                        },
                        "BudgetYearOne": {
                            "val": "56.916"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.916"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "58.058"
                        },
                        "BudgetYearThree": {
                            "val": "66.232"
                        },
                        "BudgetYearFour": {
                            "val": "61.871"
                        },
                        "BudgetYearFive": {
                            "val": "61.179"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, develops, and evaluates conventional ordnance technologies to establish technical feasibility and military utility for advanced explosives, fuzes, warheads, submunitions, and weapon airframes, carriage, and dispensing.  The project also assesses the lethality and effectiveness of current and planned conventional weapons technology programs and assesses target vulnerability.  The payoffs include improved storage capability and transportation safety of fully assembled weapons, improved warhead and fuze effectiveness, improved submunition dispensing, low-cost airframe\/subsystem components and structures, and reduced aerospace vehicle and weapon drag."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Energetic Materials Technology"
                                    },
                                    "Description": {
                                        "val": "Investigates and develops energetic materials technology that can maximize weapon lethality, while applying appropriate safety and security features."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Transitioned energetic material with multi-Service applications.  Demonstrated improved Insensitive Munition (IM) performance for energetic material formulations for penetration and general purpose bomb applications.  Developed material formulations designed to reduced shipping\/storage costs while reducing risk of catastrophic damage in event of accident.  Scaled-up technologies for producing new novel energetic formulations for hard target applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.300"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate energetic formulations that increase thermal and vibration tolerance required for very long range, high speed munitions, and hard target applications.  Continue to emphasize development of novel energetic materials, including reactive cases, that improve performance and reduce bomb and missile size so as to increase loadout and increase shipping\/storage safety.  Develop concepts for distributed and multi-point fuzing.  Develop a virtual design tool for use in material design activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.081"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.081"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate novel materials to increase energy density over traditional explosives while maintaining lethality for mass and volume constrained applications.  Continue to experiment on energetic fills for high temperature applications to mitigate environmental challenges to energetic materials' survivability, initiation, dynamic, and mechanical properties.  Continue initiative to develop virtual formulation and processing techniques for energetic materials.  Continue to develop tools and analysis techniques to further understanding of energy partitioning in order to optimize lethality.  Investigate liner technologies to improve IM performance.  Implement additive manufacturing techniques to increase the design space for kinetic weapon lethality."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuze Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigates and develops fuzes for air-delivered weapon applications to develop novel energetic initiation concepts, penetration fuzing, point burst fuzes, and develop predictive models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "2015 Completed ground-breaking research for fundamental understanding of the initiation process which will provide increased fuze reliability.  Developed unique test capability and completed testing to evaluate the performance of advanced fuze algorithms in high speed scenarios.  Quantified the fuze environment during representative penetration scenarios and provided data to multiple organizations for modeling and simulation (M&S) activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.729"
                                            },
                                            "Text": {
                                                "val": "Continue to develop M&S and test capabilities for penetration scenarios.  Develop fuzing system technologies to employ ground profiling radar for miniature ordnance packaging to enable more lethal forward-firing effects with low collateral damage.  Investigate the capability to predict and measure fuze performance during munition penetration at high impact speeds.  Investigate alternative optimized fuzing technologies that facilitate tailored lethal effects.  Develop distributed and multi-point fuzing concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.698"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.698"
                                            },
                                            "Text": {
                                                "val": "Continue to develop M&S and test capabilities for penetration scenarios.  Continue to develop and demonstrate alternative packaging technology for the fuze electronic components.  Continue to investigate the capability to predict and measure fuze performance during munition penetration at high impact speeds.  Continue research to facilitate tailored lethal effects and enable optimum fuzing solutions across the spectrum of weapon and target interactions.  Continue research for distributed and multi-point fuzing concepts.  Implement additive manufacturing techniques to increase fuze reliability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warhead Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigates and develops innovative warhead kill mechanisms, such as adaptable warheads, directional-control fragmenting warheads, and reactive metals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.381"
                                            },
                                            "Text": {
                                                "val": "Implemented new models into multiphase physics codes which improved simulation capability.  Enhanced the weapon penetration predictions codes.  Conducted numerous tests to provide phenomenological understanding and data for code validation.  Performed studies for weapon concept assessments.  Developed small, multi-output warhead technologies primarily for soft surface targets, but with limited penetration capability for hardened, shallow structures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "Continue to develop small, multi-output warhead technologies primarily for soft surface targets, but with limited penetration capability for hardened, shallow structures.  Explore novel warhead technologies and materials that increase lethality in innovative air-to-air engagements.  Develop small, multi-output penetrator technologies that address penetrator stability through novel nose shapes and increased survivability through internal structures for high-speed impacts into hard and deeply buried targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.462"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.462"
                                            },
                                            "Text": {
                                                "val": "Continue refining small, multi-output warhead technologies primarily for soft surface targets but with limited penetration capability of hardened structures.  Continue to experiment with novel materials and determine their mechanical response under high-rate and high-pressure loading conditions.  Implement additive manufacturing techniques for novel warhead designs.  Develop technologies for high speed penetration applications into challenging targets.  Develop air-to-air missile warhead concepts for legacy fighters and the air targets in near-peer engagement scenarios."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ordnance Technologies"
                                    },
                                    "Description": {
                                        "val": "Using a system approach, investigates and develops ordnance concepts by making technology trades between fuzes, warheads, and explosives and by improving weapon carriage, release, and dispensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.630"
                                            },
                                            "Text": {
                                                "val": "Conducted numerous tests to provide phenomenological understanding and data for code validation.  Performed studies for weapon concept assessments.  Enhanced the weapon penetration prediction codes and released a new version with ten times increase in problem size and twenty times reduction in run time.  Implemented new ordnance models into multiphase physics codes which improved the simulation capability.  Developed inventive ordnance concepts that increase the capacity and capability of fifth generation and beyond aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "Continue to develop multiphase physics models analyzing the detonation of a warhead and the dispersal of either a neutralizer or fuel.  Continue to develop inventive ordnance concepts that increase the capacity and capability of fifth generation and beyond aircraft.  Develop mission-level simulation architecture capability to enable weapon system and weapon technology assessments.  Explore general purpose warhead concepts that allow technology refresh matching the pace of technology discovery in an affordable, sustainable design.  Develop technologies for low-cost, long-range munition concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.675"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.675"
                                            },
                                            "Text": {
                                                "val": "Continue to develop validated modeling and simulation (M&S) tools for computational physics sciences with emphasis on the development of computational techniques for addressing physics issues that occur below the macroscopic scale.  Continue to develop mission-level simulation architecture capability to enable weapon system and weapon technology assessments.  Continue to explore general purpose warhead concepts that allow technology refresh matching the pace of technology discovery in an affordable, sustainable design.  Continue to develop technologies for low-cost, long-range munition concepts.  Develop predictive techniques for munition effectiveness tools used in concept development and assessment as well as studies involving analysis of alternatives.  Develop test capability and M&S tools to characterize lethality survivability, performance of advanced energetics, and ordnance systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}