{
    "id": "2755185453fd2bc713ff77ea571489d947570a73",
    "meta": {
        "filename": "dod-2017_RDTE_2017_TJS_U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0607828J"
        },
        "ProgramElementTitle": {
            "val": "Joint Integration & Interoperability"
        },
        "R1LineNumber": {
            "val": "188"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "16.047"
            },
            "PriorYear": {
                "val": "10.167"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "26.214"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.968"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.167"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.801"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY2015 Carryover"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.801"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2016, PE 0607828J - Joint Integration and Interoperability is realigned to PE 0604826J."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P818"
                    },
                    "ProjectTitle": {
                        "val": "Joint Integration & Interoperability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.047"
                        },
                        "PriorYear": {
                            "val": "10.167"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "26.214"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In FY2016 this PE will be realigned to PE 0604826J - Joint C5 Capability Development, Integration and Interoperability Assessments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Integration & Interoperability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.167"
                                            },
                                            "Text": {
                                                "val": "(1)  Developed and secured DoD approval for eight (8) JCIDS documents to support materiel development of Joint C2 system capabilities for: DoD's Enterprise Common Operational Picture (COP);  the Common Tactical Picture;  the Mission Partner Environment (MPE);  Force Planning and Deployment Planning & Execution; Joint Operations Planning Process and Assessment; and Joint C2 Cyber capabilities. Six software solutions were delivered to the Combatant Commands and Services as a result of these JCIDS documents.\n\n(2) Identified and resolved critical data exchange issues between GCCS-J and United Kingdom C2 systems, between GCCS-J and the Air Force’s AOC weapon system, and between GCCS-J and USTRANSCOM movement planning data services.\n\n(3) Increased the number of JIE and Warfighting Mission Area architecture products available for integration and reuse by 25% and significantly improved user search capability for structured and unstructured data.\n\n(4) Delivered Tactics, Techniques and Procedures (TTPs) and integration for the En-route Mission Command Capability based on SOF best practices to the Army’s 18th Airborne Corps and the USMC Special Purpose Marine Air Ground Task Forces providing for the first time enhanced C2 capability en-route to include secure voice, email, chat, ISR feeds and Common Operational Picture.   \n\n(5) Led the Department's adoption of the White House directed National Information Exchange Model (NIEM) with the creation and implementation of the Military Operations Domain data exchange framework (now at version 3.1) resulting in improved Joint, Interagency and Coalition warfighter interoperability and information sharing.  \n\n(6) Created a North Atlantic Treaty Organization (NATO) Core Data Framework, which received formal NATO approval and endorsement, establishing a common multi-nation warfighter information sharing approach and which establishes critical US-to-allied nation interoperability requirements. \n\n(7) Conducted Joint Staff sponsored Bold Quest Coalition Capability Demonstration and Assessment involving fourteen (14) partner nations, all US Services and U.S. Special Operations Command successfully demonstrating viability of implementing Mission Partner Environment concepts; the integration of ground-to-air situational awareness capabilities; and digitally enhanced call-for-fire and close air support operations through live, virtual, construction dismounted operations at Ft Benning GA, White Sands Missile Range, NM, Holloman AFB, NM, and Ft Bliss, TX.  \n\n(8) Led Accreditation visits to seven (7) Joint Terminal Attack Controller (JTAC); 1 Forward Air Controller (Airborne); and 3 Joint Fires Observer (JFO) Schoolhouses. Accreditation of US and partner nation schoolhouses ensured trained and qualified personnel meet standardized performance metrics, enabling enhanced trust and interoperability during current and future combat operations\n\n(9)  Provided CCMDs, Services and Agencies with Mission Partner Environment (MPE) network joining and exiting instructions for sharing information allowing a more rapid shift (hours vs days) from peacetime operations to JTF combat operations; delivered requirements and standards for Unclassified Information Sharing to the Joint Staff requirement process for whole of government and coalition partner operations e.g. Domestic Operations, United Nations Humanitarian Assistance\/Disaster Relief via JROC validated documents.\n \n(10)  Incorporated MPE concepts and principles into Senior Leader Capstone and Joint Professional Military Education (JPME) programs, Joint Doctrine Publications, Joint Knowledge Online (JKO) and four (4) CCMD and Service exercises. \n\n(11) Solved “Chat” and “Common Operational Picture” (COP) Afghan Mission Network interoperability emergent requirement in support of NATO’s Operation Resolute Support.\n\n(12)  Provided a realistic Ballistic Missile Defense test bed employing Service Red Team activities by integrating the Command and Control Information Systems (C2 IS) with the Missile Defense Agency’s Command, Control, Battle Management and Communication (C2BMC) systems and Aegis Weapons System provided by Surface Combat Systems Center Wallops Island.\n\n(13)  Developed a Concept of Operations for integrating cyber effects into exercise Master Scenario Event Lists (MSEL) and implemented cyber effects MSELs during USNORTHCOM’s Vigilant Shield 2014 exercise."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A - FY 2016 consolidation of this PE (0607828J) and two other legacy JFCOM PEs (0604787J, 0604828J) into 1 new Joint Staff PE (0604826J)."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A - FY 2016 consolidation of this PE (0607828J) and two other legacy JFCOM PEs (0604787J, 0604828J) into 1 new Joint Staff PE (0604826J)."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "FY 2016 consolidation of this PE (0607828J) and two other legacy JFCOM PEs (0604787J, 0604828J) into 1 new Joint Staff PE (0604826J)."
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Consolidation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "PE Consolidation."
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}