{
    "id": "368529221102035b65e9302fde35de4629ebe81c",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603260F"
        },
        "ProgramElementTitle": {
            "val": "Intelligence Advanced Development"
        },
        "R1LineNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.408"
            },
            "CurrentYear": {
                "val": "5.032"
            },
            "BudgetYearOne": {
                "val": "5.598"
            },
            "BudgetYearOneBase": {
                "val": "5.598"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "5.636"
            },
            "BudgetYearThree": {
                "val": "5.609"
            },
            "BudgetYearFour": {
                "val": "5.712"
            },
            "BudgetYearFive": {
                "val": "5.814"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Intelligence Advanced Development (IAD) develops and demonstrates technology required to support warfighter needs for timely all source intelligence information. IAD supports global awareness, consistent battlespace knowledge, precision information, and the execution of time critical missions. IAD focuses on enhancing defense intelligence capabilities by exploring new and innovative ways to develop software tools which support the Anti-Access\/Area Denial (A2\/AD) Contested\/Congested Degraded Operations (CDO) problem set. IAD projects provide improved on-time information to the warfighter using new and existing data sources, streamlining data analysis, thus reducing the footprint required, and enhancing performance.  The Air Force Research Lab, Rome Research Site, Information Intelligence Systems and Analysis Division (AFRL\/RIE), works directly with users, employing evolutionary approaches and integrating finished modules directly into the field. The programs are oriented toward specific shortfalls and deficiencies as documented by the Major Commands (MAJCOMS), unified commands, and Intelligence organizations in their mission and functional area plans. This PE expedites technology transition from the laboratory to operational users via rapid prototyping. It is focused on technology insertion to correct AF intelligence deficiencies at the tactical and operational levels. The PE bridges the transition of new technologies from Advance Technology Demonstrations (ATDs) and Integrated Technology Thrust Programs (ITTPs) into current\/new systems, and supports the associated Defense Technology Objectives (DTOs). IAD may also reallocate existing resources to support out-of-cycle new\/updated warfighter requirements. \n\nRequirements for this PE are identified and prioritized by the Air Combat Command (ACC). Development of new\/improved capabilities to meet the requirements is managed by AFRL\/RIE. Prototype products, usually in the form of software, are provided to users in incremental capability spirals for operational environment evaluation.\n\nThis program is Budget Activity 4, Advanced Component Development and Prototypes (ACD&P) because efforts are necessary to evaluate integrated technologies, representative modes or prototypes systems in a high fidelity and realistic operating environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.408"
                },
                "CurrentYear": {
                    "val": "5.032"
                },
                "BudgetYearOne": {
                    "val": "5.654"
                },
                "BudgetYearOneBase": {
                    "val": "5.654"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.408"
                },
                "CurrentYear": {
                    "val": "5.032"
                },
                "BudgetYearOne": {
                    "val": "5.598"
                },
                "BudgetYearOneBase": {
                    "val": "5.598"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.056"
                },
                "BudgetYearOneBase": {
                    "val": "-0.056"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.056"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.056"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "- FY17:  $56K \"Inflation rate reduction for Non-pay\/non-fuel\"."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "64536A"
                    },
                    "ProjectTitle": {
                        "val": "INTELLIGENCE EXPLOITATION TOOLS (IET)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.298"
                        },
                        "CurrentYear": {
                            "val": "3.991"
                        },
                        "BudgetYearOne": {
                            "val": "4.442"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.442"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.475"
                        },
                        "BudgetYearThree": {
                            "val": "4.453"
                        },
                        "BudgetYearFour": {
                            "val": "4.535"
                        },
                        "BudgetYearFive": {
                            "val": "4.615"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission is to develop prototypes which encompass several areas of intelligence exploitation including the advancement of all source correlation and fusion for the intelligence analyst.  The intent is to enhance the overall situational awareness for Air Force, DoD, and Coalition groups which have requirements to correlate various sources of intelligence information, including COMINT, ELINT, IMINT, GEOINT, MASINT, SIGINT, OSINT and others, in a timely manner. IET may reallocate existing resources to support out-of-cycle new\/ updated warfighter requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Intelligence Exploitation Tools (IET)"
                                    },
                                    "Description": {
                                        "val": "IET addresses the accurate and timely interpretation of various Intelligence data sources (such as digital imagery, video, documents, and signals) by developing and evaluating methods to manipulate and overlay the disparate products using various imagery, visualization and timeline techniques. This provides the analyst with the ability to fuse multiple intelligence sources for improved situational awareness and to better detect anomalies. Cross domain tools are explored as a means to view and provide data at multiple classification levels. In addition, methods to improve analysis of current and future foreign weapon systems are developed. IET provides enhanced warning and accuracy to allow national and military authorities a greater range of options to avert, diminish or control a crisis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.298"
                                            },
                                            "Text": {
                                                "val": "- Completed development, conducted user assessment, and released final prototype of software that provides automated screening of technical ELINT data through further development of applications in signals characterization and database matching algorithms\n\n- Started development of software focused on improving the way computers and application services supports intelligence analysts through the use of cognitive systems\n\n- Continued development of capability to enable the detection, geo-location, and tracking of complex wideband and low probability of intercept emitters; improve reporting timeliness and accuracy of worldwide Electronics Intelligence (ELINT) intercept data\n\n- Started development of capability to enable the intelligence analyst to conduct search and discovery either by visual pattern recognition\/feature extraction or text-based using queries.  \n-- This effort will create structured content from the recognition of objects, features and patterns contained within images\/video\n\n- Started expanding software currently deployed on RIVET JOINT processor to enable collecting current and future SIGINT metadata\n\n- Continued development of a framework designed to expose media tools, data, products, workflow and analytical services to the DoD and IC\n\n- Started development of a capability for quantitative mission assessment and integrating future ISR and combat mission capabilities\n\n- Completed development of software to perform high fidelity analysis of threat designs and potential alternatives in the command and control of an Integrated Air Defense Systems (IADS), providing critical insight into the synergistic effects of combined systems and their vulnerabilities\n\n- Continued development of automated methods that aid in the systematic, continuous, and comprehensive assessment of technical topic, concepts and emergence using information found in the published scientific, technical, and patent literature, message traffic, gray literature, conference papers, etc.\n\n- Started enabling DCGS enterprise support of high-altitude SIGINT missions\nand execution on NSANet"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.991"
                                            },
                                            "Text": {
                                                "val": "- Continuing development of software focused on improving the way computers and application services supports intelligence analysts through the use of cognitive systems\n\n- Continuing development of capability to enable the detection, geo-location, and tracking of complex wideband and low probability of intercept emitters; improve reporting timeliness and accuracy of worldwide Electronics Intelligence (ELINT) intercept data\n\n- Continuing development of capability to enable the intelligence analyst to conduct search and discovery either by visual pattern recognition\/feature extraction or text-based using queries.  \n-- This effort will create structured content from the recognition of objects, features and patterns contained within images\/video\n\n- Continuing to expand software currently deployed on RIVET JOINT processor to enable collecting current and future SIGINT metadata\n\n- Continuing development of a framework designed to expose media tools, data, products, workflow and analytical services to the DoD and IC\n\n- Continuing development of a capability for quantitative mission assessment and integrating future ISR and combat mission capabilities\n\n- Continuing development of automated methods that aid in the systematic, continuous, and comprehensive assessment of technical topic, concepts and emergence using information found in the published scientific, technical, and patent literature, message traffic, gray literature, conference papers, etc.\n\n- Continue enabling DCGS enterprise support of high-altitude SIGINT missions and execution on NSANet"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.442"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.442"
                                            },
                                            "Text": {
                                                "val": "- Will continue development of software focused on improving the way computers and application services supports intelligence analysts through the use of cognitive systems\n\n- Will continue development of capability to enable the detection, geo-location, and tracking of complex wideband and low probability of intercept emitters; improve reporting timeliness and accuracy of worldwide Electronics Intelligence (ELINT) intercept data\n\n- Will continue development of capability to enable the intelligence analyst to conduct search and discovery either by visual pattern recognition\/feature extraction or text-based using queries.  \n-- This effort will create structured content from the recognition of objects, features and patterns contained within images\/video\n\n- Will complete expanding software currently deployed on RIVET JOINT processor to enable collecting current and future SIGINT metadata\n\n- Will continue development of a framework designed to expose media tools, data, products, workflow and analytical services to the DoD and IC\n\n- Will complete development of a capability for qualitative mission assessment and lays a framework for integrating future ISR and combat mission capabilities into the assessment framework\n\n- Will continue development of automated methods that aid in the systematic, continuous, and comprehensive assessment of technical topic, concepts and emergence using information found in the published scientific, technical, and patent literature, message traffic, gray literature, conference papers, etc.\n\n- Will continue enabling DCGS enterprise support of high-altitude SIGINT missions and execution on NSANet\n\n- Will initiate development of a software capability to exploit and fuse open source information with DCGS related sources\n\n- Will initiate development of a Feature Extractor to assist automation of Tech ELINT screening\n\n- Will initiate development and integration of space based modeling capabilities into the Integrated Many on Many (IMOM) mission planning tool\n\n- Will initiate implementation of operational metadata acquisition and aggregation capability for DCGS SIGINT collection systems"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Requirements for new\/improved techniques for operational employment of simulation models are identified and prioritized by the Air Combat Command (ACC). Development of the new\/improved capabilities to meet these requirements is managed by AF Research Laboratory (Rome Research Site). Prototype products (usually software), once evaluated by the users, are transitioned from the laboratory to operational community in spirals. All major contracts within this project are awarded after full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Intelligence Exploitation Tools (IET)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.924"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.835"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.180"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.180"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFRL - Information Directorate"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.374"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.156"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.262"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.262"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "IET Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Started Development of Cognitive Systems Software for Intel Analyst"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Started Development of Search and Discovery Capability Using Visual Pattern Recognition\/Feature Extraction or Text-Based Queries"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Started Expanding Rivet Joint Processing Software to Enable Collecting Current\/Future SIGINT Metadata"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Started Development of Capability for Quantitative Mission Assessment and Integrating Future ISR and Combat Mission Capabilities"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY15 IET User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY17 IET Requirements Data Call"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Completed Development of Automated Technical ELINT Screening Software"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Completed Development of Software to Perform High Fidelity Analysis of Threat Designs and Potential Alternatives in the Command and Control of an Integrated Air Defense System (IADS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY16 IET User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY16 IET Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Will initiate development of software capability to ingest open source information and fusing with DCGS related sources"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Will initiate development of Feature Extractor to assist automation of Tech ELINT screening"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Will initiate development and integration of space based systems modeling capabilities into IMOM planning tool"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Will initiate implementation of operational metadata capability for DCGS SIGINT collection systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY17 IET User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY17 IET Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Will Complete Development of Capability for Quantitative  Mission Assessment and Integrating Future ISR and Combat Mission Capabilities"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Will Complete Expanding Rivet Joint Processing Software to Enable Collecting Current\/Future SIGINT Metadata"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY19 IET Requirements Data Call"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY18 IET User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY18 IET Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY19 IET User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY21 IET Requirements Data Call"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY19 IET Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY20 IET User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY20 IET Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY21 IET User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY21 IET Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "64537A"
                    },
                    "ProjectTitle": {
                        "val": "INTELLIGENCE ANALYSIS CAPABILITIES (IAC)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.110"
                        },
                        "CurrentYear": {
                            "val": "1.041"
                        },
                        "BudgetYearOne": {
                            "val": "1.156"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.156"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.161"
                        },
                        "BudgetYearThree": {
                            "val": "1.156"
                        },
                        "BudgetYearFour": {
                            "val": "1.177"
                        },
                        "BudgetYearFive": {
                            "val": "1.199"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission is to provide continuing development and upgrades of threat analysis capabilities to produce integrated, predictive air and space intelligence to enable military operations, force modernization decisions, and policy making. Products from IAC allow the Intelligence Analyst to accelerate and increase the accuracy of threat estimates and system descriptions to deployed operational forces. Each of the development projects within the IAC program portfolio transition technologies to the operational communities through the incremental release of upgraded versions over a period of years as development projects progress towards the final configuration. IAC may reallocate existing resources to support out-of-cycle new\/ updated warfighter requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Intelligence Analysis Capabilities (IAC)"
                                    },
                                    "Description": {
                                        "val": "IAC develops tools and algorithms for Intelligence Analysts with the ability to produce accurate, predictive, relevant, and timely intelligence that supports client processes, operational planning, and mission execution. IAC develops new and upgraded analysis, modeling and simulation tools focused on intelligence production supporting AF operational and developmental all source analysis functions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.110"
                                            },
                                            "Text": {
                                                "val": "- Released first prototype and initiated development of second prototype of capability to add a space communications modeling capability to the previously fielded terrestrial communications focused tool\n-- This effort will complete modeling of an adversary's total Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) system and assist nomination of terrestrial and space targets\n\n- Started development of a robust prototype of an enterprise level solution (tools and procedures) that will allow the intelligence analyst to perform predictive intelligence analysis on new areas of interest"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.041"
                                            },
                                            "Text": {
                                                "val": "- Releasing second prototype and initiating development of third prototype of capability to add a space communications modeling capability to the previously fielded terrestrial communications focused TEL-SCOPE tool\n\n- Releasing first prototype and initiating development of second prototype of an enterprise level solution (tools and procedures) that will allow the intelligence analyst to perform predictive intelligence analysis on new areas of interest"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.156"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.156"
                                            },
                                            "Text": {
                                                "val": "- Will release third prototype and will initiate development of fourth prototype of capability to add a space communications modeling capability to the previously fielded terrestrial communications focused TEL-SCOPE tool\n\n- Will release second prototype and will initiate development of third prototype of an enterprise level solution (tools and procedures) that will allow the intelligence analyst to perform predictive intelligence analysis on new areas of interest"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Requirements of new\/upgraded intelligence analysis tools are identified and prioritized by the Air Combat Command (ACC).  Development of capabilities to meet these requirements is managed by the Air Force Research Laboratory (Rome Research Site).  Prototype products (usually software), once evaluated by the users, are fielded in incremental capability spirals.  All major contracts within this project are awarded after full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "IAC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.975"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFRL - Information Directorate"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.135"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.041"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.156"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.156"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "IAC Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Released First Prototype and Initiated Development of Second Prototype of Capability to Add a Space Communications Modeling Capability to Existing Tool"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Started Development of Enterprise Level Solution to Perform Predictive Intelligence Analysis"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY15 IAC User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY17 IAC Requirements Data Call"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY15 IAC Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY16 IAC User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Releasing First Prototype and Initiating Development of Second Prototype of an Enterprise Level Solution to Perform Predictive Intelligence Analysis"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Released Second Prototype and Initiated Development Third Prototype of Capability to Add a Space Communications Modeling Capability to Existing Tool"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY16 IAC Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY17 IAC User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY19 IAC Requirements Data Call"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Releasing Second Prototype and Initiating Development of Third Prototype of an Enterprise Level Solution to Perform Predictive Intelligence Analysis"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Released Third Prototype and Initiated Development of Fourth Prototype of Capability to Add a Space Communications Modeling Capability to Existing Tool"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY17 IAC Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY18 IAC User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY18 IAC Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY19 IAC User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY21 IAC Requirements Data Call"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY19 IAC Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY20 IAC User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY20 IAC Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY21 IAC User Evaluations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY21 IAC Prototype Releases"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}