{
    "id": "3f9a9f8bab7f9ca974c2fb65787972edd0c6a884",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602236N"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Sustainment Applied Res"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "46.202"
            },
            "CurrentYear": {
                "val": "45.047"
            },
            "BudgetYearOne": {
                "val": "45.467"
            },
            "BudgetYearOneBase": {
                "val": "45.467"
            },
            "BudgetYearTwo": {
                "val": "46.269"
            },
            "BudgetYearThree": {
                "val": "46.606"
            },
            "BudgetYearFour": {
                "val": "46.641"
            },
            "BudgetYearFive": {
                "val": "46.448"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (20 Jan 2015).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE supports innovation-based efforts that will provide technology options for future Navy and Marine Corps capabilities.  Efforts focus on advanced Naval materials; biocentric technologies; environmental quality; human factors and organizational design; medical technologies; and Naval training technologies. Within the Naval Transformation Roadmap, this investment maps to future transformational capabilities and the FORCEnet pillar of the Chief of Naval Operations and the Commandant of the Marine Corps vision for the future -- Naval Power 21. \n\nThe ONRG International Science Program mission is to search the globe for emerging scientific research and advanced technologies to enable the Office of Naval Research (ONR) and the NRE to address effectively the current needs of the Fleet\/Forces, and investigate and assess revolutionary, high-payoff technologies for future Naval missions and capabilities. Within this Global mission, funding for the Naval Science Advisor Program ensures the Fleet\/Force (F\/F) helps shape the Department of the Navy (DoN) investment in Science and Technology (S&T), develops teaming relationships to rapidly demonstrate and transition technology, supports development of technology-based capability options for naval forces, and enables warfighting innovations based on technical and conceptual possibilities. Science Advisors provide insight into issues associated with Naval Warfighting Capabilities that influence S&T program decision making. The program develops leaders among civilian scientists and engineers in the Naval Research Enterprise (NRE). Upon completion of their tours, Science Advisors return to the NRE with first hand knowledge of the F\/F, warfighting issues, and strategic decision making. The Office of Naval Research (ONR) Science Advisor program enables continuous communication and collaboration between the warfighters, the technical community, and strategic development commands. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "46.923"
                },
                "CurrentYear": {
                    "val": "45.056"
                },
                "BudgetYearOne": {
                    "val": "46.549"
                },
                "BudgetYearOneBase": {
                    "val": "46.549"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "46.202"
                },
                "CurrentYear": {
                    "val": "45.047"
                },
                "BudgetYearOne": {
                    "val": "45.467"
                },
                "BudgetYearOneBase": {
                    "val": "45.467"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.721"
                },
                "CurrentYear": {
                    "val": "-0.009"
                },
                "BudgetYearOne": {
                    "val": "-1.082"
                },
                "BudgetYearOneBase": {
                    "val": "-1.082"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.009"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.055"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.776"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.607"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.607"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.475"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.475"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Sustainment Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "46.202"
                        },
                        "CurrentYear": {
                            "val": "45.047"
                        },
                        "BudgetYearOne": {
                            "val": "45.467"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.467"
                        },
                        "BudgetYearTwo": {
                            "val": "46.269"
                        },
                        "BudgetYearThree": {
                            "val": "46.606"
                        },
                        "BudgetYearFour": {
                            "val": "46.641"
                        },
                        "BudgetYearFive": {
                            "val": "46.448"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Efforts in this PE focus on manpower and personnel; Naval systems training and education; human systems integration; littoral combat and power projection capabilities; advanced naval materials; medical technologies; environmental quality; and biocentric technologies. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ADVANCED NAVAL MATERIALS"
                                    },
                                    "Description": {
                                        "val": "Advanced Naval Materials efforts include: developing advanced, high-performance materials; developing processes to reduce weight and cost; and developing enhanced sonar transducers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.531"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of acceptance testing methodologies for advanced transducer, single-crystal, high-strain materials and definition of standardized materials properties and composition ranges. \n- Continued development of compositional tuning of single-crystal, high-strain transducer materials, for specialized naval system applications. \n- Continued marine titanium alloy design and processing development, exploiting anticipated cost reductions for high performance, reduced maintenance naval applications. \n- Continued development of continuous, single wall, carbon nanotube composite materials for next generation air and naval platforms. \n- Continued stainless steel carburization study to enhance corrosion performance. \n- Continued development of surface preparation methods and characterization of corrosion performance for future naval ship materials. \n- Continued evaluation of low temperature, carburized materials for marine application. \n- Continued development of coating performance and knowledge database for Naval use. \n- Continued development of mechanistic model for stress corrosion cracking in Nickel Aluminum Bronze (NAB). \n- Continued development of innovative sonar transducers based on high-strain, high-coupling, piezoelectric single crystals. \n- Continued development of novel processing technologies for increasing the fatigue strength and corrosion resistance of weldments for ship structures with reduced weight and maintenance requirements. \n- Continued development of models and characterization methods for dynamic loading (water slamming and blast loading) in polymer composite materials. \n- Continued acoustic damping coatings for ship tank application. \n- Continued development of fiber-optic sensors, transducers and demodulation technology for structural health monitoring of ships and submarines. \n- Continued development of continuous based monitoring techniques of new synthetic fuels and lubricants based on electromagnetic signature analysis. \n- Continued development and application of distributed fiber optic Bragg gratings for structural health monitoring of ships and aircrafts. \n- Continued development of novel growth methods to specialized single crystal transducer materials tuned to requirements of specialized naval systems. \n- Continued assessment of the degree of sensitization potential of marine grade Al alloys. \n- Continued investigation of criteria for stable pitting of stainless steel. \n- Continued development of surface assessment technologies to measure surface profile and chlorine. \n- Continued evaluation of advanced material coating for erosion control on helicopter main rotor blade leading edges. \n- Continued studies on fuel cell corrosion. \n- Continued development of superhydrophobic surface modification technology. \n- Continued studies on mitigation of pitting corrosion and stress corrosion cracking in marine aluminum alloys. \n- Continued development of surface tolerant coating removal methods. \n- Continued development of processing technologies to fabricate piezoelectric single crystals into complex transducer assemblies. \n- Continued development of thermal management system(s) to arrest excessive heat fluxes and loads on amphibious ship by advanced Naval\/USMC aircraft. \n- Continued development of the rational engineering design of Al-alloys for naval applications. \n- Continued to increase emphasis on research efforts to discover innovative fundamental technologies to shape future Naval investments and strategies, leveraging the globe to support the Sailors & Marines of today and tomorrow. \n- Continued research and development incorporating physics and chemistry of the materials-environment interface, with the focus on materials with melting points above 3000C. \n- Continued development of quantitative coasting quality assurance tools. \n- Continued development of advanced NDE, SHM and Prognostics Technologies for improved readiness and reliability of air and naval platforms based on new and emerging electronic and photonics materials and devices. \n- Continued development of advanced structural composites with improved mechanical characteristics, blast resistance, and fire resistance, for more durable and reliable structures by optimizing the resin, the fibers and the interphases with new chemistries, additives and processes. \n- Continued development and exploitation of new and advanced forms of carbon based nanostructures (Graphene, Nanotubes, Diamond and others) for next generation family of materials and structures with outstanding mechanical, thermal, electrical and energy applications.\n- Continue development of mixed metal nanopowder additives for liquid fuels.\n- Complete multi-laser-processing technique development for the fabrication of ultra hard materials for wear resistance applications.\n- Complete development of advanced, cost-efficient joining of titanium for >25 %weight reduction of large seaborne structures.\n- Initiated investigating and characterizing cellular structures via additive manufacturing\n- Initiate development of low AC loss high temperature superconductors for advanced power."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above.\n- Complete investigation of criteria for stable pitting of stainless steel.\n- Complete acoustic damping coastings for ship tank application.\n- Complete development of mixed metal nanopowder additives for liquid fuels."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.689"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.689"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY2016, less those noted as completed above\n- Complete development and exploitation of new and advanced forms of carbon based nanostructures (Graphene, Nanotubes, Diamond and others) for next generation family of materials and structures with outstanding mechanical, thermal, electrical and energy applications.\n- Complete development of novel processing technologies for increasing the fatigue strength and corrosion resistance of weldments for ship structures with reduced weight and maintenance requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BIOCENTRIC TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Biocentric technologies provide novel solutions for naval needs based upon the applications of bio-inspired sensors, materials, processes and systems. Topic areas include, but are not limited to development of biologically-based signal processing for medical, surveillance and security applications; bioinspired robotics; synthetic biology to produce high-value naval materials or to develop sentinel organisms, and marine mammal diagnostics to support the Navy's Fleet Marine Mammal Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.952"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Naval Biosciences: \n- Continued development of innovative naval biosensors, biomaterials, and bioprocess technology. \n- Continued engineering development and optimization of sea-floor sediment energy harvesting system for sustainable and autonomous powering of underwater sensor networks and AUV's. \n- Continued development of microbial fuel cells for powering a linear sensor array\n- Continued study of microbial electrochemical systems for shipboard desalination\/waste-to-energy conversion\n- Terminated studies of microbial fuel cells for shoreside or shipboard applications.\n- Initiated study of closed-loop microbial fuels cells\n- Initiated synthetic biology research on explosive-sensing plants\n- Initiated researched on microbial electrobiosynthesis of liquid fuels\n\nSynthetic Biology for Sensing & Energy Production:  \n- Continued synthetic biology studies of engineered sentinel organisms for environmental surveillance \n- Terminate long duration, realistic field tests, and modeling studies of autonomous microbial fuel cell power systems for underwater sensor networks\n\nLife Sciences and Bioengineering: \n- Continued marine mammal diagnostics efforts, including immunobioassays for stress and infection detection. \n- Continued efforts to detect, treat, and prevent diseases in dolphins, including diabetes and kidney stones. \n- Completed effort to evaluate breath analysis for non-invasive diagnostics in marine mammal medicine. \n- Completed studies to evaluate candidate probiotics in Altantic bottlenose dolphins. \n- Completed studies of dolphin regenerative cells for treating a variety of pathologies and disease states in these animals. \n \nNeural, Sensory and Biomechanical Systems: \n- Continued efforts on naval biosensor to detect brain structures and blood vessels through skull bones \n- Continued efforts on advanced biomimetic sensing and neural control for human-robot interaction to enable effective collaboration of warfighters and autonomous systems. \n-Continued integration of biomimetic sonar with bioinspired autonomous undersea vehicles (with high-lift propulsors) to achieve closed loop control. \n- Continued efforts in bioinspired quiet, and maneuverable self-propelled line array using high-lift propulsors based on animal wing and fin biomechanics. \n- Continued efforts for bio-inspired massively parallel vision systems. \n- Continued studies to develop brain-based intelligent systems to support high level interaction between warfighters and autonomous systems. \n- Continued studies to develop electrosence and biosonar for MOC and EOD missions \n- Continued development of improved recombinant antibodies for biothreat agents \n- Initiated studies to develop electrosence and biosonar for MOC and EOD missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.729"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Naval Biosciences:\n- Continue all efforts of FY 2015, less those noted as completed above.\n\nSynthetic Biology for Sensing & Energy Production:\n- Continue all efforts for FY 2015, less those noted as completed above.\n\nLife Sciences and Bioengineering:\n- Continue all efforts for FY 2015, less those noted as completed above.\n\nNeural, Sensory and Biomechanical Systems:\n- Continue all efforts for FY 2015, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.602"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.602"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Naval Biosciences:\n- Continue all efforts of FY 2016, less those noted as completed above.\nSynthetic Biology for Sensing & Energy Production:\n- Continue all efforts for FY 2016, less those noted as completed above.\n- Initiate studies of scalability of microbial liquid fuel component production via electrobiosynthesis or bioreactor methodology\n\nLife Sciences and Bioengineering:\n- Continue all efforts for FY 2016, less those noted as completed above.\n\nNeural, Sensory and Biomechanical Systems:\n- Continue all efforts for FY 2016, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENVIRONMENTAL QUALITY"
                                    },
                                    "Description": {
                                        "val": "Environmental Quality technologies enable sustained world-wide Navy operations in compliance with all local, state, regional, national and international laws, regulations and agreements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.802"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of new, advanced, environmentally benign AF\/Anti-Corrosive (AC) coating systems for Navy platforms. \n- Continued development of advanced environmentally sound technologies for shipboard waste treatment and pollution abatement systems. \n- Continued field evaluation of prototype robotic Hull BUG to identify gaps needed to refine and advance the technology for reduced drag, and significant fuel savings. \n- Continued studies on oil emulsion issues and development of novel bilge water treatment systems on existing and new ships. \n- Completed efforts on improved handheld, waterborne, underwater hull cleaning technologies.\n- Completed efforts on ballast tank and system design optimization that minimize fuel discharges from compensated systems, minimize sedimentation in clean ballast and compensated ballast tanks, and maximize exchange of organisms during ballast tank exchanges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.627"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.616"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.616"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN FACTORS AND ORGANIZATIONAL DESIGN"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is the achievement of FORCEnet and Sea Power 21 goals by developing human factors principles and cognitive models for human centric design, decision support systems for collaborative decision making, and adaptive command and control structures. The CNO's new Maritime Strategy and the Commander Fleet Forces Command complementary plan to revise organization of Maritime Operations Centers (MOC) place high priority on the aforementioned FORCEnet and Sea Power 21 goals. Specific objectives focus on improving small team, platform, task force, and battle group operations by developing advanced human factors technologies for incorporation into operational systems. The goals and payoffs are to enhance human performance effectiveness; improve the timeliness and quality of decision making; develop strategies to mitigate high workload and ambiguity; reduce manning; improve situational awareness and speed of command through a deeper understanding of human capabilities and limitations; and improvement of team decision making in ad-hoc, complex problem solving scenarios. The current specific objectives are:\n\na) Human Computer Interaction\/Visualization: Develop an understanding of the limitations of human perceptual and attentional systems in relation to maximizing user performance when interacting with complex Naval displays. A combination of computational cognitive modeling and psychological studies are employed to determine the capacity limitations on human performance that will undoubtedly have impact in reduced manning requirements, including information-rich weapons platforms. Develop technology for improving human interaction with autonomous systems and for improving virtual reality systems for training purposes.\n\nb) Command Decision Making (CDM): This sub-project consolidates the previous Collaboration and Knowledge Interoperability (CKI) and Organizational Design and Decision Support Systems sub-projects. The CDM subproject is focused at the development of dynamic decision support systems that use automation and expert systems technology to recognize and respond to changing mission and task demands, and will therefor dynamically adapt to present appropriate information, dynamically based on planned and emergent mission requirements. This focus is explicitly intended to deliver decision support that will be more timely and responsive to rapidly evolving operational information needs. Current thrusts within the sub-project are to: 1) Conduct research on the application of cognitive theory to exploit relevant information for effective decision making; 2) Develop models that are operationally context and task sensitive, serving as the basis for a science of context driven decision making; 3) Study and apply research for the effective management of highly complex & time critical decision making; 4) Develop and demonstrate decision support tools that address the timely management of risk and uncertainty in Navy Command and Control.\n\nc) Social Network Analysis:  Develop computational models, algorithms and technologies for the analysis of conflict and crisis environments and the development of strategies against novel threats, such as terrorism, information warfare, and deception operations.  Develop computational approaches to handling very large, social and socio-cultural information and datasets. Develop computational social science approaches to the study of factionalism in social movements and the novel approaches to crowd calming and peacebuilding for civil affairs operations and disaster response. The following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.329"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Human Computer Interaction\/Visualization:\n\n- Continued research on audio-visual cue integration for 360-degree periscope displays.  Utilize eye-tracking, sleep studies and traditional behavioral measures to characterize human performance on periscope-related tasks under a variety of physiological conditions.\n \nCommand Decision Making (CDM): \n\n- Continued to develop task management algorithms applicable to agile supervisory control of teams involving human and autonomous agents.\n- Continued development of information infrastructure that is operational context sensitive to allow the dynamic prioritization of date based on its anticipated information value and mission criticality. \n-Continue research building proactive decision support tools for Command and Control.\n\nSocial Network Analysis: \n- Continued research on socio-technical aspects of community mobilization and complex humanitarian operations, including the use of novel platforms, social networks and the impact of novel technologies on human behavior in crisis and collaborative contexts.  \n\nHybrid Human Computer Systems: Terminated \n- Terminated research to address visualization and synthesis from multiple data sources to support autonomous systems and small hybrid teams.\n- Terminated research on human performance sources of cyber vulnerabilities of UxV systems.\n- Terminated research in human systems integration to reduce workload and increase operator situation awareness in command information center."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.124"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Human Computer Interaction\/Visualization: \n- Continue all efforts of FY 2015, less those noted as completed above.\n\nCommand Decision Making (CDM):\n- Continue all efforts of FY 2015, less those noted as completed above.\n- Initiate Research for Navigating in Uncertainty\n\nSocial Network Analysis:\n- Continue all efforts of FY 2015, less those noted as completed above.\n\nCommand Decision Making (CDM): \n- Continue all efforts of FY 2015, less those noted as completed above. \n\nSocial Network Analysis: \n- Continue all efforts of FY 2015, less those noted as completed above.\n- Initiate development of testbeds and tool chainsfor rapid disaster analyiss and response.\n- Initiate development of novel information feeds for Pacific Command. \n\nHybrid Human Computer Systems: Terminated"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.063"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.063"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Command Decision Making (CDM):\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nSocial Network Analysis:\n- Continue all efforts of FY 2016, less those noted as completed above. \n-Initiate efforts on information conflicts, social-cyber behavior and hybrid warfare."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MEDICAL TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "This program supports the development of field medical equipment, diagnostic capabilities and treatments; technologies to improve warfighter safety and to enhance personnel performance under adverse conditions; and systems to prevent occupational injury and disease in hazardous, deployment environments; including regenerative medicine technologies and therapeutic\/restorative practices for the treatment of combat-related traumatic injuries. Navy investment in these areas is essential because Navy\/USMC mission needs are not adequately addressed by the civilian sector or other Federal agencies. For example, civilian emergency medicine does not address casualty stabilization during long transit times to definitive care. The National Institutes of Health (NIH) focuses on the basic science of disease processes and not applied research related to development. Programs are coordinated with other Services through the Armed Services Biomedical Research Evaluation and Management (ASBREM) Committee, and Joint Technical Coordinating Group (JTCG) process, to prevent duplication of effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.069"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Medicine:\n- Continued efforts to reduce operational injuries \n- Continued studies on decompression sickness (DCS) and arterial gas embolism (AGE), to include novel approaches to the prevention, detection and treatment of DCS\/AGE, particularly by nonrecompressive methods. \n- Continued efforts to develop prophylactic agents preventing hyperbaric oxygen toxicity. Prolonged exposure to hyperbaric oxygen can be toxic to lungs, nervous system and eyes. \n- Continued efforts to assess the impact of thermal (i.e., heat and cold) stress on operational performance. Underwater thermal extremes can affect diver performance and alter risk of incurring decompression sickness. \n- Continued studies related to optimization of diver performance. Operational performance in the undersea environment can be hampered by a variety of environmental stressors. \n- Continued studies related to optimization of submariner health and performance. Submarine crewmembers are exposed to a variety of unique stressors including prolonged deployments, effects of altered diurnal rhythms, non-standard breathing gases, lack of sunlight, etc that can impact health and performance. \n- Continued research to explore novel pharmaceutical interventions for hyperbaric oxygen toxicity. \n- Initiate research on resuscitation therapies for near-drowning victims.\n\nRegenerative Medicine: \n- Continued program with Army, in regenerative medicine (Armed Forces Institute for Regenerative Medicine (AFIRM II))  \n\nNoise Induced Hearing Loss: \n- Continued research to reduce noise at the source, i.e. jet engine quieting and flight deck noise reduction. \n- Continued efforts to reverse NIHL.\n- Continued studies related to biomedical effects of underwater sound. Military divers must operate safely and effectively in potentially complex underwater sound fields. \n- Continued efforts for \"stress inoculation\" to mitigate the impact of exposure to stressful combat environments prior to deployment. \n- Continued research to study the incidence and susceptibility of Noise Induced Hearing Loss (NIHL) and tinnitus, and to evaluate mitigation strategies. \n- Continued research in prevention and treatment of Noise Induced Hearing Loss (NIHL) and tinnitus (ringing in the ears). \n- Continued research to improve personal protective equipment technology. \n\nNoise Induced Hearing Loss-Jet Noise: \n- Continued Jet Noise Reduction Project, Noise Induced Hearing Loss Program, to utilize analytical modeling and simulation tools anchored by experiment to develop and assess solutions enabling mitigation of jet induced noise from high performance tactical aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.833"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Medicine:\n- Continue all efforts of FY 2015, less those noted as completed above.\n- Terminate research into improved cognitive agility for divers and diving supervisors\n- Terminate research into diver Human Systems Integration (displays and biometric monitoring)\n\nRegenerative Medicine: \n- Continue all efforts of FY 2015, less those noted as completed above. \n\nNoise Induced Hearing Loss: \n- Continue all efforts of FY 2015, less those noted as completed above. \n \nNoise Induced Hearing Loss-Jet Noise: \n- Continue all efforts of FY 2015, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.392"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.392"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Medicine:\n- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete research on resuscitation therapies for near-drowning victims.\n\nRegenerative Medicine:\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nNoise Induced Hearing Loss: \n- Continue all efforts of FY 2016, less those noted as completed above. \n\nNoise Induced Hearing Loss-Jet Noise: \n- Continue all efforts of FY 2016, less those noted as completed above.\n\nOperational Performance Sustainment:\n\n- Initiate Operational Performance Sustainment (OPS) research to determine the effects of sleep and circadian disruption on warfighter performance. OPS program will integrate predictive models of performance and demonstrate validity using operationally relevant tasks. The goal is to make predictions of performance decrements due to fatigue \"actionable\" for commanders at sea."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "THE OFFICE OF NAVAL RESEARCH GLOBAL"
                                    },
                                    "Description": {
                                        "val": "ONR has a presence overseas, with an overarching purpose to search the globe for promising, emerging scientific research and development efforts to address the current needs of the Fleet\/Forces, and investigate high-payoff technologies for future naval missions and capabilities. To accomplish this task, ONR capitalizes on global innovation and investment to solve U.S. Navy and Marine Corps science and technology (S&T) challenges, builds global S&T awareness to mitigate risk of potential technological surprise, ensures Fleet\/Forces capability needs are communicated to the Naval Research Enterprise (NRE), and facilitates delivery of Naval S&T solutions to the Fleet\/Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.699"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "International Science Program:\nThe ONR International Science Program mission is to search the globe for emerging scientific research and advanced technologies, to enable the Office of Naval Research (ONR) and the Naval Research Enterprise (NRE) to effectively address current needs of the Fleet\/Forces, and investigate and assess revolutionary, high-payoff technologies for future naval missions and capabilities. This is accomplished through PHD-level Associate Director scientists located in Asia, Europe and South America collaborating with international organizations and researchers through grants in innovative applied research, and establishing quality, relevant connections between international science and technology (S&T) centers of excellence and DON, DOD, and other US Government organizations. The direct impact of this investment is to capitalize on international applied research during unprecedented and dynamic global interdependence, increasing the ability to solve DON S&T challenges through shared knowledge and technologies with partners. Additionally, this investment builds global S&T awareness to reduce the risk of potential technological surprise, and supports theater security cooperation goals to sustain cooperative relationships with an expanding set of international partners and to enhance global security. \n\nFleet\/Forces Science Advisors:\nThe Naval Science Advisor (SA) Program under 6.2 funding ensures the Naval Fleet\/Forces shape the DON investment in applied research S&T and develops teaming relationships to support and develop technology-based capability options for Naval Fleet\/Forces. Funding is also dedicated to applied research efforts in support of the various Naval Fleet\/Forces operational commands. The Science Advisors (SA) are a conduit between the Naval Fleet\/Forces, ONR, Naval Research Lab (NRL) and the entire Naval Research and Development Establishment (NRDE).  \n\n- SA, OPNAV N2\/N6 advises the Deputy CNO for Information Dominance, and Flag and SES leadership on Navy S&T programs that address information dominance; member of FNC Technical Oversight Group (TOG) Working Group which prioritizes and selects fifteen EC products that address nine FNC Pillars (i.e. FORCEnet, Sea Strike, Shield, and Basing); member of the FORCEnet IPT, Rapid Technology Transition Team, and Joint Concept Technology Demonstration Team that reviewed technology programs for the Fleet. Science Advisors serve in various Operational Commands, Support Commands and OPNAV Commands.  Specific examples of Fleet\/Forces Science Advisors include the following:  \n\n- SA, OPNAV N9, serves as the command's principal advisor and the senior representative of the DCNO on initiatives with S&T and Research and Development (R&D) organizations in government, academia, and industry.  Advises on technical developments in support of platform warfighting wholeness and informs DCNO on strategic and program issues as they relate to topics in decision forums; and on S&T factors outside the normal Navy program planning process that could afford strategic opportunities or affect or disrupt existing strategies, investments and plans.\n\n- SA, Commander, Navy Air and Missile Defense Command, (NAMDC) serves as the command's principal advisor and the representative of the Commander on Integrated Air and Missile Defense (IAMD) initiatives with S&T and R&D organizations in government, academia, and industry. The SA works as part of the Third Fleet Sea Shield Fleet Collaborative Team representing NAMDC.  The SA looks at the applied research and S&T aspects of IAMD and align them with the defense industry to pinpoint key requirements and emerging new technologies.\n\n- SA, Navy Warfare Development Command (NWDC), provides technical support for the generation and development of advanced warfighting concepts leading to innovative new strategies to address Navy challenges and opportunities. \n\n- SA, CNO Strategic Studies Group (SSG) fully partners in the generation of revolutionary warfighting concepts for the Navy of the future. Along with the Technology Fellows, the SA develops the SSG Fall Program which includes researching and inviting lecturers to address the SSG and developing engaging and mind-opening exploration travel for the CNO Fellows and mini exploration travel for all SSG members. - SA, Chief of Naval Operations Code N81 (OPNAV N81) focuses on disseminating the Navy's warfighting capability\/risk analysis products to the broader S&T community resulting in an improved influence of requirements pull on S&T. \n\n- SA, is part of the ONR internal strategy cell membership for updating the Navy S&T Strategic Plan. \n\n- SA, Naval Mine and Anti-Submarine Warfare Command (NMAWC) works with the Commander NMAWC who is the lead for the FNC ASW sub-Integrated Program Team (IPT). The SA is directly responsible to the Commander for drafting\/modifying capability gaps and enabling capabilities (EC) ideas, vetting them through the sub-IPT members, incorporating modifications, and providing the final recommendation to the Commander for presentation to the Sea Shield IPT. The SA advises Commander on Navy's Tactical ASW and MIW support and countermeasures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.864"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "International Science Program:\n- Continue all efforts of FY 2015, less those noted as completed above.\n\nFleet\/Forces Science Advisors:\n- Continue all efforts of FY 2014."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.235"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.235"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Training technologies enhance the Navy's ability to train effectively and affordably in classroom settings, in simulated environments, while deployed, and to operate effectively in the complex, highstress, information-rich and ambiguous environments of modern warfare such as asymmetric warfare. Technology development responds to a variety of requirements, including providing more affordable approaches to training and skill maintenance. Improved training efficiency and cost-effectiveness is achieved by applying operations research, modeling and simulation, and instructional, cognitive, and computer sciences to the development, delivery, evaluation, and execution of training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.820"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cognitive Science of Learning: \n- Continued research and assessment of advanced gaming technology for enhanced training. \n- Continued creation and conduct of experiments to validate automated performance assessment and after action reviews. \n- Continued a systematic program of applied research addressing unanswered questions regarding effective instructional strategies in artificially intelligent tutoring. \n- Continued research in the neuro-biology of learning including integration of the role of white matter. \n- Continued development of games that incorporate AI techniques to teach complex warefighter skills decision-making and problem solving. \n- Continued development of intelligent avatars to interact with learners from different cultural, linguistic backgrounds, and preferences. \n- Continued development of scenarios generators that produce integrated training (e.g., individual and collective) training. \n- Continued development of optimal training strategies for intelligent jobs on mobile devices ( e.g., IPad). \n- Continued development of immersive environments for training interpersonal and leadership skills. \n- Continued design and conduct experiment to assess training effectiveness of intelligent tutor for training ship handling skills. \n- Continued development of novel psychometric approaches to assess human performance in medical\/ military simulations and simulators. \n- Continued research in design features of medical and military simulators and simulations. \n- Continued field studies and user tests evaluating new features and job aiding tools. \n- Continued research into computational neuron-models in the design of training systems. \n\nEnhancing Warfighter Cognitive Capability: \n- Continued research to understand the structural relations among the latent variables of short-term memory, working memory, executive attentional control, and fluid intelligence. \n- Continued research to assess the improvement in recruit classification provided by the addition of measures of fluid intelligence and working memory. \n- Continued research to understand the role of intrinsic motivation in facilitating the transfer of working memory training to other cognitive capabilities. \n- Continued research to assess the efficacy of game-based brain training using hand-held (fieldable) hardware platforms. \n- Continued research to determine the relationship between induced gains in fluid intelligence and cognitive adaptability and agility, considered from the perspective of military decision-making. \n- Continued task to develop multi-agent based architectures for modeling human behavior, improve techniques for human cognitive and behavioral modeling, and create highly realistic simulated teammates. \n\nComputational Models of Human Behavior: \n- Continued research into game based training to more effectively enable better warfighter understanding of languages and cultures to enhance their regional expertise. \n- Continued research on software tools to facilitate building natural language tutorial dialogs for artificially intelligent tutoring. \n- Continued the integration of cognitive and neuron-computational models of human learning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cognitive Science of Learning: \n- Continue all efforts of FY 2015, less those noted as completed above.\n- Initiate development of skill decay models for psychomotor, perceptual, and cognitive skills and refresher training strategies.\n- Initiate development of intelligent avatars to interact with learners from different cultural, linguistic backgrounds, and preferences.\n- Initiate development of scenarios generators that produce integrated training (e.g., individual and collective) training.\n\nEnhancing Warfighter Cognitive Capability: \n- Continue all efforts of FY 2015, less those noted as completed above.\n\nComputational Models of Human Behavior: \n- Continue all efforts of FY 2015, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.870"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.870"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cognitive Science of Learning:\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nEnhancing Warfighter Cognitive Capability: \n- Continue all efforts of FY 2016, less those noted as completed above.\n\nComputational Models of Human Behavior: \n- Continue all efforts of FY 2016, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As discussed in Section A, there are a significant number of varied efforts within this PE. Each effort is measured against both technical and financial milestones. Each program effort and its projects are reviewed in depth for technical and transition performance against established goals. The Program Managers conduct routine site visits to performing organizations to assess programmatic and technical progress and most projects conduct an annual or biannual review by an independent board of visitors who assess the level and quality of the Science and Technology (S&T) basis for the project."
                        }
                    }
                }
            ]
        }
    }
}