{
    "id": "4271a801b76345e6c63417e377efefb8963f5303",
    "meta": {
        "filename": "dod-2017_RDTE_2017_OTANDE_U_RDTE_MasterJustificationBook_Operational_Test_and_Evaluation,_Defense_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Operational_Test_and_Evaluation,_Defense_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Operational Test and Evaluation, Defense",
        "appropriation_code": "0460",
        "appropriation_name": "Operational Test and Evaluation, Defense"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605118OTE"
        },
        "ProgramElementTitle": {
            "val": "Operational Test and Evaluation (OT&E)"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "AppropriationCode": {
            "val": "0460"
        },
        "AppropriationName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "75.720"
            },
            "PriorYear": {
                "val": "93.223"
            },
            "CurrentYear": {
                "val": "76.838"
            },
            "BudgetYearOne": {
                "val": "78.047"
            },
            "BudgetYearOneBase": {
                "val": "78.047"
            },
            "BudgetYearTwo": {
                "val": "80.129"
            },
            "BudgetYearThree": {
                "val": "81.488"
            },
            "BudgetYearFour": {
                "val": "82.955"
            },
            "BudgetYearFive": {
                "val": "84.116"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Director of Operational Test and Evaluation (DOT&E) was created by Congress in 1983.  The Director is responsible under Title 10 for policy and procedures for all aspects of Operational Test and Evaluation (OT&E) within the Department of Defense (DoD).  Particular focus is given to OT&E that supports major weapon system production decisions for acquisition programs included on the Office of Secretary of Defense Test and Evaluation Oversight List that is prepared and approved annually.  Generally, there are about 300 programs on the oversight list including all Major Defense Acquisition Programs (MDAP) and Major Automated Information Systems (MAIS).  MDAPs may not proceed beyond low-rate initial production (BLRIP) until OT&E of the program is complete.  DOT&E is involved early in the planning phase of each program to ensure adequate testing is planned and executed.  Key elements of DOT&E's oversight authority include: \n\n-     Approve component Test and Evaluation Master Plans (TEMPS).\n-     Approve component OT&E Test Plans (TPs).\n-     Oversee Military Department preparation and conduct of field operational tests; analysis and evaluation of the resultant test data; the assessment of the adequacy of the executed test and evaluation programs; and assessment of the operational effectiveness and suitability of the weapon systems.\n-     Report results of OT&E that supports BLRIP decisions to the Secretary of Defense and Congress, as well as providing an annual report summarizing all OT&E activities and the adequacy of test resources within DoD during the previous fiscal year.\n-     Review and make recommendations to the Secretary of Defense on all budgetary and financial matters related to OT&E, including operational test facilities, resources and ranges.\n\nDOT&E also oversees and resources OT&E community efforts to plan and execute joint operational evaluations of information assurance and interoperability\n (IA and IOP) of fielded systems and networks during major Combatant Command (CCMD) and Service exercises, and reports the trends and findings in the annual report. \n\nDOT&E is also involved in increasing the capacity to access realistically advanced cyber warfare capabilities to keep pace with heightened demand for their capabilities, advancing technologies and the growing cyber threat.\n\nThis Program Element includes funds to obtain Federally Funded Research and Development Center (FFRDC) support in performing the described tasks, travel funds to carry out oversight of the OT&E and IA and IOP programs, funds for Service teams performing information assurance and interoperability assessments during exercises, administrative support services, DFAS support, and engineering and technical support services related to the conduct of operational test and evaluation and exercise assessments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "93.223"
                },
                "CurrentYear": {
                    "val": "76.838"
                },
                "BudgetYearOne": {
                    "val": "78.434"
                },
                "BudgetYearOneBase": {
                    "val": "78.434"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "93.223"
                },
                "CurrentYear": {
                    "val": "76.838"
                },
                "BudgetYearOne": {
                    "val": "78.047"
                },
                "BudgetYearOneBase": {
                    "val": "78.047"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.387"
                },
                "BudgetYearOneBase": {
                    "val": "-0.387"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Inflation\/Economic adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.387"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.387"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Inflation\/Economic adjustment of -$0.387 in FY 2017"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0605118OTE"
                    },
                    "ProjectTitle": {
                        "val": "OT&E"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "75.720"
                        },
                        "PriorYear": {
                            "val": "93.223"
                        },
                        "CurrentYear": {
                            "val": "76.838"
                        },
                        "BudgetYearOne": {
                            "val": "78.047"
                        },
                        "BudgetYearOneBase": {
                            "val": "78.047"
                        },
                        "BudgetYearTwo": {
                            "val": "80.129"
                        },
                        "BudgetYearThree": {
                            "val": "81.488"
                        },
                        "BudgetYearFour": {
                            "val": "82.955"
                        },
                        "BudgetYearFive": {
                            "val": "84.116"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Director of Operational Test and Evaluation (DOT&E) was created by Congress in 1983.  The Director is responsible under Title 10 for policy and procedures for all aspects of Operational Test and Evaluation (OT&E) within the Department of Defense (DoD).  Particular focus is given to OT&E that supports major weapon system production decisions for acquisition programs included on the Office of Secretary of Defense Test and Evaluation Oversight List that is prepared and approved annually.  Generally, there are about 300 programs on the oversight list including all Major Defense Acquisition Programs (MDAP) and Major Automated Information Systems (MAIS).  MDAPs may not proceed beyond low-rate initial production (BLRIP) until OT&E of the program is complete.  DOT&E is involved early in the planning phase of each program to ensure adequate testing is planned and executed.  Key elements of DOT&E's oversight authority include: \n\n-     The approval of component Test and Evaluation Master Plans (TEMPS).\n-     The approval of component OT&E Test Plans (TPs).\n-     Oversight of Military Department preparation and conduct of field operational tests; analysis and evaluation of the resultant test data; the assessment of the adequacy of the executed test and evaluation programs; and assessment of the operational effectiveness and suitability of the weapon systems.\n-     Reporting results of OT&E that support BLRIP decisions to the Secretary of Defense and Congress, as well as providing an annual report summarizing all OT&E activities and the adequacy of test resources within DoD during the previous fiscal year.\n-     The review and make recommendations to the Secretary of Defense on all budgetary and financial matters related to OT&E, including operational test facilities, resources and ranges.\n\nDOT&E also oversees and resources OT&E community efforts to plan and execute joint operational evaluations of information assurance and interoperability\n( IA and IOP) of fielded systems and networks during major Combatant Command (CCMD) and Service exercises, and reports the trends and findings in the annual report. \n\nDOT&E is also involved in increasing the capacity to access realistically advanced cyber warfighting capabilities to keep pace with heightened demand for those capabilities, advancing technologies and the growing cyber threat.\n\nThis Program Element includes funds to obtain Federally Funded Research and Development Center (FFRDC) support in performing the described tasks, travel funds to carry out oversight of the OT&E and IA and IOP programs, funds for Service teams performing information assurance and interoperability assessments during exercises,  administrative support services, DFAS support, and engineering and technical support services related to the conduct of operational test and evaluation and exercise assessments."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Cyber Force Training and Resiliency"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Funding was applied at selected locations of the Cyber Mission Force, improving the capabilities and realism of Cyber Red Teams, and assessing Cyber Protection Teams and other network defenders on both ranges and operational networks.  These resources were applied in coordination with US Cyber Command in order to maximize the training benefit to the Cyber Mission Force and to perform assessments of the resiliency of CCMD critical missions and the supporting cyber teams."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PACOM Cyber"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.880"
                                        },
                                        "Text": {
                                            "val": "Funding was applied to growing cyber-range capabilities at US Pacific Command."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Red Team and Training"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3.760"
                                        },
                                        "Text": {
                                            "val": "Funding to support Cyber Red Team and training exercises."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "74.583"
                                            },
                                            "Text": {
                                                "val": "Operational Test and Evaluation Oversight\n\nThis effort is in direct support of the Director’s Title 10 responsibilities and is a continuing effort.  Funding for FY 2015 provides Operational Test and Evaluation inputs for Test and Evaluation Master Plans, Test Plans, System Acquisition Reports, Defense Acquisition Executive Summary Reports for those programs designated for oversight by DOT&E and OUSD(AT&L).  Key elements of DOT&E oversight authority are identified in Calendar Year 2015 Office of the Secretary of Defense Test and Evaluation Oversight List.  \n\nCybersecurity and Interoperability Evaluations\n\nDOT&E oversaw and resourced nine Combatant Command (CCMD) level and three Service level cybersecurity exercise assessments in FY 2015.   In addition to the 12 exercise assessments, two assessments were performed during visits to operational sites not involved in an exercise.  All DOT&E-sponsored assessments included a “fix” phase during which DOT&E-sponsored personnel helped CCMD and Service personnel address critical cybersecurity vulnerabilities.  DOT&E also began a new Theater Cyber Readiness Campaign (TCRC) with U.S. Pacific Command involving more frequent and more focused assessment events which helped the command address persistent cybersecurity vulnerabilities.  The cyber Red Teams which supported the FY 2015 assessments used validated cyber Tactics, Techniques, and Procedures (TTP’s) and incorporated more advanced cyber threats.  DOT&E initiated a Persistent Cyber OPFOR (PCO) and demonstrated this new capability for more representative and longer-duration adversary portrayal during U.S. Pacific Command’s TCRC assessments.  Fiscal year 2015 evaluations included trend analyses across prior year results, both within and across CCMDs.  Critical findings were transmitted to Service and DoD leadership for their awareness and remediation actions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "76.838"
                                            },
                                            "Text": {
                                                "val": "Operational Test and Evaluation Oversight\n\nThis effort is in direct support of the Director’s Title 10 responsibilities and is a continuing effort.  Funding for FY 2016 provides Operational Test and Evaluation inputs for Test and Evaluation Master Plans, Test Plans, System Acquisition Reports, Defense Acquisition Executive Summary Reports for those programs designated for oversight by DOT&E and OUSD(AT&L).  Key elements of DOT&E oversight authority are identified in Calendar Year 2016 Office of the Secretary of Defense Test and Evaluation Oversight List. \n\nCybersecurity and Interoperability Evaluations \n\nDOT&E plans to shift resources toward TCRCs, which are designed to help CCMDs address critical cybersecurity vulnerabilities.  Three CCMDs will each conduct a TCRC consisting of bi-monthly assessments with supporting PCO focused on improved cybersecurity technologies and\/or TTPs to address problems identified in prior assessments; the campaigns will each culminate in a major exercise that examines a critical mission aided by the improved technologies and TTPs.  DOT&E will oversee and resource approximately 10 CCMD level and Service level cybersecurity assessments in FY 2016, each including a “fix” phase as described above.  The portrayal of advanced cyber threats and assessment of mission accomplishment in representative threat environments are primary planning objectives for assessments in FY 2016.  Cyber Protection Teams will be assessed as they are encountered during PCO or exercise events.  Fiscal year 2016 evaluations will include trend analyses across prior year results, both within and across CCMDs.  Critical findings will be transmitted to Service and DoD leadership for their awareness and remediation actions.  The DoD Enterprise Cyber Range Environment (DECRE) will support events for added threat realism during exercise assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "78.047"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "78.047"
                                            },
                                            "Text": {
                                                "val": "Cybersecurity and Interoperability Evaluations\n\nDOT&E plans to continue to shift resources toward TCRCs, which are designed to help CCMDs address critical cybersecurity vulnerabilities.  Five CCMDs will each conduct a Theater Cyber Readiness Campaign consisting of bi-monthly assessments focused on improved cybersecurity technologies or TTPs to address problems identified in prior assessments; the campaign will culminate in a major exercise that examines a critical mission aided by the improved technologies and TTPs.   DOT&E will oversee and resource approximately 8 CCMD-level and Service-level assessments in FY 2017, each including a “fix” phase.  DOT&E will continue to work with the CCMDs and cyber red teams to increase the portrayal of advanced cyber threats which are more representative of nation state threats.  The goal is to have the majority of assessments in FY2017 include advanced threats that stress critical missions.  Cyber Protection Teams will also be assessed as they are encountered during PCO or exercise events.  Fiscal year 2017 evaluations will include trend analyses across prior year results, both within and across CCMDs.  Critical findings will be transmitted to Service and DoD leadership for their awareness and remediation actions.  The DoD Enterprise Cyber Range Environment (DECRE) and other cyber range assets with Red Teams portraying advanced cyber adversaries will support events for added threat realism."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance Measure:  Percentage of required operational test planning documents, assessments, and reports applicable to acquisition programs on the OSD Test and Evaluation Oversight List and other special interest programs\/legacy systems that are completed and delivered to the appropriate decision makers on time.\nThe on-time completion rate was computed on the basis of the number of required products that were submitted within established time standards relative to the total number of such products that fell due during the fiscal year.  Products included in the measure include beyond low-rate initial production reports, Test Plans, and Test and Evaluation Master Plans for operational test and evaluation oversight as well as assessment plans, “quick look” reports, and final reports for the information assurance and interoperability testing associated with scheduled test events."
                        }
                    }
                }
            ]
        }
    }
}