{
    "id": "4fdb5dbafa5f9d2a6e2b1596aa3874cbdd82df86",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA5A_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0304270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Development"
        },
        "R1LineNumber": {
            "val": "136"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.961"
            },
            "CurrentYear": {
                "val": "12.686"
            },
            "BudgetYearOne": {
                "val": "14.425"
            },
            "BudgetYearOneBase": {
                "val": "14.425"
            },
            "BudgetYearTwo": {
                "val": "13.677"
            },
            "BudgetYearThree": {
                "val": "13.533"
            },
            "BudgetYearFour": {
                "val": "13.809"
            },
            "BudgetYearFive": {
                "val": "41.380"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Fiscal Year (FY) 2017 budget request funds Electronic Warfare (EW) Development.  This Program Element encompasses engineering and manufacturing development for tactical EW.  EW encompasses the development of tactical EW equipment and systems mounted in both ground and air vehicles.  The systems under this program provides the Army with the capability to degrade or deny hostile forces the effective use of their communications, counter mortar\/counterbattery radars, surveillance radars, infrared\/optical battlefield surveillance systems and electronically fused munitions.  Existing Army EW systems must be replaced or upgraded to maintain their capability in the face of threats. Prophet Enhanced is the current system under the Prophet Ground acquisition program.  Its primary mission is to provide 24-hour Situation Development and Information Superiority to the supported maneuver brigade to enable the most effective engagement of enemy forces.  Prophet Enhanced provides a modular, scalable, open architecture-based system solution optimized for ease of use in a variety of configurations (Stationary-Fixed, Mobile and Manpack). The Army Reprogramming Analysis Team (ARAT) is a Department of the Army established project to develop techniques, methods, tools and architecture to reprogram mission software embedded in Army EW systems, Force Protection Systems (FPS), and Target Sensing Systems (TSS) in response to changes in threat signatures.  ARAT Research and Development enables continuous development of: 1) automated threat analysis tools to rapidly detect (flag) threat changes within intelligence systems, 2) tools to minimize the time to develop EW Mission Software and Products (MSP) for both air and ground EW systems, 3) tools and technology to minimize the time required to test and validate MSPs, 4) improved communications conduits to transmit mission software changes to field users, and 5) enhanced mission-software uploading tools. These efforts allow for rapid threat analysis, simulation, mission software development, distribution and uploading of mission software changes directly to the supported Soldier in the field.  The ARAT project will develop, test and equip an Army-wide infrastructure capable of rapidly reprogramming electronic combat software embedded in offensive and defensive weapon system."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.961"
                },
                "CurrentYear": {
                    "val": "12.686"
                },
                "BudgetYearOne": {
                    "val": "15.598"
                },
                "BudgetYearOneBase": {
                    "val": "15.598"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.961"
                },
                "CurrentYear": {
                    "val": "12.686"
                },
                "BudgetYearOne": {
                    "val": "14.425"
                },
                "BudgetYearOneBase": {
                    "val": "14.425"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.173"
                },
                "BudgetYearOneBase": {
                    "val": "-1.173"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.173"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.173"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EW5"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Warfare Development - MIP"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.426"
                        },
                        "CurrentYear": {
                            "val": "6.660"
                        },
                        "BudgetYearOne": {
                            "val": "6.758"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.758"
                        },
                        "BudgetYearTwo": {
                            "val": "5.512"
                        },
                        "BudgetYearThree": {
                            "val": "4.842"
                        },
                        "BudgetYearFour": {
                            "val": "4.942"
                        },
                        "BudgetYearFive": {
                            "val": "32.275"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Prophet Enhanced is the current system under the Prophet Ground acquisition program.  Funds provide for development and integration of Pre-Planned Product Improvement (P3I) upgrades for Next Generation Signals and state-of-the-art Signals Intelligence (SIGINT) exploitation techniques to increase the capabilities of the Prophet Enhanced and maintain operational relevance.  The Prophet Enhanced is the tactical commander's sole organic ground-based SIGINT\/Electronic Warfare system for the Brigade Combat Team (BCT), Stryker Brigade Combat Team (SBCT), and Battlefield Surveillance Brigade (BfSB).  Its primary mission is to provide 24-hour Situation Development and Information Superiority to the supported maneuver brigade to enable the most effective engagement of enemy forces.  Prophet Enhanced provides a modular, scalable, open architecture-based system solution optimized for ease of use in a variety of configurations (Stationary-Fixed, Mobile and Manpack).  It also incorporates product modernization, integration, and test of equipment for rapid integration of Technical Insertions (TI) and product development to ensure operational relevance.\n\nJustification:\nFiscal Year (FY) 2017 Base dollars in the amount of $6.758 million will support non-recurring engineering upgrades to the Prophet Enhanced Manpack subsystem.  Specifically, new signal capabilities will be developed, integrated, and tested\/accredited to ensure that Prophet keeps pace with the constantly changing signal environment and to ensure that Prophet maintains its operational relevance against key enemy threats.\n\nFY17 funding request for PE 0304270A was reduced by $1.173M. Out of this total reduction, EW5 FY17 funding request was reduced by $.965 million to account for the availability of prior year execution balances. Remaining funding reduction was for EW6 ARAT program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Signals"
                                    },
                                    "Description": {
                                        "val": "Development of next generation signals enable the Prophet system to remain operationally relevant with state-of-the-art Signal and Threat exploitation capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.073"
                                            },
                                            "Text": {
                                                "val": "Funds were used for development of next generation signals and required test support activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.139"
                                            },
                                            "Text": {
                                                "val": "Funds are provided  for hardware upgrades to increase system performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced SIGINT Exploitation"
                                    },
                                    "Description": {
                                        "val": "Development of next generation signals enable the Prophet system to remain operationally relevant with state-of-the-art Signal and Threat exploitation capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.153"
                                            },
                                            "Text": {
                                                "val": "Funds were provided for S\/W upgrades (increase in memory, antenna upgrade, operating system upgrade) to increase system performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.321"
                                            },
                                            "Text": {
                                                "val": "Funds are provided for S\/W upgrades (receiver software upgrade) to increase system performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Manpack Signal Set"
                                    },
                                    "Description": {
                                        "val": "Development and integration of the improved Manpack will enable the Prophet system to remain operationally relevant in the constantly changing signal environment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.258"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.258"
                                            },
                                            "Text": {
                                                "val": "Funds will provide support for non-recurring engineering change and software qualification testing for the Prophet Enhanced Manpack system.  In addition, funds will also provide for engineering and software development support for the Prophet program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "Development of next generation signals, enhanced SIGINT exploitation, and improved manpack signal sets enable the Prophet system to remain operationally relevant with state-of-the-art Signal and Threat exploitation capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Funds were provided for core, matrix and contractor system engineering and program management support for the Prophet program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Funds are provided for core, matrix  and contractor system engineering and program management support for the Prophet program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Funds will provide for core, matrix  and contractor system engineering and program management support for the Prophet program.  In addition, the integration of the advanced signal types requires increased manpower for the oversight and system engineering support to the integration efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "SSN BZ9753"
                                    },
                                    "Title": {
                                        "val": "Prophet Enhanced Modification MIP (BZ9753)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "40.910"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "40.910"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "30.114"
                                        },
                                        "BudgetYearThree": {
                                            "val": "43.359"
                                        },
                                        "BudgetYearFour": {
                                            "val": "46.874"
                                        },
                                        "BudgetYearFive": {
                                            "val": "80.392"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SSN BZ7326"
                                    },
                                    "Title": {
                                        "val": "Prophet Ground (OPA) - BZ7326"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "55.896"
                                        },
                                        "CurrentYear": {
                                            "val": "53.650"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SSN BZ9751"
                                    },
                                    "Title": {
                                        "val": "Special Purpose Systems (MIP OPA) (Prophet Only) - BZ9751"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.901"
                                        },
                                        "CurrentYear": {
                                            "val": "3.978"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.055"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.055"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.189"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.482"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.194"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.047"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SSN 0605766A"
                                    },
                                    "Title": {
                                        "val": "National Integration to Tactical Systems (MIP) - DX9 (TNG, PE 0605766A)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.450"
                                        },
                                        "CurrentYear": {
                                            "val": "0.434"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.526"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.526"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.500"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.500"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Prophet Research and Development (R&D) Acquisition Strategy is structured to maintain operational relevancy of Prophet Enhanced systems in a dynamic threat environment while reducing risk and streamlining business and engineering processes. Follow-on contracting activities are to modernize forty-seven previously fielded ground tactical SIGINT systems to the current technology baseline. The P3I contract supports R&D and other developmental work."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Electronic Warfare & Cyber"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.581"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software SIL"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GD C4 Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.889"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.889"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Radio\/Receiver Inegration (integrate software defined receiver)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GD C4 Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.037"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Integrate Electronic Warfare Systems"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TRAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Leavenworth, KS"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.900"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Next Generation Signals (TOS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GD C4 Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.200"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Precision Geo-Location"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GD C4 Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.200"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Real-time Signal Processing architectural framework (software defined capabilities)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GD C4 Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.706"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Next Generation Signals"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GD C4 Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.168"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.073"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.139"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enhance SIGINT Exploitation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GD C4 Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.811"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.153"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.321"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Improved Manpack Signal Set"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.258"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.258"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.258"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering & Software Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AASKI Technology"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.964"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.964"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Integration Lab"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "I2WD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Prepare and Conduct Delta Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EPG\/AEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.240"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "oftware Qualification Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98178-213.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Prophet Enhanced  QRC Contract Extension"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Production - Prophet Enhanced"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding - Prophet Enhanced"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prophet P3I and TI"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development Test (DT)\/Technical Test (TT) - P3I (2017)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Delta Testing - P3I (2019)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Contract Award - Modernization of Legacy Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prophet Modernization of Legacy Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prophet Modernization of Legacy Systems - Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EW6"
                    },
                    "ProjectTitle": {
                        "val": "ARAT-TSS - MIP"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.535"
                        },
                        "CurrentYear": {
                            "val": "6.026"
                        },
                        "BudgetYearOne": {
                            "val": "7.667"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.667"
                        },
                        "BudgetYearTwo": {
                            "val": "8.165"
                        },
                        "BudgetYearThree": {
                            "val": "8.691"
                        },
                        "BudgetYearFour": {
                            "val": "8.867"
                        },
                        "BudgetYearFive": {
                            "val": "9.105"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Army Reprogramming Analysis Team (ARAT) is a Department of the Army established program to develop techniques, methods, tools and architecture to rapidly reprogram mission software embedded in Army Electronic Warfare (EW) systems in response to changes in threat signatures. The regulatory guidance directing this mission is contained in AR 525-15, AR 525-22, and AR 95-1. The ARAT develops integrated technical solutions required to counter increasingly sophisticated EW threats to US Forces. The ARAT reprogramming infrastructure supports the Army Campaign Plan to provide the Regionally Aligned Forces tactical Commander timely rapid-reprogramming capability of EW systems with mission software.  The ARAT mission responsibility is to develop and distribute Mission Software and Products to forward deployed combat forces. ARAT identifies and analyzes threat signature changes which affect EW systems; determines the impact of observed signature changes; develops new mission software to adapt friendly systems to detect enemy changes; disseminates the Mission Software and Products, and provides tools and software to upload new mission software into the affected EW systems."
                        },
                        "ProjectMissionDescription": {
                            "val": "Current military operations are conducted in a rapidly changing threat environment, where Improvised Explosive Devices (IEDs), Infra Red (IR) man-portable air defense systems (MANPADS) seekers, radar guided surface-to-air-missiles (SAM), laser guided weapons, anti-helicopter mines, and targeting sensors are proliferating and evolving. Integrated solutions are required to counter increasingly sophisticated EW threats.  The ARAT reprogramming infrastructure supports the tactical Commander by providing timely rapid reprogramming of mission software and information dissemination for Army supported, Joint and allied services.  ARAT supports integrated reprogramming of target acquisition, target engagement, vehicle survivability, and Aircraft Survivability Equipment (ASE). ARAT rapid-reprogramming infrastructure supports tactical requirements for deployed aircraft and ground-based (e.g. Counter Radio-Controlled Improvised Explosive Device (CREW)) survivability systems. ARAT identifies and analyzes threat signature changes which affect EW systems; determines the impact of observed signature changes; develops new mission software to adapt the system to the changes; disseminates the mission software; and provides methods to upload the new mission software into the affected EW systems. Each element within the ARAT infrastructure plays a specific role within the program's rapid reprogramming process, providing the Soldier with the capability to install mission and target identification software at the lowest possible level, thus maximizing flexibility for tactical commanders. ARAT participates in the operational and developmental test design of Army EW systems, and supports Joint Service Reprogramming Exercises in all theaters. ARAT Research and Development enables continuous development of: 1) automated threat analysis tools to rapidly detect (flag) threat changes within the intelligence system, 2) tools to minimize the time to develop Mission Software and Products (MSP), 3) tools and technology to minimize the time required to test and validate MSPs, 4) improved communications conduits to rapidly transmit mission software to upload into supported EW systems. These efforts allow for rapid threat analysis, threat modeling and simulation, mission software development and testing, distribution and uploading of mission software directly to the supported Soldier in the field."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Keeping Pace with the Enemy and Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing a capability for the Government to rapidly develop and distribute organic mission software solutions for multiple EW systems.  The Army must continually modernize and enhance software tools and processes counter enemy technology.  ARAT EW6 Military Intelligence Program (MIP) executes Research, Development, Test, and Evaluation (RDTE) funding to provide an organic Army capability for this organization to rapidly develop and distribute mission software solutions for forward deployed combat forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.258"
                                            },
                                            "Text": {
                                                "val": "In FY15 ARAT developed the Ground Electronic Warfare (EW) Automated Test Set (ATS), a unique integrated testbed for development and evaluation of Ground EW threat devices and load sets.  The ATS provides hardware in the loop (HWIL) automated testing of Army Ground EW systems against real-world legacy and advanced threat devices, including multiple cellular communications technologies. With ATS, the Army is now able to test and optimize Ground EW systems for optimal performance against multiple threat devices in a complex RF environment. The ATS replaces a prior manual test set which was limited to single threat devices, human observation of basic test apparatus and manual data recording. Full use of the ATS in load set development will shorten timelines and reduce the costs of rapid reprogramming of Army Ground EW systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.987"
                                            },
                                            "Text": {
                                                "val": "This FY effort continues to: 1) analyze the intelligence data requirements to support MSP development for EO\/UV\/IR spectrums and other multi-spectral sensors for aviation and non-aviation EW systems, 2) Develop government organic knowledge and application-base enabling reprogramming of future systems, 3) Perform requirements analysis and concept development for the reprogramming of multi-spectral EW systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.402"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.402"
                                            },
                                            "Text": {
                                                "val": "This FY effort will continue to: 1) study the intelligence data requirements to support MSP development for EO\/UV\/IR spectrums and other multi-spectral sensors for aviation and non-aviation EW systems, 2) Develop government organic knowledge and application-base enabling reprogramming of future systems, 3)Perform requirements analysis and concept development for the reprogramming of multi-spectral EW systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infrastructure Improvements Multispectral"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on enhancing the Army's multispectral Missile Warning System (MWS) software sustainment infrastructure.  With the worldwide proliferation of MANPADS the Army must have the capability to rapidly analyze and develop mission software solutions to detect and counter MANPADS to defend Army Aviation platforms against this lethal threat."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.746"
                                            },
                                            "Text": {
                                                "val": "Developed a modernized version of the Common Missile Warning System (CMWS) User Data Module Generator (UDMG) software.  This software, which runs on the Army approved Windows 7 Army Gold Master (AGM) replaces the obsolete and unsupportable original equipment manufacturer (OEM) software which required the Information Assurance (IA) non-compliant Solaris 8 operating system.  The Windows UDMG software is fully IA compliant.  Developed software tools and databases for organic United States Government (USG) sustainment and support of the CMWS algorithm and Bulk File Data (BFD), including the advanced Virtual Software Integration Lab (VSIL) software, which allows laboratory runs of archived test data to be performed at high speed on modern cluster processing computer systems.  These infrastructure enhancements provide the basis for an Operational Flight Program (OFP) development environment to enable the (USG) to develop and deploy an OFP environment for CMWS. Previously, minimal government organic capability existed, increasing the risk that systems cannot be readily adapted to changing threats in the future."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.323"
                                            },
                                            "Text": {
                                                "val": "Conduct infrastructure enhancements for an OFP software development environment to enable the USG to develop and deploy an OFP environment for MWS. Determine data and conduct analysis requirements for MANPADS characterization and establish an organic government analysis and sustainment process to support OFPs and subsequently adapt MWSs to new threats. Establish initial government organic capability, thereby decreasing the risk that systems cannot be readily adapted to changing threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.477"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.477"
                                            },
                                            "Text": {
                                                "val": "Will conduct infrastructure enhancements for an OFP software development environment to enable the USG to develop and deploy an OFP environment for MWS. Will determine data and conduct analysis requirements for MANPADS characterization and establish an organic government analysis and sustainment process to support OFPs and subsequently adapt MWSs to new threats. Will establish government organic capability, thereby decreasing the risk that systems cannot be readily adapted to changing threats. Currently, minimal government organic capability exists, increasing the risk that systems cannot be readily adapted to changing threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infrastructure Improvement Radio Frequency General"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on enhancing the Army's Radio Frequency (RF) EW system MSP development and distribution infrastructure.  The Army must fight in a contested and congested EW environment.  Mission software solutions to defend against RF threats must be rapidly developed, tested and distributed to Soldiers on an ever changing battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.419"
                                            },
                                            "Text": {
                                                "val": "Developed the Test Automation Suite (TAS) of software which provides computer-controlled automated HWIL RF testing for multiple Army Radar Warning Receivers.  TAS allows engineers to pre-program multiple simulated threats and operating modes for test and evaluation of Mission Data Software in the laboratory.  TAS allows for unmonitored batch testing and automated data collection, greatly reducing the man hours required for Mission Data Software validation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.507"
                                            },
                                            "Text": {
                                                "val": "Enhance the ARAT communications architecture to facilitate the rapid secure transmission of mission software changes to EW systems, with emphasis on remote user and highly mobile Soldier connectivity. Develop and implement an initial integrated EW development and test environment to ensure MSP and threat countermeasure integration on the respective ground and airborne platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.394"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.394"
                                            },
                                            "Text": {
                                                "val": "Will continue to enhance the ARAT communications architecture to facilitate the rapid secure transmission of mission software changes to EW systems, with emphasis on remote user and highly mobile Soldier connectivity. Will develop and implement an initial integrated EW development and test environment to ensure MSP and threat countermeasure integration on the respective EW platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Flagging and Mission Data Set Reprogramming Tool Development"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on enhancing the Army's capability to monitor changes in enemy EW systems that affect system performance of onboard Army detection, declaration and countermeasure EW systems.  The enemy is continuously developing or modifying it's EW systems.  For Army platforms to have protection against enemy systems it must have a robust capability to immediately detect changes in threat system performance and rapidly develop, test, and distribute a mission software solution that counter the threat.  This effort will enhance the Army's capability bridge detection of a change in enemy threat and the rapid development of MSP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.112"
                                            },
                                            "Text": {
                                                "val": "Developed the ARAT Display Emulator software, which precisely produces the symbology displayed by the UH-60M Multi-Function Display (MFD) and the AH-64D Multi-Purpose Display (MPD) using Commercial Off The Shelf (COTS) computer hardware and operating systems.   The Display Emulator is scalable, and can be modified to emulate other USG on-aircraft displays in the future. Enhanced threat flagging (threat performance change detection) and intelligence analytical tools, based on supported systems performance criteria, to rapidly identify and counter emerging and changing threats that adversely affect the performance of the EW systems. Conducted initial mission software development, develop testing and validation tools to decrease time from threat-change detection to the distribution of MSP in order to increase the accuracy and fidelity of threat identification, and reduce the engineering involvement\/workload associated with the manually intensive analysis and MSP development processes. Defined requirements and developed tools to migrate to a data support infrastructure that employs the Electronic Warfare Integrated Reprogramming (EWIR) database."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.209"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and enhance applications for ARAT internal system specific threat flagging, threat analysis, mission software generation and testing processes. Continue to enhance threat flagging (threat performance change detection) and intelligence analytical tools, based on supported systems performance criteria, to rapidly identify and counter emerging and changing threats that adversely affect the performance of the EW systems. Enhance mission software development, testing and validation tools to decrease time from threat-change detection to the distribution of MSP in order to increase the accuracy and fidelity of threat identification, and reduce the engineering involvement\/workload associated with the manually intensive analysis and MSP development processes. Define requirements and develop tools to enhance a data support infrastructure that employs the EWIR database."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.394"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.394"
                                            },
                                            "Text": {
                                                "val": "Will develop enhanced spiral applications for ARAT internal system specific threat flagging, threat analysis, mission software generation and testing processes. Will conduct spiral enhancement of threat flagging (threat performance change detection) and intelligence analytical tools, based on supported systems performance criteria, to rapidly identify and counter emerging and changing threats that adversely affect the performance of the EW systems. Will develop enhanced mission software development, testing and validation tools to decrease time from threat-change detection to the distribution of MSP in order to increase the accuracy and fidelity of threat identification, and reduce the engineering involvement\/workload associated with the manually intensive analysis and MSP development processes. Will continue to evaluate and define requirements to develop tools that enhance a data support infrastructure that employs the EWIR database."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The efforts to be funded in this project will require a combination of systems specific and high-tech knowledge. The contractual services portion for the project will be obtained from both the Communications-Electronics Command (CECOM) Software Engineering Center (SEC) competitive omnibus and the Research, Development and Engineering Command (RDECOM) and the Defense Technical Intelligence Center (DTIC) high tech contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Beginning FY16, Program Management cost is properly aligned in Management Services."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM SEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Ground, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.256"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.266"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.266"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "USG Labor"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM SEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.448"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.663"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.111"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM SEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.654"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.184"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.838"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM SEC, RDECOM, DTIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.867"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.688"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.770"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.401"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.401"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98178-214.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Software Development Support (see notes in Schedule Detail)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "-Software Test Automation\n-Threat Analysis Data Evaluation Tool\n-Enhance Data Distribution"
                        }
                    }
                }
            ]
        }
    }
}