{
    "id": "5dc96eca647dd5a421f296334abcb54a258bfd3b",
    "meta": {
        "filename": "dod-2017_RDTE_2017_DTRA_U_RDTE_MasterJustificationBook_Defense_Threat_Reduction_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Defense_Threat_Reduction_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601000BR"
        },
        "ProgramElementTitle": {
            "val": "DTRA Basic Research Initiative"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "179.420"
            },
            "PriorYear": {
                "val": "36.607"
            },
            "CurrentYear": {
                "val": "38.436"
            },
            "BudgetYearOne": {
                "val": "35.436"
            },
            "BudgetYearOneBase": {
                "val": "35.436"
            },
            "BudgetYearTwo": {
                "val": "38.408"
            },
            "BudgetYearThree": {
                "val": "38.918"
            },
            "BudgetYearFour": {
                "val": "39.419"
            },
            "BudgetYearFive": {
                "val": "40.185"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "*Project RU title changes from Fundamental Research for Combating WMD to Basic Research for Countering WMD beginning in FY 2017."
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Threat Reduction Agency (DTRA) Basic Research Initiative funds research across physical, material, engineering, computational, and life sciences directed toward greater knowledge and understanding of the fundamental aspects of observable phenomena associated with weapons of mass destruction (WMD).\n\nThe Basic Research Initiative is the Nation’s only basic research program solely dedicated to countering weapons of mass destruction (CWMD).  It provides for the discovery and development of basic knowledge by research performers comprised from academia and world-class research institutions in government and industry. This investment helps motivate the scientific community to conduct research benefiting WMD-related defense missions, advancing the body of CWMD knowledge, and improving knowledge of research efforts that benefit nonproliferation, counter proliferation, and consequence management efforts. These efforts are closely coordinated with DTRA’s Chemical and Biological Technologies Department, which executes a basic research program under DoD’s Chemical and Biological Defense Program. \n\nEach year, program and technical managers conduct formal assessments of the portfolio, leveraging deep S&T expertise within DTRA, as well as from the Defense Basic Research Advisory Group, independent external panel reviews, and other CWMD-focused stakeholders. This coordination facilitates unique, CWMD-relevant basic research while eliminating unintended duplication of effort in the broader defense S&T community.\n\nDescriptions of the technical areas covered in DTRA’s Basic Research Initiative portfolio are provided in the R-2a exhibit."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.778"
                },
                "CurrentYear": {
                    "val": "38.436"
                },
                "BudgetYearOne": {
                    "val": "38.783"
                },
                "BudgetYearOneBase": {
                    "val": "38.783"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "36.607"
                },
                "CurrentYear": {
                    "val": "38.436"
                },
                "BudgetYearOne": {
                    "val": "35.436"
                },
                "BudgetYearOneBase": {
                    "val": "35.436"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.171"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.347"
                },
                "BudgetYearOneBase": {
                    "val": "-3.347"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.171"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.047"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.047"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.285"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.285"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Reductions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.015"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.015"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease in FY 2017 from the previous President's Budget submission is balance near term operational needs with future technical developments and capabilities. Other reductions were in support of Departmental efficiencies and economic assumptions.  Reductions to the RDT&E portfolio impacted investment in efforts with lower return on investment, lower customer demand, or that were early in the development cycle."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RU"
                    },
                    "ProjectTitle": {
                        "val": "*Basic Research for Countering WMD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "179.420"
                        },
                        "PriorYear": {
                            "val": "36.607"
                        },
                        "CurrentYear": {
                            "val": "38.436"
                        },
                        "BudgetYearOne": {
                            "val": "35.436"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.436"
                        },
                        "BudgetYearTwo": {
                            "val": "38.408"
                        },
                        "BudgetYearThree": {
                            "val": "38.918"
                        },
                        "BudgetYearFour": {
                            "val": "39.419"
                        },
                        "BudgetYearFive": {
                            "val": "40.185"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "*Project RU title changes from Fundamental Research for Combating WMD to Basic Research for Countering WMD beginning in FY 2017."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Basic Research for Countering WMD project as the nation’s only basic research solely dedicated to countering weapons of mass destruction (CWMD), is a core strategic investor in future scientific and technological progress across the full spectrum of Defense Threat Reduction Agency's (DTRA) CWMD mission areas. This project concentrates on high risk, high-payoff basic research, leveraging world class expertise in academia, government, and industry to increase the foundational body of scientific knowledge supporting DTRA’s Applied Research and Advanced Technology Development projects.  This Initiative aligns with DTRA’s strategic objectives that directly support policy and planning guidance from the Office of the President, the Department of Defense, and the broader WMD threat reduction community.  The portfolio addresses this guidance through capability enhancements, projects, and Science and Technology (S&T) investments that support CWMD and reduce global nuclear dangers. Specifically, they include: accelerating the development of standoff radiological\/nuclear detection capabilities; researching countermeasures and defenses to non-traditional agents; enhancing nuclear forensics; securing vulnerable materials; developing new verification technologies; developing an in-depth understanding of the capabilities, values, intent, and decision making of potential adversaries, whether they are states, networks, or individuals; defeating WMD agents; researching biologically-based and inspired materials for Department of Defense (DoD) applications; and leveraging science, technology, and innovation through domestic and international partnerships and agreements.  This project solicits, coordinates, and conducts basic research aligned to five Thrust Areas.  Each Thrust Area Manager coordinates an independently reviewed portfolio of research projects selected for scientific merit, technical quality, and the potential for innovation. \n\nThrust Area 1: Science of WMD Sensing and Recognition. This thrust area explores novel methodologies to investigate physical properties of sensitive materials as they interact with phenomena associated with WMD, such as ionizing radiation. This research provides the basis for developing capabilities to discover the presence, identity, and quantity of material or energy in the environment that may be significant, in turn providing the means to develop advanced forensic applications that enable detection, characterization, and attribution, particularly in post-detonation radiative environments.\n\nThrust Area 2: Network Sciences. This thrust area explores analytical, numerical, computational and other mathematical approaches to model and simulate the behavior of layered, interdependent physical networks affected by WMD. This interdisciplinary, theoretical research provides the basis for developing advanced algorithms and analytical frameworks that accurately predict and depict WMD environments by characterizing impacts and vulnerabilities, representing root causes of cascading failures, and assessing robustness, resilience, restoration, and recovery in varying degrees of disruption.\n\nThrust Area 3: Science for Protection. This thrust area employs experimental, computational, and theoretical approaches to explore and understand the causal mechanisms and deleterious characteristics of ionizing radiation and the tolerance, response, and resistance characteristics of affected sensitive electronic systems and microorganisms. This research provides the basis for engineering resilient systems and technologies, offering radical improvements to the survivability and performance of mission-critical electronic equipment and personnel in hostile radiative environments.\n\nThrust Area 4: Science to Defeat WMD. Through experimentation and computational modeling and simulation, this thrust area investigates phenomena associated with penetration physics, shock propagation and turbulence dynamics, and researches novel energetic and reactive materials for defeat of targets containing WMD. This research provides the scientific foundation necessary to develop advanced solutions for: (1) accessing WMD in hardened and deeply buried infrastructure, (2) defeating (non-nuclear) targets with minimal unintended collateral effects, and (3) predicting post-detonation (non-nuclear) weapon effects.\n\nThrust Area 5: Science to Secure WMD. This thrust area leverages a wide range of scientific and mathematical disciplines to explore phenomena related to physical, biological and chemical interactions with radioactive particles and waveforms. This research provides the technical basis for development of innovative, unconventional applications to improve security oversight and control of WMD materials and facilities and to improve monitoring and surveillance systems related to arms control and nonproliferation.\n \nThe increase from FY 2015 to FY 2016 maintains the investment in basic research to keep pace with inflation. The decrease from FY 2016 to FY 2017 balances near term operational needs with future technical developments and capabilities. Reductions to the RDT&E portfolio impacted investment in efforts with lower return on investment, lower customer demand, or that were early in the development cycle."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Project RU: Basic Research for Countering WMD"
                                    },
                                    "Description": {
                                        "val": "Project RU funds the exploration and discovery of fundamental scientific knowledge related to DTRA’s CWMD mission by research performers from academia, government and industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.607"
                                            },
                                            "Text": {
                                                "val": "- Managed over 150 active basic research awards on a three to five year cycle. The Agency’s Basic Research portfolio directly addressed specific priorities on Autonomy, Data to Decisions, Electronic Protection, and Engineered Resilient Systems.\n- Supported the development of the future Science, Technology, Engineering, and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories.\n- Conducted an annual technical review of each grant to assess scientific advancements and progress in meeting technical objectives, and to foster collaboration and build relationships within the scientific community.\n- Conducted an annual external panel review of the basic research program that was open to DoD research stakeholders.  The panel assessed program effectiveness in the context of CWMD technical challenges, and assessed coordination of CWMD basic research across the DoD mission space and the broader basic research community to avoid unintended duplication and ensure successful partnerships. \n- Developed highly sensitive gravity gradiometer that can detect shielded fissile material and deeply buried structures.\n- Developed spray-on nanoparticle material that emits near-infrared light when exposed to nuclear radiation and that is detectable with Commercial Off-The-Shelf camera technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "38.436"
                                            },
                                            "Text": {
                                                "val": "- Manage over 150 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio directly addresses the DoD CWMD S&T priority and supports the specific priorities on Autonomy, Data to Decisions, Electronic Protection, and Engineered Resilient Systems.\n- Support the development of the future Science, Technology, Engineering, and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conduct an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives and to foster collaboration and build relationships within the scientific community.\n- Conduct an annual external panel review of the basic research program that is open to DoD research stakeholders.  The review will assess the focus and scope of the program concerning CWMD challenges and assess the coordination of CWMD basic research across the DoD mission space and the broader basic research community to avoid duplication and ensure successful partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.436"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.436"
                                            },
                                            "Text": {
                                                "val": "- Manage over 150 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio directly addresses the DoD priority on CWMD S&T and supports specific priorities on Autonomy, Data to Decisions, Electronic Protection, and Engineered Resilient Systems.\n- Support the development of the future Science, Technology, Engineering, and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conduct an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives and to foster collaboration and build relationships within the scientific community.\n- Conduct an annual external panel review of the basic research program that is open to DoD research stakeholders.  The panel will assess the focus and scope of the program related to CWMD challenges and will assess the coordination of CWMD basic research across the DoD mission space and the broader basic research community to avoid duplication and ensure successful partnerships."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "*20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Technologies"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "*See prior year funds related to this this project in program element number 0602718BR."
                        },
                        "AcquisitionStrategy": {
                            "val": "Procurement methods include competitive selection awards through the DTRA’s Broad Agency Announcement and collaborative funding through other organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance is measured via a combination of statistics including the number of publications generated, number of students trained in sciences and engineering supporting DoD educational goals, number of participating research organizations, and percentage of awards transitioned to other programs for further development."
                        }
                    }
                }
            ]
        }
    }
}