{
    "id": "68f977f89adffe3ebe3baaffd80df4ecac965d78",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA2_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602307A"
        },
        "ProgramElementTitle": {
            "val": "Advanced Weapons Technology"
        },
        "R1LineNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "37.464"
            },
            "CurrentYear": {
                "val": "38.028"
            },
            "BudgetYearOne": {
                "val": "28.803"
            },
            "BudgetYearOneBase": {
                "val": "28.803"
            },
            "BudgetYearTwo": {
                "val": "22.774"
            },
            "BudgetYearThree": {
                "val": "21.346"
            },
            "BudgetYearFour": {
                "val": "18.378"
            },
            "BudgetYearFive": {
                "val": "24.986"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates enabling technologies for High Energy Laser (HEL) weapons.  Project 042 develops component technologies such as efficient, high energy, solid state lasers; advanced beam control components; and lethality \/ effectiveness measurements that enable better models and simulations for future HEL weapon designs.   \n\nWork in this project is related to, and fully complements, efforts in PE 0601101A (In-House Laboratory Independent Research), PE 0602120A (Sensors and Electronic Survivability) Project EM8, PE 0603004A (Weapons and Munitions Advanced Technology) Project L96 and Air Force PE 0602890F (HEL Research).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.   \n  \nWork is performed by the United States Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT) in Huntsville, AL, and the High Energy Laser Systems Test Facility at White Sands Missile Range, NM."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "38.513"
                },
                "CurrentYear": {
                    "val": "29.428"
                },
                "BudgetYearOne": {
                    "val": "28.803"
                },
                "BudgetYearOneBase": {
                    "val": "28.803"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "37.464"
                },
                "CurrentYear": {
                    "val": "38.028"
                },
                "BudgetYearOne": {
                    "val": "28.803"
                },
                "BudgetYearOneBase": {
                    "val": "28.803"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.049"
                },
                "CurrentYear": {
                    "val": "8.600"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "8.600"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.049"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "042"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.464"
                        },
                        "CurrentYear": {
                            "val": "29.428"
                        },
                        "BudgetYearOne": {
                            "val": "28.803"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.803"
                        },
                        "BudgetYearTwo": {
                            "val": "22.774"
                        },
                        "BudgetYearThree": {
                            "val": "21.346"
                        },
                        "BudgetYearFour": {
                            "val": "18.378"
                        },
                        "BudgetYearFive": {
                            "val": "24.986"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates and develops advanced technologies for High Energy Laser (HEL) weapon systems to enable more efficient laser systems with greater power output. This includes technologies to support development of alternate laser sources, precision optical pointing and tracking components, adaptive optics to overcome laser degradation due to atmospheric effects, and thermal management systems to remove excess heat.  In addition, this effort validates laser lethality performance and conducts analyses against a variety of targets and investigates the impact of low-cost laser countermeasures.  This project includes laboratory efforts for HEL applied research as well as concepts analysis for United States Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT) Technical Center competencies in directed energy, missile defense, and space technical areas. Solid State Laser (SSL) efforts continue to leverage other funds provided by the HEL Joint Technology Office (JTO), the Air Force, and the Navy to develop multiple technical approaches that reduce program risk and maintain competition. \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n \nWork is performed by USASMDC\/ARSTRAT in Huntsville, AL, and the High Energy Laser Systems Test Facility (HELSTF) at White Sands Missile Range, NM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Solid State Laser (SSL) Effects"
                                    },
                                    "Description": {
                                        "val": "This effort provides the underlying data required to support high energy laser weapon system effectiveness analyses. This activity includes the full spectrum of lethality testing from fundamental physics investigations to the engagement of flying targets in relevant scenarios. This activity is primarily executed at the Solid State Laser Testbed (SSLT) facility at White Sands Missile Range, New Mexico."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.579"
                                            },
                                            "Text": {
                                                "val": "Upgraded SSLT lethality data collection capability to collect better represented lethality data to improve lethality models and better predict integrated high energy laser demonstration performance; used lethality data to improve laser weapon system battle management capability against Rockets, Artillery, and Mortar (RAM) and Unmanned Aerial System (UAS) targets; began collecting lethality data on targets to support planning for the upcoming High Energy Laser Mobile Demonstrator (HEL MD) 50kW class demonstration, modeling, and effects simulation analysis; continued validation and analysis of atmospheric effects on the propagation of a 1.06 micron SSL."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.426"
                                            },
                                            "Text": {
                                                "val": "Conclude SSLT lethality data collection effort on representative RAM and basic UAS targets; conduct field performance validation, analyze results; develop plan and schedule, and procure targets for follow-on threats to include cruise missiles and advanced UAS threats; and analyze data and provide results from validation of 1.06 micron laser propagation models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.557"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.557"
                                            },
                                            "Text": {
                                                "val": "Will investigate and collect data on advanced aimpoints for RAM and UAS threats; develop models and methodologies for energy efficient kill mechanisms for targets such as RAM, UAS, Man-Portable Air Defense System (MANPADS), and Cruise Missiles; develop a database for advanced materials for UAS and Cruise Missile threats and validate the weapon effectiveness against current and emerging threats, material compositions and threat protection layering combinations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Beam Control Component Development"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies to enable lighter, more agile beam control systems that are robust enough to be used in Army platforms. This work is done in collaboration with the HEL JTO and other Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.916"
                                            },
                                            "Text": {
                                                "val": "Began joint advanced beam control effort with other services and the HEL JTO to develop beam control component technology that is capable of meeting desired performance requirements; continued development of an All Weather Tracker with the goal to be able to track RAM and UAS targets in adverse weather to augment the tracking and aim point maintenance of a High Energy Laser Weapon System; completed analysis and subscale experiments using segmented mirrors to demonstrate improved ability to correct wavefront errors in a high energy laser."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.283"
                                            },
                                            "Text": {
                                                "val": "Validate performance of an advanced, tactical, light-weight beam director during representative tactical laser engagements; validate advanced tracking concepts and atmospheric beam compensation at the SSLT in representative tactical laser engagements; continue development of All-Weather Tracker technologies, to include algorithms and component hardware; complete analysis and subscale experiments using segmented mirrors to validate improved ability to correct wavefront errors in a HEL; develop breadboard All-Weather Tracker that integrates algorithms and the sensor sub-system that will be compatible with the HEL MD; develop data fusion algorithms and high frame rate image processing hardware and software; and develop adverse weather testing methods and equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.781"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.781"
                                            },
                                            "Text": {
                                                "val": "Will conduct research on advanced methods of mitigating the effects of fog, rain, and dust on acquisition and tracking functions of an Army HEL system; further mature key sensor and track algorithm components of the enhanced tracking sensor for a high energy laser system; investigate integration of advanced sensors and components to improve acquisition and tracking at extended ranges; begin development of an advanced beam control system for demonstration on an Army platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Efficiency Laser Development"
                                    },
                                    "Description": {
                                        "val": "This effort develops component technologies that increase SSL efficiencies, which will lead to reductions in size and weight for multiple subsystems that greatly improve the ability to integrate SSL systems into Army weapon platforms. This work is done in collaboration with the HEL JTO and other Services. Selected laser design will be fabricated and integrated onto an Army platform to demonstrate a high energy laser system functionality and is fully coordinated with PE 0603004A, Project L96."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.341"
                                            },
                                            "Text": {
                                                "val": "Completed critical design review on efficient high power rugged laser for future integration into HEL MD; purchased long lead items, including the multi-dielectric grating, 112 channel fiber array holder, polarization-maintaining high power fibers, fiber coupled pump diodes, fiber isolators and pump combiner, and narrow line-width seed sources; completed design and spectral beam combiner component risk reduction experiments to support scaling up to 100kW; began initial subcomponent integration; conducted improved laser thermal management risk reduction experiments and verified performance of two-phase cooling approach to improve magazine depth; completed fabrication of one double-density Fiber Laser Module (FLM) and two additional fiber laser modules to support the manufacture readiness review; completed maintenance concept plan for the high power rugged laser line replaceable units."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.102"
                                            },
                                            "Text": {
                                                "val": "Complete laser subcomponent fabrication and integration; complete fabrication of 28 double density high power fiber laser modules (>2kW each); demonstrate maintenance concept plan in the laboratory with the laser line replaceable units; complete the laboratory performance validation of the rugged, high efficiency laser to at least the ~50kW power level; begin preparation of laser for integration, develop detailed integration plan for laser subsystem integration into an Army platform, and complete all the interface specifications; validate performance of a laser system integrated refrigerant cooling subsystem; and complete assessment of efficient laser power scaling to >100kW."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.015"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.015"
                                            },
                                            "Text": {
                                                "val": "Will complete populating a laser with mature fiber laser modules, bringing the system to the 50 kW-class performance level; conduct laser system performance verification and transition laser to PE 0603004A, Project L96 for further development and integration. Upon transition of the laser, assist (as the original equipment manufacturer) with the integration of the laser into the Army platform; improve the power density of the laser subsystem to allow scaling up to and potentially beyond 100 kW power output; investigate and develop fiber laser component technology to reduce system component size and weight for alternative platform applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HEL Research and Development and Concepts Analysis Laboratories"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing in-house expertise through SSL assessments and starting in Fiscal Year (FY) 2015, other USASMDC\/ARSTRAT technical core competencies, including air and missile defense, responsive space, and small satellites."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.628"
                                            },
                                            "Text": {
                                                "val": "Completed Adaptive Optics (AO) performance demonstrations of advanced AO algorithms for transition to the HEL MD AO system; purchased pump diodes and scaled electric\/Radio Frequency discharge sources and began diode pump gas laser scaling experiments; developed models of space environment effects on small spacecraft; performed orbital assessments of nanosatellite spacecraft and constellation concepts; and investigated concepts in support of space, missile, rocket, and mortar defense."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.617"
                                            },
                                            "Text": {
                                                "val": "Complete preliminary design and conduct experiments to verify Xenon laser design is scalable for potential next generation electric laser compactness, efficiency, and thermal management properties; begin algorithm development and establish an experimental testbed for non-beacon-based AO that could eliminate the need for the beacon illuminator as part of a HEL system, which would further reduce the size and weight of the system; characterize AO performance limits during horizontal beam propagation in a relevant environment; investigate radar enhancements to HEL MD fire control loop; refine models of space environmental effects on small satellites; and investigate small satellite propulsion and control designs for acquisition and tracking."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.450"
                                            },
                                            "Text": {
                                                "val": "Will conduct research into the development of a high efficiency, low Size, Weight and Power (SWaP) direct diode HEL as a next generation beyond the diode-pumped rare gas laser; investigate methods for AO systems to compensate for broader environmental effects, such as turbulence and low elevation battlespace."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NA5"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Weapons Components (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.000"
                        },
                        "CurrentYear": {
                            "val": "8.600"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for Advanced Weapons Components applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Directed energy\/thermal management program increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Directed energy\/thermal management program increase"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.600"
                                        },
                                        "Text": {
                                            "val": "Directed energy\/thermal management program increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}