{
    "id": "6da7d86330acb39a8497c5bca64f30b5454b013f",
    "meta": {
        "filename": "dod-2017_RDTE_2017_SOCOM_U_RDTE_MasterJustificationBook_United_States_Special_Operations_Command_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_United_States_Special_Operations_Command_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "1160483BB"
        },
        "ProgramElementTitle": {
            "val": "Maritime Systems"
        },
        "R1LineNumber": {
            "val": "251"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "228.283"
            },
            "PriorYear": {
                "val": "58.656"
            },
            "CurrentYear": {
                "val": "59.597"
            },
            "BudgetYearOne": {
                "val": "54.577"
            },
            "BudgetYearOneBase": {
                "val": "54.577"
            },
            "BudgetYearTwo": {
                "val": "29.451"
            },
            "BudgetYearThree": {
                "val": "11.193"
            },
            "BudgetYearFour": {
                "val": "12.857"
            },
            "BudgetYearFive": {
                "val": "13.101"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides for engineering and manufacturing development of Special Operations Forces (SOF) Surface and Undersea Mobility platforms.  This program element also provides for pre-acquisition activities to quickly respond to new requirements for SOF surface and undersea mobility, looking at multiple alternatives to include cross-platform technical solutions, service-common solutions, Commercial-Off-The-Shelf technologies, and new development efforts.  \n\nThe Underwater Systems project provides for engineering and manufacturing development of combat submersibles, SOF operator diving systems, underwater support systems, and underwater equipment.  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component and prototype development) to respond to emergent requirements.  These submersibles, equipment, and diving systems are used by SOF in the conduct of infiltration\/extraction, personnel\/material recovery, hydrographic\/inland reconnaissance, beach obstacle clearance, underwater ship attack, and other missions.  The capabilities of the submersible systems, diving systems, and unique equipment provides small, highly trained forces the ability to successfully engage the enemy and conduct clandestine operations associated with SOF maritime missions.  \n\nThe Surface Craft project provides for engineering and manufacturing development of medium and heavy surface combatant craft, combatant craft mission equipment, and pre-planned product improvement and technology insertion engineering changes to meet the unique requirements of SOF.  This project element also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to quickly respond to new requirements for maritime craft and subsystems.  The craft capabilities and unique equipment provide small, highly trained forces the ability to successfully engage the enemy and conduct operations associated with SOF maritime missions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "56.746"
                },
                "CurrentYear": {
                    "val": "63.597"
                },
                "BudgetYearOne": {
                    "val": "52.590"
                },
                "BudgetYearOneBase": {
                    "val": "52.590"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "58.656"
                },
                "CurrentYear": {
                    "val": "59.597"
                },
                "BudgetYearOne": {
                    "val": "54.577"
                },
                "BudgetYearOneBase": {
                    "val": "54.577"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.910"
                },
                "CurrentYear": {
                    "val": "-4.000"
                },
                "BudgetYearOne": {
                    "val": "1.987"
                },
                "BudgetYearOneBase": {
                    "val": "1.987"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-4.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.750"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.840"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.987"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.987"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:   \n\nFY 2015:  Net increase of $ 1.910 million is for a reprogramming of $3.680 million to support engineering and testing for the Shallow Water Combat Submersible, $0.070 million to support the contract award for the Next Generation Combatant Craft Forward Looking Infrared Radar, and a decrease of $ 1.840 million is due to a transfer of funds to Small Business Innovative Research\/Small Business Technology Transfer programs. \n\nFY 2016:  This program element was reduced due to a Congressional Directed Reduction of ($4.000) million to the Dry Combat Submersible program. \n\nFY 2017:  Net Increase of $1.987 million due to revised program strategy for the Combatant Craft Medium of $0.407 million increase, Combatant Craft Assault (previously High Speed Assault Craft) of $0.500 million increase, SOF Combat Diving of $1.490 million increase, and a decrease of ($0.410) million due to a Departmental economic assumption decrease. \n\nSchedule:  Due to delay in development and builder's trial of the DCS prototypes, further development and testing efforts were subsequently delayed into FY 2016 and FY 2017.\n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S0417"
                    },
                    "ProjectTitle": {
                        "val": "Underwater Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "221.211"
                        },
                        "PriorYear": {
                            "val": "48.086"
                        },
                        "CurrentYear": {
                            "val": "52.328"
                        },
                        "BudgetYearOne": {
                            "val": "50.150"
                        },
                        "BudgetYearOneBase": {
                            "val": "50.150"
                        },
                        "BudgetYearTwo": {
                            "val": "25.295"
                        },
                        "BudgetYearThree": {
                            "val": "6.527"
                        },
                        "BudgetYearFour": {
                            "val": "6.063"
                        },
                        "BudgetYearFive": {
                            "val": "6.185"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for engineering and manufacturing development of combat underwater submersibles, Special Operations Forces (SOF) operator diving systems, underwater support systems, and underwater equipment.  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to respond to emergent requirements.  These submersibles, equipment, and diving systems are used by SOF in the conduct of infiltration\/extraction, personnel\/material recovery, hydrographic\/inland reconnaissance, beach obstacle clearance, underwater ship attack, and other missions.  The capabilities of the submersible systems, diving systems, and unique equipment provides small, highly trained forces the ability to successfully engage the enemy and conduct clandestine operations associated with SOF maritime missions.  Sub-projects include:\n\n•   Shallow Water Combat Submersible (SWCS):  This sub-project provides for the engineering, manufacturing, testing, and development of one Engineering Developmental Model (EDM) to replace the SEAL Delivery Vehicle (SDV) system.  The EDM is being developed due to obsolescence of the SDV system.  This project will utilize mature technologies, which include electric propulsion along with upgraded navigation, communication, and sensor suites.  It also provides for integration efforts with the current Dry Deck Shelter (DDS), development of engineering changes for SWCS production craft configuration, and integration of other diving technologies to meet SOF requirements.  \n\n• Dry Combat Submersible (DCS): This sub-project provides for the advanced engineering, manufacturing, testing, and development efforts for a surface-launched, dry, diver lock-in\/lock-out vessel capable of inserting and extracting SOF and\/or payloads into denied areas.  USSOCOM will award an Engineering and Manufacturing Development contract in FY 2016 to produce one production representative vessel, with options to produce two additional vessels following testing.  Current efforts leverage commercial practices to develop dry submersible prototypes to assess submersible capabilities and reduce risk in the DCS program.  USSOCOM developed and is currently testing two submersible prototypes.  USSOCOM has also conducted risk reduction efforts on a third leased vehicle to include validation of test processes, commercial classification processes, and development of the SOCOM safety certification process which permits SEALs to operate the vehicles.  In addition, the prototypes are being and will continue to be used to evaluate capability enhancing technologies in a relevant environment.  Technologies include, but are not limited to, safe Li-Ion batteries, silver zinc batteries, improved sonar systems, an advanced battery management system, and a three-dimensional Electro Optical Infrared (EO\/IR) sensor.\n\n•   DDS Modernization:  This sub-project provides for the pre-planned product improvements, testing, and integration of specialized underwater systems to meet the unique requirements of SOF, and compatibility with the submarine fleet.  The current DDS is a certified diving system which attaches to modified host submarines that provides for insertion of SOF forces and platforms.  Funding supports product improvements to the current DDS, as well as associated diver equipment for in-service submarine support systems, unmanned underwater vehicles, and follow on development efforts for future SOF payloads.\n\n•   SOF Combat Diving:  This sub-project provides for the engineering, manufacturing, testing, development, and transition of SOF peculiar diving equipment providing the SOF combat diver the ability to engage the enemy and conduct operations.  SOF Combat Diving will provide capabilities to USSOCOM components and will support the SDV, SWCS, and DCS in conduct of infiltration\/extraction, material recovery, underwater ship attack, beach clearance, and other missions.  Technologies include, but are not limited to, commercial and developmental life support, maneuverability, employment of weapons, diver navigational accuracy and situational awareness, thermal protection, and underwater communications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SWCS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.981"
                                            },
                                            "Text": {
                                                "val": "Completed EDM manufacturing and development and started developmental testing.  Executed dry, pool, and open water testing.  Obtained Milestone C approval."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.596"
                                            },
                                            "Text": {
                                                "val": "Continue EDM development testing, certification and government  acceptance. Incorporate any necessary engineering design changes and modifications to meet key performance parameters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.950"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.950"
                                            },
                                            "Text": {
                                                "val": "Completes EDM, including final logistics packages, develops and incorporates any engineering changes into SWCS production craft configuration as needed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DCS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.105"
                                            },
                                            "Text": {
                                                "val": "Completed manufacturing, obtained commercial classification, and began testing of the two submersible prototypes.  Achieved SOF Embarkation approval for leased vessel, validating process and enabling initial SOF pilot training and multiple lock-in\/lock-out evolutions.  Validated test plans and procedures for use with DCS. Completed testing of government-furnished EO\/IR sensor, silver zinc battery, battery management system, and began initial testing of lithium ion battery.  Battery development efforts have resulted in more than doubling the range of the leased vessel.  Obtained Milestone B approval, conducted Industry Day, and released Request for Proposals for DCS program of record."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.232"
                                            },
                                            "Text": {
                                                "val": "Continue testing of lithium ion battery and begin characterization testing of the prototypes.  Award an engineering and manufacturing development (EMD) contract for a production representative system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.700"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for DCS production representative system.  Completes testing of the prototypes and initiates refit of one prototype submersible to be used as a training vessel."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DDS Modernization"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Begin development of the modernization necessary to extend useful life, transition from SSGN to Virginia Class host platform, and increase capacity to carry larger payloads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.500"
                                            },
                                            "Text": {
                                                "val": "Continues development of the modernization necessary to extend useful life of the DDS, transitions from SSGN to Virginia Class host platform, and increases capacity to carry larger payloads."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOF Combat Diving"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Begin development of SOF peculiar diving technologies for transition to the SOF combat diver for thermal protection to include free diver heating\/cooling system, compact multi-diver heating system, and propulsion power interface."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Continues thermal protection and man and unmanned testing.  Begins development for situational awareness and underwater breathing apparatuses."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC\/0210US"
                                    },
                                    "Title": {
                                        "val": "Underwater Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "25.408"
                                        },
                                        "CurrentYear": {
                                            "val": "29.021"
                                        },
                                        "BudgetYearOne": {
                                            "val": "37.098"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "37.098"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "91.032"
                                        },
                                        "BudgetYearThree": {
                                            "val": "54.299"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.820"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.977"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "•   SWCS used full and open competition, with a down select to a single contractor.  The full spectrum of contracting activities is being utilized for any integration and subsystem requirements, using existing contracts where appropriate, government agencies and new contracts as necessary.\n\n•   DCS performed risk reduction efforts on a leased vessel (S301i) to define future DCS program plans and procedures as well as used Broad Area Announcements for Research and Development contracts to design, build, and test prototypes (Button 5.60 and S351) to refine and validate key performance parameters and attributes for the future DCS, leveraging commercial technologies, practices, and safety classification standards.  USSOCOM will solicit and award a competitive engineering and manufacturing development contract for a production representative system in FY16 and award two options for procurement vessels in FY18 and FY19.\n\n•   DDS Modernization will use existing DDS contracts to develop modernization efforts and execute configuration changes required to achieve performance requirements specified by the government.\n\n•   SOF Combat Diving:  The full spectrum of contracting activities is planned to be utilized, using existing contracts where appropriate, government agencies, and new contracts competitively selected as necessary."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Shallow Water Combat Submersible (SWCS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Teledyne Brown Engineering"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "59.276"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "18.024"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "84.300"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SWCS Engineering Changes"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.950"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.950"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Combat Submersibles (DCS) (Button 5.60 prototype)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamic-Electric Boat"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Groton, CT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "25.403"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.635"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.877"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "28.915"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DCS (S351 prototype)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Submergence Group"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chester, CT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "23.075"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.638"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.953"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "33.666"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DCS Technologies (Government Furnished Equipment)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "19.552"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.907"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.003"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.377"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.377"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DCS (Engineering & Manufacturing Development)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MacDill AFB"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tampa, FL"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "22.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "25.723"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "25.723"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "48.023"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DCS Engineering Changes"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Deck Shelter (DDS)  Modernization"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oceaneering International Inc. Marine Services Division"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chesapeake, VA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.650"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.197"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.197"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SOF-Peculiar Diving Technologies"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "59.896"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "59.896"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.094"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.094"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SWCS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Puget Sound Naval Shipyard"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Seattle, Washington"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.240"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.368"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.596"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.204"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DCS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVSEA \/ CRANE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Panama City, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.700"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.307"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.299"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.306"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SOF Combat Diving"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.320"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.320"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SWCS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "John Hopkins University"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Columbia, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.589"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.589"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DCS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SRA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tampa, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.698"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.618"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DDS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVSEA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.757"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.303"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.303"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.700"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.110"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "John Hopkins University"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Columbia, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.200"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.200"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "SWCS.tif"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "DCS.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "DDS.tif"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "Diving.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Shallow Water Combat Submersible"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering & Manufacturing Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone C"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering Changes"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Combat Submersibles"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Analysis, Component and Prototype Development, and Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Training Vessel"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone B"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Acquisition Planning, Request for Proposals, and Source Selection"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering and Manufacturing Development Phase"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering Changes"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone C"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental and Operational Test and Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Deck Shelter Modernization"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Preliminary Design Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Critical Design Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOF Combat Diving"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Free Diver Heating \/ Cooling System Development \/ Manufacturing \/ Test \/ Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Compact Multi-Diver Heating System Development \/ Manufacturing \/ Test \/ Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Propulsion Power Interface Development \/ Manufacturing \/ Test \/ Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Communications and Navigational Accuracy Development \/ Manufacturing \/ Test \/ Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Diver Survivability Development \/ Manufacturing \/ Test \/ Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Maneuverability Development \/ Manufacturing \/ Test \/ Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S1684"
                    },
                    "ProjectTitle": {
                        "val": "Surface Craft"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.072"
                        },
                        "PriorYear": {
                            "val": "10.570"
                        },
                        "CurrentYear": {
                            "val": "7.269"
                        },
                        "BudgetYearOne": {
                            "val": "4.427"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.427"
                        },
                        "BudgetYearTwo": {
                            "val": "4.156"
                        },
                        "BudgetYearThree": {
                            "val": "4.666"
                        },
                        "BudgetYearFour": {
                            "val": "6.794"
                        },
                        "BudgetYearFive": {
                            "val": "6.916"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for engineering and manufacturing development of medium and heavy surface combatant craft, combatant craft mission equipment, and pre-planned product improvement and technology insertion engineering changes to meet the unique requirements of Special Operations Forces (SOF).  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to quickly respond to new requirements for maritime craft and subsystems.  The craft capabilities and unique equipment provide small, highly trained forces the ability to successfully engage the enemy and conduct operations associated with SOF maritime missions.  Sub-projects include:\n\n•   Combatant Craft Medium Mk 1 (CCM):  This sub-project is a semi-enclosed, low-observable, multi-mission combatant craft for platoon-size maritime mobility in maritime denied environments.  It is multi-mission capable, including Maritime Interdiction, Insert \/ Extract, and Visit, Board, Search, and Seizure (VBSS) Operations.  CCM is Naval Special Warfare’s (NSW) craft-of-choice for long-range, high-payload SOF mobility operations in denied environments up to high threat.  CCM has NSW’s best Iron Triangle: 40 knot (kt) speed; 4 crew + 19 passengers (pax) \/ 10,000 pound (lb) payload; and 600 nautical miles (nm) range.  CCM Mk 1 payload capacity enables inclusion of shock mitigating seats, which is critical for ride quality, operator tactical readiness, and operator health.  At 60 feet long CCM is C-17 \/ C5 transportable and can launch\/recover by well deck or shore based trailer.  \n\n•   Combatant Craft Heavy (CCH):  This sub-project represents a family of solutions that provides platoon-size maritime surface mobility.  The current CCH is the Sea, Air, Land Insertion, Observation, and Neutralization (SEALION) craft.  SEALION is a fully-enclosed, climate-controlled, low-observable, semi-submersible craft that operates in denied environments up to high-threat. SEALION is NSW’s most versatile and survivable combatant craft and the craft-of-choice for sensitive maritime intelligence, surveillance, and reconnaissance missions and those missions requiring a prolonged presence in denied environments.  Its clandestine mobility capability is only exceeded by an undersea craft.  Iron Triangle: 40 kt speed; 7 crew + 12 pax \/ 3,300 lb payload; and 400 nm range.  SEALION payload capacity enables inclusion of shock mitigating seats, which is critical for ride quality, operator tactical readiness, and operator health.  At 77+ feet long, SEALION is C-17\/C-5 transportable and can launch\/recover by well deck or shore based mobile travel lift or crane.  \n\n•   Next Generation Combatant Craft Forward Looking Infrared Radar (NG CCFLIR):  This sub-project consists of a legacy CCFLIR and the NG CCFLIR.  The CCFLIR capability provides SOF with a multi-sensor, electro-optic system that enhances SOF effectiveness by improving their ability to detect, recognize, identify, range, track, and highlight objects of interest in a maritime environment.  The legacy CCFLIR is under sustainment, it is currently used on all Naval Special Warfare Combatant Craft.  The NG CCFLIR will use technological advancements to gain significant improvements in capability such as operational range, image fusion, net-centric data sharing, information assurance, and seamless craft and combat systems integration.\n\n•   Combatant Craft Mission Equipment (CCME) (previously Next Generation Surface Systems):  This sub-project provides a rapid response capability to support SOF Combatant Craft Systems and subsystems.  The CCME will explore and provide solutions to support emerging requirements in support of SOF missions.  It provides technology refresh efforts to correct system deficiencies, improve asset life, and enhance mission capability through the means of feasibility studies, analyses of alternatives, pre-developmental risk reduction, and engineering analyses.  Demonstrations and modifications may be made to support emerging capability enhancements such as but not limited to conformal antennas, identification Friend-or-Foe capabilities, enhanced communications, weapon integration, software efresh, and navigation subsystems in support of future missions.  Solutions may be Commercial-Off-The-Shelf (COTS) solutions, leveraged from other agency solutions, or new solutions. \n\n•   Combatant Craft Assault (CCA) (previously High Speed Assault Craft):  This sub-project is a National-to-Theater transition.  The CCA is the theater version of the High Speed Assault Craft.  The CCA is a low-observable combatant craft for squad-size maritime mobility operations in maritime denied environments.  CCA is NSW’s best craft for VBSS in maritime denied environments up to and including medium threat.  It is the craft-of-choice for maritime interdiction and boarding operations because of the open deck space, maneuverability, and interoperability with an Afloat Forward Staging Base.  Iron Triangle: 40 kt speed; 3 crew + 12 pax \/ 5,000 lb payload; and 300 nm range.  At 41 feet long, CCA is air transportable by C-130 \/ C-17 \/ C-5 and can launch\/recover by crane, davit, well deck, or shore based trailer."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CCM"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.572"
                                            },
                                            "Text": {
                                                "val": "Completed Operational Testing and continued development and integration of sub-systems including weapons and situational awareness systems.  Refurbished test article to production craft configuration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.308"
                                            },
                                            "Text": {
                                                "val": "Continue development and integration of advanced technologies including situational awareness, survivability, weapons, navigation, and communication."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.659"
                                            },
                                            "Text": {
                                                "val": "Develops conceptual, preliminary, and detail design drawings necessary to integrate and conduct initial testing of a remote weapon system on the CCM test article.  Begins integration of NG CCFLIR and applicable CCME technology onto CCM crafts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CCH"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.872"
                                            },
                                            "Text": {
                                                "val": "Completed SEALION III design study and began tactical computer system upgrades.  Installed dynamic positioning system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.245"
                                            },
                                            "Text": {
                                                "val": "Continue development and integration of advanced technologies including situational awareness, survivability, weapons, navigation, and communication.  Initiate studies and analysis for upgraded CCH craft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.887"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.887"
                                            },
                                            "Text": {
                                                "val": "Completes tactical computer system upgrades.  Continues pre-planned product improvement and technology insertion.  Begins integration of NG CCFLIR and applicable CCME technology onto CCH crafts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NG CCFLIR"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.247"
                                            },
                                            "Text": {
                                                "val": "Completed source selection for prototype units for development testing.  Began development and testing of NG CCFLIR."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Complete testing and integration with combatant craft systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CCME"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.879"
                                            },
                                            "Text": {
                                                "val": "Tested and analyzed combatant crafts survivability characteristics.  Performed analysis of alternatives tests for obsolete intercom system.  Performed baseline test and assessment for a remote weapon system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.216"
                                            },
                                            "Text": {
                                                "val": "Identify and evaluate candidate solutions for capability enhancements and insertion across Combatant Craft Systems.  Technology development include, but not limited to, conformal antennas, communications, weapons integration, survivability, shock and vibration systems, and situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.381"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.381"
                                            },
                                            "Text": {
                                                "val": "Evaluates candidate solutions for technology development to include, but not limited to, MK50 SOF improvements (i.e., accuracy and increased rounds), Vehicular Intercommunications-3 intercom control integration tests, active ride control integration tests, craft survivability painting studies and verification, and situational awareness studies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CCA"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Begins integration of NG CCFLIR and applicable CCME technology onto CCA crafts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC\/0204SCCS"
                                    },
                                    "Title": {
                                        "val": "Combatant Craft Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "50.337"
                                        },
                                        "CurrentYear": {
                                            "val": "63.362"
                                        },
                                        "BudgetYearOne": {
                                            "val": "55.820"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "55.820"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "27.110"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.149"
                                        },
                                        "BudgetYearFour": {
                                            "val": "38.342"
                                        },
                                        "BudgetYearFive": {
                                            "val": "38.081"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "•  CCM acquisition strategy was a competition using a two-phase source selection process.  Phase I involved a Small Business Set-Aside competition for two vendors to design, build and deliver test articles.  Phase II selected a single vendor to provide a fully integrated baseline craft system for test and evaluation with options for production, engineering support and contractor logistic support.  \n\n•  CCH:  SEALION I & II were transitioned from United States Navy advanced technology demonstrator craft to USSOCOM.  Sustainment for SEALION I & II is conducted via Special Operations Forces Support Activity (SOFSA).  Based on market research completed in December 2015; currently pursuing a Sole Source award for SEALION III in order to take advantage of previous Government investments in manufacturing infrastructure for SEALION I & II.\n\n•  NG CCFLIR:  Current fleet of legacy CCFLIR was procured via full and open competition.  Procurement for legacy CCFLIR is complete.  Legacy CCFLIR will continue to be utilized on the Rigid-hull Inflatable Boat (RIB) and Special Operations Craft Riverine (SOCR).  The Combatant Craft Medium (CCM), Combatant Craft Heavy (CCH), and High Speed Assault Craft (HSAC) will transition from legacy CCFLIR to NG CCFLIR. NG CCFLIR completed a full and open competition in Sep 15.  An Engineering Manufacturing Development contract was awarded to FLIR Systems Incorporated, which included production and sustainment options.\n\n•  CCME acquisition strategy plans include the full spectrum of contracting activities, using existing contracts where appropriate, and other Government agencies to leverage, marinize, commonize, and advance Technology Readiness Level 6 leap ahead technology from Services and USSOCOM SOF AT&L S&T.  Procurement of items will be from the Combatant Craft Systems procurement program element.   \n\n•  CCA originated as National-to-Theater transition.  The CCA is the theater version of the High Speed Assault Craft and will use various contracting and better buying power practices to develop, test, and integrate capability enhancements required to increase the craft’s current performance envelope."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Combatant Craft Medium (CCM)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Vigor Works"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Clackamas, OR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.374"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.426"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.308"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.659"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.659"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Combatant Craft Heavy (CCH)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.225"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.872"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.245"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.887"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.887"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Next Generation Combatant Craft Forward Looking Infrared (NG CCFLIR)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "FLIR Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Billerica, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.691"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.247"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.538"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Combatant Craft Mission Equipment (CCME)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.311"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.642"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.891"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.156"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.156"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CCA"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.280"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.280"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CCM"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.281"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.081"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "NG CCFLIR"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Crane, IN"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.900"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.900"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CCME"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.237"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.325"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.225"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.225"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.787"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CCA"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.220"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.220"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CCM"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, VA; Crane, IN"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.937"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.937"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CCM"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SRA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tampa, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.625"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.409"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.034"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Years"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Crane, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.565"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.565"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "CCM.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "CCH.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "NG CCFLIR.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "CCME.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "CCA.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Combatant Craft Medium"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Test Article Refurbishment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Acceptance and Operational Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Weapons, Survivability, C4ISR Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Heavy"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Preplanned Product Improvement (Weapons \/ C4I \/ Survivability)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Design Study - SEALION III"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Tech Data Package - SEALION III"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Combatant Craft Forward Looking Infrared Radar"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Prototype Contract"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Prototype Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone C Decision"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Mission Equipment"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "360 Development, Test, Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Shock\/Vibration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Situational Awareness"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SATCOM on the Move Test, Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Weapons Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Survivability"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Threat Analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Obsolescence Analysis, Test, Analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Assault"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Preplanned Product Improvement (Survivability, Weapons, C4ISR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}