{
    "id": "6e24cc5ce26c4ed45c3150d2c393b8537ebb481e",
    "meta": {
        "filename": "dod-2017_RDTE_2017_TJS_U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605126J"
        },
        "ProgramElementTitle": {
            "val": "Joint Integrated Air & Missile Defense Organization (JIAMDO)"
        },
        "R1LineNumber": {
            "val": "142"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "307.305"
            },
            "PriorYear": {
                "val": "36.230"
            },
            "CurrentYear": {
                "val": "33.983"
            },
            "BudgetYearOne": {
                "val": "32.759"
            },
            "BudgetYearOneBase": {
                "val": "32.759"
            },
            "BudgetYearTwo": {
                "val": "32.581"
            },
            "BudgetYearThree": {
                "val": "34.971"
            },
            "BudgetYearFour": {
                "val": "34.971"
            },
            "BudgetYearFive": {
                "val": "35.570"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (JS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community’s proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD’s resource allocation structures.  JIAMDO also leads AMD mission and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations, demonstrations of joint air and missile defense architectures, and provides advocacy for innovative, technically mature and affordable solutions.  \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the development of the Air and Missile Defense Prioritized List and the Global Integrated Air and Missile Defense Assessment and analysis of the Ballistic Missile Defense System.  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and U.S. Northern Command for homeland air and cruise missile surveillance issues and technical oversight of homeland capability solutions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.176"
                },
                "CurrentYear": {
                    "val": "35.471"
                },
                "BudgetYearOne": {
                    "val": "27.967"
                },
                "BudgetYearOneBase": {
                    "val": "27.967"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "36.230"
                },
                "CurrentYear": {
                    "val": "33.983"
                },
                "BudgetYearOne": {
                    "val": "32.759"
                },
                "BudgetYearOneBase": {
                    "val": "32.759"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.946"
                },
                "CurrentYear": {
                    "val": "-1.488"
                },
                "BudgetYearOne": {
                    "val": "4.792"
                },
                "BudgetYearOneBase": {
                    "val": "4.792"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.026"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-1.462"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Additional support to the Nimble Fire effort."
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.792"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.792"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY2015 Carryover"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.946"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "JIAMDO-Core:  The Joint Staff reduced reliance upon contracted advisory and assistance service efforts and increased leverage upon organic (military and federal civilian) labor.\n\nJIAMDO-Homeland:  Programs will be near development completion and conducting Military Utility Assessment, which requires live assets and integration development.  \n\nJIAMDO-Nimble Fire:  Increased effort in FY2017."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Core"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "100.988"
                        },
                        "PriorYear": {
                            "val": "18.913"
                        },
                        "CurrentYear": {
                            "val": "14.183"
                        },
                        "BudgetYearOne": {
                            "val": "9.029"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.029"
                        },
                        "BudgetYearTwo": {
                            "val": "9.343"
                        },
                        "BudgetYearThree": {
                            "val": "10.271"
                        },
                        "BudgetYearFour": {
                            "val": "10.271"
                        },
                        "BudgetYearFive": {
                            "val": "10.476"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (TJS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the development of the Air and Cruise Missile Defense Prioritized Capability List, the Global Integrated Air and Missile Defense Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and U.S. Northern Command for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Core"
                                    },
                                    "Description": {
                                        "val": "Provides overall staff support for JIAMDO operations in the area of ballistic missile defense, air and cruise missile defense, and homeland defense.  This includes performing analyses, demonstrations, and programmatic assessments of technology, operations, requirements, and weapons systems.  In coordination with Services and CCMDs, JIAMDO Core also leads the definition, assessment, development, and approval of Joint AMD Operational Concepts, Operational Architectures, and capability requirements to guide the Department's joint\/interagency\/combined fully integrated and net-centric capable air defense (including defense against cruise missiles, unmanned aerial vehicles, and ballistic missiles).  JIAMDO Core also:\n• Develops and integrates joint exercises, simulations, war-games, force resource allocations, and interoperability initiatives\n• Manages relevant Congressional interaction and CCMD interface through a cadre of liaisons collocated with major headquarters\n• Directly supports and sponsors homeland air surveillance related demonstration and analysis activities\n• Runs the AMD Working Group focusing CCMD, Joint Staff, and Service collaboration efforts in the generation of joint concepts and development of the integrated AMD architecture and roadmap\n• Develops U.S. positions for, and serves as the U.S. representative to the NATO Air and Missile Defense Committee\n\nJIAMDO Core also enables strategic planning development, infrastructure, security, travel, administrative, and other support activities.  Funding pays for: Contractor Systems Engineering and Technical Assistance (SETA) support for Air & Cruise Missile Defense (ACMD), Ballistic Missile Defense (BMD), Homeland Air Security (HAS) strategic planning, senior level briefings, and JIAMDO white papers, leased office space including all upkeep services, all travel costs for government, and contractor support personnel, including support for Combatant Commander liaison personnel travel, multiple levels of security including lease support for a Joint Worldwide Intelligence Communications System (JWICS) communications line, and Special Compartmented Information (SCI) terminals (due to the classified nature and the diverse content of work in the JIAMDO portfolio), 24-hour physical security force and alarm monitoring, and maintenance, daily on-site security personnel to meet DOD, National Industrial Security Program Operating Manual (NISPOM), and other security regulations, for all administrative and support functions, all associated Information Technology (IT) support, copier purchase and maintenance, as well as basic office supplies and furniture, telephones, telephone lines, classified telephones, and classified\/unclassified data connections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.913"
                                            },
                                            "Text": {
                                                "val": "Performed Air and Cruise Missile Defense, and Ballistic Missile Defense directed studies in support of the Chairman (such as the fourth of a series of quantitative performance analysis, the Joint Capability Mix Study IV); provided analytical support into the premier ballistic missile defense wargame, NIMBLE TITAN; addressed critical air and missile defense related issues to NATO; and related program support activities including:  contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply.  Planned additional reductions in contract advisory and assistance services are projected.  Planning will begin on the solicitation of CORE SETA contract."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.183"
                                            },
                                            "Text": {
                                                "val": "Perform Airand Cruise Missile Defense, and Ballistic Missile Defense directed studies in support of the Chairman and related program support activities including:  contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply.  Planned additional reductions in contract advisory and assistance services are projected. Planned award of a new SETA contract is anticipated in 2016."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.029"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.029"
                                            },
                                            "Text": {
                                                "val": "Continue performing Ballistic Missile Defense directed studies with changes in program support activities as a result of reorganization and office move to the Pentagon.  Ancillary support functions such as administrative, security, communications, Information Technology and finance will be provided by the JS.  The JS reduced reliance upon contracted assistance service efforts and increased leverage upon organic (military and federal civilian) personnel.  Systems Engineering and Technical Assistance contract will still be in place."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Support two major Nimble Fire exercises during FY 2016.\n\n(2) Conduct two Air and Missile Defense Working Groups per month.\n\n(3) Support U.S. Representative to NATO Air Defense Council (NADC) to include 2 overseas NADC meetings per year.\n\n(4) Develop and maintain electronic library of current Joint and Service AMD Publications.\n\n(5) Develop and maintain operational architecture compliance with DoD Architectural Framework (DODAF) standards.\n\n(6) Ensure 100% of all government employee travel is in accordance with the Joint Federal Travel Regulation\/Joint Travel Regulation.\n\n(7) Maintain all unclassified\/classified LANs on a daily basis in accordance with TJS Office of the Chief Information Officer guidance\/policy.\n\n(8) Ensure all computers, NIPRNET\/SIPRNET, are refreshed according to J6 policy\/guidance."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P002"
                    },
                    "ProjectTitle": {
                        "val": "Homeland"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "67.544"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (JS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community’s proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD’s resource allocation structures.  JIAMDO also leads AMD mission and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations, demonstrations of joint air and missile defense architectures, and provides advocacy for innovative, technically mature and affordable solutions.  \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the development of the Air and Missile Defense Prioritized List and the Global Integrated Air and Missile Defense Assessment and analysis of the Ballistic Missile Defense System.  JIAMDO supports the USSTRATCOM ballistic missile early mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and U.S. Northern Command for homeland air and cruise missile surveillance issues and technical oversight of homeland capability solutions.      \n\nThe Homeland program transitioned to a USAF-led Program of Record across the Future Year Defense Program in the beginning of FY 2016.  JIAMDO will retain operational and requirements oversight."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "Black Dart"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "19.635"
                        },
                        "PriorYear": {
                            "val": "3.404"
                        },
                        "CurrentYear": {
                            "val": "2.444"
                        },
                        "BudgetYearOne": {
                            "val": "3.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.000"
                        },
                        "BudgetYearThree": {
                            "val": "3.300"
                        },
                        "BudgetYearFour": {
                            "val": "3.300"
                        },
                        "BudgetYearFive": {
                            "val": "3.366"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (TJS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the development of the Air and Cruise Missile Defense Prioritized Capability List, the Global Integrated Air and Missile Defense Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and U.S. Northern Command for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Black Dart"
                                    },
                                    "Description": {
                                        "val": "Provides funding to support administration and execution of Black Dart demonstrations. Black Dart is a unique joint, interagency demonstration focusing on rapid development and implementation of Counter - Unmanned Aircraft Systems (CUAS) technology from readily-available commercial and governmental products."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.404"
                                            },
                                            "Text": {
                                                "val": "Executed live-fly, live-free C-Unmanned Aircraft System (C-UAS) technology demonstration to assess and validate existing and emerging IAMD capabilities. The program presented emerging solutions to inform requirements decision-makers. Identified and developed IAMD operational concepts, system interoperability, and operational architectures for C-UAS mission set. Black Dart advocated for warfighters’ desired C-UAS capabilities and affordable, integrated solutions. Integrated Combat Command sponsored scenarios, employing an intel-driven mix of threat cruise missile and UAV target surrogates acting in concert, which enabled CCMDs to make real-time changes to Tactics, Techniques, and Procedures TP\/C2 based on Black Dart results. The program integrated numerous Joint Test and Demonstrations into one even to including: Joint Multi-Platform Advanced Combat ID JCTD; Cyber Capabilities for USAF; Electronic Attack Development; and Laser Negation System Development. Developed TTPs and conducted weapons system analyses for AH-1Z, UH-1Y, EA-18G, EC-130H, AWACS, MH-60R\/S, EC-130H, and RC-135."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.444"
                                            },
                                            "Text": {
                                                "val": "Continued FY 2015 plans including: Demonstrate UAS capabilities to employ within visual range (WVR) and beyond visual range (BVR) weapons in a counter-UAS, counter-air, and counter-cruise missile role. Expand the breadth, complexity, and integration of cyber capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Demonstrate UAS capabilities to employ within visual range and beyond visual range weapons in a counter-UAS, counter-air, and counter-cruise missile role. Expand the breadth, complexity, and integration of additional non-kinetic capabilities to include electronic and cyber effects. To the maximum extent possible, include foreign partner system and personnel participation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Complete events within schedule and budget. Events provide useful data to improve C-UAS capability.\n\n(2) Document gaps, develop and substantiate hardware, software, and employment concepts.\n\n(3) Field C-UAS capability."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P004"
                    },
                    "ProjectTitle": {
                        "val": "Joint Distributed Engineering Plant"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.212"
                        },
                        "PriorYear": {
                            "val": "0.036"
                        },
                        "CurrentYear": {
                            "val": "3.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.500"
                        },
                        "BudgetYearTwo": {
                            "val": "2.738"
                        },
                        "BudgetYearThree": {
                            "val": "2.900"
                        },
                        "BudgetYearFour": {
                            "val": "2.900"
                        },
                        "BudgetYearFive": {
                            "val": "2.958"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (JS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community’s proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD’s resource allocation structures.  JIAMDO also leads AMD mission and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations, demonstrations of joint air and missile defense architectures, and provides advocacy for innovative, technically mature and affordable solutions.  \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the development of the Air and Missile Defense Prioritized List and the Global Integrated Air and Missile Defense Assessment and analysis of the Ballistic Missile Defense System.  JIAMDO supports the USSTRATCOM ballistic missile early mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and U.S. Northern Command for homeland air and cruise missile surveillance issues and technical oversight of homeland capability solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Distributed Engineering Plant (JDEP)"
                                    },
                                    "Description": {
                                        "val": "Conducted a joint test event to assess the interoperability of joint, integrated air and missile defense weapon systems that leveraged commercial-off-the-shelf (COTS) Networks to perform Joint Integrated Fire Control.  This effort provided users the means to create family-of-system (FoS) environments by linking existing capabilities using hardware, software, and operators in a live-fly environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.036"
                                            },
                                            "Text": {
                                                "val": "JDEP conducted an appropriate distributed test event to assess the interoperability of coalition, joint, integrated air and missile defense weapons systems. The program provided users the means to create FoS environments by linking existing capabilities using hardware, software, and operator-in-the-loop.  Link existing Coalition, Service and Joint combat system engineering and test sites via distributed communications.  Reduce developmental cycle times by leveraging existing facilities.\n\nExtremely positive results from the earlier four Coalition Correlation \/ Decorrelation Interoperability Testing (C\/DIT) events were the basis for extending the International Project Arrangement (PA) between the DoD OUSD (AT&L) \/ JCS and United Kingdom MoD, out to FY 2019 in PA Amendment One.\n\nHigh Level Objectives (HLO) since these test events began in FY 2010:\n\n(HLO #1)  Assess Correlation \/ Decorrelation Interoperability of Link-16 systems under the STANAG 5516 Ed 4 and MILSTD 6016E for the U.S. Navy’s E-2C, U.S. Army’s Patriot Missile System and United Kingdom Royal Air Force E-3D (AWACS).\n\n(HLO #2)  Assess STANAG 5602 Ed 3 interoperability between the U.S. & U.K. platforms using their SIMPLE protocol communication devices Common Connectivity Device (CCD) for the U.S. E-2C Hawkeye and U.S. Patriot and the Multi-Link Test Facility (MLTF) for the U.K. AWACS E-3D.\n\n(HLO #3)  Provide input to Tactics, Techniques and Procedures (TTPs) and Capabilities & Limitations (CAPS&LIMS) to fielded tactical software.\n\n(HLO #4)  Assess interoperability Correlation \/ Decorrelation performance and impact when operating with Coalition units.\n\n(HLO #5)  Verify network architecture is capable of providing an adequate infrastructure to meet the other C\/DIT event objectives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint distributed test event to assess the interoperability of joint, integrated air and missile defense weapons systems.  Provide users the means to create FoS environments by linking existing capabilities using hardware, software, and operator-in-the-loop.  Link existing Service and Joint combat system engineering and test sites via distributed communications.  Reduce developmental cycle times by leveraging existing facilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Expand on the FY 2016 Joint JDEP C\/DIT-16 \/ AGILE FIRE event results by expanding and including the entire IAMD architecture Link-16 hardware-in-the-loop FoS platforms in a robust USFK IAMD operational scenario."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1)  Each JDEP event develops measures of effectiveness (MOE) & measures of performance (MOP) based on an eighteen month test planning and event process.\n(2)  Complete events within schedule and budget. \n(3)  Events provide useful data to improve Air Missile Defense interoperability, with implemented and recommended corrective changes.\n(4)  Events must be linked to the current approved IAMD Architecture, provide joint benefit, contribute to Joint Interoperability, and address IAMD ICD capability gaps."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P005"
                    },
                    "ProjectTitle": {
                        "val": "Nimble Fire"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "53.177"
                        },
                        "PriorYear": {
                            "val": "8.362"
                        },
                        "CurrentYear": {
                            "val": "8.000"
                        },
                        "BudgetYearOne": {
                            "val": "12.230"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.230"
                        },
                        "BudgetYearTwo": {
                            "val": "12.000"
                        },
                        "BudgetYearThree": {
                            "val": "12.500"
                        },
                        "BudgetYearFour": {
                            "val": "12.500"
                        },
                        "BudgetYearFive": {
                            "val": "12.650"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (JS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community’s proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD’s resource allocation structures.  JIAMDO also leads AMD mission and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations, demonstrations of joint air and missile defense architectures, and provides advocacy for innovative, technically mature and affordable solutions.  \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the development of the Air and Missile Defense Prioritized List and the Global Integrated Air and Missile Defense Assessment and analysis of the Ballistic Missile Defense System.  JIAMDO supports the USSTRATCOM ballistic missile early mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and U.S. Northern Command for homeland air and cruise missile surveillance issues and technical oversight of homeland capability solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JIAMDO Nimble Fire"
                                    },
                                    "Description": {
                                        "val": "The Department's only joint integrated air and missile defense operator-in-the-loop simulation that is comprised of current and future land, sea, and air weapon systems representing each of the Services AMD capabilities.  Enhances air and missile defense capability through the exploration of joint concepts and capabilities using current and future IAMD systems exercised by highly experienced operators against an integrated threat and providing quantifiable data that supports senior leadership within the Department of Defense, Combatant Commanders, and the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.362"
                                            },
                                            "Text": {
                                                "val": "- Funded and executed two (2) Joint virtual simulation events and directly supported two (2) Service and Program Office sponsored events,\n\n- Continued to provide and improve simulation environment and capabilities which enable Joint Force to integrate IAMD capabilities in accordance with the Chairman’s Joint IAMD Vision 2020, \n\n- Improved blue force systems and capabilities to represent projected FYDP +2 upgrades,\n\n- Partnered with USSTRATCOM to improve overall Electronic Warfare capabilities,\n\n- Collaborated with AMRAAM project office to standardize modeling of air-to-air missiles on all U.S. Navy and U.S. Air Force weapon systems,\n\n- Integrated 4 additional Joint Strike Fighter simulations to better explore Joint interoperability,\n \n- Continued to investigate future gateway concept contributions to Joint IAMD,\n\n- Strengthened ties with intelligence community (e.g., Office of Naval Intelligence, Missile and Space Intelligence Center, and National Air and Space Intelligence Center) for improved threat representation,\n\n- Explored the impacts of Electronic Attack, emerging CONOPS\/TTP’s, offensive cyber operations, and Integrated Fire Control to the IAMD mission area,\n \n- Additional details are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Fund and execute at least 2 Joint events and provide direct support for up to 3 Service, MDA or COCOM sponsored events.\n\nContinue to improve overall environment capabilities exploring all aspects of the Chairman's Joint IAMD Vision 2020.\n\nContinue to improve blue force systems and capabilities to represent projected FYDP+2 upgrades.\n\nContinue to investigate future gateway concept contributions to Joint IAMD.\n\nContinue to strengthen ties with intelligence community (e.g., ONI, MSIC, NASIC) for improved threat representation.\n\nEnhance overall Infrared (IR) capabilities.\n\nExplore the impacts of Electronic Attack, emerging CONOPS\/TTP’s, offensive cyber operations, and Integrated Fire Control to the IAMD mission area.\n\nExplore classified joint force capabilities and the associated impact to IAMD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.230"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.230"
                                            },
                                            "Text": {
                                                "val": "- Fund and execute (2) Joint events and provide support for up to three (3) Service, MDA, or CCMD sponsored events,\n\n- Improve blue force systems and capabilities to represent projected FYDP +5 upgrades,\n\n- Partner with USAF IAMD Cyber Lead and USCYBERCOM to improve modeling of offensive and defensive cyber effects in the simulated environment,\n\n- Explore, develop, and improve upon the space-layer in the environment and its contribution to Joint IAMD,\n\n- Explore Left-Of-Launch and other Non-Kinetic Effects and their impact on Joint IAMD,\n\n- Continue to investigate future gateway concept contributions to Joint IAMD,\n\n- Continue development and exploration of impacts of Electronic Attack, emerging CONEMPS\/TTP’s, and Integrated Fire Control to IAMDO mission area,\n\n- Explore classified joint force capabilities and associated impact to IAMD,\n\n- Additional details are classified."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Complete events within schedule and budget.\n(2) Document gaps and shortfalls.\n(3) Inform the Joint Capabilities Board (JCB) on results and findings.\n(4) Specific details are classified."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P006"
                    },
                    "ProjectTitle": {
                        "val": "Cruise Missile Combat Identification (CID)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "51.749"
                        },
                        "PriorYear": {
                            "val": "5.515"
                        },
                        "CurrentYear": {
                            "val": "6.356"
                        },
                        "BudgetYearOne": {
                            "val": "6.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.500"
                        },
                        "BudgetYearThree": {
                            "val": "6.000"
                        },
                        "BudgetYearFour": {
                            "val": "6.000"
                        },
                        "BudgetYearFive": {
                            "val": "6.120"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (JS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community’s proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD’s resource allocation structures.  JIAMDO also leads AMD mission and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations, demonstrations of joint air and missile defense architectures, and provides advocacy for innovative, technically mature and affordable solutions.\n  \nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the development of the Air and Missile Defense Prioritized List and the Global Integrated Air and Missile Defense Assessment and analysis of the Ballistic Missile Defense System.  JIAMDO supports the USSTRATCOM ballistic missile early mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and U.S. Northern Command for homeland air and cruise missile surveillance issues and technical oversight of homeland capability solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cruise Missile Combat Identification (CID)"
                                    },
                                    "Description": {
                                        "val": "Develops joint Counterair Combat Identification technology, and positions it for fielding on front-line weapon systems.  Monitors, assesses, and enhances joint AMD Combat ID programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.515"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.356"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "Details of this program are classified."
                        }
                    }
                }
            ]
        }
    }
}