{
    "id": "6f5f62c0a71cdb0dc6c7c49214b616f383cc7ce7",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA3_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603607A"
        },
        "ProgramElementTitle": {
            "val": "Joint Service Small Arms Program"
        },
        "R1LineNumber": {
            "val": "48"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.055"
            },
            "CurrentYear": {
                "val": "5.105"
            },
            "BudgetYearOne": {
                "val": "5.839"
            },
            "BudgetYearOneBase": {
                "val": "5.839"
            },
            "BudgetYearTwo": {
                "val": "5.787"
            },
            "BudgetYearThree": {
                "val": "5.874"
            },
            "BudgetYearFour": {
                "val": "5.990"
            },
            "BudgetYearFive": {
                "val": "6.110"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates advanced technologies that provide greater lethality, target acquisition, fire control, and range at a significantly reduced weight. These technologies lighten the Soldier's load, provide improved battlefield mobility, and reduce logistics burden while maintaining or improving current levels of performance.     \n \nEfforts in this PE support the Army Science and Technology Lethality Portfolio. \n\nWork in this PE is related to and fully integrated with the efforts funded in PE 0602623A (Joint Service Small Arms Program), PE 0602624A (Weapons and Munitions Technology) and PE 0602618A (Ballistic Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.318"
                },
                "CurrentYear": {
                    "val": "5.105"
                },
                "BudgetYearOne": {
                    "val": "5.839"
                },
                "BudgetYearOneBase": {
                    "val": "5.839"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.055"
                },
                "CurrentYear": {
                    "val": "5.105"
                },
                "BudgetYearOne": {
                    "val": "5.839"
                },
                "BudgetYearOneBase": {
                    "val": "5.839"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.263"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.033"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.230"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "627"
                    },
                    "ProjectTitle": {
                        "val": "Jt Svc Sa Prog (JSSAP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.055"
                        },
                        "CurrentYear": {
                            "val": "5.105"
                        },
                        "BudgetYearOne": {
                            "val": "5.839"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.839"
                        },
                        "BudgetYearTwo": {
                            "val": "5.787"
                        },
                        "BudgetYearThree": {
                            "val": "5.874"
                        },
                        "BudgetYearFour": {
                            "val": "5.990"
                        },
                        "BudgetYearFive": {
                            "val": "6.110"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced technologies that provide greater lethality, target acquisition, fire control, training effectiveness and range at a significantly reduced weight. These technologies lighten the Soldier's load, provide improved battlefield mobility, and reduce logistics burden while maintaining or improving current levels of performance.     \n \nEfforts in this Project support the Lethality Science and Technology Portfolio.  \n\nWork in this Project is related to and fully integrated with the efforts funded in Program Element (PE) 0602623A (Joint Service Small Arms Program) and PE 0602624A (Weapons and Munitions Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Small Arms Weapons and Fire Control Integration"
                                    },
                                    "Description": {
                                        "val": "Breadboard concepts from the Advanced Fire Control Technology for Small Arms (0602623A\/H21) will be integrated into lab demonstrators and evaluated on relevant current weapon systems (M4, M16, M249, M240) and developmental small arms systems to optimize affordability, target acquisition, fire control, weight, and lethality. Project technologies transition to Project Manager Soldier Weapons (PM SW)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.465"
                                            },
                                            "Text": {
                                                "val": "Performed final developmental testing and assessments in a relevant environment; demonstrated compatibility with current M240 machine gun in actual system environments; achieved Technical Readiness Level (TRL) 6 for matured component technologies and transitioned Technical Data Package (TDP)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Small Unit (Squad) Small Arms Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "Identify, advance, and demonstrate advanced technologies leading to the ability to improve Small Unit level effectiveness and utilize new small arms technological concepts to improve range overmatch capability against like-sized threat elements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.590"
                                            },
                                            "Text": {
                                                "val": "Demonstrated enabling technologies that double maximum effective range of door-breaching munition from 33m to 66m; doubled the maximum effective range to 2km for .50 caliber ammunition; increased probability of hit and hard target penetration; and doubled probability of hit for rifles from 0-600m."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.403"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a closed loop fire control weapon modification kit to compensate for dismounted shooter wobble. User-interface components will be controlled via target tracking software and embedded mobile processing hardware that optically monitor target position relative to point of aim in order to double probability of hit for rifles from 0-600m."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Material and Process Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on state of the art material substrates and surface coatings matured in PE 0602623A to improve reliability, reduce maintenance and improve weapon diagnostics through embedded technology."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.696"
                                            },
                                            "Text": {
                                                "val": "Demonstrate the application of solids substances that eliminate the need to apply lubricant to weapon components, reduce carbon fouling that builds up from weapon firing and reduce weapons maintenance time; achieve TRL 6 for matured technologies; and transition Technical Data Package (TDP) formulation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Volume Effects"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the maturation and demonstration of emerging small arms technologies from PE 0602623A efforts into current and next generation weapon systems to address Volume (sustained suppressive and lethal fires for area targets) capability gaps for improved effectiveness at extended ranges."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.152"
                                            },
                                            "Text": {
                                                "val": "Mature fire control and ammunition technologies for lightweight medium machine gun (up to 1200 meters range) and lightweight heavy machine gun (up to 2400 meters range) to support emerging next generation weapon system requirements and provide the capability to achieve desired accuracy and incapacitating effects with volume fire."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.362"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.362"
                                            },
                                            "Text": {
                                                "val": "Will integrate and demonstrate weapon systems, fire control and ammunition technologies to support the Next Generation Squad Automatic Rifle (NGSAR) requirements for a lightweight medium machine gun (up to 1200 meters range) with increased lethality, reduced weight, and decreased detection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Effects"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation and demonstration of emerging small arms technologies from PE 0602623A efforts into current and next generation weapon systems to address precision fire (Precision fire is support fire in the offense during the assault and engagement of targets to the maximum effective range of the weapon), and fire control capability gaps for improved accuracy at extended ranges."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.854"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate advanced future sniper rifles, advanced optics and image processing algorithms and spotting scopes technologies to support emerging precision weapon system requirements with the ability to achieve desired accuracy and incapacitating effects with precision fire against personnel targets for the squad (up to 600m) and the Platoon (up to 2400m)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.582"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.582"
                                            },
                                            "Text": {
                                                "val": "Will integrate and demonstrate weapon systems, fire control and ammunition technologies to support the next generation weapon systems; address precision fire requirements for the squad (up to 600m range) and the Platoon (up to 2400m range) with increased lethality, reduced weight, and decreased weapon signature."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Systems Integration and Demo"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the maturation and demonstration of small arms component technologies resulting from PE 0602623A efforts and applied into advanced small arms technologies as to inform the user requirement process, address operational capability gaps and transition mature components and technology concepts."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.395"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.395"
                                            },
                                            "Text": {
                                                "val": "Will increase understanding of current lethality capabilities, gaps, and impacts on the Warfighter; assess small unit effectiveness on next generation leap ahead weapon systems supporting the Squad."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Service Small Arms Science and Technology Collaboration"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the continued operations of the Joint Service Small Arms Program (JSSAP) office to coordinate and harmonize new Services' materiel requirements with potential joint applications, and to maintain awareness of the Services' efforts to improve Small Arms capabilities thus reducing duplication of ongoing and planned technology, acquisition and sustainment activities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Will provide intensive management of the Department of Defense (DoD) small arms tech base; harmonize emerging material requirements; focus technology development efforts on material solutions that will transition to the Project Managers for further development and eventual fielding; conduct long range plans and optimize strategies for joint applications; influence international small arms activities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}