{
    "id": "85717300e0464a2899cb72efb615f45944135a23",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605864N"
        },
        "ProgramElementTitle": {
            "val": "Test & Evaluation Support"
        },
        "R1LineNumber": {
            "val": "176"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "335.791"
            },
            "CurrentYear": {
                "val": "351.912"
            },
            "BudgetYearOne": {
                "val": "349.146"
            },
            "BudgetYearOneBase": {
                "val": "349.146"
            },
            "BudgetYearTwo": {
                "val": "361.446"
            },
            "BudgetYearThree": {
                "val": "358.709"
            },
            "BudgetYearFour": {
                "val": "375.797"
            },
            "BudgetYearFive": {
                "val": "381.238"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "JUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST and EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation.\n\nThis program provides institutional maintenance and operations support for:  the Naval Undersea Warfare Center Detachment Atlantic Undersea Test and Evaluation Center (AUTEC), Andros Island, Bahamas; the Environmental Compliance Program; Naval Air Warfare Center Weapons Division (NAWCWD), Point Mugu and China Lake, CA; Naval Air Warfare Center Aircraft Division (NAWCAD), Patuxent River, MD; Test and Evaluation (T&E) related capabilities at the Pacific Missile Range Facility, Barking Sands, HI; Maintenance and  Repair at NAWCWD, NAWCAD, and AUTEC; and the Naval Undersea Warfare Center Keyport Nanoose and Dabob Bay Ranges.  The T&E activities make up the Navy portion of the Department of Defense's Major Range and Test Facility Base.  These activities are chartered to perform T&E for the development and acquisition of technology advanced weapons systems.  Core T&E capabilities and capacity are operated to obtain weapons system performance documentation for acquisition program milestone decisions to provide operational forces with effective weapons systems.  This program provides Navy Acquisition Program Managers required test capabilities; lowers cost of T&E; removes cost and scheduling impact of providing their own T&E resources; and retains the physical airspace, land space and sea space needed to conduct testing."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "336.286"
                },
                "CurrentYear": {
                    "val": "351.912"
                },
                "BudgetYearOne": {
                    "val": "344.029"
                },
                "BudgetYearOneBase": {
                    "val": "344.029"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "335.791"
                },
                "CurrentYear": {
                    "val": "351.912"
                },
                "BudgetYearOne": {
                    "val": "349.146"
                },
                "BudgetYearOneBase": {
                    "val": "349.146"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.495"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.117"
                },
                "BudgetYearOneBase": {
                    "val": "5.117"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.495"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.256"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.256"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.861"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.861"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 request was reduced by -$7.6 million as required in order for the Department of the Navy to comply with the Bipartisan Budget Act of 2015.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0541"
                    },
                    "ProjectTitle": {
                        "val": "AUTEC"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "49.029"
                        },
                        "CurrentYear": {
                            "val": "51.537"
                        },
                        "BudgetYearOne": {
                            "val": "52.556"
                        },
                        "BudgetYearOneBase": {
                            "val": "52.556"
                        },
                        "BudgetYearTwo": {
                            "val": "54.759"
                        },
                        "BudgetYearThree": {
                            "val": "53.172"
                        },
                        "BudgetYearFour": {
                            "val": "54.927"
                        },
                        "BudgetYearFive": {
                            "val": "56.025"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "As a detachment of Naval Undersea Warfare Center, Division Newport, the mission of the Atlantic Undersea Test and Evaluation Center (AUTEC) is to provide the US Navy an underwater range facility for full-spectrum test and evaluation of Undersea Warfare systems and for Fleet training and readiness assessment.  The AUTEC Program Office is headquartered at Newport, RI.  AUTEC's administrative offices are located at West Palm Beach, Florida.  Test facilities are located at Andros Island, Sites 1 through 4, and the Berry Islands in the Bahamas.  AUTEC aircraft make scheduled daily flights between West Palm Beach and Andros Town Airport.  \n\nAUTEC manages and, under service contract, maintains and operates a 500 square nautical miles deep-water and a 100 square nautical miles shallow-water range; air-target tracking capabilities; sonobuoy simulation systems; electronic warfare threat simulation systems; rotary wing aircraft; aircraft ground support facilities; acoustic targets; torpedo retrieval and flushing capabilities; open-ocean range craft; marine support facilities; and data processing and analysis capabilities.  \n\nMajor test facilities on Andros Island are located at Site 1.  The Command Control Building houses the range tracking displays and replay centers, the computer center, operations support functions, communications center, and the central timing system. The Range Support Facility houses a torpedo post-run workshop, Mark 46 \/Mark 50 lightweight torpedo Intermediate Maintenance Activity (IMA), a Mark 30 undersea target IMA, a Mark 48 heavyweight torpedo Research and Development Turnaround facility and related technical facilities. The complex includes electrical and physical calibration labs, a complete electronics maintenance shop, a dive locker, a precision machine shop, and logistics support areas.\n\nAUTEC has a 285-foot concrete pier with a controlling depth of 17 feet (5.2 meters) at mean low tide. An adjacent wharf is approximately 240 feet in length (72 meters) with a controlling depth of 15 feet at mean low tide.  Power is available at both locations.  Facilities at the pier\/marine area include fully equipped machine \/fabrication and marine overhaul shops.  Also at Site 1, six Range User Buildings are maintained  for assembling test equipment and equipment check-out during test mobilization or dockside periods. These staging areas are equipped with a variety of power sources, gantry cranes, compressed air and security features. A fully equipped range user hanger for ground maintenance and storage of helicopters is located at the AUTEC helicopter airstrip.  Sites 2, 3, and 4 are small instrumented areas located south of Site 1 used to extend tracking of sonobuoys, communications, and air target track."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Atlantic Undersea Test and Eval Ctr Facility"
                                    },
                                    "Description": {
                                        "val": "AUTEC is a Test and Evaluation facility for collecting selected underwater, surface and air tracking data on test participants.  This project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility capabilities at AUTEC in accordance with Department of Defense Directive 3200.11."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.758"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources, instrumentation systems and marine craft required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range and Test Facility Base (MRTFB) operations.  Reimburse the Command for General and Administrative support services.  Atlantic Undersea Test and Evaluation Center (AUTEC) facility maintenance and repair funding ($4M) was realigned to the Maintenance and Repair (2922) Project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.266"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources, instrumentation systems and marine craft required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations.  Reimburse the Command for General and Administrative support services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.806"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.806"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources, instrumentation systems and marine craft required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations.  Reimburse the Command for General and Administrative support services.  Increased funding to resolve policy compliance issues resulting from a Naval Sea Systems Command Inspector General\/Newport Office of Counsel and Contracting review."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bahamian Lease"
                                    },
                                    "Description": {
                                        "val": "Rental payments to the Bahamian government for use of land and ocean in the Bahamas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.271"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide rental payments to the Bahamian government for use of land and ocean in the Bahamas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.271"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide rental payments to the Bahamian government for use of land and ocean in the Bahamas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide rental payments to the Bahamian government for use of land and ocean in the Bahamas."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Maintain Major Range and Test Facility Base infrastructure in a ready state to provide between 2,500-2,900 range hours in support of multiple Navy and Department of Defense acquisition programs and fleet training."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0566"
                    },
                    "ProjectTitle": {
                        "val": "NAVAIR Environmental Compliance"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.222"
                        },
                        "CurrentYear": {
                            "val": "4.257"
                        },
                        "BudgetYearOne": {
                            "val": "4.219"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.219"
                        },
                        "BudgetYearTwo": {
                            "val": "4.382"
                        },
                        "BudgetYearThree": {
                            "val": "4.462"
                        },
                        "BudgetYearFour": {
                            "val": "4.609"
                        },
                        "BudgetYearFive": {
                            "val": "4.702"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This continuing project supports environmental compliance, conservation and pollution prevention related efforts at the Navy Major Range and Test Facility Base (MRTFB) located at Patuxent River, MD, China Lake, CA, Point Mugu, CA, and Atlantic Undersea Test and Evaluation Center, Bahamas.  The Navy MRTFB environmental projects include ongoing efforts to comply with Federal, State, and local environmental requirements.\n\nThe MRTFB are test and evaluation facilities that provide for Department of Defense test and evaluation support missions.  These missions include: Weapons system testing, military operational squadron training on new weapon systems, and validation of performance or operational characteristics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Compliance"
                                    },
                                    "Description": {
                                        "val": "Projects supporting level 1 compliance requirements at Naval Air Systems Command Ranges inclusive of hazardous waste disposal, Resource Conservation & Recovery Act (RCRA), Subtitle C - 40 CFR 260 through 279, and Emergency Planning and Community Right-to-Know Act (EPCRA), Sections 311-312; solid waste disposal, RCRA, Subtitle D - 40 CFR Parts 239 through 259; natural & cultural resources programs, National Environmental Policy Act (NEPA), Environmental Protection Act, Marine Mammal Protection Act (MMPA), Endangered Species Act (ESA), Archeological and Historic Preservation Act (AHPA), maintaining of environmental permits, Clean Air Act (CAA), Clean Water Act (CWA), and environmental monitoring. RCRA, 42 U.S.C. Section 6901 et sequens 1976; EPCRA, 42 U.S.C. Section 11001-11050 et sequens 1986; NEPA, 42 U.S.C. Section 4331 et sequens 1969; MMPA, 16 U.S.C. Section 1361 et sequens 1972; CWA, 33 U.S.C. Section 1251-1387 1972; ESA, 7 U.S.C. Section 136, 16 U.S.C. Section 1531 et sequens 1973; AHPA, 16 USC Section 469-469c-2 1960; and CAA, Title V, 33 U.S.C. Section 1251 et sequens 1972."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.222"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue identification and funding of level 1 requirements that support compliance projects at Naval Air Systems Command (NAVAIR) Ranges and ensure applicable laws and regulations are met and Range mission\/operations proceed unencumbered."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.257"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the identification and funding of level 1 requirements that support compliance projects at Naval Air Systems Command (NAVAIR) Ranges to ensure applicable laws and regulations are met and Range mission\/operations proceed unencumbered.\nGlobal Information Systems Encroachment Data Supporting Testing & Training, 0.2\nCultural Surveys Supporting Testing & Training, 0.1"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the identification and funding of level 1 requirements that support compliance projects at NAVAIR Ranges to ensure applicable laws and regulations are met and Range mission\/operations proceed unencumbered.\nGlobal Information Systems Encroachment Data Supporting Testing & Training, 0.2\nCultural Surveys Supporting Testing & Training, 0.1"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Funding and execution of 37 level 1 compliance projects with quarterly project reviews, and monthly monitoring of expenditures vs. execution of project deliverables\/objectives.  Primary metric gauging performance of these projects is the maintaining of compliance with pertinent laws and regulations as noted in section B."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0653"
                    },
                    "ProjectTitle": {
                        "val": "NAWC Weapons Division"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "135.768"
                        },
                        "CurrentYear": {
                            "val": "141.872"
                        },
                        "BudgetYearOne": {
                            "val": "135.521"
                        },
                        "BudgetYearOneBase": {
                            "val": "135.521"
                        },
                        "BudgetYearTwo": {
                            "val": "140.345"
                        },
                        "BudgetYearThree": {
                            "val": "143.428"
                        },
                        "BudgetYearFour": {
                            "val": "148.173"
                        },
                        "BudgetYearFive": {
                            "val": "151.131"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Project provides continuing maintenance and operational support for the Naval Air Warfare Center Weapons Division Test and Evaluation (T&E) capabilities.  These capabilities include the Pacific Ranges and Facilities, consisting of China Lake Ranges and the Point Mugu Sea Range, aerial and surface targets, test instrumentation, and T&E aircraft.  The Pacific Ranges use China Lake's 1.1 million acres of land and 17,000 square miles of military restricted (R-2508) airspace together with Point Mugu's 125,000 square miles of instrumented sea range and 36,000 square miles of controlled overlying airspace, and airfield and test instrumentation at San Nicolas Island to perform its T&E mission.  Included in the China Lake ranges is the Electronic Combat Range (ECR), which provides outdoor free space development and operational testing of airborne electronic warfare systems and tactics against shipboard and land based air defense systems. These ranges perform metric radar, multilateration and optical  tracking of test objects; command, control,  and destruct for range safety purposes; communications; frequency interference control and analysis; collection processing and display of telemetered data; real-time data processing and display; and the operation of a sub scale aerial target launch capability.  Other test capabilities include sled tracks, measurement facility; propulsion, warhead, environmental, rocket motor, and other missile component test facilities; and gun ranges.  This project funds costs that are not chargeable to customers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pacific Ranges"
                                    },
                                    "Description": {
                                        "val": "In accordance with Department of Defense Directive 3200.11., this project funds the overhead\/institutional costs required to sustain the Major Range and Test Facility Base (MRTFB) capabilities at the Pacific Ranges and Facilities located at China Lake and Point Mugu, CA.  These facilities provide safe, instrumented, controlled open air testing utilizing the Land Range, Sea Range, ECR, Air Vehicle Modification and Instrumentation, and San Nicholas Island."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "54.495"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission\/core test support resources.  These resources include test article instrumentation and systems required to safely conduct flight and ground test missions as well as schedule and control air, land, sea and associated range operating areas required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased services contracts, annual utilities and any costs necessary to manage and sustain the MRTFB operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "57.153"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission\/core test support resources.  These resources include test article instrumentation and systems required to safely conduct flight and ground test missions as well as schedule and control air, land, sea and associated range operating areas required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased services contracts, annual utilities and any costs necessary to manage and sustain the Major Range and Test Facility Base (MRTFB) operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "55.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "55.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission\/core test support resources.  These resources include test article instrumentation and systems required to safely conduct flight and ground test missions as well as schedule and control air, land, sea and associated range operating areas required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased services contracts, annual utilities and any costs necessary to manage and sustain the MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy Test Wing Pacific"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the MRTFB capabilities of the Naval Test Wing Pacific located at China Lake and Point Mugu, CA.  These facilities provide the Navy's principal Pacific test activity for Naval Aviation Systems Team aircraft, engaged in or supporting Test & Evaluation of aircraft, weapons and weapons systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with 11 aircraft and related systems and flight test safety required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.162"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with 11 aircraft and related systems and flight test safety required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.964"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.964"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with 10 aircraft and related systems and flight test safety required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range and Test Facility Base (MRTFB) operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat\/Target Systems"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the MRTFB capabilities of the Threat\/Target Systems facilities.  These facilities provide the airborne and seaborne threats for test and evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.984"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with airborne and seaborne targets required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the MRTFB operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.339"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with airborne and seaborne targets required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.226"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.226"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with airborne and seaborne targets required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain the MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation Ordnance"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the MRTFB capabilities of the Test and Evaluation Ordnance facilities.  These facilities provide test and evaluation of All-Up live ordnance and components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.998"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated propulsion, warhead, environmental, rocket motor, and other missile component test facilities required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range and Test Facility Base (MRTFB) operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.012"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated propulsion, warhead, environmental, rocket motor, and other missile component test facilities required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.033"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.033"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated propulsion, warhead, environmental, rocket motor, and other missile component test facilities required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval Air Warfare Center Weapons Division (NAWCWD) Command"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the NAWCWD MRTFB Test and Evaluation capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "45.201"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to reimburse the Command for General and Administration Support services.  Continue to fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities, Navy Marine Corps Intranet, and any costs  necessary to manage and sustain MRTFB operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "48.206"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to reimburse the Command for General and Administration Support services.  Continue to fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities, Navy Marine Corps Intranet, and any costs  necessary to manage and sustain Major Range and Test Facility Base (MRTFB) operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "45.184"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "45.184"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to reimburse the Command for General and Administration Support services.  Continue to fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities, Navy Marine Corps Intranet, and any costs  necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Maintain MRTFB infrastructure in a ready state to provide between 4,300-4,800 range hours, 125-150 aerial target presentations, 400-450 surface target presentations, 11,000-11,500 ordnance test hours, and over 6,000 flight hours in support of multiple Navy and Department of Defense acquisition programs and fleet training."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0654"
                    },
                    "ProjectTitle": {
                        "val": "NAWC Acft Division"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "94.162"
                        },
                        "CurrentYear": {
                            "val": "97.652"
                        },
                        "BudgetYearOne": {
                            "val": "94.556"
                        },
                        "BudgetYearOneBase": {
                            "val": "94.556"
                        },
                        "BudgetYearTwo": {
                            "val": "97.651"
                        },
                        "BudgetYearThree": {
                            "val": "99.410"
                        },
                        "BudgetYearFour": {
                            "val": "102.706"
                        },
                        "BudgetYearFive": {
                            "val": "104.755"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides funds for the maintenance and operations of the Naval Air Warfare Center Aircraft Division's  (NAWCAD's)  Major Range and Test Facility Base (MRTFB) capabilities used to conduct test and evaluation for air platforms.  NAWCAD has extensive airfield, flight test ranges, aircraft systems test facilities and simulation laboratories to support aircraft Research Development Test and Evaluation.  This includes 50,000 square miles of airspace, 39,375 square miles of sea space, and 7,950 acres of land space.  Product areas include aircraft systems flight test and evaluation, carrier suitability certification, test article preparation, installed system test and evaluation, and modeling and simulation support of the acquisition process.   The Test and Evaluation Group, Patuxent River, performs development and operational test and evaluation of manned and unmanned air vehicle systems, including mission systems, equipment, subsystems, components, and support systems.  This project also provides test and evaluation facilities for air-breathing propulsion systems and extensive facilities for conducting both installed and uninstalled aircraft engine development and test and evaluation.  This project funds costs that are not chargeable to customers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Atlantic Ranges"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the MRTFB capabilities associated with the Atlantic Ranges and Facilities and Air Vehicle Modification and Instrumentation.  These facilities provide safe, instrumented, controlled flight testing and training in air, sea, and land arenas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources.  These resources include test article instrumentation and\/or modification for Flight Test Aircraft and Weapons Undersea Test as well as ground and flight test instrumentation systems, range instrumentation systems and data processing and communication systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.742"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources.  These resources include test article instrumentation and\/or modification for Flight Test Aircraft and Weapons Undersea Test as well as ground and flight test instrumentation systems, range instrumentation systems and data processing and communication systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range and Test Facility Base (MRTFB) operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.256"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.256"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources.  These resources include test article instrumentation and\/or modification for Flight Test Aircraft and Weapons Undersea Test as well as ground and flight test instrumentation systems, range instrumentation systems and data processing and communication systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Environmental Effects (E-Cubed) and Air Combat Environment Test and Evaluation Facility (ACETEF)"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the MRTFB capabilities associated with E-Cubed and ACETEF.  These facilities  provide Test & Evaluation support with integrated, interactive, and repeatable synthetic environments and reduce the risk and cost for programs with the use of installed systems tests to include simulation and stimulation tools, techniques and technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.149"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.879"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.729"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.729"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range Test Facility Base (MRTFB) operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Propulsion Systems Test Facility (PSEF)"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the MRTFB capabilities of the PSEF. These facilities perform Test & Evaluation (T&E) of propulsion systems in the laboratories, engine test chambers and component test rigs of the PSEF and the Aircraft T&E Facility.  Propulsion Systems consists of engines, engine components and accessories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.360"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.389"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.366"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.366"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat\/Target Systems"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the MRTFB capabilities of the Threat\/Target Systems facilities.  These facilities provide the airborne and seaborne threats for T&E."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.610"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with airborne and seaborne targets required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range and Test Facility Base (MRTFB) operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.621"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with airborne and seaborne targets required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.645"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.645"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with airborne and seaborne targets required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval Test Wing Atlantic"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the MRTFB capabilities of the Naval Test Wing Atlantic.  These facilities provide support for Naval Aviation Systems Team aircraft, engaged in or supporting Test & Evaluation aircraft systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.025"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with 12 aircraft and related systems and flight test safety required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.474"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with 12 aircraft and related systems and flight test safety required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range and Test Facility Base (MRTFB) operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.658"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.658"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with 11 aircraft and related systems and flight test safety required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval Air Warfare Center Aircraft Division Command (NAWCAD)"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the NAWCAD MRTFB Test & Evaluation capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to reimburse the Command for General and Administrative support services.  Continue to fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.547"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to reimburse the Command for General and Administrative support services.  Continue to fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.902"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.902"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to reimburse the Command for General and Administrative support services.  Continue to fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Maintain Major Range Test Facility Base infrastructure in a ready state to provide between 8,700-9,200 range hours, 4,900-5,300 chamber hours, 9,500-10,000 Electromagnetic Environmental Effects test hours, and over 10,000 flight hours in support of multiple Navy and Department of Defense acquisition programs and fleet training."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2921"
                    },
                    "ProjectTitle": {
                        "val": "Pacific Missile Range Facility"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.275"
                        },
                        "CurrentYear": {
                            "val": "5.316"
                        },
                        "BudgetYearOne": {
                            "val": "5.179"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.179"
                        },
                        "BudgetYearTwo": {
                            "val": "5.442"
                        },
                        "BudgetYearThree": {
                            "val": "5.542"
                        },
                        "BudgetYearFour": {
                            "val": "5.724"
                        },
                        "BudgetYearFive": {
                            "val": "5.838"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program provides continuing maintenance and operations support for Test & Evaluation (T&E) related capabilities at the Pacific Missile Range Facility (PMRF) located at Barking Sands on Kauai, HI.  PMRF's T&E capabilities include precision radar and telemetry assets, the Mobile Aerial Target Support System (MATSS), and Stabilized High-accuracy Optical Tracking System (SHOTS).  These assets support Navy, Department of Defense, and Army Missile Defense Test & Evaluation.  This project funds costs not chargeable to customers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PMRF"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the recognized Major Range and Test Facility Base (MRTFB) capabilities at PMRF in accordance with Department of Defense Directive 3200.11."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.275"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources including the precision radar and telemetry assets, the MATSS, the SHOTS, and the Telemetry Systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations.  Reimburse the Command for General and Administrative support services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.316"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources including the precision radar and telemetry assets, the MATSS, the SHOTS, and the Telemetry Systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations.  Reimburse the Command for General and Administrative support services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.179"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.179"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources including the precision radar and telemetry assets, the MATSS, the SHOTS, and the Telemetry Systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range Test Facility Base (MRTFB) operations.  Reimburse the Command for General and Administrative support services."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Maintain MRTFB infrastructure in a ready state to provide between 600-1,000 range hours in support of multiple Navy and Department of Defense acquisition programs and fleet training."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2922"
                    },
                    "ProjectTitle": {
                        "val": "MRTFB Maint & Repair"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "35.744"
                        },
                        "CurrentYear": {
                            "val": "39.583"
                        },
                        "BudgetYearOne": {
                            "val": "31.734"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.734"
                        },
                        "BudgetYearTwo": {
                            "val": "32.980"
                        },
                        "BudgetYearThree": {
                            "val": "29.375"
                        },
                        "BudgetYearFour": {
                            "val": "29.380"
                        },
                        "BudgetYearFive": {
                            "val": "31.646"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides funding for the maintenance and repair of the Major Range and Test Facility Base (MRTFB) Real Property Maintenance Activities (RPMA) at the Naval Air Warfare Center Weapons Division (NAWCWD), the Naval Air Warfare Center Aircraft Division (NAWCAD), and the Atlantic Undersea Test and Evaluation Center (AUTEC).  Funds mission critical emergency services, recurring maintenance and repair, and major repair projects.  In addition it addresses priority items on the Backlog of Maintenance and Repair list."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Facility Maintenance and Repair"
                                    },
                                    "Description": {
                                        "val": "Maintenance and repair of the MRTFB RPMA at NAWCWD, NAWCAD, and AUTEC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "35.744"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support mission critical emergency services, recurring maintenance and repair, and minor and major repair efforts at NAWCWD, NAWCAD, and AUTEC.  FY15 budget funds MRTFB facility to 80% of Department of Defense sustainment model and 23% of the Restoration and Modernization Model.  AUTEC facility maintenance and repair funding ($4M) was realigned to the Maintenance and Repair (2922) Project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "39.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support mission critical emergency services, recurring maintenance and repair, and minor and major repair efforts at NAWCWD, NAWCAD, and AUTEC.  FY16 budget funds MRTFB facility to 80% of Department of Defense sustainment model and 23% of the Restoration and Modernization Model.  Additional funding included to complete AUTEC Pier Repairs ($5.9M) and continue NAWCAD Hangar Life Extension ($6.2M)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.734"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.734"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support mission critical emergency services, recurring maintenance and repair, and minor and major repair efforts at NAWCWD, NAWCAD, and AUTEC.  FY17 budget funds MRTFB facility to 80% of Department of Defense sustainment model and 23% of the Restoration and Modernization Model. Continue NAWCAD Hanger Life Extension ($5.0M)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Maintain the 141, 357, and 784 building\/structures at Naval Undersea Warfare Center Detachment (NUWC) Atlantic Undersea Test and Evaluation Center  (AUTEC), Naval Air Warfare Center Aircraft Division (NAWCAD), and Naval Air Warfare Center Weapons Division (NAWCWD) respectively. Execute 15-20 major repair projects per year to address mission critical services."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3154"
                    },
                    "ProjectTitle": {
                        "val": "Nanoose and Dabob Bay Ranges"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "11.591"
                        },
                        "CurrentYear": {
                            "val": "11.695"
                        },
                        "BudgetYearOne": {
                            "val": "11.421"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.421"
                        },
                        "BudgetYearTwo": {
                            "val": "11.868"
                        },
                        "BudgetYearThree": {
                            "val": "12.085"
                        },
                        "BudgetYearFour": {
                            "val": "12.487"
                        },
                        "BudgetYearFive": {
                            "val": "12.737"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides maintenance and operations support  for the Nanoose and Dabob Bay Ranges along with associated support systems to provide Test and Evaluation (T&E) and readiness assessment services for acquisition programs and the Fleet.  Operates ocean-based environment, measurement and support systems.  Maintains and repairs systems that measure warfare system performance.  Oversees test, training, and measurement facilities, equipment, operations and maintenance processes.  Satisfies customer exercise and measurement requirements through the operation of ocean based test and measurement systems.  Assures the readiness of  systems through the implementation of calibration, maintenance, repair and life cycle processes.  Performs exercise planning, exercise interpretation and development of surrogate environments, measurement and support systems.  Assists in the design, fabrication and testing of systems for Undersea Warfare warfare environment simulation and performance measurement.  Oversees the manning and maintenance of Naval Undersea Warfare Center Division Keyport range craft and range craft systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Undersea Ranges"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhead\/institutional costs required to sustain the Major Range Test Facility Base (MRTFB) capabilities at the Nanoose and Dabob Bay undersea tracking ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.591"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with the unique test environments for T&E of undersea weapons, sensors, submarines and other undersea systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations.  Reimburse the Command for General and Administrative support services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.695"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with the unique test environments for T&E of undersea weapons, sensors, submarines and other undersea systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain MRTFB operations.  Reimburse the Command for General and Administrative support services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.421"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.421"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate mission essential\/core test support resources associated with the unique test environments for Test and Evaluation of undersea weapons, sensors, submarines and other undersea systems required to meet customer test workload.  Fund civilian labor, travel, transportation, equipment, supplies, communication, equipment maintenance, purchased service contracts, annual utilities and any costs necessary to manage and sustain Major Range and Test Facility Base (MRTFB) operations.  Reimburse the Command for General and Administrative support services."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Maintain MRTFB infrastructure in a ready state to provide between 1,600-2,000 range hours in support of multiple Navy and Department of Defense acquisition programs and fleet training."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3386"
                    },
                    "ProjectTitle": {
                        "val": "MRTFB Marine Vessels"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "13.960"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.960"
                        },
                        "BudgetYearTwo": {
                            "val": "14.019"
                        },
                        "BudgetYearThree": {
                            "val": "11.235"
                        },
                        "BudgetYearFour": {
                            "val": "17.791"
                        },
                        "BudgetYearFive": {
                            "val": "14.404"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the overhauls and preventative maintenance of the 23 Major Range and Test Facility Base (MRTFB) marine vessels located at Naval Air Warfare Center Weapons Division (NAWCWD), Point Mugu, CA, Pacific Missile Range Facility (PMRF), Honolulu, HI, Naval Undersea Warfare Center (NUWC) Keyport, WA, Naval Air Warfare Aircraft Division (NAWCAD), Patuxent River, MD, and Atlantic Undersea Test and Evaluation Center (AUTEC). These vessels are used to launch and recover torpedoes, acoustic systems, and other weapons, provide range surveillance and clearance, and can be configured as a target.  Overhauls are required to operate ships over 300 tons overseas in compliance with American Bureau of Shipping \"Load Line\" certification requirements.  Major preventative maintenance requiring shipyard support is also performed during these periods to mitigate risks of failures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MRTFB Marine Vessels"
                                    },
                                    "Description": {
                                        "val": "This project funds the overhauls and preventative maintenance of the 23 MRTFB marine vessels located at NAWCWD, Point Mugu, CA, PMRF, Honolulu, HI, NUWC Keyport Nanoose and Dabob Bay Ranges, Keyport, WA, NAWCAD, Patuxent River, MD, and NUWC Detachment (AUTEC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.960"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.960"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate overhauls and preventative maintenance on five MRTFB vessels. Initiate Service Life Extension Projects for YTT-10, YTT-11, and Transporter vessels."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Maintain Major Range Test Facility Base (MRTFB) marine vessels in a ready state to provide between 16,000-20,000 vessel hours in support of multiple Navy and Department of Defense acquisition programs and fleet training."
                        }
                    }
                }
            ]
        }
    }
}