{
    "id": "8b0c806fa23b7aef548e8e8acaa2e312d8051f2a",
    "meta": {
        "filename": "dod-2017_RDTE_2017_DISA_U_RDTE_MasterJustificationBook_Defense_Information_Systems_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Defense_Information_Systems_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0303228K"
        },
        "ProgramElementTitle": {
            "val": "Joint Information Environment"
        },
        "R1LineNumber": {
            "val": "207"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "2.789"
            },
            "BudgetYearOneBase": {
                "val": "2.789"
            },
            "BudgetYearTwo": {
                "val": "2.976"
            },
            "BudgetYearThree": {
                "val": "2.976"
            },
            "BudgetYearFour": {
                "val": "2.976"
            },
            "BudgetYearFive": {
                "val": "3.036"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Information Environment (JIE) construct is a consolidated secure and defensible environment across DoD.  This is comprised of unified, consolidated and shared information technology (IT) infrastructure, enterprise services, and standardized security architectures throughout the Department of Defense Information Network (DODIN) to achieve full spectrum superiority, improve mission effectiveness, increase security and realize IT efficiencies.  \n\nThe target objective state of JIE is a DODIN that optimizes the use of DoD's IT assets from the administrative and operational planning at the Pentagon to the tactical edge; to include our mission partners through converging communications, computing, enterprise services, and defense of the DODIN that can be leveraged for all Department missions. \n\nWhen implemented, JIE will reduce DoD's Total Cost of Ownership (TCO), improved security by reducing the attack surface of our networks, and enable Combatant Commands\/Services\/Agencies (CC\/S\/A) to more efficiently access information to perform their missions from any authorized IT device, any time, from anywhere in the world."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.789"
                },
                "BudgetYearOneBase": {
                    "val": "2.789"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.789"
                },
                "BudgetYearOneBase": {
                    "val": "2.789"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.789"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.789"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase of +$2.789 in FY 2017 will provide testing support for requirements to Joint Regional Security Stacks (JRSS) Version 1.5 security capabilities by supporting voice over IP, streaming video, and real-time collaboration capabilities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "JE1"
                    },
                    "ProjectTitle": {
                        "val": "Joint Regional Security Stacks"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.789"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.789"
                        },
                        "BudgetYearTwo": {
                            "val": "2.976"
                        },
                        "BudgetYearThree": {
                            "val": "2.976"
                        },
                        "BudgetYearFour": {
                            "val": "2.976"
                        },
                        "BudgetYearFive": {
                            "val": "3.036"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Regional Security Stack (JRSS) is a joint DoD security architecture deployed regionally throughout the world. Each of the 23 NIPR and 25 SIPR stacks is comprised of complementary defensive security solutions that remove redundant Information Assurance (IA) protections; leverages enterprise defensive capabilities with standardized security suites; protects the enclaves after the separation of server and user assets; and provides the tool sets necessary to monitor and control all security mechanisms throughout DoD's Joint Information Environment.  The JRSS Management System (JMS) is the management and operational control suite\/capability for the JRSS. While the JMS is treated as a related effort, it requires its own experience and evaluation strategy as the JMS is a selection of best of breed capabilities. The JMS is a system-of-systems designed to centralize and enhance the management of the JRSS components and achieve economies of scale by using DoD common suites\/infrastructure.  The savings are realized by coupling the JRSS and JMS. The JRSS collapses replicated IT security functionality for all Department of Defense (DoD) components into relatively few regionally located stacks.  The JMS provides Centralized Network Management of the JRSS with a standard interoperable set of capabilities across DoD.  JMS provides visibility and control over network transport and associated security systems.  It enables monitoring and analysis of relevant fault and performance data to determine the impact on current operations and trend analysis.  This centralized capability allows standardization of policies, procedures and configurations of critical network transport assets. The JMS enables DoD Components to maintain Title 10 required management and visibility of their IT security while providing high level visibility to CYBERCOM. Cyber Operations can take proactive actions to ensure the uninterrupted availability and protection of system and network information."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Regional Security Stacks"
                                    },
                                    "Description": {
                                        "val": "The Joint Regional Security Stack (JRSS) is a joint DoD security architecture deployed regionally throughout the world. Each of the 23 NIPR and 25 SIPR stacks is comprised of complementary defensive security solutions that remove redundant Information Assurance (IA) protections; leverages enterprise defensive capabilities with standardized security suites; protects the enclaves after the separation of server and user assets; and provides the tool sets necessary to monitor and control all security mechanisms throughout DoD's Joint Information Environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.789"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.789"
                                            },
                                            "Text": {
                                                "val": "Will perform integration and testing of the pre-production capabilities for planned enhancements to JRSS 1.5.  These efforts will lead into the initial testing of the production units.  Will also provide systems engineering and testing support to integrate capabilities into the existing JRSS.\n\nThe increase of +$2.789 from FY 2016 to FY 2017 will provide test and evaluation activities for enhancement to JRSS 1.5 capabilities to better synch with planned 1.5 tech refresh."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "The Joint Regional Security Stack (JRSS) is a joint DoD security architecture deployed regionally throughout the world. Each of the 23 NIPR and 25 SIPR stacks is comprised of complementary defensive security solutions that remove redundant Information Assurance (IA) protections; leverages enterprise defensive capabilities with standardized security suites; protects the enclaves after the separation of server and user assets; and provides the tool sets necessary to monitor and control all security mechanisms throughout DoD's Joint Information Environment.  The JRSS Management System (JMS) is the management and operational control suite\/capability for the JRSS. While the JMS is treated as a related effort, it requires its own experience and evaluation strategy as the JMS is a selection of best of breed capabilities. The JMS is a system-of-systems designed to centralize and enhance the management of the JRSS components and achieve economies of scale by using DoD common suites\/infrastructure.  The JMS provides Centralized Network Management of the JRSS with a standard interoperable set of capabilities across DoD.  JMS provides visibility and control over network transport and associated security systems.  It enables monitoring and analysis of relevant fault and performance data to determine the impact on current operations and trend analysis.  This centralized capability allows standardization of policies, procedures and configurations of critical network transport assets. The JMS enables DoD Components to maintain Title 10 required management and visibility of their IT security while providing high level visibility to CYBERCOM. Cyber Operations can take proactive actions to ensure the uninterrupted availability and protection of system and network information.\n\nFY 2015 (Actual): N\/A\n\nFY 2016 (Estimated): N\/A\n\nFY 2017 (Estimated): 100% successful testing of new pre-production capabilities for Full Packet Capture analytics (e.g. ArcSight and Splunk log); JMS 1.5 data orchestrator aggregation; and JRSS 1.5 active stack capabilities through the Joint Interoperability Test Command."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Certification Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.616"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.616"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.384"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.384"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Integration Test and Modification"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tech Refresh\/Functionality Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.289"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.289"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "JIE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}