{
    "id": "a69c86a444491fba5b9abdd8b1a05e9042ebb0c3",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602202F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Applied Research"
        },
        "R1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "101.157"
            },
            "PriorYear": {
                "val": "95.727"
            },
            "CurrentYear": {
                "val": "110.221"
            },
            "BudgetYearOne": {
                "val": "111.647"
            },
            "BudgetYearOneBase": {
                "val": "111.647"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "114.704"
            },
            "BudgetYearThree": {
                "val": "117.454"
            },
            "BudgetYearFour": {
                "val": "119.877"
            },
            "BudgetYearFive": {
                "val": "121.458"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program conducts applied research in the area of airmen training, airmen system interfaces, bioeffects, and understanding and shaping adversarial behavior.  The Learning and Operational Readiness project conducts research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  The Human Dynamics Evaluation project conducts research to advance machine intelligence and operator-aiding technologies by developing and applying airman-focused research for advanced intelligence, surveillance, and reconnaissance (ISR) capabilities and detecting and exploiting human signatures.  The Sensory Evaluation and Decision Science project conducts research to revolutionize the manner in which airmen optimize the capabilities of Air Force systems, including remotely piloted aircraft (RPA) and adaptive teams of airmen and machines.  The Bioeffects project conducts research on the effects of human exposure to potentially toxic, operational and advanced chemicals and materials (including nanomaterials), electromagnetic (EM) energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. \n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "96.894"
                },
                "CurrentYear": {
                    "val": "100.530"
                },
                "BudgetYearOne": {
                    "val": "109.280"
                },
                "BudgetYearOneBase": {
                    "val": "109.280"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "95.727"
                },
                "CurrentYear": {
                    "val": "110.221"
                },
                "BudgetYearOne": {
                    "val": "111.647"
                },
                "BudgetYearOneBase": {
                    "val": "111.647"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.167"
                },
                "CurrentYear": {
                    "val": "9.691"
                },
                "BudgetYearOne": {
                    "val": "2.367"
                },
                "BudgetYearOneBase": {
                    "val": "2.367"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.309"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.167"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "2.367"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.367"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2017 due to increased emphasis by DoD in Aerospace Physiology and Toxicology"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621123"
                    },
                    "ProjectTitle": {
                        "val": "Learning and Operational Readiness"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.971"
                        },
                        "PriorYear": {
                            "val": "16.385"
                        },
                        "CurrentYear": {
                            "val": "24.546"
                        },
                        "BudgetYearOne": {
                            "val": "23.329"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.329"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "23.687"
                        },
                        "BudgetYearThree": {
                            "val": "21.582"
                        },
                        "BudgetYearFour": {
                            "val": "22.021"
                        },
                        "BudgetYearFive": {
                            "val": "22.319"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  Research is conducted in two focus areas:  continuous learning and cognitive modeling.  The continuous learning effort creates live, virtual, and constructive (LVC) environments for use in developing revolutionary simulation technologies to increase training capabilities and enhance training effectiveness and efficiency by using learning theory to improve military training and mission performance.  Cognitive modeling creates realistic models and simulations of human behavior to advance the understanding of how airmen perform complex tasks."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.334"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-Directed Effort"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Research enhances distributed mission operations (DMO) and LVC environments and identifies technology requirements for training in live and immersive environments.  Continuous learning strategies improve mission training, command and control (C2), ISR, and cyber missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.385"
                                            },
                                            "Text": {
                                                "val": "Completed development of an analyst readiness research testbed for ISR and cyber operators.  Extended learning assessment and management tools to support undergraduate pilot training.  Evaluated different methods for secure, credible LVC training and rehearsal for fourth and fifth generation fighters.  Created and documented standards for tactical LVC training and readiness.  Validated methods to quickly generate rule sets for security applications in C2 and ISR domains.  Developed methods to generate realistic representations of adversary tactics for LVC training.  Evaluated methods to rapidly reconfigure training environments for different scenarios and mission sets.  Initiated work to develop agents to manage training activities in LVC.  Began requirements definition for LVC training applications to support enhancing warfighting in contested environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.212"
                                            },
                                            "Text": {
                                                "val": "Begin to implement multiple agents as synthetic white forces for cost reduction in Air Support Operations Center training. Demonstrate adaptive ISR training in training research exercise. Complete evaluations and develop specifications for in-theater C2 trainer. Demonstrate integrated RPA, C2, and joint terminal attack controller (JTAC) training and assessment in routine DMO events. Demonstrate autonomous agents for asset management in RPA operations. Continue research to create autonomous cognitive models to function in contested environments. Complete development of common scenario generation and readiness assessment methods for joint and coalition distributed training and exercise."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.102"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.102"
                                            },
                                            "Text": {
                                                "val": "Integrate and evaluate government off-the-shelf computer-generated forces in an LVC testbed.  Complete the development of the Distributed Common Ground Station (DCGS) Weapons Systems Trainer (DWST).  Conduct initial training effectiveness study to evaluate the transfer of training using the DWST.  Complete multi-role training effectiveness study and deliver results to government customers and partners.  Complete and accredit a cross domain solution ruleset.  Continue to develop specifications for secure fifth generation LVC operations to include executing a fourth and fifth generation platform study.  Initiate designs for outyear studies to execute fourth to fifth generation realistic, secure training and rehearsal events.  Begin evaluations of identified training gaps and potential solutions to gaps for the integration of the fifth generation aircraft into a close air support environment.  Integrate cyber intelligence training testbed into training research exercises.\n\nFor FY 2017 and beyond, Cognitive Modeling work accomplished under this effort will be reported under the Cognitive Modeling effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Modeling"
                                    },
                                    "Description": {
                                        "val": "Research explores application of cognitive science for performance improvement by enhancing training in mission-relevant environments (e.g., flight simulators)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.227"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.227"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort was originally performed in the Continuous Learning effort.  \n\nApply predictive performance optimization to more complex warfighter training contexts.  Evaluate robustness and stability of autonomous operations in mission-relevant simulations.  Further develop mechanisms for effectiveness in human-machine teaming.  Rapidly validate complex models through massively parallel computing architectures.  Enhance constructive entities through infusion of intelligent agent technologies.  Develop personalized learning through scheduling of learning events in intelligent tutors.  Support career-wide continuous learning through development of persistent personalized learner models that may allow individual airmen training to be followed from accession to retirement.  Refine and validate integration of intelligent agents into existing training testbeds.  Apply vigilance research to long-duration missions to improve warfighter performance at the edges of human performance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625328"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics Evaluation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "25.692"
                        },
                        "PriorYear": {
                            "val": "16.919"
                        },
                        "CurrentYear": {
                            "val": "26.812"
                        },
                        "BudgetYearOne": {
                            "val": "26.174"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.174"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "26.215"
                        },
                        "BudgetYearThree": {
                            "val": "26.690"
                        },
                        "BudgetYearFour": {
                            "val": "27.253"
                        },
                        "BudgetYearFive": {
                            "val": "27.586"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to advance machine intelligence, information operations, and operator-aiding technologies for advanced ISR capabilities. Research is focused in the following areas: human analyst augmentation, human trust and interaction, and human signatures. The human analyst augmentation area develops, integrates, and evaluates human-centric analyst technology to develop cognitive systems engineering solutions for airman data overload, work integration, and mission performance, enhancing operationally effective ISR for the Air Force. The human trust and interaction area seeks to advance human language technologies to benefit military linguists and analysts as well as to understand, quantify, and calibrate trust factors influencing airman interaction with autonomous systems that can be applied to airman-machine teaming in future weapon systems. The human signatures area develops and applies S&T to detect and exploit a variety of human-centered signatures, including behavioral and anthropometric aspects of existing and emerging adversaries as well as nano, bio, and molecular signatures of airman performance."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.333"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-Directed Effort"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Conduct research to enhance human components of ISR.  Develop ability to improve human analytic efficiency and effectiveness with fewer personnel and in increasingly complex mission space.  Develop the ability to improve human cognitive performance of the ISR weapon system through improved data exploitation and intelligence content synthesis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.672"
                                            },
                                            "Text": {
                                                "val": "Researched and developed human centric approaches to enhance ISR analysts' ability to attend to relevant intelligence data when coupled with autonomous systems and agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.172"
                                            },
                                            "Text": {
                                                "val": "Apply cognitive systems engineering research methods to airman-centered challenges surrounding contested environments to develop solutions for Air Force ISR analysts. Explore approaches to integrate semiautonomous machine analysis technologies into airman ISR analyst performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.269"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.269"
                                            },
                                            "Text": {
                                                "val": "Conduct research to understand factors that enable the Air Force's goal of full spectrum analysis, transitioning from individual analysts working a single intelligence source to exploiting multiple sources.  Develop new human-centered methodologies and analyst processes integrating semiautonomous analysis technologies to create robust analytic capacity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Conduct research in cross-cultural communication and automated speech translation tools for Air Force missions.  Conduct research to address important aspects of trust in airman-machine teams including investigating how an airman knows an autonomous or semiautonomous system is safe to use and whether the system, data, conclusions, and decision recommendations can be trusted."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.692"
                                            },
                                            "Text": {
                                                "val": "Developed guidelines for calibrated trust for symbiotic human-machine teaming.  Developed work aids that enable analysts to think more deeply and methodically about their problem space by accounting for contextual factors including culture, religion, governance, and economy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.084"
                                            },
                                            "Text": {
                                                "val": "Experiment with guidelines for calibrated trust for symbiotic airman-machine teaming.  Identify and study appropriate levels of transparency between airmen and automated systems.  Experiment with multiple language processing algorithms simultaneously to optimize system performance.  Evaluate current advances in machine processing for new militarily-relevant languages."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.188"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.188"
                                            },
                                            "Text": {
                                                "val": "Investigate trust between airmen and automation and airmen and robots to determine the appropriate levels of transparency in automatous and robotic systems.  Implement emerging machine processing approaches for militarily-relevant languages including mission and domain specific applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Signatures"
                                    },
                                    "Description": {
                                        "val": "Develop databases of human motion and features collected from air\/space platforms.  Identify human threat signatures across diverse populations for ISR and force protection applications.  Develop nano, bio, and molecular signatures of airman performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.555"
                                            },
                                            "Text": {
                                                "val": "Developed algorithms capable of reliably detecting and characterizing human signatures by leveraging multiple sensing modalities, from multiple platforms, for human threat situation awareness.  Developed sensors for novel molecular signatures for increased threat detection in an operational environment and human performance assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.223"
                                            },
                                            "Text": {
                                                "val": "Develop advanced molecular and genetic diagnostic methodologies to better assess airman performance.  Develop algorithm capable of reliably detecting and characterizing anthropometric signatures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.717"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.717"
                                            },
                                            "Text": {
                                                "val": "Exploit novel, non-invasive biomarkers in sweat and exhaled breath, develop selective capture elements for detection of these markers, and incorporate and test these to provide real-time feedback to operators.  Develop durable algorithm to provide persistent human detection and tracking throughout a single full motion video mission."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625329"
                    },
                    "ProjectTitle": {
                        "val": "Sensory Evaluation and Decision Science"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "37.267"
                        },
                        "PriorYear": {
                            "val": "37.443"
                        },
                        "CurrentYear": {
                            "val": "32.246"
                        },
                        "BudgetYearOne": {
                            "val": "31.539"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.539"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "31.739"
                        },
                        "BudgetYearThree": {
                            "val": "32.840"
                        },
                        "BudgetYearFour": {
                            "val": "33.516"
                        },
                        "BudgetYearFive": {
                            "val": "33.921"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to revolutionize the manner in which airmen optimize the capabilities of Air Force systems, including RPA and adaptive teams of airmen and machines.  Research optimizes airman situational awareness and cognitive performance, improves the airman-machine interface, and seamlessly integrates warfighters with their weapon systems across air, space, and cyber domains.  Research is conducted in four focus areas:  applied neuroscience; human role in semiautonomous systems; battlespace visualization; and battlespace acoustics.  The applied neuroscience area develops technologies to enhance airman-airman and airman-machine collaborations and system interactions in distributed decision-making environments.  The human role in semiautonomous systems area develops new control\/display concepts and technologies to optimize Air Force platform capabilities.  The battlespace visualization area advances the S&T associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making.  The battlespace acoustics area researches human-human and human-machine communications to exploit the use of voice and acoustic data in collaborative, net-centric environments while accounting for the effects of acoustic propagation."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed effort."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.333"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-directed effort"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Develop technologies to enhance airman performance, airman-airman, and airman-machine collaboration, and system interaction in distributed decision-making environments.  Conduct research to predict physiological impacts of high-stress\/extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.800"
                                            },
                                            "Text": {
                                                "val": "Investigated individual and team state sensing and assessment algorithms and methods to examine augmentation mitigation strategies leading to improved warfighter performance.  Developed team workload and trust models for autonomy, increased human performance monitoring, and performance improvement.  Identified stress-driven metrics and processes that influence human performance.  Defined neurophysiological, psychological, and genetic mechanisms and processes for developing guidelines to enhance warfighter cognitive resiliency and performance.  Applied physiology computational modeling methods to predict high-stress\/extreme environmental effects on the human.  Developed augmentation techniques for improving performance in operational environments that include human-machine teaming.  Investigated interface technologies and exposure design criteria to protect operators and mitigate injury and performance risks in current and future weapon systems.  Developed contamination sensor technology for on-board oxygen generation systems for hypoxia vulnerability risk mitigation.  Investigated new technologies for aircraft next generation on-board oxygen generation system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.515"
                                            },
                                            "Text": {
                                                "val": "Explore novel airman performance sensor and material solutions to increase sensing and assessing capabilities. Mature team workload and trust models for autonomy, increased airman performance monitoring, and performance improvement. Utilize knowledge of stress-driven metrics and processes to optimize airman performance. Apply neurophysiological, psychological, and genetic mechanisms and processes for developing guidelines to enhance airman performance and cognitive resiliency. Explore additional augmentation techniques such as supplementation and physical training for improving performance in operational environments that include airman-machine teaming. Apply interface technologies and exposure design criteria to protect airmen and mitigate injury and performance risks in current and future weapon systems. Refine physiology computational modeling methods to predict high-stress\/extreme environmental effects on airmen. Continue contamination sensor technology development for on-board oxygen generation systems for hypoxia vulnerability risk mitigation. Evaluate new technologies for aircraft next generation on-board oxygen generation system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.642"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.642"
                                            },
                                            "Text": {
                                                "val": "Begin development of an optimized sense and access suite of tools for enhanced airman performance in a laboratory environment.  Begin design of an adaptive aiding tool for team workload balancing for enhanced team performance.  Investigate distributed team mechanisms, techniques, and metrics for initial augmentation technology development.  Define target biomarkers and associated sampling techniques for the development of real-time biomarker sensor technology for human performance assessment.  Develop behavioral model of mechanisms of cognitive augmentation and stress resilience.  Begin development of full crewmember human response model to enhance aircrew performance in extreme stressor environments.  Investigate next generation aircraft injury exposure criteria for multi-axial injury model development for improved aircrew protection.  Investigate on-board oxygen generating system performance vulnerabilities affecting oxygen production.  Explore new ion transport membrane technologies for next generation on-board oxygen generating system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Research new control\/display concepts and technologies (e.g., information portrayal, control devices, decision-aiding algorithms).  Identify best design to direct operator attention."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.580"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and quantified the use of selected automation technologies and various tools to enable choices between courses of action for the command and control of multiple RPAs.  Integrated advanced visualization concepts and interaction methods for managing information from on- and off-board sources to support RPA operator decision-making into high-fidelity simulations for test and evaluation.  Performed advanced simulation of adjustable, adaptive levels of automation to support flexible control of unmanned systems depending on mission and environmental context."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.456"
                                            },
                                            "Text": {
                                                "val": "Integrate the current states of the platform, mission, environment, and airman operator into a global state database. Develop guidelines for interface design based upon computational problem solving method.  Investigate ways to represent autonomous system competency against the current task\/situation. Explore airman-autonomy teaming methods and metrics for Air Force applications. Perform advanced simulation of adjustable and adaptive automation to support flexible control of autonomous systems depending on mission and environmental context."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.180"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.180"
                                            },
                                            "Text": {
                                                "val": "Demonstrate effective deliberative-reactive control interaction methods of dynamic mission planning of heterogeneous multi-vehicle systems.  Integrate agent architecture to perform sense-making of human, vehicle, and environmental factors to enhance task performance and mission effectiveness.  Demonstrate real time adaptive airman-machine teaming and task allocation methods.  Develop and demonstrate communication-compensated distributed control methods for RPA and flexible weapon concepts.  Research and develop predictive, look-ahead tools for effects-based mission planning and execution.  Develop retrospective methods with integrated machine learning for personalized decision support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Visualization"
                                    },
                                    "Description": {
                                        "val": "Advances science and technology associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.391"
                                            },
                                            "Text": {
                                                "val": "Evaluated image enhancement and fusion techniques for improving human perception and performance.  Assessed visual analytics techniques for visualizing large, disparate data sets.  Investigated cyber operations visualization techniques for transforming numerical data into actionable information.  Explored decision aids for multisource fusion methods."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.973"
                                            },
                                            "Text": {
                                                "val": "Create cyber operations visualization techniques for transforming numerical data into actionable information. Develop and evaluate cyber operator system interfaces. Design decision aids for multisource fusion methods. Develop experimental test bed for more effective visualization of current and future sensor technologies. Prototype 3-D spatial viewers for mobile devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.474"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.474"
                                            },
                                            "Text": {
                                                "val": "Assess cyber operations visualization techniques for transforming numerical data into actionable information.  Continue the development and perform assessments of new cyber interfaces and visualization work aids for cyber defense, offense, and network health.  Test and evaluate decision aids for multisource fusion.  Assess preliminary geospatial viewers on mobile devices for improved operator performance by evaluating how to best present and interact with Special Operations data.  Initiate probabilistic human-centric visual target detection and recognition models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Conducts research on advanced auditory and communication technologies that mitigate effects of noise and enhance performance in operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.672"
                                            },
                                            "Text": {
                                                "val": "Validated auditory interfaces that enable the human operator to respond to cyber attacks through persistent auditory displays.  Optimized the use of multimodal displays and visualizations to communicate time critical information to distributed teams.  Validated the combined effectiveness of audio displays and multimodal interaction techniques to support human decision-making."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.969"
                                            },
                                            "Text": {
                                                "val": "Evaluate auditory interfaces that enable airmen to respond to cyber attacks through persistent auditory displays. Validate the use of multimodal displays and visualizations to communicate time-critical information to distributed teams. Enhance the combined effectiveness of audio displays and multimodal interaction techniques to support airman decision-making. Develop communication metrics of intent of communicators compared to receivers' understanding. Develop metrics of airman-machine communication to incorporate emotional context."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.243"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.243"
                                            },
                                            "Text": {
                                                "val": "Operationally demonstrate multimodal displays and visualizations to communicate time-critical information to distributed teams.  Assess the combined effectiveness of audio displays and multimodal interaction techniques to support airman decision-making.  Customize automatic speech recognition and generation models in developing interface technology for engagement with autonomous systems.  Optimize communication metrics of intent of communicators compared to receivers' understanding.  Optimize metrics of airman-machine communication to incorporate emotional context."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627757"
                    },
                    "ProjectTitle": {
                        "val": "Bioeffects"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "26.227"
                        },
                        "PriorYear": {
                            "val": "24.980"
                        },
                        "CurrentYear": {
                            "val": "26.617"
                        },
                        "BudgetYearOne": {
                            "val": "30.605"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.605"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "33.063"
                        },
                        "BudgetYearThree": {
                            "val": "36.342"
                        },
                        "BudgetYearFour": {
                            "val": "37.087"
                        },
                        "BudgetYearFive": {
                            "val": "37.632"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on the effects of human exposure to potentially toxic chemicals in the operational environment, advanced materials (including nanomaterials), EM energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons. This research addresses fundamental physical principles, as well as the psychophysical interaction between directed energy and the individual or groups of individuals.  Research is divided into three core focus areas:  optical radiation bioeffects; radio frequency radiation (RFR) bioeffects; and molecular bioeffects.  Optical radiation bioeffects research enhances combat survivability and systems effectiveness through technologies that enable deployed forces to counter optical threats and exploit optical systems for offensive applications.  The RFR bioeffects research investigates basic biological mechanisms of RFR, conducts theoretical and empirical dosimetry, conducts research of bioeffects from short- and long-term exposures, develops methods to counter RFR threats, and performs research for exploitation of directed energy systems for offensive capabilities.  Molecular bioeffects research is conducted to protect Airmen from the effects of toxic chemicals and materials to include nanomaterials and other advanced development products and to discover novel biomarkers and molecular mechanisms to support personalized training, performance and protection of Airman cognitive and physical performance using advanced sense, assess and augment technologies."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research on laser bioeffects, enabling military exploitation of laser technology while providing countermeasures for optical hazards\/threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.990"
                                            },
                                            "Text": {
                                                "val": "Integrated components of engagement-level simulations for laser bioeffects into broader DoD modeling and simulation products for the purpose of mission-level and campaign level models.  Initiated studies to evaluate bioeffects, protection needs, and collateral effects of emerging directed energy systems concepts.  Completed data collection for currently identified optical radiation damage and transient vision effects for use in next-generation of standardized personnel vulnerability models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.181"
                                            },
                                            "Text": {
                                                "val": "Complete development of scalable effects simulation tool. Complete new standardized methodology for evaluation of laser devices that cause glare effects in multiple environments. Integrate probabilistic model of individual observer within overall modeling and simulation architecture for evaluating laser collateral effects. Complete integration of new distributed simulation standard into modeling and simulation components to enable risk-based assessment of personnel effects within real-time weapons concept exercises with other Air Force and DoD research organizations. Complete data collection for currently identified optical radiation damage and transient vision effects for use in next generation of standardized personnel vulnerability models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.991"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.991"
                                            },
                                            "Text": {
                                                "val": "Expand research into pulse laser damage mechanisms for collateral hazard assessment of new high energy laser systems under development.  Continue development of scalable effects simulation tool for solid state continuous wave lasers.  Integrate probabilistic assessment using dose-response methodologies for realistic laser exposure scenarios.  Initiate development of glare assessment models that consider retinal pigmentation, dynamic background, and ocular scatter. Conduct studies to define impact of laser eye protection on performance and potential mitigation strategies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research to enable safe exploitation of directed energy technologies for communication, target identification, and weapons development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.665"
                                            },
                                            "Text": {
                                                "val": "Conducted empirical laboratory tests on the human behavioral response to combined effects of directed energy sources.  Investigated high peak power human performance effects.  Explored whole-body biological effects of directly applied ultra-short pulses.  Determined effects of RF overexposure on neurological tissue."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.225"
                                            },
                                            "Text": {
                                                "val": "Determine the impact of fast thermal gradients on neurological cells. Conduct empirical studies to verify computational tool for radio frequency-induced bio-thermal response. Validate radio frequency dosimetry suite for broad power and frequency range to support next generation high peak power dose determinations. Perform empirical and modeling studies to investigate the feasibility of using short pulse radio frequency energy for standoff membrane poration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.131"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.131"
                                            },
                                            "Text": {
                                                "val": "Evaluate effects of whole body fast thermal gradients.  Refine bioeffects approach to analyze effects of short pulse radio frequency energy.  Finalize validation of dosimetry suite covering broad power and frequency range to support next-generation counter-electronic weapons and high power microwave smart weapons."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Molecular Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct novel toxicology, nanotechnology and cognitive research to protect Airmen health and to augment Airman performance in diverse operational environments. Conduct studies to assess human responses to non-lethal weapons and effects\/risks of these weapons.  Leverage toxicological\/biological data to improve airman performance and decision-making abilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.325"
                                            },
                                            "Text": {
                                                "val": "Advanced toxicity and nanotoxicity research; investigated\/established toxicity impacts to selected organ systems in the body of advanced fuels, materials, and chemicals used to support existing and future weapon systems.  Defined and pursued modulation of major cell pathways affecting human performance using in vitro and in vivo models and modeling and support human studies of the same.  Conducted research to define toxicity issues in current and future aircraft environments.  Began development of models incorporating toxicity data and mechanisms of action to inform sensor development and development of real-time sensing of pilot and hazard protection of ground crews.  Conducted research to understand novel mechanisms of fundamental interaction of nanomaterials in a biological system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.211"
                                            },
                                            "Text": {
                                                "val": "Conduct research to define toxicity issues in current and future aircraft environments.  Pursue development and application capabilities of biomarkers for short-and long-term exposure modeling for existing and emerging militarily-relevant chemicals and materials.  Conduct and develop novel research studies to elucidate mechanisms of fundamental interaction of nanomaterials in biological systems. Continue research to identify novel molecular mechanism and predictive biomarkers in connection with Airman state changes under diverse military relevant conditions for Airman health and performance sensing, assessment and augmentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.483"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.483"
                                            },
                                            "Text": {
                                                "val": "Advance knowledge and capability to complete analysis of aerospace fluid(s) toxicity characterization and impacts on high performance aircraft operators to best reduce Airmen health risk and Air Force mission risk.  Characterize and examine novel mechanisms of fundamental interaction of nanomaterials in a biological system to best understand exposure effects on the Airman.  Examine molecular mechanism of cognitive performance in physically or mentally intensive operational environments for the development of effective and safe strategies to protect, optimize and augment Airman performance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}