{
    "id": "ab88f805dc814917d4bb0ee7abc60da47ab932f6",
    "meta": {
        "filename": "dod-2017_RDTE_2017_MDA_U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603176C"
        },
        "ProgramElementTitle": {
            "val": "Advanced Concepts and Performance Assessment"
        },
        "R1LineNumber": {
            "val": "28"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "6.919"
            },
            "PriorYear": {
                "val": "9.999"
            },
            "CurrentYear": {
                "val": "12.139"
            },
            "BudgetYearOne": {
                "val": "17.880"
            },
            "BudgetYearOneBase": {
                "val": "17.880"
            },
            "BudgetYearTwo": {
                "val": "12.599"
            },
            "BudgetYearThree": {
                "val": "12.897"
            },
            "BudgetYearFour": {
                "val": "13.004"
            },
            "BudgetYearFive": {
                "val": "13.221"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The FY 2017 increase funds post-test and planned data replay simulation events, hardware in the loop (HWIL) infrastructure, high performance computing infrastructure upgrade, as well as test costs required for performance assessments for the Aegis Launch-on-Remote live fire test (FEV-1) and the advanced sensor demonstration (FEV-2)."
        },
        "ProgramElementMissionDescription": {
            "val": "Advanced Concepts & Performance Assessments MD71 program delivers an integrated government concept definition, simulation, and analysis capability and centralizes assessment of advanced ballistic missile defense technology.  Delivering insight into the performance of proposed concepts extends MDA's ability to address evolving threats for the warfighter.\n\nSubject matter experts provide independent assessments of government, university, and industry technology concepts, used in concert with systems engineering requirements to support acquisition strategy decisions and define technology focus areas.  The innovative structured concept definition and assessment methodology enables the MDA to quickly validate focus areas, verify contractor technology solutions, and evaluate promising concepts in future Ballistic Missile Defense System (BMDS) architectures.   This methodology significantly enhances the MDA's ability to assess technology concepts while decreasing the cost of the development through:\n- Independent model-based simulations of industry technology concepts to inform systems engineering process\n- Digital simulation and hardware-in-the-loop performance assessments of algorithms and hardware concepts prior to expensive live fire test events\n- End-to-end testing of technology concepts integrated with weapon systems and Command, Control, Battle Management and Communications \n\nPerformance assessment of advanced concepts incorporates Better Buying Power philosophy in the earliest stages of technology development to maximize technology investments with minimal investment.\n\nMD40 Program-Wide Support (PWS) consists of essential non-headquarters management efforts providing integrated and efficient support to MDA functions and activities across the entire BMDS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.470"
                },
                "CurrentYear": {
                    "val": "12.139"
                },
                "BudgetYearOne": {
                    "val": "13.227"
                },
                "BudgetYearOneBase": {
                    "val": "13.227"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.999"
                },
                "CurrentYear": {
                    "val": "12.139"
                },
                "BudgetYearOne": {
                    "val": "17.880"
                },
                "BudgetYearOneBase": {
                    "val": "17.880"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.529"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.653"
                },
                "BudgetYearOneBase": {
                    "val": "4.653"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.670"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.141"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.653"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.653"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 adjustment reflects realignment of Department of Defense priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD71"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Concepts and Performance Assessments"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "6.919"
                        },
                        "PriorYear": {
                            "val": "9.539"
                        },
                        "CurrentYear": {
                            "val": "11.569"
                        },
                        "BudgetYearOne": {
                            "val": "17.298"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.298"
                        },
                        "BudgetYearTwo": {
                            "val": "11.988"
                        },
                        "BudgetYearThree": {
                            "val": "12.242"
                        },
                        "BudgetYearFour": {
                            "val": "12.336"
                        },
                        "BudgetYearFive": {
                            "val": "12.524"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "Advanced Concepts & Performance Assessment centralizes all advanced technology concept modeling, simulation, software, and analysis.  Integrating models of promising technical solutions into BMDS system-level simulations enables leadership to make data driven acquisition and technology investment decisions.\n\nAdvanced Concepts & Performance Assessment capitalizes on the innovation of small business, universities, Federally Funded Research and Development Centers, and University Affiliated Research Centers to pursue a broad range of hardware, software, models, algorithms, trade studies and analysis.  These innovations bring together government developed models representing existing and future ballistic missile defense architectures, technology concepts, and advanced algorithms to provide detailed assessments of concept performance to make investment decisions. \n\nThese innovations, combined with a robust high performance computing infrastructure, provide a unique in-house government capability to demonstrate and assess technology concepts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Description": {
                                        "val": "Advanced Concepts and Performance Assessment's diverse staff of subject matter experts developed advanced concepts across the broad spectrum of ballistic missile defense technology initiatives.\n-Prioritize technology investments and inform requirements\n-Analyze and evaluate industry sensor and kill vehicle concepts\n-Develop and extend modeling techniques \n-Demonstrate concept performance against evolving threats"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.539"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Worked with the Ballistic Missile Defense System (BMDS) Architect and MDA Systems Engineer to provide realistic assumptions, design concepts, models and assessments for technology items included within the future BMDS, elements, and component concepts\n-Provided technology concepts, models and assessments for kill vehicles, discrimination sensors, space alternatives and directed energy systems\n-Matured tracking, discrimination, and sensor fusion algorithms \n-Demonstrated precision track through simulation exercises\n-Accelerated assessment of hardware and algorithms for space alternative sensors\n-Focused research and engineering activities from university and small business partners to identify suitable technology and concepts that improve BMDS performance through a rapid innovation model based engineering test bed \n-Reduced time to translate innovative technology into BMDS capability by providing integrated models of emerging concepts that characterize key parameters and expected performance"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.569"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Increase from FY 2015 to FY 2016 funds upgrades to the digital simulation and hardware-in-the-loop (HWIL)infrastructure required to move from Multi-Spectral Targeting System (MTS)-B to MTS-C hardware and airborne processor software prior to Standard Missile -3 Flight Test Standard Missile-01 (SFTM-01), Controlled Test Vehicle (CTV-02+) flight test, and Aegis Launch-on-Remote live fire test (FTM FEV-1) missions\n-Build the digital simulation and hardware in the loop infrastructure required for testing of the MTS-C and airborne processor software prior to Standard Missile -3 Flight Test Standard Missile-01 (SFTM-01), Controlled Test Vehicle (CTV-02+)flight test, and Aegis Launch-on-Remote live fire test (FTM FEV-1) test missions\n-Work with the BMDS Architect and MDA Systems Engineer to design concepts, build models and assess technology concepts for the future BMDS\n-Analyze discrimination sensor flight tests\n-Conduct HWIL tests\n-Develop modular open kill vehicle architecture testbed \n-Mature tracking, discrimination, and sensor fusion algorithms \n-Demonstrate precision track through digital and HWIL simulation exercises\n-Focus research and engineering activities from university and small business partners to identify suitable technology and concepts that improve BMDS performance through a rapid innovation model based engineering test bed \n- Reduce time to translate innovative technology into Ballistic Missile Defense System (BMDS) capability by providing integrated models of emerging concepts that characterize key parameters and expected performance"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.298"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.298"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increase from FY 2016 to FY 2017 funds post-test and planned data replay simulation events, hardware in the loop (HWIL) infrastructure, high performance computing infrastructure upgrade, as well as test costs required for performance assessments for the Aegis Launch-on-Remote live fire test (FEV-1) and the advanced sensor demonstration (FEV-2).\n\n-Define and analyze sensor discrimination capability using  flight test data\n- Mature tracking, discrimination, and sensor fusion algorithms for multi-phenomenology sensor platform\n-Demonstrate end-to-end correlation of sensor track and discrimination data through digital and hardware-in-the-loop simulation exercises\n-Conduct performance analysis of government and industry Multi-Object Kill Vehicle and low-power and multi-kilowatt directed energy concepts \n-Incrementally demonstrate contribution to BMD for  launch-on-remote, engage-on-remote, discrimination, and handover improvements for  next-generation sensors and kill vehicle concepts\n-Demonstrate ruggedized deployable virtual testbed to provide onsite assessment of flight test data in near real-time \n-Implement modular open kill vehicle architecture testbed to verify industry concepts\n-Accelerate development of hardware in the loop (HWIL) infrastructure required for assessment and testing of advanced sensor and directed energy concepts in preparation for FY18 concept demonstrations.\n-Update High Performance Computing infrastructure to improve security and performance of concept assessment models and simulations\n-Work with the BMDS Architect and MDA Systems Engineer to design concepts, build models and assess technology concepts for the future BMDS\n-Focus research and engineering activities from university and small business partners to identify suitable technology and concepts that improve BMDS performance through a rapid innovation model based engineering test bed"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603177C"
                                    },
                                    "Title": {
                                        "val": "Discrimination Sensor Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.223"
                                        },
                                        "CurrentYear": {
                                            "val": "28.200"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603178C"
                                    },
                                    "Title": {
                                        "val": "Weapons Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "61.396"
                                        },
                                        "CurrentYear": {
                                            "val": "51.153"
                                        },
                                        "BudgetYearOne": {
                                            "val": "71.843"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "71.843"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "69.004"
                                        },
                                        "BudgetYearThree": {
                                            "val": "53.745"
                                        },
                                        "BudgetYearFour": {
                                            "val": "66.400"
                                        },
                                        "BudgetYearFive": {
                                            "val": "67.487"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603180C"
                                    },
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.476"
                                        },
                                        "CurrentYear": {
                                            "val": "17.364"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.433"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.433"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "19.870"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.529"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.131"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.494"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603294C"
                                    },
                                    "Title": {
                                        "val": "Common Kill Vehicle Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24.836"
                                        },
                                        "CurrentYear": {
                                            "val": "61.753"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603904C"
                                    },
                                    "Title": {
                                        "val": "Missile Defense Integration and Operations Center (MDIOC)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "53.972"
                                        },
                                        "CurrentYear": {
                                            "val": "47.939"
                                        },
                                        "BudgetYearOne": {
                                            "val": "54.750"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "54.750"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "53.894"
                                        },
                                        "BudgetYearThree": {
                                            "val": "55.524"
                                        },
                                        "BudgetYearFour": {
                                            "val": "58.100"
                                        },
                                        "BudgetYearFive": {
                                            "val": "59.029"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Advanced Concepts and Performance Assessment acquisition strategy continues a successful partnership with Small Business, the Aviation & Missile Research Development & Engineering Center, Federally Funded Research and Development Centers, and University Affiliated Research Centers to provide concept modeling and assessment capability. This innovative strategy leverages agency and partner subject matter experts and government model-based assessments to inform Better Buying Power acquisition decisions."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.460"
                        },
                        "CurrentYear": {
                            "val": "0.570"
                        },
                        "BudgetYearOne": {
                            "val": "0.582"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.582"
                        },
                        "BudgetYearTwo": {
                            "val": "0.611"
                        },
                        "BudgetYearThree": {
                            "val": "0.655"
                        },
                        "BudgetYearFour": {
                            "val": "0.668"
                        },
                        "BudgetYearFive": {
                            "val": "0.697"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "PWS contains non-headquarters management costs in support of MDA functions and activities across the entire BMDS.  It Includes Government Civilians, and Contract Support Services.  This provides integrity and oversight of the BMDS as well as supports MDA in the development and evaluation of technologies that will respond to the changing threat. Additionally, PWS includes Global Deployment personnel and support performing deployment site preparation and activation and, provides facility capabilities for MDA Executing Agent locations.  Other MDA wide costs includes:  physical and technical security; civilian drug testing; audit readiness; the Science, Technology, Engineering, and Mathematics (STEM) program; legal services and settlements; travel and agency training; office, equipment, vehicle, and warehouse leases; utilities and base operations; data and unified communications support; supplies and maintenance; materiel and readiness and central property management of equipment; and similar operating expenses. PWS is allocated on a pro-rata basis and therefore, fluctuates by year based on the adjusted RDT&E profile (which excludes: 0305103C Cyber Security Initiative, 0603274C Special Programs, 0603913C Israeli Cooperative Program and 0901598C Management Headquarters)."
                        }
                    }
                }
            ]
        }
    }
}