{
    "id": "aeca7ad68b43c7384cfe1ee3ee498023e9413e2a",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603788F"
        },
        "ProgramElementTitle": {
            "val": "Battlespace Knowledge Development and Demonstration"
        },
        "R1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "34.338"
            },
            "CurrentYear": {
                "val": "46.196"
            },
            "BudgetYearOne": {
                "val": "58.110"
            },
            "BudgetYearOneBase": {
                "val": "58.110"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "61.169"
            },
            "BudgetYearThree": {
                "val": "63.984"
            },
            "BudgetYearFour": {
                "val": "64.044"
            },
            "BudgetYearFive": {
                "val": "60.224"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates Air Force enterprise-centric information technologies for the warfighter. The Global Battlespace Awareness project develops, integrates, and demonstrates advanced technologies to achieve comprehensive net-centric operations and total battlespace awareness by using and exploiting information from all sources. The Assured Worldwide Connectivity project provides advanced net-enabled architectures and communications technologies in support of global military operations, including a secure information grid for worldwide information exchange of near-real-time multimedia (i.e., voice, data, video, and imagery) information. In addition, this project develops and demonstrates advanced optical networking and communications for Air Force air and space-based information exchange on and between platforms. These optical networks will be rapidly deployable, mobile, interoperable, and seamless between Air and Space Operations Centers (AOCs) and air and space- based platforms either en route or in theater. This project also provides tools and applications leading to the development and integration of cyber deterrence technologies resulting in a strategic capability of cyber dominance within the secure information grid. The Knowledge Management and Computing project develops the technology applications that will provide for a secure, tailored, seamless exchange of information among producers, consumers, and managers of information relevant to a particular community of interest (COI). The project also provides the development of interactive and real-time computing technologies that greatly improve the usability of high performance computing for the exchange, utilization, and management of information in the enterprise. The Anticipatory Operations Intent and Response project develops the technologies for dynamic planning and execution with the accuracy, fidelity, and timeliness needed to dominate the battlespace. This program has been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.\n\nStarting in FY 2017 to improve reporting to Congress, Project 635329, Cyber Battlespace Dev & Demo was created to capture all cyber activity that was previously performed in this program.  \n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "35.289"
                },
                "CurrentYear": {
                    "val": "46.414"
                },
                "BudgetYearOne": {
                    "val": "52.042"
                },
                "BudgetYearOneBase": {
                    "val": "52.042"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "34.338"
                },
                "CurrentYear": {
                    "val": "46.196"
                },
                "BudgetYearOne": {
                    "val": "58.110"
                },
                "BudgetYearOneBase": {
                    "val": "58.110"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.951"
                },
                "CurrentYear": {
                    "val": "-0.218"
                },
                "BudgetYearOne": {
                    "val": "6.068"
                },
                "BudgetYearOneBase": {
                    "val": "6.068"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.218"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.116"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.165"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "6.068"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.068"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2017 is due to increased DoD emphasis on high-speed data link technology."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635319"
                    },
                    "ProjectTitle": {
                        "val": "Anticipatory OPS Intent and Response"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.265"
                        },
                        "CurrentYear": {
                            "val": "3.635"
                        },
                        "BudgetYearOne": {
                            "val": "3.562"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.562"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.602"
                        },
                        "BudgetYearThree": {
                            "val": "6.144"
                        },
                        "BudgetYearFour": {
                            "val": "6.267"
                        },
                        "BudgetYearFive": {
                            "val": "6.392"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "In order to achieve information dominance, the Air Force must be able to monitor, assess, plan, and execute missions rapidly across the full spectrum of operations (air, space, and cyberspace) at all levels of war (strategic, operational, and tactical) and during all phases of conflict (pre-conflict, conflict through stability operations). This project develops and integrates decision support technologies that will enhance the commander's ability to anticipate and dominate the future battlespace by more effectively forecasting the evolution of the battlespace and by more rapidly generating options to \"virtually checkmate\" the adversary. It develops the decision aid technologies and processes to plan the use of various assets and assess their effects in the battlespace. It provides a tailorable information environment to effectively portray complex data sets accurately in real-time."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive Planning and Decision Tools"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate the integration of planning tools and information-based intelligent agents for adaptive replanning and decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.584"
                                            },
                                            "Text": {
                                                "val": "Designed and developed a set of planning tools and services that proactively build and shape the portion of cyberspace employed in support of mission assurance objectives. Developed a moving target defense specification for integration into a Command and Control (C2) mission assurance framework. Continued development and experimentation of net-centric mission planning and execution concepts to provide a net-enabled dynamic decision support capability for a variety of air, space and cyber missions. Generated optimized means of synchronizing cross-domain effects while respecting hard and soft constraints within and across domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.231"
                                            },
                                            "Text": {
                                                "val": "Prototype a mission assurance framework and integrated service oriented architecture for a set of planning tools and services that proactively build and shape the portion of cyberspace employed in support of mission assurance objectives. Demonstrate net-centric mission planning and execution concepts to support a net-enabled dynamic decision support capability for a variety of air, space and cyber missions in support of combined, global operations. Validate the ability to synchronize efforts across warfighting domains (air, space, cyber, land and maritime) to create desired effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.606"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.606"
                                            },
                                            "Text": {
                                                "val": "Continue planned work in real-time course of action generation and prioritization, extensible C2 framework modernizing JSpOC operations, advanced indications and warning tipping C2 system for proactive countermeasure actions and visualization of the complete electromagnetic spectrum for enhancing Joint Space Operations Center (JSpOC) decision making. Initiate effort for Distributed Operations in a Contested Environment. Create and use scenarios and evaluation metrics for integrated demonstration and testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Planning and Assessment Tools"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an effects-based approach for the next generation of planning and assessment techniques that enable decision makers to determine operational effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.681"
                                            },
                                            "Text": {
                                                "val": "Completed development of tools in machine learning for patterns of life generation. Demonstrated capabilities to rapidly and systematically decompose commander's intent into a set of measurable effects that result from actions taken in multiple domains (air, space, and cyber)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.404"
                                            },
                                            "Text": {
                                                "val": "Develop links and tools to effectively employ cyber, directed energy and electronic warfare weaponry within a target folder environment. Provide a set of models that will give targeteers greater comprehension of the second and third order effects of targeting actions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.956"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.956"
                                            },
                                            "Text": {
                                                "val": "Initiate the subsequent development and demonstration of capabilities that utilize a mixture of analytics and visualization methods to determine progress relative to the achievement of objectives and end states. Initiate the development and demonstration of capabilities that provide ability to make actionable recommendations to assist the strategy division in identifying resource constraints, adversary actions, rules of engagement restrictions, and realignment of forces to assure commander’s intent is met."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635320"
                    },
                    "ProjectTitle": {
                        "val": "Assured Worldwide Connectivity"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.768"
                        },
                        "CurrentYear": {
                            "val": "25.190"
                        },
                        "BudgetYearOne": {
                            "val": "20.837"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.837"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "22.813"
                        },
                        "BudgetYearThree": {
                            "val": "19.717"
                        },
                        "BudgetYearFour": {
                            "val": "16.636"
                        },
                        "BudgetYearFive": {
                            "val": "13.208"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires advanced net-enabled architectures and communications technologies in support of global kinetic and non-kinetic military operations including a secure information grid for worldwide information delivery and exchange of near-real-time information including voice, data, video, and imagery.  This secure environment will be rapidly deployable, mobile, interoperable, and seamless between AOC and aircraft, either en route or in theater.  This project provides secure information transmission capabilities for a persistent, global, survivable communications backbone network accessible for warfighters operating in all domains. It provides self-healing, self-configuration, anti-jam communication networking capabilities, and provides enterprise networking capabilities for agile, policy-based network management.  In addition, this project develops and demonstrates flight ready systems consisting of high capacity radio frequency (RF) and optical components and architectures for next generation communications.  The Air Force also requires the ability to deliver sovereign options in cyberspace through the development and integration of cyber attack, cyber defense, and cyber support technologies for a strategic capability of cyber dominance.  This project develops the ability to deliver cyber attack capabilities (access, stealth and persistence, cyber intelligence, and weapons delivery), cyber defense capabilities (attack detection, attack attribution, and response automation), and cyber support capability (situational awareness and war gaming.)\n\nStarting in FY 2017 cyber work previously performed within this project will be reported under Project 635329, Cyber Battlespace Dev & Demo."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Offense"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate offensive cyber operations capabilities in a series of experimental technology demonstrations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.671"
                                            },
                                            "Text": {
                                                "val": "Continued development and delivery of a capability which processes available cyber observables to deliver operational preparation of the environment information vital to the warfighter.  Continued development of a highly configurable cyber simulation environment which produces high fidelity cyber telemetry for analysis. Continued assessment of military objectives for places where non-kinetic solutions can aid kinetic missions and enhance technologies for military relevant environments. Continued development of technologies to remain current with new waveforms and signals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.543"
                                            },
                                            "Text": {
                                                "val": "Merge next generation cyber operations technologies with other relevant military programs and demonstrate enhanced capabilities that allow non-kinetic capabilities to aid kinetic missions. Develop technologies to remain current with new waveforms and signals. Continue Service Oriented Architecture component development for use in the Air Force Lifecycle Management Center (AFLCMC) Cyber Mission Platform (CMP). Schedule final delivery and demonstration of the highly configurable cyber simulation environment which produces network traffic annotated with high fidelity cyber telemetry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2017, the work for this effort will be performed under Project 635329, Cyber Battlespace Dev & Demo in an effort of the same name."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Connectivity Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate intelligent networking transport and management technology to provide assured, seamless, battlespace connectivity to the Air Force tailored to anti-access\/area denial environments and contested operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.742"
                                            },
                                            "Text": {
                                                "val": "Continued development of a network level encryption and traffic-aware router, which allow enclaves  at different security levels to share a common network. Demonstrated interference-tolerant waveform design, dissemination and utility on portable radio platform. Developed decentralized control algorithms and protocols for radio networks that optimally allocate resources from the bottom to higher layers of the protocol stack. Continued development of key technologies to be demonstrated in the laboratory using the software definable radio testbed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.295"
                                            },
                                            "Text": {
                                                "val": "Continue the development of a network level encryption and traffic-aware router, allowing enclaves at different security levels to share common network. Continue research to push the limits of technologies that improve the Aerial Layer Networks used by the Air Force. Develop optimal universal waveform sets for multipath multi-access communications. Initiate the integration, test & evaluation, and demonstration of an integrated version of the capabilities developed under this program. Perform an advanced technology demonstration of key technologies on tactical software radios."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.837"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.837"
                                            },
                                            "Text": {
                                                "val": "Continue to develop a Compact Rugged High assurance Crypto-Router with Network. Continue to develop a set of domain specific ontologies, extractors, relevancy assessment rule sets, mission templates and interfaces to support an operationally relevant Limited Technology Experiment (LTE). Demonstrate the next-generation wireless communications and networking technology. Demonstrate public key infrastructure (PKI)-enabled authentication services to enable task submission from authenticated enterprise consumers. Initiate the development and transition of a componentized building-block approach for a modular upgradable design for rapid waveform development of multi-mission radio frequency (RF) capability. Initiate the development of high-speed data link technology in line with DoD emphasis areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resiliency"
                                    },
                                    "Description": {
                                        "val": "Integrate and demonstrate a resilient and self-regenerating information enterprise that dynamically recognizes, characterizes, and understands novel cyber attacks and reconfigures and self-optimizes to resist new attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.011"
                                            },
                                            "Text": {
                                                "val": "Continued the enhancement, maturation, testing, and demonstration of cyber agility technologies through exercises and other user-focused venues.\nDeveloped semantic models for discovering and managing conflicts, dependencies, and cascading terminology alterations in DoD-wide Joint Doctrine and U.S. Transportation Command (USTRANSCOM)\/JSpoC mission implementations. Developed plans for bridging domain and DoD doctrinal models for information relationships extrtactions. Demonstrated SecureServe capabilities at the virtual machine (VM) and hypervisor level to the AFLCMC Transition Agent (AFLCMC\/HBB). Provided initial research into current state of the art of open source technologies of steganographic and malware-based technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.247"
                                            },
                                            "Text": {
                                                "val": "Continue developing techniques to allow rapid analytical assessments of mission-mapped information, enhancing mission monitoring and mission assurance capabilities to conform and interoperate with DoD standards. Continue developing mature doctrinal representations for cross-DoD mission ontologies and use cases. Continue developing SecureServe to include updating and enhancing VM communication channels, network monitoring, failover, snapshot, and migration. Integrate the dynamic attestation prototype into the SecureServe baseline. Continue development and evaluation of an agile, modular, and pluggable framework for integration of open source algorithms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2017, the work for this effort will be performed under Project 635329, Cyber Battlespace Dev & Demo in an effort of the same name."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Effects-based Cyber Defense"
                                    },
                                    "Description": {
                                        "val": "Integrate technology to demonstrate an effects-based strategic approach to cyber defense that focuses on avoiding, deterring, and minimizing the threat, and rendering the adversary ineffective."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.344"
                                            },
                                            "Text": {
                                                "val": "Continued development and performance analysis of new enhancement for insertion into active steganalysis product."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.105"
                                            },
                                            "Text": {
                                                "val": "Complete the development and demonstration of new enhancements into the active steganalysis product. Initiate research into novel resiliency technologies to package into an adaptive systems solution. Complete the initial prototyping of defensive cyber deception technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2017, the work for this effort will be performed under Project 635329, Cyber Battlespace Dev & Demo in an effort of the same name."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635321"
                    },
                    "ProjectTitle": {
                        "val": "Global Battlespace Awareness"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.709"
                        },
                        "CurrentYear": {
                            "val": "12.165"
                        },
                        "BudgetYearOne": {
                            "val": "8.425"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.425"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.017"
                        },
                        "BudgetYearThree": {
                            "val": "12.874"
                        },
                        "BudgetYearFour": {
                            "val": "14.616"
                        },
                        "BudgetYearFive": {
                            "val": "14.908"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force must be able to process and exploit data and information from a variety of sources and domains to create a common operating picture of the battlespace to allow commanders to maintain information dominance.  This project develops, integrates, and demonstrates advanced technologies to achieve comprehensive net-centric operations and Predictive Battlespace Awareness using information from all sources.  Technology development includes:  tasking information collectors, such as intelligence, surveillance, and reconnaissance (ISR) platforms, national intelligence sources, etc; correlating and geo-registering the collected data; exploiting the data to extract information of military significance; fusing information from multiple sources to create a digital-and-dimensional representation of the battlespace; assessing the situation; predicting adversary COA; and archiving the results for ready use by decision-makers.  This is a dynamic, complex process that involves technologies for information exploitation, fusion, processing, storage, and retrieval, as well as technologies for machine reasoning, pattern recognition, and timeline analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Signal and Data Exploitation Technologies"
                                    },
                                    "Description": {
                                        "val": "Demonstrate advanced signal and data exploitation technologies for detection, tracking, identification, and targeting of time-critical targets, and information extraction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.284"
                                            },
                                            "Text": {
                                                "val": "Developed technologies which enhanced electronic signals intelligence (ELINT) detection and processing capabilities against emerging emitter weapon systems. Explored signals intelligence (SIGINT), communications intelligence (COMINT) and other intelligence signal exploitation for contested environments. Continued the development of speech processing algorithm investigations that improved feature extraction techniques, speed and efficiency of training\/testing algorithms, and classifiers that aid in improvements to component technologies.  Developed and performed an analysis of new enhancement which were inserted into active steganalysis products. Developed technologies that maintained currency with new waveforms and signals. Researched and developed full motion video object of interest signature detection and exploitation algorithms. Continued development of multi-source intelligence (multi-INT) correlation approaches. Investigated and developed techniques which improved the motion imagery capabilities. Continued the development of automated capabilities which exploited signals of interest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.454"
                                            },
                                            "Text": {
                                                "val": "Refine and test technologies to enhance ELINT detection and processing capabilities against emerging emitter weapon systems. Develop strategies for multi-INT exploitation. Investigate algorithms that can improve upon the audio prioritization capabilities, improvements to detection and correction methods, and mitigation techniques for modeling differences. Complete new enhancements and insert them into active steganalysis products. Develop technologies to remain current with new waveforms and signals. Integrate full motion video object of interest detection and exploitation algorithms with multi-INT correlation algorithms and demonstrate the capability. Integrate enhanced motion imagery capabilities with existing imagery exploitation tools. Continue the development of automated capabilities to exploit signals of interest."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.016"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.016"
                                            },
                                            "Text": {
                                                "val": "Continue to refine and test technologies for ultra-wideband ELINT signal detection and prosecution. Continue planned development of data association\/curation from historical analysis, multi-INT discovery, and entity resolution for contested environments. Develop and implement speaker similarity tagging to improve model generation, cohort detection methods, and prioritization methods based on acoustics, radio traffic, keywords, and metadata."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Data Handling, Visualization and Distributed Data Fusion"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced data handling, event visualization technologies, and distributed data fusion to enable a more effective utilization of data available."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.354"
                                            },
                                            "Text": {
                                                "val": "Continued analysis of recorded multi-intelligence test data with developed algorithms.  Applied object based processing and activity based intelligence tradecraft to selected domains and intelligence problems. Developed approaches of filtering multi-intelligence data for ingestion into machine learning approaches for the purpose of event discovery. Matured capabilities to provide graph-based approaches for handling large and complex relationships observed across various sources. Delivered automatic optimization of tracking algorithms across sensors, modes, and regions. Migrated tools and data to distributed (cloud) computing to extract additional performance gains. Completed an improved cross domain solution independent file filtering capability within Cross Domain Solution (CDS) systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.092"
                                            },
                                            "Text": {
                                                "val": "Continue the application of object based processing and activity based intelligence tradecraft to selected domains and intelligence problems. Transition advanced activity-based intelligence (ABI) tools with built-in optimization tailored against operator objectives to National Air and Space Intelligence Center and National Geospatial-Intelligence Agency. Continue developing, demonstrating, and transitioning technology solutions for automated recognition of indicators to associate potential and emerging threats against Blue assets. Continue developing computational capabilities that automate the decision-making process and that encompass sensing, data mining and analysis, information extraction and understanding, and activity recognition. Continue the development of technologies to create activity based intelligence from motion data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.118"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.118"
                                            },
                                            "Text": {
                                                "val": "Continue the planned development of automated detection and recognition of indicators that associate threats against blue forces in multiple domain.  Continue to develop near real time data mining and  analysis capabilities by incorporating automated  knowledge discovery, modeling and reasoning, and data fusion, exploitation and processing. Plan for forthcoming delivery of baseline advanced ABI toolkit. Complete multi-source\/multi-INT raw data collection experiment at the Stockbridge Site in Rome, NY. Prepare to evaluate distributed multiple multi-INT Processing, Exploitation and Dissemination (PED) software framework capabilities compared to current methods for multi-INT data mining, correlation and fusion analytics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Text Exploitation"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate capabilities for reasoning and learning, text understanding, link and group discovery, and advanced analysis for situational awareness and understanding."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.178"
                                            },
                                            "Text": {
                                                "val": "Continued the development of cross-document co-reference capability integrated into document processing pipeline. Continued the development of web-based Text Exploitation and Analysis framework."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.724"
                                            },
                                            "Text": {
                                                "val": "Continue developing cross-document co-reference capability integrated into document processing pipeline. Continue developing web-based Text Exploitation and Analysis framework.  Initiate research and development for plug and play modules for deeper text understanding and large scale, time dependent, network based analytics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.220"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.220"
                                            },
                                            "Text": {
                                                "val": "Continue plans to develop and transition end-to-end flexible and scalable technology transition platform enabling text exploitation and layered multi-intelligence network analysis and visualization in support of multi-source analysis. Continue research and development for plug and play modules for deeper text understanding and large scale, time dependent, network based analytics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adversary Courses of Action"
                                    },
                                    "Description": {
                                        "val": "Develop models to provide detailed understanding of the adversary's probable intent and future strategy to identify adversary COAs, the most likely COA, and the COA most dangerous to friendly forces and mission accomplishment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.893"
                                            },
                                            "Text": {
                                                "val": "Continued development of a demonstration of advanced analytical capabilities that integrate kinetic and non-kinetic options for full spectrum targeting. Initiated the development of assessment tools that assist the analyst\/operator in determining the success\/failure of a given target set and\/or plan in meeting a stated set of mission objectives. Continued the addition of targeting capabilities to increase the full range of options available."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.895"
                                            },
                                            "Text": {
                                                "val": "Continue developing links and tools to effectively employ cyber, directed energy and electronic warfare weaponry within a target folder environment and developing a set of models that will give targeteers greater comprehension of the second and third order effects of targeting actions. Continue developing a demonstration of advanced analytical capabilities that integrate kinetic and non-kinetic options for full spectrum targeting. Continue developing tools that assist the analyst\/operator in determining the success\/failure of a given target set and\/or plan in meeting a stated set of mission objectives. Continue adding targeting capabilities to increase the full range of options available."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.071"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.071"
                                            },
                                            "Text": {
                                                "val": "Continue developing kinetic and non-kinetic, full spectrum targeting tools to create a demonstrable concept where new batches of battlefield reports semi-automatically update the understanding of the target system analysis."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635322"
                    },
                    "ProjectTitle": {
                        "val": "Knowledge Management and Computing"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.596"
                        },
                        "CurrentYear": {
                            "val": "5.206"
                        },
                        "BudgetYearOne": {
                            "val": "4.767"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.767"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.369"
                        },
                        "BudgetYearThree": {
                            "val": "3.811"
                        },
                        "BudgetYearFour": {
                            "val": "3.676"
                        },
                        "BudgetYearFive": {
                            "val": "2.068"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires technologies that will provide the decision maker and staff with seamless access to tailored information within a mobile, dynamic, and scalable, globally distributed AOC, as well as among other producers, consumers, and managers of information relevant to other particular communities of interest (COI).  This project demonstrates the enterprise management capabilities needed for the rapid distribution of actionable information, as well as the needed advances in high performance computing to ensure this complex capability.  This project develops an agile information environment that focuses on quality of service, transformation and brokering, a federated information environment focusing the relationship among the members of the environment, a secure cross-domain information sharing capability that focuses on the security layer and inter-COI information exchange in different security domains, and a collaboration environment focusing on the information workflow layer of the enterprise.  This project will also develop:  1) a computational science and engineering capability demonstrating new models of computation; 2) novel approaches for high performance, interactive, net-centric, distributed, and embedded computing systems; and 3) the technological tools enabling affordable, large-scale, complex, software intensive systems. \n\nStarting in FY 2017 cyber work previously performed within this project will be reported under Project 635329, Cyber Battlespace Dev & Demo."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Game Changing Computing Power"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate computer architectures with greater capacity and sophistication to enable game changing computing power to the warfighter, anywhere, anytime."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.924"
                                            },
                                            "Text": {
                                                "val": "Continued the design, development and demonstration of affordable, high performance, interactive, parallel data exploitation and massively parallel systems. Developed and demonstrated embedded high performance computing systems and integrated bio-inspired embedded computing hardware that delivers a set of autonomous sensing capabilities for Air Force ISR missions in contested and anti-access\/area denial (A2\/AD) environments. Initiated the development of trusted resilient legacy systems that continuously and simultaneously assess and re-establish warfighter trust as the resilient system dynamically responds to fight through failures and attacks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.695"
                                            },
                                            "Text": {
                                                "val": "Continue designing, developing and demonstrating affordable, high performance, interactive, parallel data exploitation and massively parallel systems. Develop and demonstrate embedded high performance computing systems and integrate bio-inspired embedded computing hardware that delivers a set of autonomous sensing capabilities for Air Force ISR missions in the contested A2\/AD environments. Continue to  develop capabilities to simultaneously assess, maintain or reestablish trust as resiliency actions respond to failures and\/or attacks. Continue to develop new approaches to building trusted and resilient systems. Demonstrate trusted and resilient systems in a realistic operational environment. Initiate the development of technologies for neuromorphic co-processing, memristive technologies for use in reducing the size weight and power of conventional processing. This technology also will provide intrinsic, hardware based cyber security features for encryption, anti-tamper and unique identification, algorithm and system operation control for continuous, dynamic autonomous operations. The output will develop a processor capable of universal quantum computation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2017, the work for this effort will be performed under Project 635329, Cyber Battlespace Dev & Demo in an effort of the same name."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Information Management"
                                    },
                                    "Description": {
                                        "val": "Demonstrate how a publish, subscribe, and query information management (IM) paradigm can enable vertical and horizontal integration of Air Force information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.980"
                                            },
                                            "Text": {
                                                "val": "Developed and delivered a suite of new collaboration capabilities for U.S. and Coalition Multiple Levels of Security (MLS) environments  producing four new cross-domain collaboration tools in: Voice over Internet Protocol(VoIP) \/ Video Teleconferencing; Secure Full Motion Video (FMV) streaming; Automated & resilient data content inspection; and Global trusted remote monitoring & management. Initiated the development of information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared situational awareness (SA) across the theater of war for targeting and force protection operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.511"
                                            },
                                            "Text": {
                                                "val": "Continue developing, demonstrating and transitioning information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared situational awareness (SA) across the theater of war for targeting and force protection operations.\n\nInitiate the development, transition and delivery of new technologies in the form of plugins and include security for bulk data at rest to deliver full functionality for AFSOC Special Tactics (ST) mission sets so that ST operators can have superior situational awareness (SA) and communications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.767"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.767"
                                            },
                                            "Text": {
                                                "val": "Continue plans to develop, demonstrate and transition information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared situational awareness (SA) across the theater of war for targeting and force protection operations.  Focus will be on the development of capabilities for disruption tolerant information delivery, data synchronization, and improved Quality of Service (QoS) in congested and contested tactical network environments.\n\nContinue the development, transition and delivery of new technologies in the form of plugins and include security for bulk data at rest to deliver full functionality for AFSOC Special Tactics (ST) mission sets so that ST operators can have superior situational awareness (SA) and communications.\n\nStarting in FY 2017, the cyber activities within this effort (advanced cross-domain solution capabilities) will move to Project 635329, Cyber Battlespace Dev & Demo within the effort, Autonomous, Multi-level Access & Transfer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Agile Information Management Services"
                                    },
                                    "Description": {
                                        "val": "Demonstrate how agile information management services enable effective information sharing in a tactical environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.692"
                                            },
                                            "Text": {
                                                "val": "Completed development of information management services embedded with the sensor that will boost the effective communication bandwidth available to tactical users and link pilots, remotely piloted aircraft and ground assets in the field."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Effort terminated due to higher DoD priorities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635329"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Battlespace Dev & Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "20.519"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.519"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "20.368"
                        },
                        "BudgetYearThree": {
                            "val": "21.438"
                        },
                        "BudgetYearFour": {
                            "val": "22.849"
                        },
                        "BudgetYearFive": {
                            "val": "23.648"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires the ability to deliver sovereign options in cyberspace through the development and integration of cyber-attack, cyber defense, and cyber support technologies for a strategic capability of cyber dominance. This project develops the ability to deliver cyber-attack capabilities (access, stealth, persistence, cyber intelligence and weapons delivery), cyber defense capabilities (attack detection, attack attribution and response automation) and cyber support Capabilities (situation awareness and war gaming).  This project will also develop; 1) a computational science and engineering capability demonstrating new models of computation, 2) novel approaches for high performance, interactive, net-centric, distributed and embedded computing systems and 3) the technological tools enabling affordable, large scale, complex software intensive systems.\n\nProject 635329, Cyber Battlespace Dev & Demo is new for FY 2017. Work from this effort was previously performed under Projects 635320, Assured Worldwide Connectivity and 635322, Knowledge Management and Computing in this program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Offense"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate offensive cyber operations capabilities in a series of experimental technology demonstrations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.223"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.223"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed under Project 635320, Assured Worldwide Connectivity in an effort of the same name. \n\nContinue to research technologies that show maturation promise and enhance the capabilities to make it transitionable to the warfighter. Develop technologies to remain current with new waveforms and signals. Continue service oriented architecture (SOA) mission component development for use in the AFLCMC Cyber Mission Platform (CMP). Transition components, including Cyber Time and Cyber Mission Planning, for use in CMP. Continue red-teaming new components to improve security."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Effects-based Cyber Defense"
                                    },
                                    "Description": {
                                        "val": "Integrate technology to demonstrate an effects-based strategic approach to cyber defense that focuses on avoiding, deterring, and minimizing the threat, and rendering the adversary ineffective."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.026"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.026"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed Project 635320, Assured Worldwide Connectivity in an effort of the same name.\n\nContinue to develop technologies for the proactive control of cyber defenses, integrating with existing mission assurance framework(s). Develop and deliver cyber capabilities with transition to AFLCMC, National Security Agency and U.S. Special Operations Command customers. Research technologies to assist in educating and training the next generation of cyber leaders. Enhance, mature, test, and demonstrate Cyber Agility and defensive cyber deception technologies through exercises and other user-focused venues toward the objective of transition. Integrate new capabilities with existing ISR systems, and, progress testing with the Cyber Experimentation Environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resiliency"
                                    },
                                    "Description": {
                                        "val": "Integrate and demonstrate a resilient and self-generating information enterprise that dynamically recognizes, characterizes, and understand novel cyber attacks and reconfigures and self-optimizes to resist new attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.703"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.703"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed Project 635320, Assured Worldwide Connectivity in an effort of the same name.\n\nDevelop effective red teaming techniques that sufficiently assess detection capabilities for mission-level critical events. Continue development of mission monitoring components, analytics engine, and C2 technology integration. Develop and rapidly evolve capabilities and Concept of Operations (CONOPS) for active guidance and automated processes addressing cyber survivability using an operational system laboratory to host of modular RDT&E, including autonomous cyber survivability capabilities and CONOPS. Schedule to complete advanced technology demonstration for cyber-based mission assurance on trust enhanced hardware."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Game Changing Computing Power"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate computer architectures with greater capacity and sophistication to enable game-changing computing power to the warfighter anywhere, anytime."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.617"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.617"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed Project 635322, Knowledge Management and Computing in an effort of the same name.\n\nTest the Agile Condor embedded computing POD in the field on test platform with real-time processing and communication concepts. Develop a runtime environment that can monitor and maintain a trusted and resilient envelope of operation. This runtime environment may consist of monitors that are generated right along with formally verified code during the formal code generation process to monitor\/ensure that the high level specifications are maintained through execution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous, Multi-level Access and Transfer"
                                    },
                                    "Description": {
                                        "val": "Develop autonomous, secure information access and sharing capabilities required by the Air Force net-centric information enterprise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.950"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.950"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort originally was performed Project 635322, Knowledge Management and Computing in an effort of the same name.\n\nContinue the development and transition of advanced cross domain solutions (CDS). Demonstrate and integrate into CDS a virtual detonation chamber filter to detect malicious\/abnormal behavior. Demonstrate advanced CDS command and control capabilities to improve insight into cross domain service health and status and provide tools to manage CDS risk based upon changes in mission and threat. Continue robust protocol-to-CDS interfaces and techniques to enforce CDS compliance with machine to machine (M2M) interface specifications to make cross-domain enablement of M2M communications more robust and cost effective. Continue to improve the usability of MLS access solutions with a focus on adding secure foundations to commercial-off-the-shelf mobile technologies as the basis for secure multi-level collaboration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}