{
    "id": "b632ea46070f08bf0e2956a0ed9bedd4a4eb2651",
    "meta": {
        "filename": "dod-2017_RDTE_2017_DISA_U_RDTE_MasterJustificationBook_Defense_Information_Systems_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Defense_Information_Systems_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0302016K"
        },
        "ProgramElementTitle": {
            "val": "National Military Command System-Wide Support"
        },
        "R1LineNumber": {
            "val": "196"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "5.391"
            },
            "PriorYear": {
                "val": "0.924"
            },
            "CurrentYear": {
                "val": "0.963"
            },
            "BudgetYearOne": {
                "val": "0.575"
            },
            "BudgetYearOneBase": {
                "val": "0.575"
            },
            "BudgetYearTwo": {
                "val": "1.155"
            },
            "BudgetYearThree": {
                "val": "1.105"
            },
            "BudgetYearFour": {
                "val": "0.988"
            },
            "BudgetYearFive": {
                "val": "1.008"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The National Military Command System (NMCS), operated by the Chairman of the Joint Chiefs of Staff, provides the President, Secretary of Defense, and other national senior leaders the ability to maintain situational and operational awareness and command and control of military forces in all crisis and\/or national emergency contingencies. DISA's NMCS engineering program meets the NMCS systems engineer responsibilities, per Department of Defense Directive (DoDD) S-5100.44 and Chairman of the Joint Chiefs of Staff Instruction (CJCSI) 3280.01B, to provide the Joint Staff with operationally efficient and cost-effective engineering solutions to ensure that components and facilities satisfy operational requirements including emergency messaging, situational awareness, crisis action, and information management.\n\nThe NMCS engineering program is vital in supporting the government's ability to safeguard national security and respond to contingencies globally and\/or nuclear war. NMCS engineering focuses on implementing collaborative tools into current and crisis operations areas, integrating adequate back-up storage and recovery of voice, video and data across the continental United States to support key leaders, transitioning nuclear command and control to Internet Protocol based networks, migrating data and voice network to next generation satellites, implementing modern cryptological devices, and utilizing wireless networking to support warning systems and situational awareness. In addition, NMCS engineering continues to maintain the NMCS Reference Guide required by DoDD S-5100.44 and to develop engineering and test plans for the installation of hardware and software systems utilized within the NMCS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.924"
                },
                "CurrentYear": {
                    "val": "0.963"
                },
                "BudgetYearOne": {
                    "val": "0.956"
                },
                "BudgetYearOneBase": {
                    "val": "0.956"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.924"
                },
                "CurrentYear": {
                    "val": "0.963"
                },
                "BudgetYearOne": {
                    "val": "0.575"
                },
                "BudgetYearOneBase": {
                    "val": "0.575"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.381"
                },
                "BudgetYearOneBase": {
                    "val": "-0.381"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.381"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.381"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease of -$0.381 in FY 2017 is due to a reduction of the Joint Systems Engineering and Integration Office's (JSEIO's) engineering and analysis efforts supporting Ultra High Frequency (UHF) Emergency Network (UEN) ground entry points (GEPs) re-siting and network infrastructure redesign."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S32"
                    },
                    "ProjectTitle": {
                        "val": "NMCS Command Center Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.391"
                        },
                        "PriorYear": {
                            "val": "0.924"
                        },
                        "CurrentYear": {
                            "val": "0.963"
                        },
                        "BudgetYearOne": {
                            "val": "0.575"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.575"
                        },
                        "BudgetYearTwo": {
                            "val": "1.155"
                        },
                        "BudgetYearThree": {
                            "val": "1.105"
                        },
                        "BudgetYearFour": {
                            "val": "0.988"
                        },
                        "BudgetYearFive": {
                            "val": "1.008"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The National Military Command System (NMCS), operated by the Chairman of the Joint Chiefs of Staff, provides the President, Secretary of Defense, and other national senior leaders the ability to maintain situational and operational awareness and command and control of military forces in all crisis and\/or national emergency contingencies. DISA's NMCS engineering program meets the NMCS systems engineer responsibilities, per Department of Defense Directive (DoDD) S-5100.44 and Chairman of the Joint Chiefs of Staff Instruction (CJCSI) 3280.01B, to provide the Joint Staff with operationally efficient and cost-effective engineering solutions to ensure that components and facilities satisfy operational requirements including emergency messaging, situational awareness, crisis action, and information management.\n\nThe NMCS engineering program is vital in supporting the government's ability to safeguard national security and respond to contingencies globally and\/or nuclear war. NMCS engineering focuses on implementation of collaborative tools into current and crisis operations areas, the integration of adequate back-up storage and recovery of voice, video and data across the continental United States to support key leaders, transition of nuclear command and control to Internet Protocol (IP)-based networks, migration of data and voice network to next generation satellites, implementation of modern crypto-logical devices, and the utilization of wireless networking to support warning systems and situational awareness. In addition, NMCS engineering continues to maintain the NMCS Reference Guide (NRG) required by DoDD S-5100.44 and to develop engineering and test plans for the installation of hardware and software systems utilized within the NMCS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NMCS Systems Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.924"
                                            },
                                            "Text": {
                                                "val": "Maintained the Primary Command Center (PCC) Toolkit and the Online Companion Reference.  Continued to modernize and integrate NMCS capabilities (e.g., transmission platforms, data interfaces, security and graphical user interfaces).  Continued to ntegrate NMCS with other senior leadership and continuity command, control and communication (C3) systems that constitute the National Leadership Command Capability (NLCC).  These efforts also supported the Joint Systems Engineering and Integration Office (JSEIO) mission and improved situational monitoring systems across the PCCs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.963"
                                            },
                                            "Text": {
                                                "val": "Will maintain the NMCS Reference Guide (NRG) and the PCC Toolkit to ensure expanded collaboration and information sharing. Update, automate and maintain the Online Companion Reference for the CJCSI 3280.01M which is critical to ongoing operations. Provide technical evaluations and strategies for implementing Nuclear Command and Control over IP into other National Leadership Command Capability (NLCC) enabling programs. Support engineering requirements and continue in identifying technical solutions to integrate NMCS with other senior leadership and continuity command, control and communication (C3) systems that constitute the NLCC. Focus on implementing collaborative tools into current and crisis operations areas, integrate adequate back-up storage and recovery of voice, video and data to support key leaders and migrate data and voice networks to next generation satellites.\n\nThe increase of +$0.039 from FY 2015 to FY 2016 will address data integration and engineering activities required to deliver enterprise level solutions to meet NMCS priorities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.575"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.575"
                                            },
                                            "Text": {
                                                "val": "Will modernize and integrate NMCS capabilities (e.g. transition platforms, data interfaces, security and graphical user interfaces)  as the NMCS systems engineer IAW the CJCSI 3280 and CJCSI 5119.  Will focus on the improvement of collaborative services, and the integration of new transport mediums that facilitate C3 services.\n\nThe decrease of -$0.388 from FY 2016 to FY 2017 is due to a reduction of JSEIO's engineering and analysis efforts supporting Ultra High Frequency (UHF) Emergency Network (UEN) ground entry points (GEPs) re-siting and network infrastructure redesign."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "O&M, DW\/PE 0302016K"
                                    },
                                    "Title": {
                                        "val": "O&M, DW"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.263"
                                        },
                                        "CurrentYear": {
                                            "val": "3.311"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.213"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.213"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.254"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.242"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.281"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.342"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Full and open competition resulted in a contract with Raytheon, Arlington, VA."
                        },
                        "PerformanceMetrics": {
                            "val": "The JSEIO conducts regularly scheduled In-progress Program Reviews (IPRs) and Configuration Control Board (CCB) meetings to monitor status of engineering projects\/tasks. Each current project\/task is evaluated in terms of how well the technical work is progressing and how allocated resources are being utilized. Adjustments to resources, schedules, and technical directions are made, as required.  Future projects\/tasks are also discussed, thereby ensuring an integrated approach is maintained across all related project\/task areas. To further increase the utility of the IPR\/CCB structure, the Joint Staff customer participates in the project\/task reviews. The result of this approach is a truly integrated effort of NMCS Engineering, contractor, and Joint Staff working together to achieve common program goals. Suitable products are delivered within allocated resources and delivered on schedule 90% of the time.\n\nThe NMCS met all FY 2015 performance metrics and is on track to meet its FY 2016 and FY 2017 metrics by delivering suitable products on schedule and within allocated resources 100% of the time."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering\/Tech Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon E-Sys"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.391"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.924"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.963"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.575"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.575"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.525"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "NMCS"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Maintenance\/Update of NMCS Reference Guide (ongoing\/real-time)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Maintenance\/Update of the PCC Toolkit"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Completion of Study: NC2 over IP"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Completion of SHF Upgrade"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Inspection\/Maintenance of HEMP sites in the NCR"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Modernize Non-Secure Conferencing Networks"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Implement PCC Dashboard"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milstar Cryptological Modernization"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}