{
    "id": "c066b4682f26ff0aaafa67e0f14af8fd48f24c80",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604441F"
        },
        "ProgramElementTitle": {
            "val": "Space Based Infrared System (SBIRS) High EMD"
        },
        "R1LineNumber": {
            "val": "62"
        },
        "MdapCode": {
            "val": "210"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "9738.188"
            },
            "PriorYear": {
                "val": "308.788"
            },
            "CurrentYear": {
                "val": "291.510"
            },
            "BudgetYearOne": {
                "val": "181.966"
            },
            "BudgetYearOneBase": {
                "val": "181.966"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "444.177"
            },
            "BudgetYearThree": {
                "val": "798.344"
            },
            "BudgetYearFour": {
                "val": "650.492"
            },
            "BudgetYearFive": {
                "val": "911.263"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Prior Years: Total Program Element above includes $39.831M for BPAC 65A040 Commercially Hosted Payload funded in FY11 and FY12.\nMDAP PNO 210 includes only BPAC 653616 SBIRS High EMD."
        },
        "ProgramElementMissionDescription": {
            "val": "The SBIRS RDT&E FY17 budget justification exhibits describe three elements of the SBIRS program: 1) the SBIRS Engineering and Manufacturing Development (EMD) program of record PNO 210 MDAP, 2) the Space Modernization Initiative (SMI) (non-MDAP) and the 3) Evolved SBIRS follow-on (pre-MDAP PNO 499).\n\n1. SBIRS EMD:  The Space-Based Infrared System (SBIRS) primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS enhances detection and improves reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. SBIRS supports Missile Defense, Battlespace Awareness, and Technical Intelligence missions by providing reliable, accurate, and timely data to Unified Combatant Commanders, Joint Task Force (JTF) Commanders, the intelligence community, and other users. SBIRS provides increased detection and tracking performance over legacy systems in order to meet requirements in Air Force Space Command's (AFSPC) Operational Requirements Document (ORD). The SBIRS system includes both space and ground elements. The space segment consists of Geosynchronous Earth Orbit (GEO) satellites, payloads hosted on satellites in Highly Elliptical Orbit (HEO), and Defense Support Program (DSP) satellites. The ground segment consists of both fixed and mobile data processing elements, communications infrastructure, and relay ground stations serving all SBIRS space elements. The three HEO payloads and two GEO satellites are on-orbit.  Both GEO and two of the three HEO satellites have completed AFSPC and USSTRATCOM operational acceptance and are certified for Integrated Tactical Warning\/Attack Assessment (ITW\/AA) missile warning operations and technical intelligence operations.  HEO-3 is in a storage\/residual operational mode.  The program of record ground segment development exploits both the new scanner and starer sensor data through software processing and builds user messages for missile warning and missile defense. Also, data exploitation efforts enable access to raw and processed data to expand capabilities for battlespace awareness and other applications.  FY17 and FY18 funds support ground segment development.  The baseline requirement document is the 1996 SBIRS ORD. Enterprise systems engineering and integration (SE&I) provides intra- and inter-program requirements development, enterprise master planning, validation and verification, specialty engineering, and architecture development. \n\n2. SMI:   The primary objective of SMI is to enable and inform future decisions to maintain and evolve a capable, resilient, and affordable OPIR architecture by maturing technologies and mitigating risk areas to facilitate OPIR modernization within the Department's constrained resources. SMI supports the Program of Record (PoR) by assessing future parts and material obsolescence and designing future space and ground modifications focused on affordability and capability while simultaneously maximizing the effectiveness of existing system data products. SMI funds engineering activities to reduce both production and future system costs through manufacturing and producibility enhancements and through technology insertion. SMI will also mature potential technology upgrades at the component and system level for future space and ground architecture affordability and capability enhancements.  The SBIRS OPIR SMI plan includes studies and risk reduction activities to evolve the current PoR SBIRS constellation, reduce production timelines, and reduce recurring production costs. Based on the outcome of these studies, the Sensor Ground Demonstration will develop capability for current, next generation sensors, processors, and algorithms.  SMI funded data exploitation efforts include OPIR mission data processing, data fusion, data dissemination, algorithm development, network connectivity, efficient interfaces and sensor performance assessments to enable greater exploitation of SBIRS PoR and other data sources. SMI exploitation efforts build upon PoR capabilities and inform the PoR decision process. The data exploitation efforts identify affordable, responsive and resilient measures to improve technical intelligence and battlespace awareness processing and data dissemination tools to enhance OPIR support to the warfighters and other data users. The SMI Hosted Payloads and Wide Field of View (WFOV) Testbed activities explore technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture. Hosted Payloads and WFOV Testbeds support maturation of mission data processing algorithms for tactical and strategic applications which are critical demonstration efforts to enhance PoR capabilities and to reduce program risks for future OPIR systems, whether new systems or evolutions of the PoR.  Collection of on-orbit WFOV data is critical to develop algorithms to process large data sets generated by emerging large format focal planes and to reduce risk for possible SBIRS follow-on architectures.  SBIRS Enterprise Ground Services (EGS) infrastructure modernization efforts under SMI will introduce Telemetry, Tracking and Command systems (TT&C) and Ground Control automation, mission data processing as well as competition into SBIRS Ground with an emphasis to on-ramp to EGS as soon as practical.  SMI activities are balanced and phased to enable an expanded tradespace and improve the competitive environment. \n\nIn FY17, this program element supports EGS from the SMI BPAC.  EGS is performing tech maturation, experiments and prototyping for increased commonality and resiliency in space program ground systems.  \n\n3. Evolved SBIRS Follow-on: The SBIRS Follow-On Analysis of Alternatives (AoA) and knowledge gained from the SBIRS SMI projects will inform a future Defense Acquisition Board (DAB) decision for the Evolved SBIRS effort.  DAB alternatives are expected to include: 1) continued production of SBIRS PoR design with modernization changes; 2) an evolved satellite and ground system derived from the SBIRS POR designs; 3) an evolved satellite and ground system that includes a combination of PoR derivatives and new systems; or 4) an alternative architecture (potentially disaggregated).  The Evolved SBIRS effort will implement the DAB directed program alternative. The Evolved SBIRS AoA will consider the requirement for global coverage in the post-GEO-6 and post-HEO-4 timeframe.\n \n\nThis program element is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "308.788"
                },
                "CurrentYear": {
                    "val": "292.235"
                },
                "BudgetYearOne": {
                    "val": "198.779"
                },
                "BudgetYearOneBase": {
                    "val": "198.779"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "308.788"
                },
                "CurrentYear": {
                    "val": "291.510"
                },
                "BudgetYearOne": {
                    "val": "181.966"
                },
                "BudgetYearOneBase": {
                    "val": "181.966"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-0.725"
                },
                "BudgetYearOne": {
                    "val": "-16.813"
                },
                "BudgetYearOneBase": {
                    "val": "-16.813"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.725"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-16.813"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-16.813"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY17 Other Adjustments: -$15.0M SMI re-phased to FY18 (+$9M) and FY19 (+$6M), -$1.813M inflation adjustments"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "653616"
                    },
                    "ProjectTitle": {
                        "val": "SBIRS High Element EMD"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "9601.716"
                        },
                        "PriorYear": {
                            "val": "229.580"
                        },
                        "CurrentYear": {
                            "val": "202.929"
                        },
                        "BudgetYearOne": {
                            "val": "108.890"
                        },
                        "BudgetYearOneBase": {
                            "val": "108.890"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "95.454"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10238.569"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "4"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Note: The quantity of RDT&E articles above reflects delivery of GEO-1 in FY11, GEO-2 in FY12, HEO-1 in FY04, and HEO-2 in FY05.\n\nThe Space-Based Infrared System (SBIRS) primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS enhances detection and improves reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. SBIRS supports Missile Defense, Battlespace Awareness, and Technical Intelligence missions by providing reliable, accurate, and timely data to Unified Combatant Commanders, Joint Task Force (JTF) Commanders, the intelligence community, and other users. SBIRS provides increased detection and tracking performance over legacy systems in order to meet requirements in Air Force Space Command's (AFSPC) Operational Requirements Document (ORD). The SBIRS system includes both space and ground elements. The space segment consists of Geosynchronous Earth Orbit (GEO) satellites, payloads hosted on satellites in Highly Elliptical Orbit (HEO), and Defense Support Program (DSP) satellites. The ground segment consists of both fixed and mobile data processing elements, communications infrastructure, and relay ground stations serving all SBIRS space elements. The three HEO payloads and two GEO satellites are on-orbit.  Both GEO and two of the three HEO satellites have completed AFSPC and USSTRATCOM operational acceptance and are certified for Integrated Tactical Warning\/Attack Assessment (ITW\/AA) missile warning operations and technical intelligence operations.  HEO-3 is in a storage\/residual operational mode.  The program of record ground segment development exploits both the new scanner and starer sensor data through software processing and builds user messages for missile warning and missile defense. Also, data exploitation efforts enable access to raw and processed data to expand capabilities for battlespace awareness and other applications.  FY17 and FY18 funds support ground segment development.  The baseline requirement document is the 1996 SBIRS ORD. Enterprise systems engineering and integration (SE&I) provides intra- and inter-program requirements development, enterprise master planning, validation and verification, specialty engineering, and architecture development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIRS EMD"
                                    },
                                    "Description": {
                                        "val": "Continued EMD contracts for Space and Ground segment development, concept studies\/activities for obsolescence issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "229.580"
                                            },
                                            "Text": {
                                                "val": "Continued Ground System Development (Block 10) and started pre certification use of the staring sensor for Technical Intelligence. Block 10 provides significantly enhanced missile warning capabilities for our nation and allies by exploiting both scanner and starer sensor data with the improved ability for quicker detection and warning against a wider-ranging number of smaller missiles that are proliferating around the globe. Continued Block 20 Ground System Development, System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/Exploitation\/ground integration activities, CTF support activities, systems integration and test studies. Block 20 adds ground processing that will exploit starer data via auto-cues on theater launches to enhance burnout surveillance and improve impact point prediction. Continued Program Office and related support activities, technical analysis and independent verification and validation of contractor developmental efforts. Continued enterprise SE&I."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "202.929"
                                            },
                                            "Text": {
                                                "val": "Complete ground system development and consolidation (Block 10). Block 10 acceptance will significantly enhance missile warning capabilities for our nation and allies by exploiting both scanner and starer sensor data with the improved ability for quicker detection and warning (for Combatant Commanders and the National Command Authority) against a wider-ranging number of smaller missiles that are proliferating around the globe. Complete Increment 1 operations support activities. Continue Block 20 Ground System Development, System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/ Exploitation\/ground integration activities, systems integration and test studies. Block 20 adds ground processing that will exploit starer data via auto-cues on theater launches for enhanced burnout surveillance and improved impact point prediction. Continue Program Office and related support activities, technical analysis and independent verification and validation of the Contractor. Continue developing and fielding Command & Control, Technical Intelligence, and Battlespace Awareness operations to leverage residual capability for HEO 1\/2 post-transition. Continue enterprise SE&I."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "108.890"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "108.890"
                                            },
                                            "Text": {
                                                "val": "The Block 10 Operational Acceptance and ITW\/ AA certification (including GEO-1\/2 Starers) is scheduled for Nov 2016.  Government certification is the only scheduled FY 2017 Block 10 activity. The Program Office will continue Block 20 Ground System Development, System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/ Exploitation\/ground integration activities, systems integration and test studies. Block 20 adds ground processing that will exploit starer data via auto-cues on theater launches for enhanced burnout surveillance and improved impact point prediction. Continue Program Office and related support activities, technical analysis and independent verification and validation of the Contractor. Continue developing and fielding Command & Control, Technical Intelligence, and Battlespace Awareness operations to leverage residual capability for HEO 1\/2 post-transition.  Continue enterprise SE&I."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "MPAF, BA 05, Line Item # 25, MSSBIR"
                                    },
                                    "Title": {
                                        "val": "SBIR High (Space)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "444.567"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF, BA 03, Line Item # 43, 836720"
                                    },
                                    "Title": {
                                        "val": "Space Based Ir Sensor Pgm Space"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "31.293"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPAF, BA 01, Line # 10, MSSBIR"
                                    },
                                    "Title": {
                                        "val": "SBIR High (Space)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "542.713"
                                        },
                                        "BudgetYearOne": {
                                            "val": "362.504"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "362.504"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "933.169"
                                        },
                                        "BudgetYearThree": {
                                            "val": "118.649"
                                        },
                                        "BudgetYearFour": {
                                            "val": "110.121"
                                        },
                                        "BudgetYearFive": {
                                            "val": "112.102"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "2179.258"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The pre-SDD SBIRS contracts were competed in full and open competition.  Two contracts were awarded to Lockheed\/Loral\/Aerojet and Hughes\/TRW in 1995 for the pre-SDD phase.  A single contract was awarded to Lockheed Martin in 1996 for the SDD phase.  This contract is still ongoing and will incrementally deliver the ground segment.  Production contracts are discussed in the procurement budget exhibits."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Award dates represent date of first award of the funds for that fiscal year."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Pre-EMD (LMMS & Hughes)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Hughes Aircraft Company"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "159.600"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "159.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "159.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIRS EMD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Prime: Lockheed Martin Sunnyvale, CA; Sub: Northrop Grumman, Azusa, CA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8592.134"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "195.884"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "157.103"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "82.368"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "82.368"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "77.442"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9104.931"
                                                    },
                                                    "TargetValue": {
                                                        "val": "9104.931"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Remote Sensing Enterprise Systems Engineering and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "The Analytical Sciences Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Andover, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "48.887"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.194"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.340"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.769"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.769"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.329"
                                                    },
                                                    "TotalCost": {
                                                        "val": "69.519"
                                                    },
                                                    "TargetValue": {
                                                        "val": "69.519"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIRS Pre-SDD Contract Adjustment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.780"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.780"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.780"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.600"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Phenomenology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.350"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.350"
                                                    },
                                                    "TargetValue": {
                                                        "val": "17.350"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sensor Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sandia National Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Albuquerque, NM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "10.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HEO Command & Control (C2) Ground Expansion"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "39.700"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "39.700"
                                                    },
                                                    "TargetValue": {
                                                        "val": "39.700"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Mission Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.163"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.706"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.896"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.896"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "4.208"
                                                    },
                                                    "TotalCost": {
                                                        "val": "18.973"
                                                    },
                                                    "TargetValue": {
                                                        "val": "18.973"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HEO 1\/2 Residual Capability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "14.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "14.600"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "WFOV Testbed Concept Study"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Millennium Space Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Various Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.538"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.538"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.538"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Award dates represent date of first award of the fiscal year."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FFRDC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "442.704"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.970"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.156"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.265"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.265"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.471"
                                                    },
                                                    "TotalCost": {
                                                        "val": "468.566"
                                                    },
                                                    "TargetValue": {
                                                        "val": "468.566"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "104.732"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.077"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.565"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.771"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.771"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.775"
                                                    },
                                                    "TotalCost": {
                                                        "val": "123.920"
                                                    },
                                                    "TargetValue": {
                                                        "val": "123.920"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "150.691"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.292"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.459"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.821"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.821"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "4.229"
                                                    },
                                                    "TotalCost": {
                                                        "val": "175.492"
                                                    },
                                                    "TargetValue": {
                                                        "val": "175.492"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Integration & Test at MCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Integration & Test at MCSB"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B10.3 Completed and ITW\/AA Certified"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 20 Integration & Test at MCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 20 Integration & Test at MCSB"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 20 Operational Utility Evaluation and Initial Operational Test & Evaluation with AFOTEC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B20 Completed and ITW\/AA Certified"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "657009"
                    },
                    "ProjectTitle": {
                        "val": "Space Modernization Initiative"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "136.472"
                        },
                        "PriorYear": {
                            "val": "79.208"
                        },
                        "CurrentYear": {
                            "val": "88.581"
                        },
                        "BudgetYearOne": {
                            "val": "73.076"
                        },
                        "BudgetYearOneBase": {
                            "val": "73.076"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "116.337"
                        },
                        "BudgetYearThree": {
                            "val": "115.022"
                        },
                        "BudgetYearFour": {
                            "val": "110.748"
                        },
                        "BudgetYearFive": {
                            "val": "112.356"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The primary objective of SMI is to enable and inform future decisions to maintain and evolve a capable, resilient, and affordable OPIR architecture by maturing technologies and mitigating risk areas to facilitate OPIR modernization within the Department's constrained resources. SMI supports the Program of Record (PoR) by assessing future parts and material obsolescence and designing future space and ground modifications focused on affordability and capability while simultaneously maximizing the effectiveness of existing system data products. SMI funds engineering activities to reduce both production and future system costs through manufacturing and producibility enhancements and through technology insertion. SMI will also mature potential technology upgrades at the component and system level for future space and ground architecture affordability and capability enhancements.  The SBIRS OPIR SMI plan includes studies and risk reduction activities to evolve the current PoR SBIRS constellation, reduce production timelines, and reduce recurring production costs. Based on the outcome of these studies, the Sensor Ground Demonstration will develop capability for current, next generation sensors, processors, and algorithms.  SMI funded data exploitation efforts include OPIR mission data processing, data fusion, data dissemination, algorithm development, network connectivity, efficient interfaces and sensor performance assessments to enable greater exploitation of SBIRS PoR and other data sources. SMI exploitation efforts build upon PoR capabilities and inform the PoR decision process. The data exploitation efforts identify affordable, responsive and resilient measures to improve technical intelligence and battlespace awareness processing and data dissemination tools to enhance OPIR support to the warfighters and other data users. The SMI Hosted Payloads and Wide Field of View (WFOV) Testbed activities explore technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture. Hosted Payloads and WFOV Testbeds support maturation of mission data processing algorithms for tactical and strategic applications which are critical demonstration efforts to enhance PoR capabilities and to reduce program risks for future OPIR systems, whether new systems or evolutions of the PoR.  Collection of on-orbit WFOV data is critical to develop algorithms to process large data sets generated by emerging large format focal planes and to reduce risk for possible SBIRS follow-on architectures.  SBIRS Enterprise Ground Services (EGS) infrastructure modernization efforts under SMI will introduce Telemetry, Tracking and Command systems (TT&C) and Ground Control automation, mission data processing as well as competition into SBIRS Ground with an emphasis to on-ramp to EGS as soon as practical.  SMI activities are balanced and phased to enable an expanded tradespace and improve the competitive environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Evolved SBIRS"
                                    },
                                    "Description": {
                                        "val": "Perform Trade and Design Studies to assess obsolescence, affordability, and capability design modifications to the PoR.  Based on study outcomes, mature technologies and manufacturability to reduce cost, schedule, and technical risk for new component and subsystem designs which may be used in the next production block.  Develop brassboards, breadboards, and engineering model prototypes for hardware\/software integration and testing to reduce risk and mature technologies applicable to PoR and new system alternatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.122"
                                            },
                                            "Text": {
                                                "val": "Completed SBIRS design trade studies with the incumbent SBIRS Prime contractor and Payload Subcontractor that 1) identified obsolescence issues and corresponding hardware\/software design modifications to mitigate future production risks; 2) identified payload and spacecraft modifications to improve affordability of the current satellite; and 3) identified design modifications required to simplify payload hardware, software, and functionality to enable evolution of the PoR SBIRS satellites. Extended trade study to identify a preferred Geosynchronous Inclined Orbit (GIO) and constellation architecture, determine the performance and cost of implementation, and developed a candidate transition plan.  Initiated detailed design studies and component hardware\/software risk reduction efforts to implement the most critical technology maturation activities required to support the most promising alternative architectures for the SBIRS Follow-on program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.549"
                                            },
                                            "Text": {
                                                "val": "Continue detailed design studies and hardware\/software risk reduction efforts to implement the most critical technology maturation activities required to support the most promising alternative architectures for the SBIRS Follow-on program. Advance key technologies for spacecraft and ground system components to include resiliency features; focal planes; signal processing; algorithm development; communications upgrades, such as crosslinks and high data rate downlinks; and space-environmental qualification of new detectors, microprocessors, and memory devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.907"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.907"
                                            },
                                            "Text": {
                                                "val": "Continue detailed design studies and hardware\/software risk reduction efforts to implement the most critical technology maturation activities required to support the most promising alternative architectures for the SBIRS Follow-on program. Initiate a technology demonstration effort focused on maturing key payload technologies, including mission data processor development and validation methods, critical to the evolution of the most promising alternative architectures for the SBIRS Follow-on program.  Expand fiscal year 2016 technology maturation activities to include additional vendors, reducing risk to future SBIRS Follow-on payload competition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Exploitation"
                                    },
                                    "Description": {
                                        "val": "Exploit existing OPIR data sources (DSP, SBIRS HEO, SBIRS GEO Scanner, SBIRS GEO Starer, Commercially Hosted Infrared Payload (CHIRP), other classified sources) through data collection, processing, fusion, data dissemination, algorithm development and testing, network connectivity, and sensor performance assessments. SBIRS and other sensors provide a rich data set for exploitation. SMI data exploitation enables access to raw and processed data for data analysts and application developers to expand capabilities for battlespace awareness and other applications. SMI data exploitation efforts are complementary to, and enhance, the exploitation capabilities delivered by the PoR and inform future PoR exploitation efforts. SMI will develop tools and algorithms to enable users to apply OPIR data to support their mission needs. Data exploitation efforts are also evaluating tools for command and control, mission management, and mission data processing for risk reduction to support evolution of the SBIRS PoR ground system to an open architecture that could support PoR and other future satellites and payload alternatives. SMI ground system development activities seek to demonstrate the performance of an evolved ground system architecture capable of supporting multi-satellite, multi-payload, multi-mission management and data processing for any IR payload to achieve lower operating costs with enhanced net-centric and service oriented features along with a flexible expansion capability that was not designed into the current PoR ground system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.589"
                                            },
                                            "Text": {
                                                "val": "Awarded contracts that provided enhanced ground segment capability and tools for command and control, data collection, mission processing, and data dissemination to enhance data exploitation of SBIRS PoR and other OPIR data. Continued to collaborate with Intelligence Community (IC) and Missile Defense Agency (MDA) to enhance Joint OPIR Ground (JOG) initiatives. Initiated development of an open architecture ground command and control and Virtual Mission Management operations for expanded data exploitation of the SBIRS HEO sensors. Initiated development of a data exploitation laboratory to support experimentation, technology maturity and evolution of exploitation algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.919"
                                            },
                                            "Text": {
                                                "val": "Continue to provide enhanced ground segment capability and tools for command and control, data collection, mission processing, and data dissemination to enhance data exploitation of SBIRS and other OPIR data. Continue to collaborate with IC and MDA to enhance Joint OPIR Ground (JOG) initiatives. Continue development of an open architecture ground command and control and mission processing capability for the WFOV Testbed to support evolution of the SBIRS PoR ground system. Conduct space to ground system testing in preparation for the WFOV Testbed launch in fiscal year 2019. Continue development of an open architecture ground command and control and Virtual Mission Management operations for expanded data exploitation of the SBIRS HEO sensors. Continue development of data exploitation laboratory to support experimentation, technology maturity and evolution of exploitation algorithms. Continue development of a Battlespace Awareness real-time capability that will integrate applications and services matured in the data exploitation government lab."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.278"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.278"
                                            },
                                            "Text": {
                                                "val": "Continue to provide enhanced ground segment capability and tools for command and control, data collection, mission processing, and data dissemination to enhance data exploitation of SBIRS and other OPIR data. Continue to collaborate with IC and MDA to enhance Joint OPIR Ground (JOG) initiatives. Continue development, integration, and testing of WFOV ground command and control system and mission processing capability to support WFOV Testbed launch in fiscal year 2019.  Continue development of data exploitation laboratory to support experimentation, technology maturity and evolution of exploitation algorithms.  Continue development of a Battlespace Awareness real-time capability that will integrate applications and services matured in the data exploitation government lab."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hosted Payloads"
                                    },
                                    "Description": {
                                        "val": "Hosted Payloads mature WFOV technology and demonstrate multi-mission capabilities including the potential for a single sensor to simultaneously perform both the strategic and tactical missions. On-orbit data is required in order to develop and validate WFOV algorithms and on-board mission data processing throughput requirements for the Strategic Missile Warning Mission. These payload risk-mitigation efforts support the potential to field future Strategic Missile Warning and\/or multi-mission systems and potentially increase capability of the PoR starer. WFOV payloads are a part of all evolved and new architecture alternatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.579"
                                            },
                                            "Text": {
                                                "val": "Completed WFOV payload CDR, initiated procurement of long-lead parts and materials, and began payload build. Continued WFOV payload calibration and test planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.118"
                                            },
                                            "Text": {
                                                "val": "Continue build, integration, and checkout of the WFOV payload. Continue planning for the payload calibration and test campaign."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.626"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.626"
                                            },
                                            "Text": {
                                                "val": "Complete final payload integration and checkout. Deliver payload to the calibration and test facility. Conduct the payload calibration and test campaign. Deliver payload to bus contractor to begin space vehicle integration. Initiate post-calibration ground analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WFOV Testbeds"
                                    },
                                    "Description": {
                                        "val": "WFOV Testbeds are satellite platforms offering opportunities to demonstrate mission capabilities on-orbit and mitigate development risks for employing WFOV sensors. WFOV Testbeds include contractual options to integrate, test, and launch prototype, developmental WFOV payloads with a Government-owned free-flyer spacecraft or on a host government or commercially owned satellite. The WFOV Testbed will host the WFOV payload to demonstrate on-orbit mission performance.  On-orbit data from the WFOV payload hosted on the WFOV Testbed is essential to develop and validate WFOV algorithms and on-board mission data processing throughput requirements for the Strategic Missile Warning mission.  These two critical risk mitigation efforts support the potential to field future Strategic Missile Warning and\/or multi-mission WFOV systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.747"
                                            },
                                            "Text": {
                                                "val": "Completed spacecraft primary structure build. Continued component build, integration and test. Completed payload-to-bus and space-to-ground interface control specification documents. Awarded contracts for WFOV System Engineering, Integration and Test (SEIT) effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.380"
                                            },
                                            "Text": {
                                                "val": "Complete bus integration and test. Continue SEIT activities, including completion of system-level requirements review and critical design review, system test plan, and information assurance (IA) accreditation plan. Award contract for launch opportunity in fiscal year 2019."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.996"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.996"
                                            },
                                            "Text": {
                                                "val": "Begin payload-to-bus integration. Continue coordination with launch vehicle provider to complete coupled-loads analysis and launch integration design. Procure launch vehicle rocket. Continue SEIT activities, including inter-segment testing and IA accreditation approvals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Ground Demonstration"
                                    },
                                    "Description": {
                                        "val": "Based on previous study outcomes, design and build test capability for next generation sensors, processors and algorithms. Develop modeling and simulation software (M&S), breadboards\/brassboards, test equipment, and data reduction software. Perform ground demonstration of candidate focal plane arrays, on-board processors, and other payload components for future SBIRS satellites."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.798"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.798"
                                            },
                                            "Text": {
                                                "val": "Complete detailed design of sensor demonstration experiments, including requirements for M&S and test equipment. Initiate M&S development work, such as threat\/scene generation capability and predictive effects for threat engagement. Develop an experimental optical breadboard, leveraging focal plane maturation efforts to create a focal plane interface.  Procure test equipment, such as thermal control system and dewar. Initiate ground sensor demonstration integration and test."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System Engineering and Integration"
                                    },
                                    "Description": {
                                        "val": "System of Systems engineering and integration (SE&I) activities to evolve to future architectures."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.035"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.035"
                                            },
                                            "Text": {
                                                "val": "Provide SE&I support for OPIR Enterprise analysis and integration of potential mission capabilities with existing OPIR Architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Description": {
                                        "val": "Conduct Systems Engineering and Program Management to include but not limited to Program Office support such as Federally Funded Research and Development Center (FFRDC) analyses and System Engineering Technical Assistance (SETA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.171"
                                            },
                                            "Text": {
                                                "val": "Provided Program Office and Space and Missile Systems Center support for SMI projects.  Completed the AoA and provide findings to Senior AF and OSD leadership to determine way ahead for the SBIRS Follow-on."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.615"
                                            },
                                            "Text": {
                                                "val": "Provide Program Office and Space and Missile Systems Center support for SMI projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.336"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.336"
                                            },
                                            "Text": {
                                                "val": "Provide Program Office and Space and Missile Systems Center support for SMI projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise Ground Services (EGS)"
                                    },
                                    "Description": {
                                        "val": "EGS is envisioned to provide a robust enterprise ground architecture for Air Force space systems, which leverages mission commonality and automation to reduce sustainment costs and re-focus manpower on warfighting capabilities.  In addition, EGS will enable a near-real-time common operating picture of enterprise-wide tactical health, status, indications, and warnings for Air Force satellites.  The end-state will be a modern technical infrastructure which is cyber-secure and resilient against the Advanced Persistent Threat and employs streamlined architecting, acquisition, and operational processes.  Through early architecture studies and prototyping, the government will establish clear ownership of the technical baseline to meet Better Buying Power principles as the EGS effort evolves through development.  This effort provides focus and expertise for the development, test, certification and enforcement of standards and interfaces for all AFSPC satellite ground systems to enable transition planning for legacy ground systems, new capability demonstrations, and systems acquisition leading to an enterprise ground architecture for Air Force space systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Conduct developmental planning, mature technologies, and develop initial small-scale prototype capability for the enterprise ground architecture.  Efforts in 2017 will include, but not be limited to, systems engineering, special studies, cybersecurity planning and implementation, standards and interface development and codification, integration and test efforts in support of demonstrations, and operational architecture planning.  In addition, this effort will build the technical and programmatic roadmap to enable a phased enterprise transition in the future."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program office will use a variety of acquisition approaches to execute various concept studies, technology maturation efforts, testbed\/prototype demonstrations, and data exploitation initiatives and projects. The program office will collaborate with appropriate contracting agencies to support each individual effort. Activities, such as SBIRS obsolescence and affordability enhancements to the existing satellite design, will leverage existing Program of Record contracts. Technology maturation and component prototyping and\/or qualification could leverage existing contracts; in fact many are planned in collaboration with AFRL and other government agencies.  Where practical, other efforts could be competed.  FFRDC and SETA contractors will also be used to conduct and support studies.  New technology, replacement components, and system designs will be acquired with government data rights to the maximum extent to allow their incorporation into any future OPIR satellite production or system development.  Contracting partnerships with other agencies will also be used to study, develop, demonstrate and prove emerging capabilities.  For example, the Wide Area Six-Degree Payload (WASP) was awarded through an Army Research Laboratory (ARL) Broad Agency Announcement (BAA). The BAA awarded in 2013 for 6 PDR-phase contracts to the following vendors: Ball Aerospace, Leidos, L3 Communications, Lockheed Martin, Northrop Grumman, and Raytheon. L3 was awarded contracts for the CDR and Build phases in 2014 and 2015 respectively. The Wide Field of View (WFOV) Testbed Aquila II bus contract, which will host the WASP, was awarded in 2012 to Millennium Space Systems through NASA’s Ames Research Center. The WFOV ground station will be located at the Naval Research Laboratory’s (NRL’s) Blossom Point Tracking Facility (BPTF), and the WASP calibration campaign and mission data calibration will be conducted through Utah State University Research Facility’s (USURF’s) Space Dynamics Laboratory (SDL) through contracts awarded in 2013 and 2015 respectively."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Evolved SBIRS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.187"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.122"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.550"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "17.907"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "17.907"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Exploitation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "40.215"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "20.589"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "22.918"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "24.278"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "24.278"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hosted Payloads"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L3 Communications"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wilmington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "44.449"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "29.579"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.118"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.626"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.626"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "WFOV Testbeds"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Millenium Space Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "36.884"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "19.747"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "40.380"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "16.996"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "16.996"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sensor Ground Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.798"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.798"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-04"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Remote Sensing Enterprise Systems Engineering and Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.035"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.035"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise Ground Services (EGS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.875"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.826"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.730"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.218"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.218"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.862"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.345"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.885"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.118"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.118"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Evolved SBIRS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Data Exploitation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "WFOV Starer Payload"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "WFOV Testbed"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Sensor Ground Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "657106"
                    },
                    "ProjectTitle": {
                        "val": "EVOLVED SBIRS"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "232.386"
                        },
                        "BudgetYearThree": {
                            "val": "683.322"
                        },
                        "BudgetYearFour": {
                            "val": "539.744"
                        },
                        "BudgetYearFive": {
                            "val": "798.907"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The SBIRS Follow-On Analysis of Alternatives (AoA) and knowledge gained from the SBIRS SMI projects will inform a future Defense Acquisition Board (DAB) decision for the Evolved SBIRS effort.  DAB alternatives are expected to include: 1) continued production of SBIRS PoR design with modernization changes; 2) an evolved satellite and ground system derived from the SBIRS POR designs; 3) an evolved satellite and ground system that includes a combination of PoR derivatives and new systems; or 4) an alternative architecture (potentially disaggregated).  The Evolved SBIRS effort will implement the DAB directed program alternative.  The SBIRS Follow-on AoA will consider the requirement for global coverage in the post-GEO-6 and post-HEO-4 timeframe.\n\nThe \"cost to complete\" and \"total cost\" fields above will be populated after completion of the formal cost estimate in support of the DAB decision."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Evolved SBIRS"
                                    },
                                    "Description": {
                                        "val": "New FY18 development effort for the Follow-on System after SBIRS GEO-6 and HEO-4. Evolved SBIRS will also include development of ground system modifications to accommodate evolved SBIRS satellite design changes. The specific system requirements and program definition are pending the outcome of the SBIRS Follow-on AoA, post-AoA deliberations, DAB approvals and milestone decisions, and the new Capability Development Document (CDD)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A, no funding in FY15."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A, no funding in FY16."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A, no funding in FY17."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "TBD until Milestone Decision in the FY16-17 timeframe."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Evolved SBIRS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Evolved SBIRS Development\/Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SBIRS Future Ground Evolution\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}