{
    "id": "cb85d79601aff483f582dc9ebedecb16bd36eeec",
    "meta": {
        "filename": "dod-2017_RDTE_2017_TJS_U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604787J"
        },
        "ProgramElementTitle": {
            "val": "Joint Systems Integration"
        },
        "R1LineNumber": {
            "val": "101"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "7.064"
            },
            "PriorYear": {
                "val": "3.150"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "10.214"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.002"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.150"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.852"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY2015 Carryover"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-3.852"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY2016 this program element will be consolidated with PE 0604826J - Joint C5 (Command, Control, Communications, Computers, and Cyber) Capability Development, Integration, and Interoperability Assessments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P787"
                    },
                    "ProjectTitle": {
                        "val": "Joint Systems Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.064"
                        },
                        "PriorYear": {
                            "val": "3.150"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.214"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In support of the Chairman’s responsibility for the assessment of the capability and adequacy of United States forces to successfully execute the national military strategy the Joint Systems Integration (JSI) Program Element provides mission funding for the Joint Staff J6 C4 Assessments Division (C4AD). C4AD conducts interoperability assessments and develops solutions\/recommendations to improve integration of Service, Defense Agency, and coalition systems. \n\nC4AD's Persistent Command and Control Environment replicates an operational environment and provides Combatant Commands, Services, Agencies and Coalition partners at the joint force headquarters level, a laboratory and assessment venue for the warfighter and capability developer to identify and solve interoperability and integration issues with current and near-term joint and coalition capabilities. With this capability, C4AD assesses system of systems interoperability, operational capability, procedural compliance and technical suitability of emerging and existing systems and programs to confirm readiness for deployment.  \n\nBy establishing ground truth for interoperability and suggesting remedies for demonstrated shortfalls, C4AD is an enabler for the Chairman’s priorities to: pioneer new ways to combine and employ emergent capabilities, drive Jointness deeper, sooner in capability development, move quickly toward Joint information and simulation networks that support secure and agile command and control, expand the envelope of interagency and international cooperation, and promote multilateral security approaches and architectures.\n\nIn FY2016 this program element will be consolidated with PE 0604826J - Joint C5 (Joint Command, Control, Communications, Computers and Cyber) Capability Development, Integration, and Interoperability Assessments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Systems Integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.150"
                                            },
                                            "Text": {
                                                "val": "(1) Conducted 16 interoperability assessments of fielded and emerging command, control, communications, computers, and cyber (C5) systems that resulted in over 200 recommendations and\/or solutions in support of the National Military Strategy, Chairman’s guidance, and operational needs statements from operational commanders.  Integrated advanced technologies to demonstrate new capabilities in wireless devices (5), wireless security. \n\n(2) Meshed and ad-hoc networking (2), satellite modem technology (1), and small lightweight secure digital datalink capabilities (2) on warfighter command and control nets.  Automated NATO Database Interface (ANDI) Interoperability Assessment – Assessed the automated exchange of targeting data between the U.S. Joint Targeting Toolbox (JTT) and the NATO Joint Targeting System (JTS) which reduces manpower requirements and data entry errors by automating the transfer of targeting data.  This makes targeting data available in real time and reduces targeting errors\/fratricide resulting from bad data.   \n\n(3) Tactical Infrastructure Enterprise Services (TIES) Coalition Warfare Program (CWP) Interoperability Assessment – Executed a successful OCONUS technical demonstration and operational utility assessment of the Tactical Infrastructure Enterprise Services (TIES) Coalition Warfare Program (CWP) that established a two-way identity access management, data security labeling and information exchange capability among multiple allied partner nations.  \n\n(4) Joint Fire Support (JFS) Joint Mission Thread (JMT) Interoperability Assessment – Assessed JFS system of systems interoperability across user, decision maker, and Service boundaries to evaluate the capability to support immediate close air support in a joint\/multinational operational environment to improve time between and accuracy of JCAS capability.\n\n(5) Bold Quest 15 Mission Partner Environment (MPE) Federated Mission Networking (FMN) Joining, Membership and Exit Instructions (JMEI) Assessments – Assessed developing JMEIs to implement MPE in the Bold Quest operational venue.  Provides risk mitigation for global implementation of MPE partner information sharing as a key enabler of Joint Force 2020.\n\n(6) Coalition Warrior Interoperability Exploration, Experimentation, Examination Exercise (CWIX) Interoperability Assessments – Conducted interoperability assessments between selected systems during the CWIX 2015 event. CWIX provides the venue for NATO and coalition partners to pool and share resources to achieve C2 systems interoperability prior to deployment.\n\n(7) Federated Mission Networking (FMN)\/Mission Partner Environment (MPE) Assessment and Enhancement of Civilian-Military Interoperability – Assessed the tactics, techniques, procedures, and methodologies to overcome the challenges of incompatible\/non-interoperable services and systems required for the timely establishment of effective information sharing with non-military mission partners supporting humanitarian disaster relief operations.\n\n(8) Austere Challenge 2015; Radiant Mercury Operational Demonstration Capability Assessment – Validated the correction of previously discovered discrepancies in the prescribed Radiant Mercury Rule-Set that allows compliant data flow between USEUCOM headquarters and UK headquarters.\n\n(9) Coalition Validation and Verification Environment (C2VE) – Developed a persistent assessment environment that enables Coalition partners to validate the capability to share critical information quickly and accurately to support information exchange requirements of multi-national operations.\n\n(10) Bold Quest (BQ) 2015 Engineering Support – Designed, accredited, installed, operated and maintained the BQ15 exercise tailored network in support of the BQ operational demonstration.\n\n(11) Friendly Force Tracking (FFT) Assessment Support – Assessed US and Allied ground to air situational awareness systems and capabilities to ensure shared situational awareness and reduce the risk of fratricide incidents in coalition air-to-ground situations.\n\n(12) Targeting and Intelligence, Surveillance and Reconnaissance Systems Interoperability Assessment – Conducted an interoperability assessment between US Pacific Command and Theater Service Components joint targeting and command\/decision systems that identified interoperability gaps and recommended potential solutions.\n\n(13) Distributed Common Ground System-Army Interoperability Assessment – Conducted an interoperability assessment in support of the Joint Interoperability Test Command’s interoperability certification of the DCGS-A version 3.2 interface to the Modernized Integrated Database (MIDB).  This interface is used daily in USEUCOM and Korea to maintain currency and validity of intelligence databases. \n\n(14) Joint Operational Long Term Evolution Deployable (JOLTED) Tactical Cellular System (TACTICS) Joint Capability Technical Demonstration (JCTD) - Technical Manager – JOLTED TACTICS is an ongoing project that is an Internet Protocol (IP) based system designed to provide secure cellular communications to tactical users. This system leverages innovations in Fourth Generation (4G) LTE Cellular technologies and mobile Ka band spread spectrum satellite communications to deliver megabits of data to mobile and dismounted teams armed with mobile devices such as smartphones or netbooks.\n\n(15) C2 Applications over Broadband Cellular (C2 ABC) Integration and Assessment – Ongoing project that is integrating and assessing legacy C2 and emerging tailored applications using broadband cellular technologies to provide the warfighter at the tactical edge with expanded situational awareness.\n\n(16) National Security Agency (NSA) Commercial Solutions for Classified (CSfC) Secure Wireless Local Area Network (SWLAN) Integration Assessment – Assisted NSA in the development and assessment of a Suite B software encryption solution. This capability supports communicating over classified wireless networks without using Type-1 hardware.\n\n(17) Classified Reconfigurable Operational Wireless Network Integration (CROWN) – Developing a multi-classification secure wireless capability that is fully compliant and supports integration of commercial smartphones, tablets, and laptops for access to enterprise services for deployed users.  Its development will enable rapid deployment of communications capability to a tactical environment with a reduced physical footprint, increased logistical flexibility, and reduced cost.\n\n(18) Tactical Infrastructure Enterprise Services (TIES) Joint Capability Technical Demonstration (JCTD) Interoperability Assessment - Assessed the capability of sharing data from authoritative data sources using web services in a National Information Exchange Model (NIEM) conformant standardized data format.\n\n(19) C2 Common Operating Picture (COP) Support and Assessment to Cyber Flag (CF) 2015-1 – Provided C2 systems, a common operational picture, and assessment of cyber effects on these systems integrated into the Navy Defensive Cyber Operation DoD Information Network (DoDIN) Simulation, Training, and Exercise Platform (STEP) environment.\n\n(20) Cyberspace Situational Awareness Display, Symbology Set Assessment – Assessed the usability, usefulness, and scope of newly published MIL-STD-2525D, standardized graphical symbols for use in Cyberspace operations information displays.\n\n(21) DoD Enterprise Cyber Range Environment (DECRE) Event 3 – Developed the distributed DECRE by integrating additional organizations and capabilities and leveraging the best practices, tools, and procedures required to provide an environment for training cyber warriors, assessing cyber techniques, and assessing networks and systems vulnerabilities.  DoD lacks an enterprise training and development environment to further understand computer network defense activities, operations, and impacts. \n \n(22) Navy Cyber Defense Operations Command Facility Support – Provided selected systems to assess system vulnerabilities to red team exploitation.\n\n(23) Cyber Assessment Event Number 4 Phases 1, 2, 3 - Provided a representative Joint Task Force (JTF) Headquarters node to assess C2 system vulnerabilities to red team exploitation and improve blue team responses.\n\n(24) Office of Cost Assessment and Program Evaluation (CAPE) Cyber Defense C2 Systems Support – Provided required systems, system administration support and connectivity for three events to evaluate cyberspace defensive strategies and allow for the exploration of the impact of alternate defensive strategies.\n\n(25) Cyber Guard 15 Assessment and Support – Provided assessment and all infrastructure support to sustain services to 180 workstations for 540 participants for three events which assessed Cyber Mission Force command and control operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A: Consolidating to new PE in FY2016 - reference PE0604826J"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "N\/A: Consolidating to new PE in FY2016 - reference PE0604826J"
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Consolidation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Consolidating to new PE in FY2016 - reference PE0604826J"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}