{
    "id": "d5ebfbf6af84b7649f628a58a10673abbede7507",
    "meta": {
        "filename": "dod-2017_RDTE_2017_ARMY_BA5A_U_RDTE_JustificationBook_Army_PB_2017.zzz_unzipped_U_RDTE_JustificationBook_Army_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604854A"
        },
        "ProgramElementTitle": {
            "val": "Artillery Systems - EMD"
        },
        "R1LineNumber": {
            "val": "107"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "1.838"
            },
            "CurrentYear": {
                "val": "1.953"
            },
            "BudgetYearOne": {
                "val": "1.756"
            },
            "BudgetYearOneBase": {
                "val": "1.756"
            },
            "BudgetYearTwo": {
                "val": "1.800"
            },
            "BudgetYearThree": {
                "val": "2.155"
            },
            "BudgetYearFour": {
                "val": "6.998"
            },
            "BudgetYearFive": {
                "val": "8.754"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Lightweight 155mm Howitzer (LW155), also known as the M777A2, provides direct, reinforcing, general support fires to maneuver forces and direct support artillery. It replaces all howitzers in all missions in the USMC and replaces the M198 howitzer as the general support artillery for light forces in the Army. The LW155 fires unassisted projectiles to a range of 15 miles and assisted projectiles to 19 miles. The addition of the digital fire control system enables the weapon to program and fire the improved Excalibur precision-guided munitions to ranges in excess of 25 miles with better than 10-meter Circular Error Probable (CEP) accuracy. The LW155 is the first ground combat system whose major structures are made of high strength titanium alloy and the system makes extensive use of hydraulics to operate the breech, load tray, recoil and wheel arms. The combination of titanium structures and the use of hydraulic systems resulted in a significant weight savings of 7000 lbs over the M198 system. Compared to the M198, the LW155 emplaces three-times faster and displaces four-times faster. It traverses 32 percent more terrain worldwide and is 70 percent more survivable than the M198. It is a successful joint service program between the Marine Corps and Army working together to develop, produce, field, and sustain the howitzer. The LW155 was first introduced into the Marine Corps in April 2005 and the Marines have now fielded the howitzer to all active units. The Army has fielded the howitzer to its Stryker Brigade Combat teams (SBCT), Fires Brigades and National Guard. Fielding of the Infantry Brigade Combat Teams (IBCT) commenced in FY14 and will continue through 2018. The LW155 saw extensive action in Afghanistan, receiving high marks for its performance. Having now been in the field for almost 10 years, the howitzer will be going through obsolescent replacement of electronic components in its digital fire control system.  \n\nFunding supports engineering studies for capabilities identified in the Joint U.S. Army, U.S. Marine Corps Operational Requirements Document (JORD) for the Advanced Towed Cannon System but deferred during Engineering Manufacturing and Development due to technology maturity, cost and schedule as well as government sustainment activities requiring RDTE. This includes a digital direct fire sight for the Digital Fire Control System; low temperature, high density power solutions; and electric elevation drives and auto loader to achieve full operational requirements. Efforts in FY2015-FY2018 center on researching technical solutions while efforts in FY2019-FY2021 will involve developing technology demonstrator prototypes."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.911"
                },
                "CurrentYear": {
                    "val": "1.953"
                },
                "BudgetYearOne": {
                    "val": "1.973"
                },
                "BudgetYearOneBase": {
                    "val": "1.973"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.838"
                },
                "CurrentYear": {
                    "val": "1.953"
                },
                "BudgetYearOne": {
                    "val": "1.756"
                },
                "BudgetYearOneBase": {
                    "val": "1.756"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.073"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.217"
                },
                "BudgetYearOneBase": {
                    "val": "-0.217"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.073"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.217"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.217"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "509"
                    },
                    "ProjectTitle": {
                        "val": "LIGHTWEIGHT 155M HOWITZER"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.838"
                        },
                        "CurrentYear": {
                            "val": "1.953"
                        },
                        "BudgetYearOne": {
                            "val": "1.756"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.756"
                        },
                        "BudgetYearTwo": {
                            "val": "1.800"
                        },
                        "BudgetYearThree": {
                            "val": "2.155"
                        },
                        "BudgetYearFour": {
                            "val": "6.998"
                        },
                        "BudgetYearFive": {
                            "val": "8.754"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Lightweight 155mm (LW155) Towed Howitzer is a jointly managed program with the Marine Corps."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Lightweight 155mm Howitzer (LW155), also known as the M777A2, provides direct, reinforcing, general support fires to maneuver forces and direct support artillery. It replaces all howitzers in all missions in the USMC and replaces the M198 howitzer as the general support artillery for light forces in the Army. The LW155 fires unassisted projectiles to a range of 15 miles and assisted projectiles to 19 miles. The addition of the digital fire control system enables the weapon to program and fire the improved Excalibur precision-guided munitions to ranges in excess of 25 miles with better than 10-meter Circular Error Probable (CEP) accuracy. The LW155 is the first ground combat system whose major structures are made of high strength titanium alloy and the system makes extensive use of hydraulics to operate the breech, load tray, recoil and wheel arms. The combination of titanium structures and the use of hydraulic systems resulted in a significant weight savings of 7000 lbs over the M198 system. Compared to the M198, the LW155 emplaces three-times faster and displaces four-times faster. It traverses 32 percent more terrain worldwide and is 70 percent more survivable than the M198. It is a successful joint service program between the Marine Corps and Army working together to develop, produce, field, and sustain the howitzer. The LW155 was first introduced into the Marine Corps in April 2005 and the Marines have now fielded the howitzer to all active units. The Army has fielded the howitzer to its Stryker Brigade Combat teams (SBCT), Fires Brigades and National Guard. Fielding of the Infantry Brigade Combat Teams (IBCT) commenced in FY14 and will continue through 2018. The LW155 has seen extensive action in Afghanistan, receiving high marks for its performance. Having now been in the field for almost 10 years, the howitzer will be going through obsolescent replacement of electronic components in its digital fire control system. \n\nFunding supports engineering studies for capabilities identified in the Joint U.S. Army, U.S. Marine Corps Operational Requirements Document (JORD) for the Advanced Towed Cannon System but deferred during Engineering Manufacturing and Development due to technology maturity, cost and schedule as well as government sustainment activities requiring RDTE. This includes a digital direct fire sight for the Digital Fire Control System; low temperature, high density power solutions; electric elevation drives and auto loader to achieve full operational requirements; and extended range and mobility concepts. Efforts in FY2015-FY2018 center on researching technical solutions while efforts in FY2019-FY2021 will involve developing technology demonstrator prototypes."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Description": {
                                        "val": "Funding supports management services within the Program Management Office, Towed Artillery Systems"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.194"
                                            },
                                            "Text": {
                                                "val": "Funding supported management and coordination with the Armaments Research Development and Engineering Center to conduct trade studies to determine the best material solution for the digital direct fire sight and low temperature, high density power solutions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.197"
                                            },
                                            "Text": {
                                                "val": "Funding supports management and coordination with the Armaments Research Development and Engineering Center to conduct modeling, simulation, analysis and trade studies to characterize the M777A2 for performance improvements. The data generated from these efforts will be used to establish a database to support future technology demonstrations focused on achieving current JORD objective capabilities as well as Force 2025 and Beyond Initiatives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.199"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.199"
                                            },
                                            "Text": {
                                                "val": "Funding supports management and coordination with the Armaments Research Development and Engineering Center to conduct modeling, simulation, analysis and trade studies to characterize the M777A2 for performance improvements. The data generated from these efforts will be used to establish a database to support future technology demonstrations focused on achieving current JORD objective capabilities as well as Force 2025 and Beyond Initiatives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Funds engineering support from the Armaments Research Development and Engineering Center"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.644"
                                            },
                                            "Text": {
                                                "val": "Funding supported conduct of trade studies to determine the best material solution for digital direct fire sight for the Digital Fire Control System and low temperature, high density power solutions to achieve full operational requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.756"
                                            },
                                            "Text": {
                                                "val": "Funding will support continued modeling, simulation, and analysis to characterize the objective M777A2 extended range design, analysis, and drawings. Continues XM907 common cannon assembly support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.557"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.557"
                                            },
                                            "Text": {
                                                "val": "Funding will support continued modeling, simulation, and analysis to characterize the objective M777A2 extended range design, analysis, and drawings. Continues XM907 common cannon assembly support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "M777 Mods"
                                    },
                                    "Title": {
                                        "val": "M777 Mods - Modification of Weapons and Other Combat Vehicles SSN GZ1700"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.166"
                                        },
                                        "CurrentYear": {
                                            "val": "10.070"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.913"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.913"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.553"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.973"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.201"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.290"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Procurement Funding supports active retrofits and hardware refresh for previously contracted Digital Fire Control System components, addressing obsolescence."
                        },
                        "AcquisitionStrategy": {
                            "val": "This will be a collaborative effort between the Program Management Office, Towed Artillery Systems, and the Armaments Research Development and Engineering Center at Picatinny Arsenal."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Sub Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Program Management Towed Artillery Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.194"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.197"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.199"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.199"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Armaments Research & Developmet Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.644"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.756"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.557"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.557"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "98178-169.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "M777 Engineering Tools Development & Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "XM907 Common Cannon Assembly Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Objective M777ER Design, Analysis & Drawings"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Objective M777ER Component Fabrication"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}