{
    "id": "e27c08d9db0315a025cab1dd1c63cd1eec16bc14",
    "meta": {
        "filename": "dod-2017_RDTE_2017_NAVY_BA1_3_U_RDTE_MasterJustificationBook_Navy_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Navy_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603758N"
        },
        "ProgramElementTitle": {
            "val": "Navy Warfighting Exp & Demo"
        },
        "R1LineNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "55.363"
            },
            "CurrentYear": {
                "val": "65.946"
            },
            "BudgetYearOne": {
                "val": "60.550"
            },
            "BudgetYearOneBase": {
                "val": "60.550"
            },
            "BudgetYearTwo": {
                "val": "84.122"
            },
            "BudgetYearThree": {
                "val": "93.270"
            },
            "BudgetYearFour": {
                "val": "117.192"
            },
            "BudgetYearFive": {
                "val": "154.271"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) addresses the development of recent technology breakthroughs to meet current operational needs from a subscale proof-of-principle into a full-scale prototype for warfighter experimentation during laboratory and operational demonstrations, Fleet Battle Experiments (FBE), Limited Objective Experiments (LOEs) and sea trial exercises.  The key aspects of this PE are divided into four areas: (1) SwampWorks develops and demonstrates newly invented or recently discovered technologies that address emergent and enduring operational problems in an accelerated timeframe; (2) Naval Warfare Experimentation develops rapid prototypes and provides them to the warfighter for experimentation during laboratory and operational demonstrations; (3) TechSolutions develops rapid response science and technology prototypes addressing Fleet\/Force needs identified by Sailors and Marines at the deckplate level; (4) Operations Analysis provides the Navy and Marine Corps the means to identify capability needs that can be addressed with science and technology solutions, and (5) Manufacturing Technology Science and Technology (S&T) to accelerate recently discovered manufacturing technologies to reduce the acquisition and ownership costs of current and future platforms.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE. \n\nFunding increased in FY2016 in order to accommodate increased Naval Warfare Experimentation to support emergent opportunities to meet fleet needs with potential technology solutions and SwampWorks due to the increased research and fleet interest in the areas of Autonomy, Electromagnetic Warfare and the exploitation of unmanned systems.  \n\nNote: For Manufacturing Technology S&T, the funds in FY2016 ($7.495M) and beyond have moved to new PE 0603680N Manufacturing Technology Program."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "53.876"
                },
                "CurrentYear": {
                    "val": "66.041"
                },
                "BudgetYearOne": {
                    "val": "61.995"
                },
                "BudgetYearOneBase": {
                    "val": "61.995"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "55.363"
                },
                "CurrentYear": {
                    "val": "65.946"
                },
                "BudgetYearOne": {
                    "val": "60.550"
                },
                "BudgetYearOneBase": {
                    "val": "60.550"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.487"
                },
                "CurrentYear": {
                    "val": "-0.095"
                },
                "BudgetYearOne": {
                    "val": "-1.445"
                },
                "BudgetYearOneBase": {
                    "val": "-1.445"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.095"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.303"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.816"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.118"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.118"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.327"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.327"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2918"
                    },
                    "ProjectTitle": {
                        "val": "Navy Warfighting Experiments and Demo"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "55.363"
                        },
                        "CurrentYear": {
                            "val": "65.946"
                        },
                        "BudgetYearOne": {
                            "val": "60.550"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.550"
                        },
                        "BudgetYearTwo": {
                            "val": "84.122"
                        },
                        "BudgetYearThree": {
                            "val": "93.270"
                        },
                        "BudgetYearFour": {
                            "val": "117.192"
                        },
                        "BudgetYearFive": {
                            "val": "154.271"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project focuses on the development of recent technology breakthroughs to meet current operational needs from a subscale proof-of-principle into a full-scale prototype for warfighter experimentation during laboratory and operational demonstrations, Fleet Battle Experiments (FBEs), Limited Objective Experiments (LOEs) and sea trial exercises."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ONR EXPERIMENTATION"
                                    },
                                    "Description": {
                                        "val": "The objective of this project is to capitalize on recent technology breakthroughs to integrate components and subsystems into prototypes for field experiments and\/or tests in simulated or actual environments. The use of Navy Warfare Development Command (NWDC) Fleet Experimentation (FLEX)  events is encouraged and the net results are to gain the knowledge that only an experiment can provide.\n\nFunding increase in FY2016 will support emergent opportunities to meet fleet needs with potential technology solutions including demonstrations and experimentation with Directed Energy and High Energy Laser Weapons Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.571"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued concept based technology program efforts.\n- Continued experimentation efforts with technologies developed in SwampWorks\/TechSolutions.\n- Continued to identify promising technology breakthroughs that can be prototyped and delivered to the warfighter for experimentation.\n- Continued development and demonstration of real time situational awareness technologies such as battlespace enhanced mixed reality.\n- Continued technology experimentation for Total Ownership Cost (TOC) reduction such as the advanced aircraft top coats and topside corrosion control.\n- Continued efforts to develop, demonstrate and experiment with technologies to meet current or emerging operational needs.\n- Initiated demonstrations and experimentation with Directed Energy (DE) and High Energy Laser (HEL) advanced weapons systems.\n- Successfully conducted an experiment to demonstrate unmanned surface vehicle swarming technologies in collaboration with the warfighter, laboratories and operational forces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.688"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY2015 unless noted as completed above.  \n- Demonstrate unmanned air vehicle swarming technologies in collaboration with the warfighter, laboratories and operational forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.352"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.352"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY2016 unless noted as completed above.\n- Initiate experimentation initiatives to support high impact Fleet efforts\n- Leverage fleet experimentation venues in order to optimize development efforts and gain greater fleet\/force feedback of developing technologies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OPERATIONS ANALYSIS"
                                    },
                                    "Description": {
                                        "val": "The objective of this project is to provide operational analysis through studies, analyses, gaming and experimentation to identify Navy and Marine Corps capability needs that can be addressed with S&T solutions. The effort includes core analysis of S&T programs, military utility\/capability gaps analyses, war gaming, structured experimentation events, the articulation of the results of that analysis and wargaming, and the development of innovation strategies and messages resulting from these analyses. Recent work includes participation in SIMEX design, data collection and analysis events; wargame design in support of the ONR Office of Technology; analytical, strategic planning, and wargaming support; organizing and conducting workshops and symposia that increase innovation outreach; and participating in Red Teaming and conceptual analysis.\n\nFunding increase in FY2017 will accommodate increased efforts needed to support increased experimentation planning and execution and robust concept development efforts in support of the Innovative Naval Prototyping program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.746"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to conduct Military Utility Analyses of Future Naval Capability technologies.\n- Continued to conduct capability gaps analyses to identify areas that can be addressed with products from the S&T portfolio.\n- Continued to conduct SIMEX development, execution, data collection and analysis.\n- Continued to conduct war-game design in support of the ONR Office of Technology.\n- Successfully conducted a war-game to identify capability needs for the NEMESIS Innovative Naval Prototype, operational personnel participated to ensure S&T solutions were focused on capabilities needed in electronic warfare."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.178"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY2015 unless noted as completed above.\n- Conduct a war-game to identify capability needs for the medium displacement unmanned surface vehicle, utilize operational personnel to ensure S&T solutions are focused on capabilities needed for unmanned systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.112"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.112"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY2016 unless noted as completed above.\n- Initiate new efforts in support of Fleet\/Force."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SWAMPWORKS"
                                    },
                                    "Description": {
                                        "val": "SwampWorks seeks to develop and demonstrate technologies that address emergent and enduring operational problems in an accelerated timeframe.  The general nature of these efforts are high risk\/high reward and constitute a leap ahead in capability or technology.  Some of these technologies may become part of a follow-on technology development, may end up in the hands of the warfighter for Fleet\/Force experimentation, or may culminate in a significant Fleet\/Force exercise that demonstrates capability then transitions into the Acquisition Program of Record (POR).\n\nFunding increase in FY2016 is due to the increased research in Directed Energy (Solid State Laser - Technology Maturation, or SSL-TM). This investment was a single year investment and thus the decrease from FY2016 to FY2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.004"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to identify enduring and emergent operational barriers identified by naval leadership and responded with relevant technology developments and demonstrations.\n- Continued disruptive commercial technology studies at varied military, government, and educational institutions.\n- Continued high risk\/high payoff projects to explore significant leap-ahead capabilities.\n- Continued efforts to develop technologies to meet current or emerging operational needs.\n- Continued investment in submarine control surface technologies.\n- Continued investment in advanced electronic warfare technologies; projects are expected to be classified at a higher level.\n- Continued efforts to develop and demonstrate technologies to meet current or emerging operational needs to include vision enhancement, electronic warfare, diving technologies.\n- Continued efforts that develop and\/or demonstrate advanced technologies in support of Fleet issue in an accelerated timeframe."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.064"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY2015 unless noted as completed above.\n- Initiate additional projects in the area of Autonomy, Electromagnetic Warfare and exploitation of unmanned systems\n- Pursue emergent technology opportunities to support high impact pacific pivot efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.086"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.086"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY2016 unless noted as completed above."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TECH SOLUTIONS"
                                    },
                                    "Description": {
                                        "val": "TechSolutions develops rapid response Science and Technology (S&T) solutions to immediate Fleet\/Force needs identified by individual warfighters at the deckplate level. Sailors, Marines and Science Advisors submit their issues throughout the year via the TechSolutions website, email, phone, or chain of command. Projects are initiated as requests are received and are completed in approximately twelve to eighteen months, resulting in a prototype demonstration of TRL 6 or higher."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.056"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed CVN 360 degree Surveillance System providing improved EO\/IR situational awareness of the local area to CVN personnel and Virginia class Diesel Generator 3D Trainer \n- Continued development of projects that provide solutions to problems identified by Science Advisors and the Fleet\/Force to address emergent critical needs.\n- Rapidly responded to the needs of our warfighters. Some examples include a Submarine Electronic Sonar Tacaid that automates dated procedures that utilize mechanical devices,  beyond the line of sight control for the UAS Scan Eagle, and a low light aiming system for the 60mm lightweight mortar"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.016"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY2015 unless noted as completed above.\n- Continue development of projects that will provide solutions to address emergent critical needs.\n- Develop, demonstrate and deliver technical solution prototypes to projects initiated in the previous fiscal year."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY2016 unless noted as completed above.\n- Initiate rapid response S&T projects in direct support of Fleet\/Force needs."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANUFACTURING TECHNOLOGY S&T"
                                    },
                                    "Description": {
                                        "val": "The Manufacturing Technology S&T program accelerates recently discovered manufacturing technologies to reduce the acquisition and ownership costs of current and future platforms which assists in meeting performance and platform affordability goals - both acquisition and life-cycle.  This supports a critical goal of the Navy, meeting the affordability goals of major acquisition platforms, by accelerating emerging manufacturing technology. \n\nThe funds in FY2016 ($7.495M) and beyond have moved to new PE 0603680N Manufacturing Technology Program.  The funding has been distributed to R2 activities within that PE as follows:  $1.200 Composites Processing and Fabrication, $0.957M to Electronics Processing and Fabrication, $5.338M to Manufacturing Enterprise\/Other."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.986"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued\/accelerated recently discovered manufacturing technologies to reduce the acquisition and ownership costs of current and future platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Funds moved to new PE 0603680N Manufacturing Technology Program.\nThe funding has been distributed to R2 activities within that PE as follows: $1.200M Composites Processing and Fabrication, $0.957M to Electronics Processing and Fabrication, $5.338M to Manufacturing Enterprise\/Other."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Overall metric goals are to transition the 6.3 advanced technology projects into acquisition programs of record, demonstrate successful technologies to enable new operational concepts, and enable the production of technology products such as proofs of concept and manufacturing packages. The performance of the work funded in this PE is reviewed at several levels to ensure that the investment is relevant and productive.  At the macroscopic level, the investment is coordinated with Navy Warfare Development Command and Commander, Fleet Forces Command to address the goals and objectives identified for sea trials and Limited Objective Experiments (LOEs).  At the microscopic level, the work funded in this PE is reviewed periodically by the Program Manager to ensure the investment is meeting the goals defined for each project. This review includes feedback collected from the warfighter community on all sea trials and LOEs to support the Program Manager's assessment of the value and relevance of each investment. Furthermore, the entire program is reviewed yearly by the Chief of Naval Research."
                        }
                    }
                }
            ]
        }
    }
}