{
    "id": "f52b21a290701abc01000e9a3459af2eb1b2b517",
    "meta": {
        "filename": "dod-2017_RDTE_2017_DARPA_U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603766E"
        },
        "ProgramElementTitle": {
            "val": "NETWORK-CENTRIC WARFARE TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "57"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "350.323"
            },
            "CurrentYear": {
                "val": "425.861"
            },
            "BudgetYearOne": {
                "val": "428.894"
            },
            "BudgetYearOneBase": {
                "val": "428.894"
            },
            "BudgetYearTwo": {
                "val": "410.027"
            },
            "BudgetYearThree": {
                "val": "392.905"
            },
            "BudgetYearFour": {
                "val": "368.717"
            },
            "BudgetYearFive": {
                "val": "337.668"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Network-Centric Warfare Technology program element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to develop and rapidly mature advanced technologies and systems required for today's network-centric warfare concepts.  It is imperative for the future of the U.S. forces to operate flawlessly with each other, regardless of which services and systems are involved in any particular mission.  The overarching goal of this program element is to enable technologies at all levels, regardless of service component, to operate as one system.\n\nThe objective of the Joint Warfare Systems project is to create enabling technologies for seamless joint operations, from strategic planning to tactical and urban operations.  Joint Warfare Systems leverage current and emerging network, robotic, and information technology and provide next generation U.S. forces with greatly expanded capability, lethality, and rapid responsiveness.  Critical issues facing this project are:  (1) U.S. opponents utilizing systems that are flexible, robust, and difficult to neutralize; and (2) U.S. doctrine that limits the use of firepower to lessen the impact of operations on noncombatants.  These problems are magnified in urban and semi-urban areas where combatants and civilians are often collocated, and in peacekeeping operations where combatants and civilians are often indistinguishable.  Meeting these challenges places a heavy burden on joint war planning.  Understanding opponent networks is essential so that creative options can be developed to counter their strategies.  Synchronization of air and ground operations to apply force only where needed and with specific effects is required.  \n\nThe Maritime Systems project will identify, develop and rapidly mature critical advanced technologies and system concepts for the naval forces' role in today's network centric warfare concept.  Improvements in communications between and among submarines, surface ships and naval aircraft have allowed these forces to operate seamlessly with each other and with other Service's network centric systems.  Naval forces will play an ever-increasing role in network centric warfare because of their forward deployed nature, their unique capability to operate simultaneously in the air, on the sea and under the sea and their versatile ability to provide both rapid strike and project-sustained force.  The technologies developed under this project will capitalize on these attributes, improve them and enable them to operate with other network centric forces."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "360.426"
                },
                "CurrentYear": {
                    "val": "452.861"
                },
                "BudgetYearOne": {
                    "val": "470.582"
                },
                "BudgetYearOneBase": {
                    "val": "470.582"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "350.323"
                },
                "CurrentYear": {
                    "val": "425.861"
                },
                "BudgetYearOne": {
                    "val": "428.894"
                },
                "BudgetYearOneBase": {
                    "val": "428.894"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-10.103"
                },
                "CurrentYear": {
                    "val": "-27.000"
                },
                "BudgetYearOne": {
                    "val": "-41.688"
                },
                "BudgetYearOneBase": {
                    "val": "-41.688"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-7.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-20.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.875"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-10.978"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-41.688"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-41.688"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015:  Decrease reflects reprogrammings offset by the SBIR\/STTR transfer.\nFY 2016:  Decrease reflects congressional reduction.\nFY 2017:  Decrease reflects the completion of several classified programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "NET-01"
                    },
                    "ProjectTitle": {
                        "val": "JOINT WARFARE SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "45.784"
                        },
                        "CurrentYear": {
                            "val": "66.219"
                        },
                        "BudgetYearOne": {
                            "val": "72.916"
                        },
                        "BudgetYearOneBase": {
                            "val": "72.916"
                        },
                        "BudgetYearTwo": {
                            "val": "111.556"
                        },
                        "BudgetYearThree": {
                            "val": "144.765"
                        },
                        "BudgetYearFour": {
                            "val": "160.416"
                        },
                        "BudgetYearFive": {
                            "val": "202.367"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The objective of the Joint Warfare Systems project is to create enabling technologies for seamless joint operations, from strategic planning to tactical and urban operations.  Joint Warfare Systems leverage current and emerging network, robotic, and information technology and provide next generation U.S. forces with greatly increased capability, lethality, and rapid responsiveness.  Critical issues facing this project are: (1) U.S. opponents using systems that are flexible, robust, and difficult to neutralize; and (2) U.S. doctrine that limits the use of firepower to lessen the impact of operations on noncombatants.  These problems are magnified in urban and semi-urban areas where combatants and civilians are often co-located and in peacekeeping operations where combatants and civilians are often indistinguishable.  Meeting these challenges places a heavy burden on joint war planning.  Understanding opponent networks is essential so that creative options can be developed to counter their strategies.  Synchronization of air and ground operations to apply force only where needed and with specific effects is required.  This project supports all levels of the force structure including: (1) the strategic\/operational level by generating targeting options against opponents' centers of gravity that have complex networked relationships; (2) the tactical\/operational level by managing highly automated forces with tight coupling between air and ground platforms; and (3) the focused tactical level by developing platforms and tools, which acquire targets of opportunity and cue network-based analysis of likely enemy operations thus maximizing the effectiveness of ground forces in stability and support operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System of Systems Integration Technology and Experimentation (SoSite)"
                                    },
                                    "Description": {
                                        "val": "The System of Systems Integration Technology and Experimentation (SoSite) program seeks to implement an architecture framework capable of assessing and demonstrating potential operational benefits of integrating various system capabilities to improve mission success in contested environments.  Such assessments would optimize system-level trades of requirements and architectures to properly leverage an integrated set of system characteristics and capabilities.  The demonstration assessment metrics will measure individual and combined system performance to further streamline resource allocation to maximize operational impact.  In addition, providing a modeling and simulation (M&S) environment to assess complex systems will enable greater utility of emerging system technologies, since they can be assessed in near-real-world simulations without the real-world costs of testing fully integrated systems.  The program will also develop system synthesis and integration technologies that enable rapid assimilation of new and off-the-shelf technologies into the system of systems architecture.  These technologies will break down current barriers to entry that new technologies face in system of systems using formal methods, compositional reasoning, and automated design space exploration.  Technologies from this program will be transitioned to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.411"
                                            },
                                            "Text": {
                                                "val": "-  Developed reference objective system of systems architecture.\n-  Commenced development of architecture demonstration plan, including range and platform options.\n-  Implemented M&S capabilities for architecture design analysis and validation.\n-  Commenced the development of system of systems synthesis and integration tools and protocols.\n-  Commenced development of engineering tools to validate system of systems architecture designs.\n-  Commenced development of formal verification techniques to validate integration of constituent systems into a system of systems.\n-  Investigated technologies to facilitate multi-level open architecture security.\n-  Explored alternative systems architectures, designs, tools, and protocols for the maritime environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36.109"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of architecture demonstration plan, including range and platform options.\n-  Develop a System Integration Laboratory (SIL) to support Government verification and validation of system of systems architectures.\n-  Complete the development of system of systems synthesis and integration tools and protocols.\n-  Complete prototype architecture designs to implement the system of systems concept.\n-  Initiate experimentation in constructive and virtual environments to validate system of systems approach.\n-  Assess in SIL the capability of new engineering tools to validate system of systems architecture designs.\n-  Assess in SIL the capability of new formal verification techniques to validate integration of constituent systems into a system of systems.\n-  Verify prototype of system of systems architectures in M&S environments.\n-  Develop technologies to facilitate multi-level open architecture security M&S.\n-  Identify the most promising alternative systems architectures, designs, tools, and protocols for the maritime environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.681"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.681"
                                            },
                                            "Text": {
                                                "val": "-  Prepare detailed live flight experimentation plans establishing system of systems risk reduction test objectives, experiment designs, required test articles and experiment support assets, and analysis plans.\n-  Secure test articles for flight test experiments: manned and unmanned platforms, and experimental mission systems from DARPA and Service Science and Technology programs.\n-  Secure or develop models of test articles to support laboratory and ground checkout prior to live flight.\n-  Secure support assets required for flight test experiments:  ranges and range instrumentation, frequency and airspace authorizations, pilots, virtual and constructive simulation facilities.\n-  Conduct virtual integration and laboratory checkout of system of systems architectures using test article models to verify those architectures will satisfy risk reduction experimentation objectives.\n -  Integrate test articles into system of systems architectures and conduct ground checkout prior to live flight.\n-  Conduct experiments of system of systems architectures in live flight, augmented with virtual and constructive simulation of test articles not ready for live flight; analyze experiment outcomes and document accomplishment of risk reduction objectives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resilient Synchronized Planning and Assessment for the Contested Environment (RSPACE)"
                                    },
                                    "Description": {
                                        "val": "Currently, Command and Control (C2) of air platforms is a highly centralized process operating largely independently across planning domains (intelligence, surveillance, and reconnaissance (ISR), strike, and spectrum management) and is optimized for a permissive environment.  To address the challenges faced in today's increasingly contested environments, the Resilient Synchronized Planning and Assessment for the Contested Environment (RSPACE) program will develop tools to enable distribution of planning functions across the C2 hierarchy for resilience (e.g., loss of communications) while synchronizing strike, ISR, and spectrum planning to maximize the contribution of all assets through increased utilization and exploitation of synergies.  The program will develop tools supporting a mixed initiative planning approach, maximizing automation according to operator's choice, and enabling human-in-the-loop intervention and modification.  During execution, the tools will provide lifecycle tracking of targeting and information needs and support assessment of progress towards achieving the commander's intent.  The tools will dynamically respond as directed to ad hoc requests and significant plan deviations via a real-time dynamic replanning capability, and easily adapt to technology refreshes.  The RSPACE tools will transition to the Air Force and the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.300"
                                            },
                                            "Text": {
                                                "val": "-  Developed initial concept of operations (CONOPS) for a distributed, communications-challenged set of capabilities to support an integrated strike, ISR, and spectrum management planning and assessment working in place of a fixed Air Operations Center (AOC).\n-  Developed initial system architecture and software framework for distributed strike, ISR, and spectrum management to include planning, assessment, and dynamic replanning.\n-  Developed initial models and simulation capability for testing, analysis, and validation of a set of distributed planning and assessment components working in a communications-challenged environment.\n-  Commenced development of algorithms and prototypes for distributed planning and assessment components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.236"
                                            },
                                            "Text": {
                                                "val": "-  Complete initial development of algorithms and prototypes for distributed planning and assessment components.\n-  Develop models and simulation capability for testing, analysis, and validation of a distributed system operating in a communications-challenged environment.\n-  Implement the framework designs into a software prototype.\n-  Test and evaluate candidate software frameworks and components.\n-  Commence development of decision support tools for operational planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.948"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.948"
                                            },
                                            "Text": {
                                                "val": "-  Develop experiments to highlight the planning and assessment capabilities in both a distributed and communications-challenged environment.\n-  Continue integration efforts with the prototype framework.\n-  Continue development of planning tools that combine planning for strike, reconnaissance and electronic warfare in a distributed environment.\n-  Continue development of assessment capabilities that automatically track plan execution and alert command and control cells when plans are likely to change. \n-  Demonstrate the ability of small, distributed staffs to plan and manage large-scale operations within an established Air Force modeling and simulation environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Retrodirective Arrays for Coherent Transmission (ReACT)"
                                    },
                                    "Description": {
                                        "val": "Worldwide advancements in signal processing and electronics have decreased the effectiveness of single-platform, power-based Electronic Warfare (EW) as a viable technique in the future.  The goal of the Retrodirective Arrays for Coherent Transmission (ReACT) program is to develop and to demonstrate the capability to combine distributed mobile transmitters to provide high-power spatially resolved EW beams at frequencies utilized by adversary communications and radars.  ReACT will achieve this capability by synchronizing multiple distributed transmitters to form a much larger effective array than a single platform could support.  The key technical challenge is to synchronize distributed and moving transmitters while compensating for platform motion and vibration.  Further, the ReACT system must sense the target's emissions and then optimally configure the ReACT transmitters to focus on the area to be jammed, as well as the minimum power required to sufficiently jam the target.  The ReACT program builds upon technology developed under the Arrays at Commercial Timescales (ACT) program, which is budgeted in PE 0602716E, Project ELT-01, and will culminate with a flight demonstration of distributed EW beamforming.  The ReACT technology is planned to transition to the Air Force and Navy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.874"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of algorithms and hardware for coherent beamforming under mobile environments.\n-  Design vibration compensation circuit for feedback control.\n-  Design algorithms that target an adversary by their emissions.\n-  Identify phenomenological barriers (frequency, motion, and vibration) and validate transition opportunities.\n-  Demonstrate system performance over-the-air in mobile ground environments at extended ranges, under operationally representative motion and vibration.\n-  Integrate tracking algorithms for target motion preparing for air-to-ground demonstration of capability.\n-  Begin coordinating program transition with the Navy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.287"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.287"
                                            },
                                            "Text": {
                                                "val": "-  Design predictive algorithms for broadband channel estimation.\n-  Design control and feedback circuits to track high velocity targets based on target's emissions.\n-  Integrate hardware for a dynamic airborne demonstration on multiple aircraft.\n-  Demonstrate ReACT system and quantify performance against high velocity airborne target.\n-  Continue coordinating program transition with the Navy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Liquid Laser Area Defense System (HELLADS)"
                                    },
                                    "Description": {
                                        "val": "The goal of the High Energy Liquid Laser Area Defense System (HELLADS) program was to develop a high-energy laser weapon system that provides an order of magnitude reduction in weight compared to previous laser systems.  HELLADS enabled high-energy lasers (HELs) to be integrated onto tactical aircraft and significantly increased engagement ranges compared to ground-based systems, in addition to enabling high precision\/low collateral damage and rapid engagement of fleeting targets for both offensive and defensive missions.  Advancements in beam control and other subsystems that are required for the practical integration of a laser weapon into existing tactical platforms were explored.  With the assistance of the Services, the HELLADS program pursued the necessary analysis, coordination, and design activity for a prototype laser weapon system incorporating the HELLADS laser system and the ABC turret into air-, ground-, or sea-based tactical vehicles.  The HELLADS 150 kilowatt (kW) class laser will transition to the Air Force.  Additional technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.073"
                                            },
                                            "Text": {
                                                "val": "-  Completed live fire tests against rocket and mortar fly-outs to demonstrate lethal laser power at mission-relevant ranges.\n-  Completed live fire performance tests of laser weapon system against target sets representative of airborne missions, to include targeting of ground vehicles and self-defense against surface-to-air missiles.\n-  Made system available for transition to the Services, and retain as a demonstration and test asset at the Army High Energy Laser System Test Facility (HELSTF)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics Challenge"
                                    },
                                    "Description": {
                                        "val": "The Robotics Challenge program sought to boost innovation in autonomous systems and expand platform utility through enhanced actuation, energy density, perception, locomotion, agile reconfiguration, and design efficiency.  Program thrusts were centered on a progressive regimen of physical problem solving, real-time team oriented tasks, and dynamic adaptation designed to build \"machine trust\", especially when integrated with humans in a variety of operational environments.  The Robotics Challenge program consisted of a series of obstacle course style challenge events that focused on technology solutions to demonstrate and test robot capabilities for disaster response.  The program drove advances in power systems, agility and speed, precision in perception tied to platform coordination, dexterity, and impulsive power.  Program objectives focused on technologies to expand mobility and extend endurance of unmanned platforms, advanced tactile and manipulation capabilities, and tools for cost effective design, validation, and construction of autonomous technology, and human-robot interaction. The 6.2 portion of this program was budgeted in PE 0602702E, Project TT-04. Anticipated Service users include the Army, Marines, and Special Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted DARPA Robotics Challenge Finals."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "High Energy Liquid Laser Area Defense System (HELLADS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.743"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.7430"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Resilient Synchronized Planning & Assessment for the Contested Environment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.187"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "16.060"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.322"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.322"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Retrodirective Arrays for Coherent Transmission (ReACT)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.937"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.584"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.584"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Robotics Challenge"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.507"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.5070"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System of Systems Integration Technology and Experimentation (SoSITE)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.099"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "26.035"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "25.631"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "25.631"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.831"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.649"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.917"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.917"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "High Energy Liquid Laser Area Defense System (HELLADS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "W04W USA WHITE SANDS MSL RANGE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "NM"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.535"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.5350"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Resilient Synchronized Planning & Assessment for the Contested Environment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "THE MITRE CORPORATION"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.850"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.077"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.491"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.491"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Robotics Challenge"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.494"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.4940"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System of Systems Integration Technology and Experimentation (SoSITE)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.249"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.150"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.325"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.325"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.289"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.311"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.646"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.646"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "System of Systems Integration Technology and Experimentation (SoSITE)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "System of System Concept Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Open Systems Architecture Enhancement Reviews\/Demonstrations"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Prototype Architecture Design Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test Readiness Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Air-Air Kill Chain Live, Virtual, Constructive (LVC) Experimentation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resilient Synchronized Planning & Assessment for the Contested Environment (RSPACE)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "System architecture and software development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test Event #1 - Component & System Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test Event #2 - Component & System Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test Event #3 - Component & System Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Demonstration within modeling environment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Retrodirective Arrays for Coherent Transmission (ReACT)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Vibration\/Motion Compensation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Hardware and algorithm completion"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Dynamic Nodes Demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Airborne Target Demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Liquid Laser Area Defense System (HELLADS)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Live fire performance tests of laser weapons system"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Baseline target engagements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Additional lethality testing for Services"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics Challenge"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Conducted DARPA Robotics Challenge Finals"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NET-02"
                    },
                    "ProjectTitle": {
                        "val": "MARITIME SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "72.980"
                        },
                        "CurrentYear": {
                            "val": "119.401"
                        },
                        "BudgetYearOne": {
                            "val": "138.303"
                        },
                        "BudgetYearOneBase": {
                            "val": "138.303"
                        },
                        "BudgetYearTwo": {
                            "val": "126.321"
                        },
                        "BudgetYearThree": {
                            "val": "162.344"
                        },
                        "BudgetYearFour": {
                            "val": "145.301"
                        },
                        "BudgetYearFive": {
                            "val": "135.301"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The objective of the Maritime Systems project is to identify, develop, and rapidly mature critical advanced technologies and system concepts for the naval forces' role in today's network centric warfare concept.  Improvements in communications between and among submarines, surface ships, and naval aircraft have allowed these forces to operate seamlessly with each other and with other Service's network centric systems.  Naval forces will play an ever-increasing role in network centric warfare because of their forward deployed nature, their unique capability to operate simultaneously in the air, on the sea and under the sea, and their versatile ability to provide both rapid strike and project sustained force.  The technologies developed under this project will capitalize on these attributes, improve them, and enable them to operate with other network centric forces."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hydra"
                                    },
                                    "Description": {
                                        "val": "The Hydra program will develop and demonstrate advanced capabilities for the undersea deployment and employment of unique payloads.  Hydra integrates existing and emerging technologies and the ability to be positioned in the littoral undersea battlespace to create a disruptive capability.  The system consists of a modular enclosure with communications, command and control, energy storage, and standard interfaces for payload systems.  The modular enclosures are deployed by various means, depending on the need for speed and stealth, and remain deployed until awakened for employment.  Hydra will develop critical enabling technologies for energy storage and recharging, communications, command and control, deployment, and autonomous operations. Technologies from this program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.790"
                                            },
                                            "Text": {
                                                "val": "-  Completed concept designs for the modular enclosure and potential payloads.\n-  Began development of a prototype modular enclosure.\n-  Began development of undersea and air vehicle payloads.\n-  Demonstrated enabling technologies and subsystems.\n-  Conducted initial flight test of the air vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.363"
                                            },
                                            "Text": {
                                                "val": "-  Build and test prototype modular enclosure.\n-  Complete preliminary design review for undersea payload.\n-  Complete component testing on undersea payload technologies.\n-  Complete critical design review for air vehicle payload.\n-  Conduct flight tests of the air vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.210"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.210"
                                            },
                                            "Text": {
                                                "val": "-  Construct and demonstrate a prototype modular enclosure.\n-  Complete a full air vehicle flight test.\n-  Launch air vehicle from modular enclosure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hybrid Multi Material Rotor Full Scale Demonstration (HyDem)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Hybrid Multi Material Rotor Full Scale Demonstration (HyDem) program is to dramatically improve U.S. Navy submarine superiority.  HyDem will apply breakthroughs in materials and material system technologies, and multi-disciplinary design methods to a Virginia Class Submarine propulsor, a critical component in submarine performance.  The U.S. Navy's ability to operate their submarine fleet with improved capability allows for the creation of strategic surprise.  Submarines could exploit expanded areas which were previously unattainable for the purpose of submarine warfare, including antisubmarine warfare (ASW), antisurface warfare (ASuW), intelligence, surveillance and reconnaissance (ISR) gathering, strike, Special Forces operations, and strategic deterrence missions.  The HyDem program will design, manufacture, and supply the Navy with a novel component for integration into a new construction Virginia Class Submarine.  The Navy will evaluate this component in sea trials.  It is envisioned that the Navy will integrate this design change into the future development of the Virginia Class and Ohio Replacement Submarines, and back-fit previously constructed Virginia Class Submarines.  This program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.982"
                                            },
                                            "Text": {
                                                "val": "-  Conducted a Preliminary Design Review.\n-  Completed manufacturing drawings and tooling.\n-  Conducted a Critical Design Review.\n-  Incorporated design lessons-learned from large scale vehicle (LSV) testing of scaled unit.\n-  Continued structural building block testing.\n-  Confirmed high-cycle fatigue endurance limit for structural material.\n-  Initiated manufacturing of the full-scale propulsor component to be installed on a Virginia Class submarine.\n-  Conducted a shock test of a large-scale model."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete structural building block testing.\n-  Complete manufacturing of the full-scale propulsor component.\n-  Deliver full-scale propulsor component to the Navy for integration into a Virginia Class submarine.\n-  Assess structural and shock qualification of the propulsor component.\n-  Provide integration support for the propulsor component.\n-  Complete shock building block testing.\n-  Initiate development of advanced concepts seeking to improve performance and affordability.\n-  Initiate long-term environment exposure monitoring test program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete shock qualification of propulsor component.\n-  Complete development of advanced concepts.\n-  Transition long-term environmental exposure monitoring program to the Navy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Undersea Network Architecture"
                                    },
                                    "Description": {
                                        "val": "Systems fighting as a network are vulnerable to a loss of connectivity in a contested environment.  This connectivity is important for synchronizing forces, establishing and maintaining situation awareness, and control of remotely operated vehicles and systems.  Additionally, undersea systems are challenged to maintain connectivity and must carry their own energy and operate over their design lifetime with little to no maintenance and repair.  These factors inhibit their use in collaborative networks and prevent the full exploitation of the potential of undersea systems.  By leveraging techniques explored under the Distributed Agile Submarine Hunting (DASH) program budgeted within this PE\/Project, the Tactical Undersea Network Architecture program will overcome these limitations by developing the technologies necessary for autonomous, reliable, and secure undersea data transfers; true plug, play, and operating standards; and rapid, cost effective deployment technologies. The program will develop and demonstrate novel technology options and designs to temporarily restore connectivity for existing tactical data networks in contested environments using small diameter optical fiber and buoy relay nodes.  The program will focus on innovative system architecture designs, lightweight optical fiber technologies, and rapidly deployable buoy node designs and component technologies.  The Tactical Undersea Network Architecture program will emphasize early risk reduction with future scaled at-sea integrated demonstrations of increasing complexity.  Program technologies will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.384"
                                            },
                                            "Text": {
                                                "val": "-  Commenced system architecture design trade studies, modeling, and simulation.\n-  Commenced small lightweight optical fiber development and fiber performance testing.\n-  Assessed system deployment options; developed cost model.\n-  Developed system component-level technologies and commenced scaled component-level testing.\n-  Identified key system risks and technology trades."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.500"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate environmental condition's impact on system performance via modeling and simulation.\n-  Complete system architecture design trade studies and preliminary designs.\n-  Continue fiber performance testing; demonstrate fiber survivability under at-sea conditions.\n-  Conduct system-level performance modeling.\n-  Complete component-level testing.\n-  Commence prototype system design and plan for sea test."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.173"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.173"
                                            },
                                            "Text": {
                                                "val": "-  Complete and evaluate prototype system design and design review.\n-  Commence system fabrication and integration testing.\n-  Continue at-sea system demonstration planning and coordination.\n-  Demonstrate deployment and at-sea operation and survival."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blue Wolf"
                                    },
                                    "Description": {
                                        "val": "Undersea platforms have inherent operational and tactical advantages such as stealth and surprise.  Platform drag due to fluid viscosity and platform powering requirements varies with the speed through the water.  Platform energy and power density limitations create two distinct operational usage profiles: one for unmanned undersea vehicles (low speed, long endurance) and another for undersea weapons (high speed, short endurance).  Designers have historically solved this with hybrid systems such as the Navy's Vertical Launch Anti-Submarine Rocket, or by increasing the size of undersea systems.  However, hybrid systems can be vulnerable to air and undersea defensive systems and larger undersea systems can result in significant launch platform modifications. The Blue Wolf program seeks to provide a radically different solution to develop and demonstrate an undersea demonstrator vehicle with endurance and speed capabilities beyond conventional undersea systems within the weight and volume envelopes of current Navy undersea systems.  Significant technical challenges to be addressed include: dynamic lift and drag reduction; hybrid energy system development compatible with existing manned platform safety requirements and certification; and system integration and demonstration in at-sea environment.  The program will leverage Navy connectivity, autonomy, guidance, navigation, and obstacle avoidance technologies and culminate in a series of at-sea demonstrations and transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.500"
                                            },
                                            "Text": {
                                                "val": "-  Commenced platform and module design and technology assessments and system safety and effectiveness modeling.\n-  Established baseline test platform architecture and conducted initial check-out testing.\n-  Developed interface control documentation.\n-  Developed model-based engineering environment for rapid trade analyses.\n-  Conducted design trade studies to refine system architecture.\n-  Conducted system performance modeling and simulation and small scale laboratory trials.\n-  Commenced system design safety certification and system engineering including test planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete component designs and design reviews.\n-  Commence module development and fabrication.\n-  Commence sub-system hardware and software testing and module integration.\n-  Update system performance models and conduct initial at-sea testing.\n-  Commence subsystem safety certifications and testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete module fabrication and integration.\n-  Continue system at-sea testing.\n-  Complete module and system safety and certification testing and analyses.\n-  Commence at-sea demonstration planning, training, and support preparations.\n-  Complete system integration and checkouts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Positioning System for Deep Ocean Navigation (POSYDON)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Long-Range Undersea Navigation\n\nThe Positioning System for Deep Ocean Navigation (POSYDON) program will provide continuous, Global Positioning System (GPS)-level positioning accuracy to submarines and autonomous undersea vehicles (AUVs) in ocean basins over extended periods of time.  Undersea navigation cannot use GPS because the water blocks its signals.  At shallower depths, masts can be raised to receive GPS signals, but masts present a detection risk.  Typically, the alternative to GPS for undersea navigation has been inertial navigation systems (INS), but INS accuracy can degrade unacceptably over time.  Building upon concepts explored under the Distributed Agile Submarine Hunting (DASH) program, budgeted within this PE\/Project, and the Upward Falling Payloads program, PE 0602702E, Project TT-03, the POSYDON program will distribute a small number of acoustic sources, analogous to GPS satellites, around the ocean basin.  A submarine or AUV will be equipped with an acoustic receiver and appropriate software in order to obtain, maintain, and re-acquire, if lost, an initial location.  By transmitting specific acoustic waveforms and developing accurate acoustic propagation models to predict and interpret the complex arrival structure of the acoustic sources, the submarine or AUV can determine its range from each source and thus triangulate its position.  Technologies developed under this program will transition to the Navy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.620"
                                            },
                                            "Text": {
                                                "val": "-  Design and develop algorithms for accurately predicting acoustic signal propagation paths.\n-  Develop the system concept of operations.\n-  Conduct at-sea experiments to validate analysis using a single source\/receiver pair at basin-scale range to measure signal tracking accuracy and stability as well as signal acquisition techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.570"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.570"
                                            },
                                            "Text": {
                                                "val": "-  Design and develop signal waveforms for transmitters and receivers.\n-  Refine the system concept of operations based on data collections from at-sea experiments.\n-  Update ocean models to support real-time ranging. \n-  Conduct multiple at-sea demonstrations of real-time ranging signals in various environments with noise and interference."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Offboard Command, Control and Attack (MOCCA)"
                                    },
                                    "Description": {
                                        "val": "The Mobile Offboard Command, Control and Attack (MOCCA) program seeks to counter the fourth generation submarine signature quieting technology that has significantly degraded passive anti-submarine warfare (ASW) sonar detection range and targeting performance.  The MOCCA program will build on lessons learned under the Distributed Agile Submarine Hunting (DASH) program, budgeted within this PE\/Project, to nullify submarine signature reduction trends with active sonar projectors deployed from a mobile unmanned undersea vehicle (UUV) and cooperatively processed with onboard submarine acoustic receive sonar systems.  The off-board UUV sonar projector will operate, under positive control, at a significant distance from the cooperative submarine using communication links.\n\nThe program seeks to achieve breakthrough capability for long-range submarine detection and precision target tracking.  The program will develop compact, high output acoustic transducers, novel low probability of intercept\/low probability of detection (LPI\/LPD) communication signaling, and high energy density sub-systems compatible with deployable UUV packaging constraints.  In addition, the MOCCA system will be integrated into submarine onboard sonar and weapons control systems.  This program will transition to the Navy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "-  Begin preliminary design of hardware and software components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.334"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.334"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate designs on compact acoustic projectors, UUV energy solutions, LPI\/LPD communications link system components.\n-  Develop subsystems including compact high output acoustic projector, UUV energy solutions, LPI\/LPD communications link system.\n-  Commence testing to evaluate at-sea performance of UUV mobile sonar demonstrating source level and beam control, LPI\/LPD communications waveforms detectability, range performance and data rate, and submarine Bi-static sonar processing algorithms.\n-  Initiate process for approval of temporary system integration into submarine systems for test and evaluation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Virtual Acoustic Microphone System (VAMS)"
                                    },
                                    "Description": {
                                        "val": "The Virtual Acoustic Microphone System (VAMS) program will develop additional acoustic sensor capabilities for underwater platforms.  The VAMS program seeks to develop and demonstrate technologies that enable the laser projection of underwater acoustic sensor arrays with performance comparable to existing arrays.  The VAMS approach, however, will allow the array to be adaptively reconfigured, enabling capabilities that are not currently possible with existing technology.\n\nExpanding on lessons learned from the Distributed Agile Submarine Hunting (DASH) program, budgeted within this PE\/Project, the program will combine reconfigurable laser transmitters with novel signal extraction methods and exploit new and emerging high-speed sensor and processor capabilities.  The VAMS system has the potential to be integrated into a number of underwater platforms.  The acoustic sensor technology developed under the VAMS program will transition to the Navy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate core enabling technologies, including the application of high-speed sensor technology to increase the sensitivity of laser-based acoustic detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.958"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.958"
                                            },
                                            "Text": {
                                                "val": "-  Initiate system design, which will demonstrate the required acoustic capabilities.\n-  Initiate the development of advanced signal processing methods that will enable acoustic information extraction from the laser-based sensor and compensate for motion of the platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross Domain Maritime Surveillance and Targeting (CDMaST)"
                                    },
                                    "Description": {
                                        "val": "The Cross Domain Maritime Surveillance and Targeting (CDMaST) program seeks to identify and implement architectures consisting of novel combinations of manned and unmanned systems to execute long-range kill chains against submarines and ships over large contested maritime areas.  By exploiting promising new developments in unmanned platforms, seafloor systems, and emerging long-range weapon systems, the program will develop an advanced, integrated undersea and above sea warfighting capability.  Building upon research conducted under the System of Systems Integration Technology and Experimentation (SoSite) program (budgeted in PE 0603766E, Project NET-01), the Cross Domain Maritime Surveillance and Targeting (CDMaST)program will establish an analytical and experimental environment to explore architecture combinations in terms of operational effectiveness as well as engineering feasibility and robustness.  The program will leverage enabling technologies needed for command, control, and communication (C3) between physical domains in order to support the architecture constructs.  Through experimentation, the program will not only demonstrate integrated system performance, but also develop new tactics that capitalize on features created by the heterogeneous architecture.  The Cross Domain Maritime Surveillance and Targeting (CDMaST) program will invest in technologies that will reduce cost, manage complexity, and improve reliability.  Technologies from this program will transition to the Navy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Establish modeling and simulation environment to conduct high fidelity mission-level architecture analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.558"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.558"
                                            },
                                            "Text": {
                                                "val": "-  Develop baseline system of systems architecture.\n-  Create concept design for system of systems live, virtual, and constructive test bed environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Agile Submarine Hunting (DASH)"
                                    },
                                    "Description": {
                                        "val": "The diesel-electric submarine is an asymmetric threat in terms of its cost and consequential growth in numbers relative to our legacy maritime platforms.  In addition, these submarines have trended toward lower acoustic signature levels and have grown in lethality.  The Distributed Agile Submarine Hunting (DASH) program intends to reverse the asymmetric advantage of this threat through the development of advanced standoff sensing from unmanned systems.  Deep-ocean sonar nodes will be developed to operate at significant depths in open ocean areas to achieve large fields of view to detect submarines overhead.  Each deep node is the maritime equivalent of a satellite, and is referred to as a subullite.  The significant field of view, along with the advantage of low-noise phenomena at extreme depths, will permit a scalable number of collaborative sensor platforms to detect and track submarines over large areas.  At-sea demonstrations have shown that the detection capability is achievable.  The program will continue to develop prototype systems that will evolve through additional at-sea testing.  These tests will demonstrate the ability to integrate into the Navy's undersea systems responsible for anti-submarine warfare (ASW).  The program seeks to achieve breakthrough technology for long-range detection and classification, communications, energy management, sensor and platform integration, and robust semiautonomous processing and control for distributed sensing platforms.  This program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.324"
                                            },
                                            "Text": {
                                                "val": "-  Designed and developed longer duration passive and active sonar nodes.\n-  Conducted extended duration sonar demonstrations at sea against a target.\n-  Demonstrated connectivity from seafloor node to remote shore station.\n-  Integrated distributed communications with Navy systems for data transfer and Command, Control, Communications, Computers, and Intelligence (C4I).\n-  Initiated test planning for passive and active sonar sea test.\n-  Explored alternative concepts of operations and modified architectures of DASH system for other applications.\n-  Initiated data collection experiments in other significant Navy operational areas to characterize DASH performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.218"
                                            },
                                            "Text": {
                                                "val": "-  Conduct at-sea demonstrations of a distributed deep-ocean passive sonar barrier using multiple nodes for extended duration.\n-  Conduct at-sea demonstrations of a mobile active sonar node.\n-  Perform data-driven signal processing development to improve automated sonar detection algorithms.\n-  Provide analysis and data to support Navy utility assessments and studies to aid in transition.\n-  Complete data collection experiments in other significant Navy operational areas to characterize DASH performance.\n-  Continue to explore alternate techniques for long-range submarine detection and precision target tracking."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Hydra"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oceaneering International, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.474"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.646"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hydra"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon Company"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.437"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "19.974"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.393"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.393"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hydra"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.647"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.101"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.100"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hybrid Multi Material Rotor Full Scale Demonstration (HyDem)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Goodrich Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.465"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.760"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hybrid Multi Material Rotor Full Scale Demonstration (HyDem)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.619"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.980"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.325"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.325"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tactical Undersea Network Architecture"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "11.449"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "14.560"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "18.815"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "18.815"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Blue Wolf"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.465"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "14.505"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.590"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.590"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Positioning System for Deep Ocean Navigation (POSYDON)*"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.903"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "23.134"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "23.134"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Positioning System for Deep Ocean Navigation (POSYDON)*"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "THE CHARLES STARK DRAPER LABORATORY INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.757"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.7570"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Mobile Offboard Command, Control and Attack (MOCCA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.430"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "15.122"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "15.122"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Virtual Acoustic Microphone System (VAMS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.950"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.283"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.283"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cross Domain Maritime Surveillance and Targeting (CDMaST)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.310"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "15.224"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "15.224"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Distributed Agile Submarine Hunting (DASH)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.926"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.290"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "18.2160"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.919"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.776"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.532"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.532"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Hydra"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.725"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.725"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hybrid Multi Material Rotor Full Scale Demonstration (HyDem)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.750"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.750"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tactical Undersea Network Architecture"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.562"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.195"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.7570"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Positioning System for Deep Ocean Navigation (POSYDON)*"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.175"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.650"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.650"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Mobile Offboard Command, Control and Attack (MOCCA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Virtual Acoustic Microphone System (VAMS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.045"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.045"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Distributed Agile Submarine Hunting (DASH)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.368"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.118"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.4860"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.649"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.971"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.915"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.915"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Hydra"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Modular Enclosure Preliminary Design Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Air Vehicle Initial Flight Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test Prototype Modular Enclosure"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Critical Design Review of Undersea Payload and Air Vehicle Payload"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Complete a Full Air Vehicle Flight Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Demonstrate Full Undersea Payload Demonstration from the Modular Enclosure"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hybrid Multi Material Rotor Full Scale Demonstration (HyDem)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Preliminary Design Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Critical Design Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deliver Full Scale Component to Navy"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Support Propulsor Integration on VIRGINIA Class Submarine"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Support Propulsor Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Undersea Network Architecture"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "System architecture design studies"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Preliminary Design Review of system architecture"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Component Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Software Design Review (SDR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "At-sea demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blue Wolf"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Initial Check-Out Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Design Safety Certification"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Sub-System Hardware and Software Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Module Development and Fabrication"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System At-Sea Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Complete System Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Positioning System for Deep Ocean Navigation (POSYDON)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Program Initiation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Conduct at-sea data collections"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Conduct real-time ranging demonstrations"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Offboard Command, Control and Attack (MOCCA)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Program Initiation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Evaluation testing of UUV mobile sonar"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Virtual Acoustic Microphone Systems (VAMS)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Program Initiation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System development and design review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross Domain Maritime Surveillance and Targeting (CDMaST)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Program Initiation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Concept design for test bed environment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Agile Submarine Hunting (DASH)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "At sea sonar demonstrations"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Node Design Validations"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "At sea mobile active sonar demonstrations"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Node System demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NET-06"
                    },
                    "ProjectTitle": {
                        "val": "NETWORK-CENTRIC WARFARE TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "231.559"
                        },
                        "CurrentYear": {
                            "val": "240.241"
                        },
                        "BudgetYearOne": {
                            "val": "217.675"
                        },
                        "BudgetYearOneBase": {
                            "val": "217.675"
                        },
                        "BudgetYearTwo": {
                            "val": "172.150"
                        },
                        "BudgetYearThree": {
                            "val": "85.796"
                        },
                        "BudgetYearFour": {
                            "val": "63.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "231.559"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "240.241"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "217.675"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "217.675"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details will be provided under separate cover."
                        }
                    }
                }
            ]
        }
    }
}