{
    "id": "fd60ddc4ab704239aad1e09e387ba7c313881556",
    "meta": {
        "filename": "dod-2017_RDTE_2017_AIRFORCE_V1_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.zzz_unzipped_U_RDTE_MasterJustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0207601F"
        },
        "ProgramElementTitle": {
            "val": "USAF Modeling and Simulation"
        },
        "R1LineNumber": {
            "val": "159"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "11.687"
            },
            "CurrentYear": {
                "val": "24.945"
            },
            "BudgetYearOne": {
                "val": "16.666"
            },
            "BudgetYearOneBase": {
                "val": "16.666"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "16.877"
            },
            "BudgetYearThree": {
                "val": "17.201"
            },
            "BudgetYearFour": {
                "val": "17.520"
            },
            "BudgetYearFive": {
                "val": "17.831"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "United States Air Force (USAF) Modeling & Simulation (M&S) Program Element (PE) is broken into two thrust areas:  Modeling and Simulation Foundations, and Warfighter Readiness.  It directly supports Air Force, Joint, Coalition composite training and rehearsal, concept development, and acquisition and testing through modeling and simulation development as well as the integration of these across and within Live, Virtual, and Constructive (LVC) environments.  This program focuses on support of Department of Defense (DoD) Training Transformation (T2).  It allows the authoritative portrayal of new and emerging Air Force capabilities within DoD and coalition LVC environments; as well as reciprocating capabilities within Air Force LVC environments.  \n\nLVC environments today are used as the most cost effective and practical means to meet mission needs.  In support of the DoD T2 initiative, USAF M&S program thrust areas develop and modernize models and simulations that are the constructive backbone of Air Force and joint training and rehearsal.  Once these models and simulations are developed, they are integrated across training LVC environments for use by Major and Combatant Commands.  This development and integration is imperative to ensure that air, space, and cyberspace training and mission rehearsal activities are supported with realistic, interoperable, and readily available tools, data, and services.  These, in turn, enable joint, coalition, and interagency training required to prepare forces for combat by generating the air and space picture for the Air and Space Operations Center (AOC), Joint Force Air Component Commander (JFACC), and Joint Force Commander in combat exercises; training over 100,000 personnel per year in exercises (e.g., Ulchi Freedom Guardian, Red & Blue Flags, Unified Endeavor, etc).  These programs also provide the current foundational environment that enables warfighters to interact with high-fidelity tactical cockpit simulators, which replicate high demand\/low density platforms that are often unavailable for training due to real-world operations; while simultaneously linking it to warfighters using their current command and control systems 1,000 miles away and the constructive simulations being run from key operational wargaming and simulation centers worldwide. \n\nUSAF M&S is integral to inter-agency Homeland Defense (HLD) exercises chartered to train combat units tasked to protect the Homeland, including the National Capital Region (exercise Amalgam Arrow); this generates equipment and manpower efficiencies by using simulations which reduce fuel consumption, aircraft wear and tear, and manpower costs.  In support of the DoD drive to improve the effectiveness and efficiency of its enterprise-wide acquisition business processes, the USAF M&S Program Element develops and supports enhancements to models, simulations, tools, and the LVC infrastructure to provide for system-of-systems M&S capabilities across the lifecycle, reduce developmental costs, and minimize risks. \n\nThe FY 2017 funding request was reduced by $.929 million to account for the availability of prior year execution balances.  \n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.034"
                },
                "CurrentYear": {
                    "val": "24.994"
                },
                "BudgetYearOne": {
                    "val": "22.812"
                },
                "BudgetYearOneBase": {
                    "val": "22.812"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.687"
                },
                "CurrentYear": {
                    "val": "24.945"
                },
                "BudgetYearOne": {
                    "val": "16.666"
                },
                "BudgetYearOneBase": {
                    "val": "16.666"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.347"
                },
                "CurrentYear": {
                    "val": "-0.049"
                },
                "BudgetYearOne": {
                    "val": "-6.146"
                },
                "BudgetYearOneBase": {
                    "val": "-6.146"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.049"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.347"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.146"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.146"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY17:  Other Adjustments row list a reduction of $6.146 million to include:\n- reduce the Simulation and Analysis Facility (SIMAF) funding by $5.05 million to meet the needs of higher Air Force priorities\n- reduce $.167 million for inflation\n- the FY 2017 funding request was reduced by $.929 million to account for the availability of prior year execution balances"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674567"
                    },
                    "ProjectTitle": {
                        "val": "M&S Foundations"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.163"
                        },
                        "CurrentYear": {
                            "val": "13.613"
                        },
                        "BudgetYearOne": {
                            "val": "5.676"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.676"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.731"
                        },
                        "BudgetYearThree": {
                            "val": "6.864"
                        },
                        "BudgetYearFour": {
                            "val": "6.992"
                        },
                        "BudgetYearFive": {
                            "val": "7.116"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Modeling and Simulation Foundations (MSF) focuses on integrating foundational capabilities needed to improve the usefulness of Modeling and Simulation (M&S) capabilities derived from the Warfighter Readiness (WR) thrust.  The efforts supporting the MSF thrust include both concept exploration and development.  \n\nMSF provides the capability to rapidly and efficiently create realistic and accurate synthetic operational battlespaces to support the full spectrum of activities associated with concept development to acquisition and testing through composite training and mission rehearsal.   \n\nThe Air, Space, and Cyberspace Constructive Environment-Information Operations Suite (ACE-IOS) provides the authoritative representation of Air Force information operations.  ACE-IOS is comprised of models that support training and mission rehearsal for the Air Force, Joint Task Force commanders, and Combatant Commands (COCOM) battle staffs during Joint and Service exercises and experimentations.  \n\nSimulation and Analysis Facility (SIMAF) focuses on fostering M&S tools, data, and infrastructure to enable high confidence acquisition of capabilities to support the joint warfighter.  This includes Live-Virtual-Constructive (LVC) infrastructure, tools and processes supporting LVC events, and models, tools, data, simulations\/stimulation to support requirements definition, systems engineering and test activities.  Activities include M&S support for studies and analysis to support both current program planning and execution and future program planning.  These efforts will enable more efficient delivery of effective capabilities to the warfighter while reducing the time and resources required for design, development, test and evaluation, maintainability and sustainment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Constructive Environment - Information Operations Suite (ACE-IOS)"
                                    },
                                    "Description": {
                                        "val": "ACE-IOS provides the authoritative representation of Air Force information operations.  IOS is comprised of models that support training and mission rehearsal for the Air Force, Joint Task Force commanders, and Combatant Command battle staffs during Joint and Service exercises and experimentations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.163"
                                            },
                                            "Text": {
                                                "val": "- Completed ACE-IOS (version 5.0.16.0)\n- Integrated Distributed Mission Operations Center - sSpace models for satellite orbits\/topology and precision Global Positioning System (GPS) jamming effects\n- Implemented Digital Terrain Elevation Data (DTED) and Line-of-Sight (LOS) service for sensor module and ground game\n- Implemented Distributed Interactive Simulation (DIS) to High Level Architecture bridge for interaction between Air Force Synthetic Environment for Reconnaisance and Surveillance weaponized Unmanned Aerial Vehicle and Joint Land Component Constructive Training Capability Federation\n- Added Pacific Intelligence Reporting Directive standards to the Joint Virtual Editing Tool\n- Implemented close combat and personnel modeling requested by and in support of United States Pacific Command (USPACOM) exercises\n- Implemented offensive\/defensive cyber operations between a cyber exercise range and kinetic battlefield exercise"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.646"
                                            },
                                            "Text": {
                                                "val": "- Complete ACE-IOS (version 5.0.17.0)\n- Develop Joint Data Translator as a service for Joint Live Virtual Constructive (JLVC) 2020\n- Develop interface with Suter Project System for cross-initialization and run-time synchronization\n- Complete integration of DTED and LOS service in last three modules (jamming, electronic warfare, and networks)\n- Develop package available for DOD use to replace commercially licensed DIS package\n- Modernize United States Message Text Format production module and Java Server Pages\n- Develop Intelligence, Surveillance, and Reconnaissance (ISR) as a service for JLVC 2020, a prototype for the ACE-IOS services conversion scheduled for FY17"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.676"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.676"
                                            },
                                            "Text": {
                                                "val": "- Will complete ACE-IOS (version 5.0.18.0)\nWill replace the commercially licensed Relational Database Management System (RDBMS) with a license-free database package\n- Will replace all control Graphical User Interfaces (GUIs)\/scripts with a single web-based GUI\n- Will continue to re-engineer ACE-IOS to an open architecture design     \n- Will complete the modernization of all ACE-IOS modules as services with database access via the Application Programmers Interface (API)\n- Will develop the interface from the ACE-IOS to the JLVC 2020 database API"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Simulation and Anaylsis Facility (SIMAF)"
                                    },
                                    "Description": {
                                        "val": "Develop, enhance and verify models, tools, data, simulations\/stimulation environments for systems engineering and test activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.967"
                                            },
                                            "Text": {
                                                "val": "- Supports activities that include studies and analysis of current program planning\/execution and future program planning\n  -- Enables more efficient delivery of effective capabilities to the warfighter\n  -- Reduces the time and resources required for design, development, test and evaluation, maintainability and sustainment \n- Supports the development and maturation of collaborative processes and capabilities within airborne network and air-ground layer interaction systems-of-systems assessments"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Air Force Life Cycle Management Center (AFLCMC) at Hanscom AFB, MA and the Simulation and Anaylsis Facility, Wright-Patterson AFB, OH manage the project's acquisition process.  AFLCMC develops threats through engineering assessments and analysis.  SIMAF focuses on M&S tools, data, and infrastructure to enable a high confidence of acquisition capabilities to support the warfighter.  There acquisition goals are achieved through incremental development of the project's M&S activities.  All major contracts are awarded using full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Air Constructive Environment - Information Operations Suite (ACE-IOS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "90th IOS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lackland AFB, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.503"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.528"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.528"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Simulation and Analysis Facility (SIMAF)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SIMAF"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wright Patterson AFB, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.967"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.063"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.143"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.148"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.148"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-04"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Air Contstructive Envitronment-Information Operations Suite (ACE-IOS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.16.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.17.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.18.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.19.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.20.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.21.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- ACE-IOS - v5.0.22.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Simulation and Analysis Facility (SIMAF)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675135"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Readiness"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.524"
                        },
                        "CurrentYear": {
                            "val": "11.332"
                        },
                        "BudgetYearOne": {
                            "val": "10.990"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.990"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "10.146"
                        },
                        "BudgetYearThree": {
                            "val": "10.337"
                        },
                        "BudgetYearFour": {
                            "val": "10.528"
                        },
                        "BudgetYearFive": {
                            "val": "10.715"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Modeling and Simulation support to our Warfighter's Readiness is a United States Air Force (USAF) corporate imperative to ensure air, space, cyberspace training, and mission rehearsal activities are supported with realistic, interoperable, and readily available, tools, data, services and environments.  Warfighter readiness supports Department of Defense (DoD) Training Transformation (T2) and Joint National Training Capability (JNTC) along with the USAF priorities and core functions.  Activities also include studies and analysis to support both current program planning, execution, and future program planning.  \n\nIt includes several complimentary programs, initiatives and areas for investment:  Warfighter and Joint Training Integration supports the Chief of Staff of the Air Force (CSAF) directed Live, Virtual, and Constructive (LVC) integration efforts and is a critical piece to the USAF's implementation of the Strategic Plan for Transforming DoD Training.  The goal of LVC training and mission rehearsal is to prepare our warfighters for the full range of military operations and maintain the combat readiness levels required by the Combatant Commands (COCOMs).  This can only be accomplished by training and rehearsing in realistic operational environments.  These environments include live training ranges and virtual simulators enhanced with constructive entities.  Specific training and mission rehearsal events can include some or all of these simultaneously; making the ability to integrate LVC capabilities a necessity.  \n\nThe Air, Space, and Cyberspace Constructive Environment (ASCCE) is the USAF's authoritative federation of constructive training models and tools realistically representing the tactical and operational capabilities the USAF brings to the joint fight.  It includes the Air Force Modeling and Simulation Training Toolkit (AFMSTT), which provides the authoritative representation of AF and joint theater-level air and space power and is used to train Air and Space Operations Center (AOC) personnel and Combat Commanders (COCOM) battle staffs.  The primary models in the AFMSTT are the Air Warfare Simulation (AWSIM) and Air Base Simulation (ABS)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air, Space, and Cyberspace Constructive Environment (ASCCE)"
                                    },
                                    "Description": {
                                        "val": "Air Force Modeling & Simulation Training Toolkit (AFMSTT)\/Air Warfare Simulation (AWSIM)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.524"
                                            },
                                            "Text": {
                                                "val": "- Completed the software development of the Air, Space, and Cyberspace Constructive Environment (ASCCE) via the Air Force Modeling and Simulation Training Toolkit (AFMSTT) Version 5.7 \n- Completed the modernization of the AFMSTT modular framework architecture and the early development of the Unified Mission Controller (UMC) capability that simplified operator training\n- The Base Simulation Model was updated to better reflect support to Pacific operations  \n- Supported a new competitive prime award and transition preparation"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.332"
                                            },
                                            "Text": {
                                                "val": "- Complete and field AFMSTT Version 5.9 and commence long lead development for AFMSTT Version 5.11\n- Complete contract transition\n- Continue AFMSTT modular framework architecture refinements and transition to the AFMSTT Unified Mission Controller (UMC) capability \n- Migrate TADIL and Air Base Simulations to the AFMSTT modular framework\n- Continue new joint requirements and model interface changes to the Federate Object Models (FOMs)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.990"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.990"
                                            },
                                            "Text": {
                                                "val": "- Complete the development, test, and fielding of AFMSTT Version 5.11 and commence development of AFMSTT Version 5.13\n- Complete full developmental transition to the new AFMSTT UMC functionality with deprecation of select legacy point to point interfaces\n- Continue integration with spiral Joint Live Virtual Constructive (JLVC 2020) developments\n- Continue modeling of real world environments and new C2 systems' interfaces to ensure continued accurate and realistic\n- Commence long lead requirements derivation for prototyping of primary AWSIM application replacement"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Air Force Life Cycle Management Center (AFLCMC) at Hanscom AFB, MA manages the acquisition and incremental development process for all the project's M&S activities. To continue current efforts, a new Small Business Set Aside (SBSA) contract that incorporates the modular framework into AFMSTT being awarded after full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AFMSTT\/(Air Warfare Simulation (AWSIM))"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.999"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.846"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.588"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.588"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.525"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.486"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.402"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.402"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Air, Space, and Cyber Constructive Environment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v5.7"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v5.9"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v5.11"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v5.13"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v6.1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v6.3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v6.5"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "- AFMSTT v6.7"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}