{
    "id": "39f36dd8b660fec71395fb28bb042dd55cc058da",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_NAVY_OTHER_BA2_PROCUREMENT_JustificationBook_Navy_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "2960"
        },
        "LineItemTitle": {
            "val": "Integ Combat System Test Facility"
        },
        "P1LineNumber": {
            "val": "81"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Shore Electronic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "16.88"
                },
                "PriorYear": {
                    "val": "8.143"
                },
                "CurrentYear": {
                    "val": "4.016"
                },
                "BudgetYearOneBase": {
                    "val": "14.419"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "14.419"
                },
                "BudgetYearTwo": {
                    "val": "8.777"
                },
                "BudgetYearThree": {
                    "val": "8.972"
                },
                "BudgetYearFour": {
                    "val": "9.186"
                },
                "BudgetYearFive": {
                    "val": "9.379"
                },
                "Total": {
                    "val": "79.772"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "16.88"
                },
                "PriorYear": {
                    "val": "8.143"
                },
                "CurrentYear": {
                    "val": "4.016"
                },
                "BudgetYearOneBase": {
                    "val": "14.419"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "14.419"
                },
                "BudgetYearTwo": {
                    "val": "8.777"
                },
                "BudgetYearThree": {
                    "val": "8.972"
                },
                "BudgetYearFour": {
                    "val": "9.186"
                },
                "BudgetYearFive": {
                    "val": "9.379"
                },
                "Total": {
                    "val": "79.772"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "16.88"
                },
                "PriorYear": {
                    "val": "8.143"
                },
                "CurrentYear": {
                    "val": "4.016"
                },
                "BudgetYearOneBase": {
                    "val": "14.419"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "14.419"
                },
                "BudgetYearTwo": {
                    "val": "8.777"
                },
                "BudgetYearThree": {
                    "val": "8.972"
                },
                "BudgetYearFour": {
                    "val": "9.186"
                },
                "BudgetYearFive": {
                    "val": "9.379"
                },
                "Total": {
                    "val": "79.772"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.6"
                },
                "CurrentYear": {
                    "val": "0.351"
                },
                "BudgetYearOneBase": {
                    "val": "0.498"
                },
                "BudgetYearOne": {
                    "val": "0.498"
                },
                "BudgetYearTwo": {
                    "val": "0.525"
                },
                "BudgetYearThree": {
                    "val": "0.573"
                },
                "BudgetYearFour": {
                    "val": "0.582"
                },
                "Total": {
                    "val": "3.129"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This program supports various Navy Land Based Test Sites (LBTS) required to support integration and interoperability testing. Sites include, but are not limited to: Naval Surface Warfare Center (NSWC) Dahlgren, Surface Combat System Center (SCSC) Wallops Island, and NSWC Dam Neck.\n\nThe United States Navy has a requirement to fully test and certify computer programs for maturity, Interoperability and Integration (I&I) prior to delivery to the Fleet.  Commander, U.S. Fleet Forces Command (CFFC) provided specific direction to develop a unified modernization process and certify all combat system baselines for integration and interoperability as an integral step in the CNO Optimized Fleet Response Plan (O-FRP). Various Navy facilities, serving as LBTS, conduct the required testing in support of CVN, DDG, CG, LHD, LHA, LPD17 and LSD class ships. These sites also comprise the Navy's Distributed Integration & Interoperability Assessment Capability (DIIAC) (supported through the use of JMETC network) alliance, which performs Interoperability Assessment and Systems Engineering Events (SEEs) for deploying Strike Groups.\n\nThese facilities also provide combat system in-service support to respond to emergent fleet problems. This capability tests and certifies new combat system baseline in a lab based environment, which has significantly reduced the cost of corrective action and shifted the burden of problem discovery away from the operator at sea.  It also provides support to the acquisition community to conduct interoperability (shift to the right) testing earlier in the acquisition cycle. \n\nAs existing systems experience parts obsolescence, combat systems are continually updated through planned technical refresh. As these new Commercial Off the Shelf (COTS) systems are introduced, LBTS must maintain test beds in order to accurately replicate Command, Control, Communications, Computer, Combat Systems, and Intelligence (C5I) configurations that are destined for the fleet. In addition, new combat systems architectures are under development for new ship classes such as LCS, CVN-78, DDG-1000, as well as new Open Architecture (OA) variants of legacy suites. Procurement of production representative systems of these OA combat systems being delivered to operational fleet units is critical to ensure that testing and subsequent certification of both current and newly installed combat systems is in accordance with NAVSEAINST 9410.2 Naval Warfare Systems Certification Policy (NWSCP) and the O-FRP Program.\n\nThe basic procurement outlined herein is directed at expanding various facilities capability to support Interoperability Integration and Stressful Endurance testing. Procurement requirements are directly tied to the interoperability testing schedule and establish independence between test beds allowing for parallel certification efforts. Procurements are required to build the necessary test beds and for laboratory support equipment. This budget procures lab support equipment that various facilities are able to support the new tactical subsystems that use COTS equipment. \n\nIn addition, the basic program provides for equipment\/upgrades for the Navy's Distributed Integration & Interoperability Assessment Capability (DIIAC) needed to conduct interoperability assessment testing. The DIIAC consists of 14 land based sites networked to certify computer programs prior to their delivery to the fleet and provides support to the acquisition community to conduct interoperability and integration (shift to the right) testing earlier in the acquisition cycle. Interoperability Assessment and Stressful Endurance testing is required for all deploying strike groups per the Joint Fleet Instruction.\n\n[P40A \/ M8200 - Support Equipment]: M8200 - SUPPORT EQUIPMENT\nProcures hardware necessary to support integration and interoperability testing.  Equipment includes simulation hardware, test tools and laboratory equipment.\n\n[P40A \/ M8300 - CS Simulation]: M8300 - COMBAT SYSTEM (CS) SIMULATION\nProcures software and support for the modification of existing simulation software required for conducting integration, interoperability, and stressful endurance testing.\n\n[P40A \/ M8400 - SESEF Electronic Equipment]: The Shipboard Electronic Systems Evaluation Facilities (SESEF) are Navy owned and operated test sites. The SESEF Program mission is to provide electromagnetic system tests and evaluations to afloat and shore commands for new and\/or upgraded systems, to validate system performance following new construction and overhaul\/availability, and to provide real-time assessment of material readiness in an operational environment. Also provided are:  new system development and integration, system and equipment component procurement and S\/W upgrades for test systems for Tactical Control and Navigation (TACAN), Automated Information Management System (AIMS), MK XII Identification Friend or Foe (IFF), LINK 4A\/11\/16, OUTBOARD\/COMBAT Direction Finder (DF)\/Radio Direction Finder (RDF), search and fire control radars, and  communication systems including secure voice. SESEFs have been used effectively to conduct TACAN certifications, support AN\/SLQ-32 Electronic Warfare (EW) Planned Maintenance System (PMS)and to detect and isolate shipboard system deficiencies leading to maintenance action to increase ship material readiness at the completion of construction, delivery availabilities, during routine ship operations, and prior to deployment.\n\n[P40A \/ M8500 - Interoperability Assessment Equipment]: M8500 - INTEROPERABILITY ASSESSMENT EQUIPMENT\nKNOWN AS DISTRIBUTED INTEGRATION & INTEROPERABILITY ASSESSMENT CAPABILITY (DIIAC)\nProcures upgrades to support the 14 sites that comprise the Navys DIIAC sites. Procures hardware that provides the DIIAC Operations Center (DOC) the ability to support monitoring and execution of events providing data collection and distribution.  Funds are also allocated for site upgrades to meet current standards and allow scalability for DIIAC requirements. In addition, to enable the DIIAC to maintain efficiency and product improvement to interface with other Joint communities using Joint Mission Environment Test Community (JMETC) network.\n\n[P40A \/ M86IN - Non-FMP Installation]: M86IN - EQUIPMENT INSTALLATION (NON FMP)\nProcures engineering and installation support for the above OPN budget.  Support includes performing test bed staging, installation, connection, switching, repair and removal services of upgraded\/tech refresh tactical, simulation and support systems in direct support of NAVSEA requirements. Provides engineering services for rapid reconfiguration to new\/upgraded installations to meet requirements."
        },
        "Justification": {
            "val": "Increase from FY15 funding to FY16 funding for SESEF Electronic Equipment is due to upgrades at 6 existing sites and new installation of an 8th site in the PACFLT AOR to meet emergent requirements."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "ICSTF Program"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) M8200 - Support Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) Support Equipment"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.468"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.155"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2.468"
                                        },
                                        "PriorYear": {
                                            "val": "0.155"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) M8300 - CS Simulation"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) CS Simulation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.295"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.1"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "1.295"
                                        },
                                        "PriorYear": {
                                            "val": "0.1"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) M8400 - SESEF Electronic Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "FY15 $5M increase for SESEF Site Enhancement to upgrade capabilities at the existing 6 SESEF sites.  Additional $5.4M increase is to install an 8th site in PACFLT AOR to meet emergent requirements.",
                                                "val": "3.1) SESEF Electronic Equipment"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "8.361"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.601"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.833"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "10.806"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "10.806"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "8.361"
                                        },
                                        "PriorYear": {
                                            "val": "4.601"
                                        },
                                        "CurrentYear": {
                                            "val": "0.833"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.806"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.806"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) M8500 - Interoperability Assessment Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) Interoperability Assessment Equipment"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.222"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2.732"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.183"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.613"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.613"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2.222"
                                        },
                                        "PriorYear": {
                                            "val": "2.732"
                                        },
                                        "CurrentYear": {
                                            "val": "3.183"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.613"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.613"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) M86IN - Non-FMP Installation"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "5.1) M86IN - Non-FMP Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.534"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.555"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2.534"
                                        },
                                        "PriorYear": {
                                            "val": "0.555"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "16.88"
                            },
                            "PriorYear": {
                                "val": "8.143"
                            },
                            "CurrentYear": {
                                "val": "4.016"
                            },
                            "BudgetYearOneBase": {
                                "val": "14.419"
                            },
                            "BudgetYearOne": {
                                "val": "14.419"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}