{
    "id": "3e56f3b1dd4d57932e2cfa60799b8405ebcb0f64",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_ARMY_WTCV_PROCUREMENT_JustificationBook_Army_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2033A",
        "appropriation_name": "Procurement of W&TCV, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "GZ1300"
        },
        "LineItemTitle": {
            "val": "M240 Medium Machine Gun MODS"
        },
        "P1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2033A"
        },
        "AppropriationTitle": {
            "val": "Procurement of W&TCV, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Weapons and Other Combat Vehicles"
        },
        "BudgetSubActivityNumber": {
            "val": "20"
        },
        "BudgetSubActivityTitle": {
            "val": "Mod of Weapons and Other Combat Veh"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "157.554"
                },
                "PriorYear": {
                    "val": "2.719"
                },
                "CurrentYear": {
                    "val": "2.635"
                },
                "BudgetYearOneBase": {
                    "val": "1.424"
                },
                "BudgetYearOne": {
                    "val": "1.424"
                },
                "BudgetYearTwo": {
                    "val": "1.798"
                },
                "BudgetYearThree": {
                    "val": "1.945"
                },
                "BudgetYearFour": {
                    "val": "1.953"
                },
                "BudgetYearFive": {
                    "val": "1.982"
                },
                "Total": {
                    "val": "172.01"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "157.554"
                },
                "PriorYear": {
                    "val": "2.719"
                },
                "CurrentYear": {
                    "val": "2.635"
                },
                "BudgetYearOneBase": {
                    "val": "1.424"
                },
                "BudgetYearOne": {
                    "val": "1.424"
                },
                "BudgetYearTwo": {
                    "val": "1.798"
                },
                "BudgetYearThree": {
                    "val": "1.945"
                },
                "BudgetYearFour": {
                    "val": "1.953"
                },
                "BudgetYearFive": {
                    "val": "1.982"
                },
                "Total": {
                    "val": "172.01"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "157.554"
                },
                "PriorYear": {
                    "val": "2.719"
                },
                "CurrentYear": {
                    "val": "2.635"
                },
                "BudgetYearOneBase": {
                    "val": "1.424"
                },
                "BudgetYearOne": {
                    "val": "1.424"
                },
                "BudgetYearTwo": {
                    "val": "1.798"
                },
                "BudgetYearThree": {
                    "val": "1.945"
                },
                "BudgetYearFour": {
                    "val": "1.953"
                },
                "BudgetYearFive": {
                    "val": "1.982"
                },
                "Total": {
                    "val": "172.01"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "2.719"
                                },
                                "CurrentYear": {
                                    "val": "2.635"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.424"
                                },
                                "BudgetYearOne": {
                                    "val": "1.424"
                                },
                                "BudgetYearTwo": {
                                    "val": "1.798"
                                },
                                "BudgetYearThree": {
                                    "val": "1.945"
                                },
                                "BudgetYearFour": {
                                    "val": "1.953"
                                },
                                "BudgetYearFive": {
                                    "val": "1.982"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "2.719"
                    },
                    "CurrentYear": {
                        "val": "2.635"
                    },
                    "BudgetYearOneBase": {
                        "val": "1.424"
                    },
                    "BudgetYearOne": {
                        "val": "1.424"
                    },
                    "BudgetYearTwo": {
                        "val": "1.798"
                    },
                    "BudgetYearThree": {
                        "val": "1.945"
                    },
                    "BudgetYearFour": {
                        "val": "1.953"
                    },
                    "BudgetYearFive": {
                        "val": "1.982"
                    }
                }
            }
        },
        "Description": {
            "val": "The M240B\/L Medium Machine Gun is an infantry version of the M240 Armored Machine Gun used to replace the M60 Series Machine Gun in Light Infantry, Mechanized Infantry, Armor, Rangers, Special Forces, and select Combat Engineer units.  Since the initial fielding of the M240B, various system enhancements have been identified that further improves the use of this weapon system by increasing functionality and performance capabilities, while improving training capability.  These include adopting a forward rail system to mount ancillary sighting\/night vision equipment, an accessory ammunition pouch, a spare barrel bag to transport and store overheated barrels, and an improved Lightweight Ground Mount.  Additional enhancements include improved bipod, sling, short barrel, improved barrel, combat ammo pack, improved hydraulic buffer, drop-in mount cradle, design modifications to the Lightweight Ground Mount, collapsible buttstock and Mounted Machine Gun Optic.  These enhancements are applicable to both the M240B and M240L.  M240L reduces the weight of the existing M240B by approximately 5 pounds.\n\nThe M197 Vehicle Mount is the current standard used to mount the M249 and M240B to most vehicle platforms. A system improvement (drop in mount cradle) will add a link\/spent case deflector and ammo handling system to provide capability upgrades addressing issues that Soldiers have identified as shortcomings of the current system.  The M192 is the primary ground mount for the M240B\/L and M249 machineguns.  Based on recent combat experience, improvements are required to address identified shortcomings in the design and to enhance operational performance. \n\nFielding of the M240H Machine Gun requires replacement\/upgrade of the helicopter mounts\/cradles to accommodate the replacement M240H.  This upgrade will enhance the performance of the armament subsystems the M240H is assigned to thereby increasing the overall survivability of the aircraft platform.  Improved mounts are required to be fielded to both the UH-60 and CH-47 platforms."
        },
        "Justification": {
            "val": "FY 2016 Base procurement dollars in the amount of $1.424 million supports the Active Army by purchasing system enhancements for the M240B\/L Medium Machine Gun Weapon System.  System enhancements have been identified by fielded units to further improve the reliability and functionality of this weapon system.  These include improved lightweight bipods which production of these items will allow for fielding to approximately 25 Infantry Brigade Combat Teams (IBCT), and the M197 Modification Work Order (MWO) Kit (drop-in mount cradle) that adds a link\/spent case deflector and ammo handling system to provide capability upgrades addressing issues that Soldiers have identified as shortcomings of the current system. Continues action on the Collapsible Buttstock, Improved Buffer, Improved Rails, Improved Barrel, and M192 MWO Kit which, when provided, delivers a system improvement to this lightweight tripod. M240L reduces the Soldier's combat load while allowing easier handling and movement of the weapon.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}