{
    "id": "4068084afa84a39b8a71b7e91e55905a40a04912",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_AIRFORCE_OTHER_PROCUREMENT_JustificationBook_Air_Force_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "834430"
        },
        "LineItemTitle": {
            "val": "GCSS-AF Fos"
        },
        "P1LineNumber": {
            "val": "33"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "12.675"
                },
                "CurrentYear": {
                    "val": "3.67"
                },
                "BudgetYearOneBase": {
                    "val": "25.515"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "25.515"
                },
                "BudgetYearTwo": {
                    "val": "8.001"
                },
                "BudgetYearThree": {
                    "val": "8.124"
                },
                "BudgetYearFour": {
                    "val": "8.97"
                },
                "BudgetYearFive": {
                    "val": "9.125"
                },
                "Total": {
                    "val": "76.08"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "12.675"
                },
                "CurrentYear": {
                    "val": "3.67"
                },
                "BudgetYearOneBase": {
                    "val": "25.515"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "25.515"
                },
                "BudgetYearTwo": {
                    "val": "8.001"
                },
                "BudgetYearThree": {
                    "val": "8.124"
                },
                "BudgetYearFour": {
                    "val": "8.97"
                },
                "BudgetYearFive": {
                    "val": "9.125"
                },
                "Total": {
                    "val": "76.08"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "12.675"
                },
                "CurrentYear": {
                    "val": "3.67"
                },
                "BudgetYearOneBase": {
                    "val": "25.515"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "25.515"
                },
                "BudgetYearTwo": {
                    "val": "8.001"
                },
                "BudgetYearThree": {
                    "val": "8.124"
                },
                "BudgetYearFour": {
                    "val": "8.97"
                },
                "BudgetYearFive": {
                    "val": "9.125"
                },
                "Total": {
                    "val": "76.08"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0708012F"
                }
            ]
        },
        "Description": {
            "val": "Global Combat Support System (GCSS) is a family of information technology systems that provide integration and interoperability between combat support functions and command and control to support the operational needs of the warfighter.  It directly supports Command, Control, Communication, Computers, and Information (C4I) for the warfighter and Chairman Joint Chiefs of Staff (CJCS) Joint Vision 2020.  The GCSS-Air Force Family of Systems (FOS) includes standard base-level combat support applications which provide warfighters with a \"one update-one time\" processing environment.  The following systems provide the key support foundation for the Air Force's global engagement strategy and evolution to DoD Joint Information Environment (JIE) leveraging Core Data Centers (CDCs) and DISA-brokered cloud capabilities through GCSS-AF.\n\nPE 0303141F GLOBAL COMBAT SUPPORT SYSTEM\n\nGLOBAL COMBAT SUPPORT SYSTEM-AIR FORCE (GCSS-AF):  This program element encompasses GCSS-AF's Integration Framework and its presentation layer for operational users.  This infrastructure and provided Air Force enterprise common services are a critical basis for the target common computing environment (CCE) effort which Air Force Guidance Memorandum has directed for all new and modernizing IT applications.  This effort is the Air Force evolution to DoD Joint Information Environment (JIE) leveraging Core Data Centers (CDCs) and DISA-brokered cloud capabilities in compliance with the Air Force Information Technology (AF IT) baselines.  This framework is a set of baseline-driven platform and infrastructure services in both physical and virtual hosting environments.  It is comprised of development tools, an initial set of enterprise services, and governance processes critical to JIE management.  As the customer interfaces on GCSS-AF, the presentation layer provides the worldwide standard security and single sign-on for accessing a variety of functional systems. The framework uses additional security features of Public Key Infrastructure (PKI) and AF Directory Services, negating duplication of security features in each of the functional systems being modernized within the GCSS-AF Family of Systems (FoS). This effort procures application, security, web, and proxy servers, software and associated licenses, and engineering support. \n\nFunding for this exhibit contained in PE 0303141F. \n\nPE 0708012F LOGISTICS SUPPORT ACTIVITY\n\nCARGO MOVEMENT OPERATIONS SYSTEM (CMOS): CMOS supports base-level and theater distribution management.   More than 235 Air Force, Marine Corps, Navy, Army, NSA, and DCMA activities employ CMOS through its web-based and deployable configurations. CMOS continues to provide effective traffic management support to the warfighter for both peacetime and contingency operations. CMOS prepares and manages all movement documentation, electronically interfaces with shippers, commercial carriers, and receiving activities, and provides bar code\/radio frequency identification (RFID) capability.  It provides in-transit visibility to DOD and commercial carriers, aids planning and managing force deployment, and supports the deployed Air and Space Expeditionary Force (AEF) warfighter through deployable and standard CMOS architectures.\n\nFunding for this exhibit contained in PE 0708012F.\n\nPE 0708610F LOGISTICS INFORMATION TECHNOLOGY (LOGIT)\n\nFinancial Improvement Audit Readiness (FIAR) and Software Upgrades:  The remediation and modification of core logistics systems is necessary for the Air Force to meet statutory Financial Improvement Audit Readiness (FIAR) by 2017 and align with the Joint Chiefs of Staff J-4 Concept for Logistics and the Air Force Logistics Board's approved Enterprise Logistics Strategy (ELS). The Air Force planned for ECSS to subsume most of the Service's core logistics systems upon fielding and therefore placed them in barebones reduced maintenance status during the ECSS program. Due to the cancellation of ECSS, the Air Force must sustain and modernize these systems through both FIAR Remediation, to address the most immediate gaps in meeting FIAR by the 2017 statutory deadline, and Software Upgrades, to reduce high operating costs, implement previously deferred statutory compliance requirements and improve near term system performance.\n\nSystems contained in these business areas include, but are not limited to, the Air Force Equipment Management System (AFEMS), Integrated Maintenance Data System (IMDS), Reliability and Maintainability Information System (REMIS), Combat Ammunitions System (CAS), Enhanced Maintenance Operations Center (EMOC), Aircraft Structural Integrity Management Information System (ASIMIS), Integrated Logistics System-Supply (ILS-S), Cargo Movement Operations System (CMOS), Stock Control System (SCS), Purchase Request Process System (PRPS), Automated Logistics Management Support System (ALMSS), Depot Maintenance Accounting and Production System (DMAPS), Enhanced Technical Information Management System (ETIMS), and Weapon System Management Information System (WSMIS).\n\nTransformation: The Air Force must transform its logistics business processes and transition away from using numerous stovepipe systems and process flows that execute the same tasks. Eliminating process redundancies across the logistics enterprise will enable the Air Force to execute more efficient, cost-effective and integrated logistics in the long term. The objective of Transformation is to conduct business process reengineering (BPR) to identify and eliminate overlaps in our current processes and where appropriate, implement the use of new information technology systems.  The Air Force Service Development and Delivery Process (SDDP) is being applied as part of this BPR effort to apply discipline and focus to the task of process reengineering and requirements development in order to reduce risk and successfully transform logistics IT systems. In the SDDP, the requirements definition, architecture and design for an IT capability is a government-owned process. The SDDP ensures the AF end user and Sponsor consider all possible doctrine, organization, training, material, leadership, personnel and facility (DOTMLPF) solutions to the end user's need\/problem before a materiel solution is sought. The SDDP is a six-step process, each step with its own specific product outcomes that serve as the basis for downstream activities in the SDDP and facilitating enterprise level analysis to maximize reuse of existing capabilities. Maximizing reuse will eliminate duplicate implementation actions across the Air Force and assure individual user problems or needs are not solved at the cost of overall enterprise benefits. The outcome of using the SDDP is a well-described requirement which may include\na materiel solution, in which case the SDDP details the acquisition and implementation activities to support delivery of the capability. Alternatively, success may be demonstrated by the resolution of the user's problem without a materiel solution.\n\nThe Air Force logistics enterprise is comprised of multiple overarching functional areas, to include maintenance, repair and overhaul, end-to-end supply chain support, base supply inventories, and predictive analysis and forecasting. The Air Force will standardize its business processes within each major logistics functional area through Transformation Capability Initiatives (CI). Transformation CIs include, but are not limited to: Maintenance, Repair and Overhaul (MROi), Supply Chain Management (SCM), and Product Lifecycle Management (PLM).\n\nFunding for this exhibit contained in PE 0708610F.\n\nPE 0901538 FINANCIAL MGMT INFO SYS DEVELOPMENT\n\nDEFENSE ENTERPRISE ACCOUNTING AND MANAGEMENT SYSTEM (DEAMS) Increment 1: To enhance transparency, DEAMS Other Procurement Air Force (OPAF) funding in Weapon System Code (WSC) 834430, Global Combat Support System - Air Force Family of Systems (GCSS-AF FOS) will end in FY 2014. Starting in FY 2015, DEAMS OPAF funding requests will be shown in WSC 834470, DEAMS.\n\nDEAMS Inc 1 is a commercial-off-the-shelf (COTS) Oracle based software implementation effort that will provide an auditable modern accounting and finance system. DEAMS is a Joint AF and United States\nTransportation Command (USTRANSCOM) Enterprise Resource Planning (ERP) Program that will replace existing accounting and finance legacy systems and will provide core funds execution management\nfunctions consistent with financial management laws, regulations and policy, general ledger, funds management, payments, receivables, cost and revenues, and fiduciary reporting. DEAMS is compliant with the\nClinger-Cohen Act, Business Enterprise Architecture (BEA), and integrates into Global Combat Support System-Air Force (GCSS-AF).\n\nIn 2014, DEAMS Inc 2 activities were incorporated into DEAMS Inc 1 to expedite deployment to operational locations and users.\n\nDEAMS Inc 1 capability is currently deployed to 14 locations and being used by ~3,000 users.  In FY 2015-2017, DEAMS Inc 1 capability will continue to be deployed to additional locations and users. \n\nFunding for this exhibit contained in PE 0901538F."
        },
        "Justification": {
            "val": "PE 0303141F GLOBAL COMBAT SUPPORT SYSTEM\n\nNo FY16 funding requested.\n\nPE 0708012F LOGISTICS SUPPORT ACTIVITY\n\nCARGO MOVEMENT OPERATIONS SYSTEM (CMOS): CMOS supports base-level and theater distribution management.   More than 235 Air Force, Marine Corps, Navy, Army, NSA, and DCMA activities employ CMOS through its web-based and deployable configurations. CMOS continues to provide effective traffic management support to the warfighter for both peacetime and contingency operations. CMOS prepares and manages all movement documentation, electronically interfaces with shippers, commercial carriers, and receiving activities, and provides bar code\/radio frequency identification (RFID) capability.  It provides in-transit visibility to DOD and commercial carriers, aids planning and managing force deployment, and supports the deployed Air and Space Expeditionary Force (AEF) warfighter through deployable and standard CMOS architectures.\n\nPE 0708012F LOGISTICS SUPPORT ACTIVITY\n\nCARGO MOVEMENT OPERATIONS SYSTEM: FY16 procurement dollars procure different types\/amounts of hardware in support of installation and unit mission requirements for Joint personnel. These funds replace hardware and updates software and licensing to support the sustainment posture for contingency operations, and buy various mixes of hardware, software, and licensing for 60 new sites. Hardware replacement mitigates increased capability demands on older platforms and supports deployable CMOS hardware and associated Automatic Identification Technology (AIT). \n\nPE 0708610F LOGISTICS INFORMATION TECHNOLOGY (LOGIT)\n\nThe Air Force must remediate and modify a number of core logistics IT systems to meet statutory Financial Improvement Audit Readiness (FIAR)requirements by 2017 and align with the Joint Chiefs of Staff J-4 Concept for Logistics and the Air Force Logistics Board's approved Enterprise Logistics Strategy (ELS).  Hardware and software purchases are part of necessary updates that will reduce future maintenance costs.  \n\nPE 0901538F FINANCIAL MANAGEMENT INFORMATION SYSTEMS DEVELOPMENT\n\nNo FY 16 funding requested."
        },
        "MDAPCode": {
            "val": "221"
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Global Combat Support System"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "GLOBAL COMBAT SUPPORT SYSTEM"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "3.038"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "3.038"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "3.038"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "3.038"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Logistics Support Activities"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "CARGO MOVEMENT OPERATIONS SYSTEM"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.696"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.696"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.796"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.796"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "0.696"
                                        },
                                        "CurrentYear": {
                                            "val": "0.696"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.796"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.796"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0.696"
                            },
                            "CurrentYear": {
                                "val": "0.696"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.796"
                            },
                            "BudgetYearOne": {
                                "val": "0.796"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Logistics Information Technology (LOGIT)"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Logistics IT Systems Modernization"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "3"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.974"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "24.719"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "24.719"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "3"
                                        },
                                        "CurrentYear": {
                                            "val": "2.974"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "24.719"
                                        },
                                        "BudgetYearOne": {
                                            "val": "24.719"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "3"
                            },
                            "CurrentYear": {
                                "val": "2.974"
                            },
                            "BudgetYearOneBase": {
                                "val": "24.719"
                            },
                            "BudgetYearOne": {
                                "val": "24.719"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Financial Management Information Systems Development"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "FINANCIAL MANAGEMENT INFORMATION SYSTEM"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "5.941"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "5.941"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "5.941"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}