{
    "id": "608f103c516262fcb32ae47da9941ee4873aff80",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_ARMY_OTHER_3-4_PROCUREMENT_JustificationBook_Army_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "MA4500"
        },
        "LineItemTitle": {
            "val": "Modification Of In-Svc Equipment (OPA-3)"
        },
        "P1LineNumber": {
            "val": "172"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "90"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "899.875"
                },
                "PriorYear": {
                    "val": "69.037"
                },
                "CurrentYear": {
                    "val": "98.559"
                },
                "BudgetYearOneBase": {
                    "val": "64.219"
                },
                "BudgetYearOne": {
                    "val": "64.219"
                },
                "BudgetYearTwo": {
                    "val": "53.407"
                },
                "BudgetYearThree": {
                    "val": "48.253"
                },
                "BudgetYearFour": {
                    "val": "61.753"
                },
                "BudgetYearFive": {
                    "val": "73.972"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "899.875"
                },
                "PriorYear": {
                    "val": "69.037"
                },
                "CurrentYear": {
                    "val": "98.559"
                },
                "BudgetYearOneBase": {
                    "val": "64.219"
                },
                "BudgetYearOne": {
                    "val": "64.219"
                },
                "BudgetYearTwo": {
                    "val": "53.407"
                },
                "BudgetYearThree": {
                    "val": "48.253"
                },
                "BudgetYearFour": {
                    "val": "61.753"
                },
                "BudgetYearFive": {
                    "val": "73.972"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "899.875"
                },
                "PriorYear": {
                    "val": "69.037"
                },
                "CurrentYear": {
                    "val": "98.559"
                },
                "BudgetYearOneBase": {
                    "val": "64.219"
                },
                "BudgetYearOne": {
                    "val": "64.219"
                },
                "BudgetYearTwo": {
                    "val": "53.407"
                },
                "BudgetYearThree": {
                    "val": "48.253"
                },
                "BudgetYearFour": {
                    "val": "61.753"
                },
                "BudgetYearFive": {
                    "val": "73.972"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Description": {
            "val": "This budget line funds Modifications of In-Service Equipment programs.  It is used to develop material solutions and also to procure hardware, materials, and the hardware installation cost required to complete the modification.  Modifications are performed to correct safety deficiencies; increase mission capabilities and interoperability; extend the useful life; improve supportability; upgrade existing technology; increase efficiency; improve readiness; modernization of legacy communications equipment and links; address obsolescence issues; and to meet new and\/or changing statutory and regulatory requirements.  By modifying existing equipment, the Army maintains a ready, supportable inventory of equipment that meets current requirements and regulations at a cost considerably below that of buying new equipment.\n\nArmy Watercraft Systems are categorized under Landing Craft, Towing and Terminal Operations, Ship-to-Shore Enablers and Watercraft Operations Support.  Landing Craft consist of 8 Logistic Support Vessels (LSV), 34 Landing Craft Utility (LCU-2000), and 30 Landing Craft Mechanized (LCM-8) MOD 1.  Towing and Terminal Operations consist of 6 Large Tugs (LT 800), 16 Small Tugs (ST 900), and 4 Barge Derrick Cranes (BD-115).  Ship-to-Shore Enablers consist of 3 Modular Causeway Systems (MCS) [each MCS includes 2 Roll-On\/Roll-Off Discharge Facilities (RRDF), 5 Modular Warping Tugs (MWT), 1 Causeway Ferry (CF), 1 Floating Causeway (FC)].  Landing Craft discharge combat equipment or troops to austere beaches, undeveloped coastlines and operate in a non-permissive environment.  Towing and Terminal Operations and Ship-to-Shore Enablers support ocean and port\/harbor towing\/salvage operations.  Both are critical in denied\/degraded ports, Joint Logistics Over-the-Shore (JLOTS) operations, and operations throughout the littorals.  Watercraft Operations Support includes 6 LCM-8 MOD 2.\n\nFirst fielded in 1988, the Logistics Support Vessel (LSV) is globally self deployable, and provides worldwide and intra-theater movement and line haul of large quantities of combat vehicles, equipment, and sustainment cargo, to include containerized, break-bulk, and Roll-on Roll-off (RO\/RO) cargo, to improved and\/or degraded ports, bare and austere beaches, and inland water terminals.  With 10,500 square feet of cargo space and a payload capacity of 2,000 tons, the LSV can carry 24 combat loaded M1A1 Main Battle Tanks or the equivalent.  The vessel supports JLOTS, seaport opening and coastal\/inland waterway distribution, anti-access theater opening, and can deliver combat-configured elements or sustainment cargo during all phases of the campaign.\n\nFirst fielded in 1990, the Landing Craft Utility (LCU-2000) provides intra-theater movement of combat vehicles, equipment, and sustainment cargo, to include containerized, break-bulk, and RO\/RO cargo to improved and\/or degraded ports, bare and austere beaches, and inland water terminals.  The vessel is ideally suited for the discharge and back load of sea lift, the shallow draft, bow ramp, and associated systems providing capability for beaching and beach extraction.  The vessel supports JLOTS, seaport opening and coastal\/inland waterway distribution, anti-access theater opening, and can deliver combat-configured elements or sustainment during all phases of the campaign.\n\nFirst fielded in 1967, the Landing Craft Mechanized (LCM-8) transports combat equipped personnel and equipment, and sustainment cargo, from ship to shore and\/or within coastal areas including inland waterways.  The vessel is also capable of providing medical evacuations, command and control (C2) afloat and light harbor salvage support.  The size of the vessel facilitates operation within restricted areas, access to shallow areas to include bare beaches, and extensively throughout inland waterways.\n\nFirst fielded in 1994, the Large Tug 800 (LT 800) performs transoceanic and coastal towing operations, docking and undocking of large ships, salvage and recovery operations for disabled or damaged watercraft at sea and along the coastal main supply routes, clearance of degraded, damaged, and denied access waterways and port facilities, and provides both ship to ship and ship to shore firefighting capability to include in support of ammunition upload\/download operations.\n\nFirst fielded in 1998, the Small Tug 900 (ST 900) provides movement of cargo barges and lighterage of various types within a harbor, port, or Logistics Over the Shore (LOTS) or Joint LOTS (JLOTS) operations.  It also assists larger tugs with utility work such as docking\/undocking of ships of all sizes, movement of floating cranes, and line-handling duties.\n\nFirst fielded in 1999, the Barge Derrick, 115 ton (BD-115) provides heavy lift to load and discharge cargo that exceeds the lift capacity of ship's gear in theater-wide missions\/operations.  The BD-115 is capable of lifting the M1A1 main battle tank from the centerline of a non-self sustaining ship, and is world-wide deployable via the LT-800.  The BD-115 also provides heavy clearance and salvage capabilities within degraded, damaged, and denied access waterways and port facilities.\n\nFirst fielded in 1996, the Modular Causeway System (MCS) provides floating platforms for the loading, discharge, and transport of combat vehicles, equipment, and sustainment cargo to and from improved or austere ports, inland water terminals, and during bare beach operations.  A modular and highly transportable system, the MCS consists of both powered and non-powered systems to include the Roll-on Roll-off Discharge Facility (RRDF), Causeway Ferry (CF), Floating Causeway (FC), and Warping Tug (WT), and serves as a key enabler for both LOTS and JLOTS operations.\n\nThe Army Watercraft Service Life Extension Program (SLEP) in prior fiscal years has been funded by MA4500, Modification of In-Service Equipment.  As of FY 2014, the SLEP requirement moved to M11101 Army Watercraft Extended Service Program (ESP)."
        },
        "Justification": {
            "val": "FY 2016 Base funding procures Construction Equipment (CE) ($3.207 million) and Material Handling Equipment (MHE) ($0.182 million) Technical Insertion modifications; weight reduction of selected components to allow armor addition onto already fielded M56 Smoke Generator systems; Food Sanitation Center ($2.480 million); Resource and Operational Energy reduction kits for Force Provider; and Tactical Bridging Modifications including upgrading the Dry Support Bridge (DSB)and the Rapidly Emplaced Bridging System (REBS). \n\nUpgrades\/modifications to Countermine Clearing Equipment for AN\/PSS-14 (HSTAMIDS) ($11.765 million) will extend the service life of this systems, currently used in theater.  \n\nForce Provider Modifications ($30.074 million) include: Operational Energy Kits (Shelter Energy Efficiency and Micro Grid); Quality of Life Augmentation Kits (with shelter energy efficiency, LED lighting, and energy saving air conditioning upgrade kits); Solid Waste Disposal Units; Laundry Water Reuse Kits; LED Lighting Kits; Heating, Ventilation and Air Conditioning Upgrade Kits; Solar Hot Water Kits; Renewable Energy Kits; Base camp Monitoring (Smart Camp); and Chaplain Package Modification Kits. \nFY 16 Base Funding includes production and installation of 22 Operational Energy-efficient Quality of Life Kits; 30 Microgrid Kits; 120 Laundry Water Reuse Kits; 68 LED Lighting Kits; 30 Solid Waste Disposal Kits; and 56 Environmental Control Upgrade Kits. Modifications support energy stewardship initiatives in the Army Strategic Plan and integrate threshold operational requirements identified in the Force Provider Capabilities Production Document.\n\nFY 2016 Base procurement dollars in the amount of $9.305 million supports upgrades\/modifications to all Army Watercraft Systems which are completed as required to resolve any safety and\/or sustainability issues, along with technical insertions.  These modifications will gain critically required operational improvements or maintain compliance with new and\/or changing federal statutory and regulatory mandates in the areas of safety of life at sea (SOLAS) and environmental compliance. \n\nFY16 $.206 million, Petroleum and Water Systems (PAWS) will perform continual evaluation of fielded fleet for future modification\/upgrades to PAWS systems to ensure these systems will meet the warfighter requirements.\n\nFY 2016 Base procurement dollars in the amount of $7.000 millions supports the following Bridging upgrades: the Dry Support Bridge (DSB) upgrade enabling the DSB to bridge a gap of 46 meters, increasing its gap crossing capability by 15%; the Rapidly Emplaced Bridge System (REBS) arctic kit, Roll-on\/Roll-off capability for C130 transport of the REBS, the REBS Automation kit, and the REBS Underride Bar; and the The M9 Armored Combat Earthmover (M9 ACE) effort brings the M9 ACE fleet to a common configuration.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "MODIFICATION KITS"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "MODIFICATION KITS"
                                            },
                                            "ItemNumber": {
                                                "val": "MA4501"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "698.565"
                                                    },
                                                    "PriorYear": {
                                                        "val": "52.818"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "70.279"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "39.856"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "39.856"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "INSTALLATION OF MODIFICATIONS"
                                            },
                                            "ItemNumber": {
                                                "val": "MA4502"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "176.816"
                                                    },
                                                    "PriorYear": {
                                                        "val": "5.777"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "20.84"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "17.363"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "17.363"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "RCMPV MODIFICATIONS"
                                            },
                                            "ItemNumber": {
                                                "val": "MA4503"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.082"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "TACTICAL  BRIDGING MODIFICATIONS"
                                            },
                                            "ItemNumber": {
                                                "val": "MA4504"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "24.494"
                                                    },
                                                    "PriorYear": {
                                                        "val": "10.442"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "7.358"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "7"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "7"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "899.875"
                                        },
                                        "PriorYear": {
                                            "val": "69.037"
                                        },
                                        "CurrentYear": {
                                            "val": "98.559"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "64.219"
                                        },
                                        "BudgetYearOne": {
                                            "val": "64.219"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "899.875"
                            },
                            "PriorYear": {
                                "val": "69.037"
                            },
                            "CurrentYear": {
                                "val": "98.559"
                            },
                            "BudgetYearOneBase": {
                                "val": "64.219"
                            },
                            "BudgetYearOne": {
                                "val": "64.219"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}