{
    "id": "62eb8655fe6a90bb47c2f1698764853b46cbbc07",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_AIRFORCE_OTHER_PROCUREMENT_JustificationBook_Air_Force_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "834040"
        },
        "LineItemTitle": {
            "val": "AF Global Command & Control Sys"
        },
        "P1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "13.559"
                },
                "CurrentYear": {
                    "val": "9.098"
                },
                "BudgetYearOneBase": {
                    "val": "7.212"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.212"
                },
                "BudgetYearTwo": {
                    "val": "17.759"
                },
                "BudgetYearThree": {
                    "val": "16.937"
                },
                "BudgetYearFour": {
                    "val": "13.135"
                },
                "BudgetYearFive": {
                    "val": "13.367"
                },
                "Total": {
                    "val": "91.067"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "13.559"
                },
                "CurrentYear": {
                    "val": "9.098"
                },
                "BudgetYearOneBase": {
                    "val": "7.212"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.212"
                },
                "BudgetYearTwo": {
                    "val": "17.759"
                },
                "BudgetYearThree": {
                    "val": "16.937"
                },
                "BudgetYearFour": {
                    "val": "13.135"
                },
                "BudgetYearFive": {
                    "val": "13.367"
                },
                "Total": {
                    "val": "91.067"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "13.559"
                },
                "CurrentYear": {
                    "val": "9.098"
                },
                "BudgetYearOneBase": {
                    "val": "7.212"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.212"
                },
                "BudgetYearTwo": {
                    "val": "17.759"
                },
                "BudgetYearThree": {
                    "val": "16.937"
                },
                "BudgetYearFour": {
                    "val": "13.135"
                },
                "BudgetYearFive": {
                    "val": "13.367"
                },
                "Total": {
                    "val": "91.067"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0303150F"
                }
            ]
        },
        "Description": {
            "val": "PE 0303150F GLOBAL COMMAND AND CONTROL SYSTEM \n\nGLOBAL COMMAND AND CONTROL SYSTEM AIR FORCE (GCCS-AF): The GCCS-AF program provides the common AF infrastructure hardware and software necessary to pass AF command and control (C2) data among commands, their components, and the joint GCCS. This program procures GCCS components which include, but are not limited to, servers, work stations, commercial-off-the-shelf (COTS) software, and associated peripherals to provide users with the full suite of joint baseline capability (including the common operating picture) and AF specific applications such as the Deliberate Crisis Action Planning and Execution Segments (DCAPES), and the AF's feed into the Joint Operations Planning and Execution System (JOPES). GCCS-AF is integrated at the following locations to establish initial and full joint connectivity and operational capability across the spectrum of intelligence, operations, manpower, and logistics: AF supported warfighting commanders, Headquarters United States Air Force, Major Command headquarters (MAJCOM), numbered air forces, wings, Air National Guard (ANG) bases, Air Force Reserve (AFR) bases, and remote sites. Each site will comply with current Air Force and Department of Defense (DoD) network initiatives by employing a standardized interface among AF base-level classified C2 networks, AF base-level network control centers, and the joint Defense Information Systems Agency Secret Internet Protocol Router Network. This program provides a flexible open system, distributed C2 architecture necessary to support the joint GCCS. GCCS supports AF operations by installing and upgrading a site's classified C2 system through extensive use of COTS technology that adheres to AF command and control, communications, and computer architectures and standards. \n\nThe FY2016 funding request was reduced by $5.133 million to account for the availability of prior execution balances."
        },
        "Justification": {
            "val": "PE 0303150F GLOBAL COMMAND AND CONTROL SYSTEM \n\nGLOBAL COMMAND AND CONTROL SYSTEM AIR FORCE (GCCS-AF): FY16 procurement funding procures various types and quantities of hardware and software in support of installation and unit mission requirements for Air Force personnel. These funds provide for the procurement and installation of GCCS-AF hardware and software (government-off- the-shelf and commercial-off-the-shelf) at warfighter Combatant Command (COCOM), MAJCOM, ANG, and AFR locations providing a full spectrum of command, control, logistics, and intelligence capability from strategic to unit level operations with total joint service connectivity. Funds replace logistically unsupportable MAJCOM C2 systems to accept advancements in the Air Force and joint GCCS software. The classified command and control infrastructure of MAJCOM C2 facilities (e.g. command posts) will be replaced by installing state-of-the-art components for improved integration, interoperability, data throughput, and system security required for Secret Internet Protocol Router Network (SIPRNET) connectivity. The procured application and database servers, enclave protection components, and end-user equipment support multiple existing and new sites and support the deployment of the DCAPES application. The GCCS architecture supports functional users on each base and specifically incorporates manpower and logistics functions into GCCS. This fielding is consistent with the AF's Air Expeditionary Force (AEF) C2 structure and integration with DoD's emerging next generation joint C2 enabler."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "AF GLOL COMMAND and CONTROL SYS"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "GCCS-AF IMPLEMENTATION"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "8.396"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.787"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.279"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.279"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "GCCS-AF IMPLEMENTATION (PROGRAM MANAGEMENT ADMINISTRATION)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "3.508"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.856"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.93"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.93"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "GCCS-AF IMPLEMENTATION (INTEGRATION AND INSTALLATION)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1.655"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.455"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.003"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.003"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "13.559"
                                        },
                                        "CurrentYear": {
                                            "val": "9.098"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.212"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.212"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "GCCS-AF ANG and AFR Implementation lines have been zeroed out because ANG and AFRC do not have GR enclave suites, and maintain a few of the previously legacy Windows servers. They are now Client\nonly sites, and point to Commands like AMC and USAFE for their GCCS capabilities\/functionality. The next infrastructure release to any Command will be for GCCS-J GR 6.0 X86 (late FY15 and FY16), and\nANG and AFRC are not slated for those new enclave suites.\n\nWith the $5M cut projected in FY16 3080, we will be unable to field GCCS-J v6.0 to the following sites (critical sites marked with *):\n*Headquarters Special Operations Command Central (HQ SOCCENT) - Deployed\n*Headquarters U.S. Central Command (HQ USCENTCOM) - Deployed\n*Air Force Targeting Center (AFTC), Langley AFB, VA\n*20 Intelligence Squadron, Offutt AFB\n*Raven Rock Mountain Complex (SITE R), PA AFISRA (AIA (NC)) \"25th Air Force\"\nAir Education Training Command (AETC) Schoolhouse Headquarters Fourteenth Air Force (HQ 14AF) Western Air Defense Sector (WADS) Eastern Air Defense Sector (EADS) Air Force Space Command\nCenter (AFSPC)\n36th AEW\n18th Wing\n8th Fighter Wing\n35th Fighter Wing\nHeadquarters Seventh Air Force (HQ 7AF)\nHawaii (HIRAOC)\nHeadquarters Fifth Air Force (HQ 5AF)\nHeadquarters Alaskan Command (HQ ALCOM\/HQ 11AF)\n\nGCCS-AF PMO is the AF's sole agent for fielding GCCS-J. As such, we must provide the hardware, software, and engineering expertise and manpower to field GCCS-J to all AF locations except AOCs as well as the 5 Combatant Commands that the AF is responsible for. Our purchase schedule is driven in part by DISA's fielding schedule for critical sites. Fielding to the critical sites is executed by DISA and we must provide the hardware and software to those sites in advance of Dis As fielding dates. In the past, DISA has fielded to critical sites in the 6 months following an FRR which means that we will need to begin providing hardware\/software in early FY16."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "13.559"
                            },
                            "CurrentYear": {
                                "val": "9.098"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.212"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "7.212"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}