{
    "id": "785682bd3c99154ebd3298fd0ba36607c73c4889",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_ARMY_OTHER_3-4_PROCUREMENT_JustificationBook_Army_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "M90101"
        },
        "LineItemTitle": {
            "val": "Base Defense Systems (BDS)"
        },
        "P1LineNumber": {
            "val": "111"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Chemical Defensive Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "7.2"
                },
                "CurrentYear": {
                    "val": "1.93"
                },
                "BudgetYearOneOCO": {
                    "val": "4.035"
                },
                "BudgetYearOne": {
                    "val": "4.035"
                },
                "BudgetYearTwo": {
                    "val": "1.983"
                },
                "BudgetYearThree": {
                    "val": "12.355"
                },
                "BudgetYearFour": {
                    "val": "29.944"
                },
                "BudgetYearFive": {
                    "val": "36.161"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "7.2"
                },
                "CurrentYear": {
                    "val": "1.93"
                },
                "BudgetYearOneOCO": {
                    "val": "4.035"
                },
                "BudgetYearOne": {
                    "val": "4.035"
                },
                "BudgetYearTwo": {
                    "val": "1.983"
                },
                "BudgetYearThree": {
                    "val": "12.355"
                },
                "BudgetYearFour": {
                    "val": "29.944"
                },
                "BudgetYearFive": {
                    "val": "36.161"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "7.2"
                },
                "CurrentYear": {
                    "val": "1.93"
                },
                "BudgetYearOneOCO": {
                    "val": "4.035"
                },
                "BudgetYearOne": {
                    "val": "4.035"
                },
                "BudgetYearTwo": {
                    "val": "1.983"
                },
                "BudgetYearThree": {
                    "val": "12.355"
                },
                "BudgetYearFour": {
                    "val": "29.944"
                },
                "BudgetYearFive": {
                    "val": "36.161"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "7.2"
                                },
                                "CurrentYear": {
                                    "val": "1.93"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "4.035"
                                },
                                "BudgetYearOne": {
                                    "val": "4.035"
                                },
                                "BudgetYearTwo": {
                                    "val": "1.983"
                                },
                                "BudgetYearThree": {
                                    "val": "12.355"
                                },
                                "BudgetYearFour": {
                                    "val": "29.944"
                                },
                                "BudgetYearFive": {
                                    "val": "36.161"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "7.2"
                    },
                    "CurrentYear": {
                        "val": "1.93"
                    },
                    "BudgetYearOneOCO": {
                        "val": "4.035"
                    },
                    "BudgetYearOne": {
                        "val": "4.035"
                    },
                    "BudgetYearTwo": {
                        "val": "1.983"
                    },
                    "BudgetYearThree": {
                        "val": "12.355"
                    },
                    "BudgetYearFour": {
                        "val": "29.944"
                    },
                    "BudgetYearFive": {
                        "val": "36.161"
                    }
                }
            }
        },
        "Description": {
            "val": "Base Defense Systems (BDS) includes Non-Intrusive Inspection Systems (NIIS) (M90108), Battlefield Anti-Intrusion System (BAIS) (M90202), Lighting Kit Motion Detection (LKMD) (M90204), Integrated Ground Security, Surveillance and Response Capability (IGSSR-C)(M90106) and Integrated Base Defense (IBD) Kitting (M90115) \n\nNIIS is a family of systems that inspects for the presence of explosives, weapons and other contraband in vehicles, cargo containers and personnel from a distance providing stand-off ballistic and blast protection.  The current family of systems includes the Z-backscatter Van (ZBV), Military Mobile Vehicle and Cargo Inspection System (MMVACIS) and personnel scanners such as the Secure-1000. All systems are either mobile or fully relocatable.  It is a force multiplier that maximizes protection of personnel, equipment and installations while minimizing manpower requirements.  NIIS provides the capability to non-intrusively inspect vehicles, cargo containers and personnel for the presence of explosives, weapons or other contraband which can kill or injure Soldiers and destroy critical warfighting materiel.  NIIS supports the urgent need for Counter-Improvised Explosive Device equipment to support military operations.   \n\nBAIS is a compact, modular, light-weight, unattended tactical ground seismic\/acoustic sensor that provides tactical units and Forward Operating Bases with an enhanced force protection capability.  BAIS enhances force protection and provides early detection and warning of personnel and wheeled or tracked vehicles, increasing situational awareness during defensive and ambush-type operations.  BAIS can be integrated into a layered system of systems force protection plan for small tactical units.  BAIS is also one of the sub-systems included in the Force Protection Suite that is part of the Base Expeditionary Targeting and Surveillance System, Combined, employed in Forward Operating Bases (FOB) and Combat Outpost (COP) defense and force protection.  BAIS provides combat Soldiers a force multiplier force protection system that significantly increases the combat potential and Soldier survivability, enhancing the probability of successful mission accomplishment.  BAIS replaces the Platoon Early Warning System (PEWS), which is no longer in production.  The Army Acquisition Objective (AAO) is 8,933 systems. \n\nLKMD is a lightweight, man-portable, easily emplaced and recoverable motion activated warning device.  LKMD provides an early detection and warning capability enhancing force protection and situational awareness during all types of combat operations.  LKMD is a motion activated (Infrared (IR) and Microwave) warning and illumination (visible light, IR and strobe) system.  LKMD can be employed in a stand-alone configuration or as part of an integrated protection plan.  LKMD provides small-unit Commanders with close-in warning of imminent intrusion and illuminates the intrusion where it occurs, permitting easier identification and facilitating appropriate responses. LKMD systems will be organic to appropriate tactical units.  LKMD provides support systems to Army units either operating in or deploying to combat theaters, thereby increasing force protection posture.  The Army fielding plan, based on the approved Basis of Issue Plan, requires systems be provided to the following types of units: Military Police, Infantry, Armor and Combat Engineers.  LKMD replaces the M49 Trip Flare, Electronic which is no longer in production.  The Army Acquisition Objective (AAO) is 23,545 systems.\n\nThe IGSSR-C is a Joint Requirement that provides a layered approach to integrate sensors, sensor systems and unmanned systems with automated fusion capabilities to create an in-depth security, surveillance and response Force Protection (FP) COP capability for CONUS fixed, OCONUS semi-fixed or expeditionary elements in all Operating Environments (OE).  This capability will enable rapid decision analysis, speed the response process as well as increase information dissemination horizontally and vertically along the chain of command and with outside supporting organizations.  IGSSR-C is a software centric fusion engine that connects legacy and emerging FP systems, legacy Chemical, Biological, Radiological, Nuclear, and Explosive (CBRNE), unmanned systems, biometric identification and forensic data systems.The desired end state is to achieve interoperability with current and emerging FP systems used by Joint Forces, Department of Defense (DoD) agencies and multi-national forces.\n\nThe purpose of IBD Kitting is to harvest and refurbish physical security and FP Non-Standard Equipment and package them into integrated and interoperable IBD capabilities.  IBD packages support expeditionary ground operations and provide a bridge to the enduring IBD capability.  IBD kits are integrated into a System of Systems (SoS) to provide an interim IBD capability to increase protective effectiveness, enhance situational awareness and reduce troop-to-task requirements."
        },
        "Justification": {
            "val": "FY16 OCO procurement of $4.035 million will provide 32 IBD packages: X-Small (14), Small (5), Medium (5), Large (4), Small Training (3), Large Training (1)."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "INTEG BASE DEF NONSTAND EQUIP (IBD NS-E) KITTING"
                    },
                    "ItemNumber": {
                        "val": "M90115"
                    },
                    "SecondaryDistribution": {
                        "ComponentList": {
                            "Component": [
                                {
                                    "Name": {
                                        "val": "Army Active"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "BudgetYearOneOCO": {
                                                "val": "4.035"
                                            },
                                            "BudgetYearOne": {
                                                "val": "4.035"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "BudgetYearOneOCO": {
                                "val": "4.035"
                            },
                            "BudgetYearOne": {
                                "val": "4.035"
                            }
                        },
                        "UnitCost": {
                            "BudgetYearOneBase": {
                                "val": "126.094"
                            },
                            "BudgetYearOne": {
                                "val": "126.094"
                            }
                        },
                        "NetProcurementP1": {
                            "BudgetYearOneOCO": {
                                "val": "4.035"
                            },
                            "BudgetYearOne": {
                                "val": "4.035"
                            }
                        },
                        "TotalObligationAuthority": {
                            "BudgetYearOneOCO": {
                                "val": "4.035"
                            },
                            "BudgetYearOne": {
                                "val": "4.035"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "IBD Govt Program Management Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.333"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.333"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "IBD Equipment Receipt"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.782"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.782"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "IBD Equipment Catalog"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.332"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.332"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "IBD Container Refurbishment"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.148"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.148"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "IBD Package Assembly"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "1.391"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.391"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "IBD Kit Transportation"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.727"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.727"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "IBD Quality Assurance"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.322"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.322"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "BudgetYearOneOCO": {
                                                "val": "4.035"
                                            },
                                            "BudgetYearOne": {
                                                "val": "4.035"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneOCO": {
                                            "val": "4.035"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.035"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "BATTLEFILELD ANTI-INTRUSION SYSTEM (BAIS)"
                    },
                    "ItemNumber": {
                        "val": "M90202"
                    },
                    "SecondaryDistribution": {
                        "ComponentList": {
                            "Component": [
                                {
                                    "Name": {
                                        "val": "Army Active"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "5.08"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "5.08"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "5.08"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "5.08"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Fielding Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "3.033"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Program Management Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0.3"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SETA Contract Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "1.747"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "5.08"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "5.08"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ],
            "P40AItemGroup": [
                {
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "LIGHTING KIT, MOTION DETECTOR (LKMD), AN\/GAR-2"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "LIGHTING KIT, MOTION DETECTOR (LKMD), AN\/GAR-2"
                                            },
                                            "ItemNumber": {
                                                "val": "M90204"
                                            },
                                            "SecondaryDistribution": {
                                                "ComponentList": {
                                                    "Component": [
                                                        {
                                                            "Name": {
                                                                "val": "Army Active"
                                                            },
                                                            "Cost": {
                                                                "TotalCost": {
                                                                    "PriorYear": {
                                                                        "val": "2.12"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "1.93"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    ]
                                                }
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "2.12"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.93"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "2.12"
                                        },
                                        "CurrentYear": {
                                            "val": "1.93"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "2.12"
                            },
                            "CurrentYear": {
                                "val": "1.93"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}