{
    "id": "7d82817768bdac2499216d11a1bfac73724dbefc",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_NAVY_MARINECORPS_PROCUREMENT_JustificationBook_Navy_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "6438"
        },
        "LineItemTitle": {
            "val": "Physical Security Equipment"
        },
        "P1LineNumber": {
            "val": "52"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Materials Handling Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "207.818"
                },
                "PriorYear": {
                    "val": "14.851"
                },
                "CurrentYear": {
                    "val": "24.643"
                },
                "BudgetYearOneBase": {
                    "val": "33.145"
                },
                "BudgetYearOneOCO": {
                    "val": "7"
                },
                "BudgetYearOne": {
                    "val": "40.145"
                },
                "BudgetYearTwo": {
                    "val": "51.353"
                },
                "BudgetYearThree": {
                    "val": "41.94"
                },
                "BudgetYearFour": {
                    "val": "19.727"
                },
                "BudgetYearFive": {
                    "val": "21.09"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "207.818"
                },
                "PriorYear": {
                    "val": "14.851"
                },
                "CurrentYear": {
                    "val": "24.643"
                },
                "BudgetYearOneBase": {
                    "val": "33.145"
                },
                "BudgetYearOneOCO": {
                    "val": "7"
                },
                "BudgetYearOne": {
                    "val": "40.145"
                },
                "BudgetYearTwo": {
                    "val": "51.353"
                },
                "BudgetYearThree": {
                    "val": "41.94"
                },
                "BudgetYearFour": {
                    "val": "19.727"
                },
                "BudgetYearFive": {
                    "val": "21.09"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "207.818"
                },
                "PriorYear": {
                    "val": "14.851"
                },
                "CurrentYear": {
                    "val": "24.643"
                },
                "BudgetYearOneBase": {
                    "val": "33.145"
                },
                "BudgetYearOneOCO": {
                    "val": "7"
                },
                "BudgetYearOne": {
                    "val": "40.145"
                },
                "BudgetYearTwo": {
                    "val": "51.353"
                },
                "BudgetYearThree": {
                    "val": "41.94"
                },
                "BudgetYearFour": {
                    "val": "19.727"
                },
                "BudgetYearFive": {
                    "val": "21.09"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206313M"
                }
            ]
        },
        "Description": {
            "val": "Physical Security Systems provide systematic, uniform technological solutions to manpower intensive security requirements.  Systems are used at bases and stations protecting our most important assets vital to operations - people, flight lines, classified information, arms, ammunition, and explosives (AA&E), shore lines, open dessert areas, critical assets and infrastructure and providing constant, vigilant capabilities that control and restrict access and provide notification of actual and attempted unauthorized intrusion. Mass Notification System (MNS) provides immediate notice and warning to personnel living and working aboard our bases and stations in the event of security breaches via interior and exterior speaker systems, telephones and computers in the event of natural disasters, terrorist activities, weather emergencies or other events requiring immediate guidance to ensure the safety and security of personnel.  \n\nCollateral Equipment (CE) is specifically designed for physical security\/electronic security systems (ESS) in military construction (MILCON) projects. Funding procures items such as equipment, devices, and systems necessary for the United States Marine Corps installation and facility structure to comply with Congressional, White House Military Office, Department of Defense, Department of Navy, and Marine Corps Physical Security and antiterrorism directives pertaining to security equipment and ESS as technological solutions to manpower intensive security requirements. This resource further provides a systematic, uniform capability throughout Marine Corps installations to deter, delay, and defeat espionage, sabotage, damage, theft, and terrorist attacks against Marine Corps assets such as personnel, facilities, information, and equipment.  Additionally, this resource funds centrally managed items for the initial outfitting of construction projects.  The types of equipment procured under the CE program include but are not limited to; physical security, command support, audio visual, and communications equipment.   \n\nThese systems upgrade and replace antiquated individually purchased systems that are costly to maintain and may not meet prescribed requirements for securing U.S. assets.  The Marine Corps Electronic Security System (MCESS) Program provides a comprehensive electronic security system suite that supports collateral equipment including intrusion detection, surveillance, installation, and facility automated access control and tracking capabilities.  These systems increase efficiency\/effectiveness of available security manpower and improve security and safety at installation perimeter, flight line, restricted area, facility entry points and is now expanding to meet installation access control requirements.  Ground based radars support wide areas aboard Marine Corps installations such as expansive waterways, open airfields and dessert areas (improved assessment at long distances) allowing for greater defensive posture and response capabilities.  \n\nIdentity Dominance System-MC (IDS-MC) is a multi-modal (fingerprint, iris and face) biometric collection system that provides the USMC a reliable and effective capability to collect, share, match, access, verify and store identity information. IDS-MC will enable the Marine to collect appropriate biometric, biographical and reference information on an individual and match this locally developed information with pre-existing information available to the expeditionary force. The system will display match results with linkage to the respective individual's biographical and reference information as well as help analyze the response, update records as appropriate, create reports and disseminate updated information in accordance with current MAGTF policy. The primary mission of IDS-MC is to provide the MAGTF with the means to identify persons encountered in the battlespace. While IDS-MC is not an intelligence analysis system, it does provide identification information in support of military intelligence and law enforcement operations by providing positive identification of persons of interest. IDS-MC is an enabler in the areas of detainee management and questioning, base access, counterintelligence screening, border control, law enforcement, displaced persons' management and aiding in humanitarian assistance missions. IDS-MC supports the tactical application of identity dominance and fully supports a forward presence, crisis response and contingency response capability. IDS will subsume the Biometrics Automated Toolset (BAT). The total AAO of 804 is required for training facilities and eleven battalion-sized elements.\n\nGround-Based Operational Surveillance System (G-BOSS) is an expeditionary, ground-based, self-contained, multi-spectral sensor-oriented, persistent surveillance system.  It is used to observe, collect, detect, identify, classify, track, and report on contacts, objects of interest, and assessed threats.  The G-BOSS Heavy (GBH), G-BOSS Medium (GBM) and G-BOSS Light (GBL) variants may be integrated into mutually supporting networks of G-BOSS systems."
        },
        "Justification": {
            "val": "The FY 2016 funding request was reduced by $7.751M to account for the availability of prior year execution balances.\n\nFY14 Base Appropriation: $14.851M\nInstallations Security Equipment $6.951M: Physical Security Systems supported systematic, uniform technological solutions to manpower intensive security requirements such as Intrusion Detection Systems throughout the Marine Corps. Funds were needed to upgrade operating systems no longer supported by industry due to end of life support for the current operating system software. \n\nCollateral Equipment $7.900M: Funds provided for the procurement of flight line security systems, ground based radar detection tracking systems, Mass Notification Systems and perimeter and facility automated access control and tracking capabilities control systems. \n\n\nFY15 Base Appropriation: $24.643M\nInstallations Security Equipment $12.332M: Physical Security Systems supports systematic, uniform technological solutions to manpower intensive security requirements, such as Intrusion Detection Systems throughout the Marine Corps. The funding increase from FY14 to FY15 supports the Department of the Navy's decision to focus on requirements and resource realignment of all commodity areas and budget adjustments.  Funds are needed to upgrade operating systems no longer supported by industry due to end of life support for the current operating system software.\n\nCollateral Equipment $10.657M: FY15 funds procurement of flight line security systems, ground based radar detection tracking systems, and perimeter and facility automated access control and tracking capabilities control systems.    \n\nIDS-MC $1.654M: Supports the procurement of 78 IDS systems to provide identification information in support of military intelligence and law enforcement operations by providing positive identification of persons of interest. IDS-MC is an enabler in the areas of detainee management and questioning, base access, counterintelligence screening, border control, law enforcement, displaced persons' management and aiding in humanitarian assistance missions. IDS-MC supports the tactical application of identity dominance and fully supports a forward presence, crisis response and contingency response capability.\n\nFY16 Base Appropriation Request: $33.145M\nInstallations Security Equipment $23.206M: Physical Security Systems supports systematic, uniform technological solutions to manpower intensive security requirements throughout the Marine Corps. The funding increase from FY15 to FY16 is mostly due to the procurement of telecommunications equipment to support Defense Policy Review Initiative (DPRI) efforts.  \n\nCollateral Equipment $8.756M: FY16 funds procurement of items such as flight line security systems, ground based radar detection tracking systems, perimeter and facility automated access control and tracking capabilities control systems, VOIP phones, uninterrupted power supplies, passive optical networks, intercom systems, internal grounding systems for testing and backup generators.  \n\nIDS-MC $1.183M: Supports the procurement of IDS systems to provide identification information in support of military intelligence and law enforcement operations by providing positive identification of persons of interest. IDS-MC is an enabler in the areas of detainee management and questioning, base access, counterintelligence screening, border control, law enforcement, displaced persons' management and aiding in humanitarian assistance missions. IDS-MC supports the tactical application of identity dominance and fully supports a forward presence, crisis response and contingency response capability.\n\nOCO: \nFY16 Overseas Contingency Operations (OCO) Request:  $7.000M\n\nGBOSS $7.000M:  Supports a technology refresh of G-BOSS by integrating UAS receivers capable of supporting emerging encryption requirements.  This request supports the procurement and integration of VideoScout Receivers and the ancillary equipment to support enhanced UAS encryption."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Physical Security Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Collateral Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) Collateral Equipment"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "108.542"
                                                    },
                                                    "PriorYear": {
                                                        "val": "7.9"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "10.657"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "8.756"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.756"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "108.542"
                                        },
                                        "PriorYear": {
                                            "val": "7.9"
                                        },
                                        "CurrentYear": {
                                            "val": "10.657"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.756"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.756"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) Installations Security Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) Installation Security Equipment"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "87.413"
                                                    },
                                                    "PriorYear": {
                                                        "val": "6.951"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "12.332"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "8.849"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.849"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.2) Installation Sec Eqp - Defense Policy Review Initiative Equipment"
                                            },
                                            "ItemNumber": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "14.357"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "14.357"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "87.413"
                                        },
                                        "PriorYear": {
                                            "val": "6.951"
                                        },
                                        "CurrentYear": {
                                            "val": "12.332"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.206"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.206"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) IDENTITY DOMINANCE SYSTEM (IDS-MC)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) IDS  Biometrics Systems"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "78"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "52"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "52"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "1.365"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.911"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.911"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "17500"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "17519.23"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "17519.23"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "TBD"
                                                        },
                                                        "Location": {
                                                            "val": "TBD"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2015"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "TBD"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2015-07"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2015-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "78"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "17500.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "false"
                                                                    },
                                                                    "RevisionsAvailableDate": {
                                                                        "val": "2015-07"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2016"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "TBD"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2016-07"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2016-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "52"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "17519.23"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "false"
                                                                    },
                                                                    "RevisionsAvailableDate": {
                                                                        "val": "2015-07"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "TBD"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.2) Integration\/Production\/Logistics Support"
                                            },
                                            "ItemNumber": [],
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.289"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.272"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.272"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.5) IDS Biometric Enrollment Screening Device (BESD)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "11.863"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "11.863"
                                        },
                                        "CurrentYear": {
                                            "val": "1.654"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.183"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.183"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) Ground-Based Operational Surveillance System (G-BOSS)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) G-BOSS VideoScout Receivers and Ancillary Equipment"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "4"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.2) G-BOSS Integration Support"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "3"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "7"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "207.818"
                            },
                            "PriorYear": {
                                "val": "14.851"
                            },
                            "CurrentYear": {
                                "val": "24.643"
                            },
                            "BudgetYearOneBase": {
                                "val": "33.145"
                            },
                            "BudgetYearOneOCO": {
                                "val": "7"
                            },
                            "BudgetYearOne": {
                                "val": "40.145"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}