{
    "id": "8ae4b2f8aa8f3f6dd9afa8815e46296867f3b343",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_AIRFORCE_OTHER_PROCUREMENT_JustificationBook_Air_Force_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "834520"
        },
        "LineItemTitle": {
            "val": "Theater Battle Mgt C2 System"
        },
        "P1LineNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "7.387"
                },
                "CurrentYear": {
                    "val": "9.561"
                },
                "BudgetYearOneBase": {
                    "val": "7.523"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.523"
                },
                "BudgetYearTwo": {
                    "val": "9.738"
                },
                "BudgetYearThree": {
                    "val": "9.627"
                },
                "BudgetYearFour": {
                    "val": "9.261"
                },
                "BudgetYearFive": {
                    "val": "9.426"
                },
                "Total": {
                    "val": "62.523"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "7.387"
                },
                "CurrentYear": {
                    "val": "9.561"
                },
                "BudgetYearOneBase": {
                    "val": "7.523"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.523"
                },
                "BudgetYearTwo": {
                    "val": "9.738"
                },
                "BudgetYearThree": {
                    "val": "9.627"
                },
                "BudgetYearFour": {
                    "val": "9.261"
                },
                "BudgetYearFive": {
                    "val": "9.426"
                },
                "Total": {
                    "val": "62.523"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "7.387"
                },
                "CurrentYear": {
                    "val": "9.561"
                },
                "BudgetYearOneBase": {
                    "val": "7.523"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.523"
                },
                "BudgetYearTwo": {
                    "val": "9.738"
                },
                "BudgetYearThree": {
                    "val": "9.627"
                },
                "BudgetYearFour": {
                    "val": "9.261"
                },
                "BudgetYearFive": {
                    "val": "9.426"
                },
                "Total": {
                    "val": "62.523"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Theater Battle Management Core Systems (TBMCS) is an integrated battle management system used to plan, execute, and assess an air campaign. It provides automated planning tools enabling consistent, coordinated battle management at entities ranging from the force level (Air Operations Centers [AOC]) to the unit level (wings\/squadrons) for operations and intelligence functions. TBMCS is a United States Air Force system with Joint interest responsible for generation and dissemination of the air tasking order and interoperates with allied units. \n\nThe FY2016 funding request was reduced by $1.331M to account for the availability of prior execution balances \n\nUnit Command and Control (UC2): Provides the wing and base commanders, and their battle staffs with timely and accurate information for effective decision making. UC2 also provides secure, automated, deployable, and distributed wing-level command and control system with connectivity to TBMCS-Force Level (TBMCS-FL) systems. \n\nStarting in FY16 the Unit Command and Control Intel funding is transferred to P-1 Line Item 832070 Intelligence Comm Equipment, in PE 020431F Combat Air Intel Systems. \n\nPersonnel Recovery Command and Control (PRC2): Provides PRC2 services supporting all Combatant Commands, Joint Services and other non-government agencies. Capabilities include web-based access to isolated personnel reports for all DoD personnel, C2 tools for performing command and control of recovery efforts for downed airmen\/isolated ground troops, and rapid identification of personnel in distress. PRC2 is used within Air Operation Centers\/Area Of Responsibilities (AOCs\/AORs), Joint Personnel Recovery Centers, and Rescue Coordination Centers to provide the capabilities and services for planning and executing recovery of isolated personnel, and rapidly collaborate, disseminate, and store time-sensitive personnel recovery information. \n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities. \n\nFunding for this exhibit contained in PE 0207410F."
        },
        "Justification": {
            "val": "1.  TBMCS-FORCE LEVEL (TBMCS-FL): Provides the Joint and Combined Air Component Commander with the automated tools necessary to effectively and efficiently plan, monitor, and execute the air campaign.  This includes planning and issuing the Air Tasking and Airspace Control Orders that ensure the theater commander's intent is supported through the application of airpower using the latest intelligence.  FY16 funding will continue fielding TBMCS-FL Spiral 1.1.3 Maintenance Release 2, and begin fielding Maintenance Release 3, to 40 locations (28 AD\/7 ANG\/5 AFR).  \n\n     a.  TBMCS-FL PROGRAM MANAGEMENT ADMINISTRATION (PMA): FY16 funding includes provisions for government contract oversight, technical expertise, and program office support associated with the fielding of TBMCS-FL.  \n\n     b.  TBMCS-FL TRAINING & FIELDING: FY16 funding will continue to support Type 1 training & fielding.  As contractors field the TBMCS-FL upgrades, they will provide specialized training at each location.\n\n     c-e.  TBMCS-FL Spiral 1.1.3: FY16 funds will continue to be used to procure hardware and associated software licenses for fielding to various sites.\n\n2.  UNIT COMMAND AND CONTROL (UC2): Provides the wing and base commanders and their battle staffs with timely and accurate information for effective decision making.  UC2 also provides secure, automated, deployable, and distributed wing-level command and control system with connectivity to TBMCS-FL systems.  Enhanced unit-level operations and intelligence capabilities will be provided through the Unit Command and Control [UC2) project.  FY16 funding will continue to support fielding Capital Equipment Replacement (CER) cycle for UC2 Ops at 45 active duty locations and UC2 Intel at 137 active duty locations. Starting in FY16 the Unit Command and Control Intel funds will be executed from PE 27431F.\n\n     a.  UC2 HARDWARE AND COMMERCIAL-OFF-THE-SHELF (COTS) SOFTWARE: FY16 funds will continue to replace clients, servers, miscellaneous hardware, and associated software licenses for UC2 Ops sites.\n\n     b.  UC2 PMA: FY16 funding includes provisions for government contract oversight, technical expertise, and program office support associated with the fielding of UC2.\n\n3.  PERSONNEL RECOVERY COMMAND AND CONTROL (PRC2): Provides PRC2 services supporting all Combatant Commands, Joint Services and other governmental agencies.  Capabilities include web-based access to isolated personnel reports for all DoD personnel, C2 tools for performing command and control of recovery efforts for downed airmen\/isolated ground troops, and rapid identification of personnel in distress.  PRC2 is used within AOC's\/AORs, Joint Personnel Recovery Centers, and Rescue Coordination Centers to provide the capabilities and services for planning and executing recovery of isolated personnel, and rapidly collaborate, disseminate, and store time-sensitive personnel recovery information.  \n\n     a.  PRC2 HARDWARE AND COTS SOFTWARE: FY16 funds will continue procure various hardware pieces and associated software licenses for fielding to various sites.\n\n     b.  PRC2 PMA: FY16 funding includes provisions for government contract oversight, technical expertise, and program office support associated with the fielding of PRC2."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Theater Battle Mgt C2 System"
                    },
                    "ItemNumber": [],
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "7.387"
                            },
                            "CurrentYear": {
                                "val": "9.561"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.523"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "7.523"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "7.387"
                            },
                            "CurrentYear": {
                                "val": "9.561"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.523"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "7.523"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "7.387"
                            },
                            "CurrentYear": {
                                "val": "9.561"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.523"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "7.523"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "Hardware End Item"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "1.c. TBMCS-FL, Spiral 1.1.3 - AD"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0.814"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.232"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.081"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.081"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.d. TBMCS-FL, Spiral 1.1.3 - GUARD"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0.15"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.15"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.079"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.079"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.e. TBMCS-FL, Spiral 1.1.3 - RESERVE"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0.145"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.145"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.079"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "0"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.079"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "1.109"
                                            },
                                            "CurrentYear": {
                                                "val": "1.527"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.239"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.239"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "1.109"
                                        },
                                        "CurrentYear": {
                                            "val": "1.527"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.239"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.239"
                                        }
                                    }
                                }
                            }
                        ],
                        "PackageFielding": {
                            "Name": {
                                "val": "PackageFielding End Item"
                            },
                            "Recurring": {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "1.b. TBMCS-FL Training & Fielding"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1.641"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.247"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.21"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.21"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.a. UC2 Hardware & COTS Software"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "2.255"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.088"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.378"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.378"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.a. PRC2 Hardware & COTS Software"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.426"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.73"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.765"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.765"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "4.322"
                                        },
                                        "CurrentYear": {
                                            "val": "6.065"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.353"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.353"
                                        }
                                    }
                                }
                            },
                            "CategorySubtotal": {
                                "TotalCost": {
                                    "PriorYear": {
                                        "val": "4.322"
                                    },
                                    "CurrentYear": {
                                        "val": "6.065"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "5.353"
                                    },
                                    "BudgetYearOneOCO": {
                                        "val": "0"
                                    },
                                    "BudgetYearOne": {
                                        "val": "5.353"
                                    }
                                }
                            }
                        },
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "1.a. TBMCS-FL PMA"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.35"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.712"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.69"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.69"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.b. UC2 PMA"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.992"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.737"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.751"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.751"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.b. PRC2 PMA"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.614"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.52"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.49"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.49"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "1.956"
                                        },
                                        "CurrentYear": {
                                            "val": "1.969"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.931"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.931"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Support End Item"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}