{
    "id": "8c5f6784f13da1d4bab99548cadbddc957fdc34c",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_ARMY_OTHER_3-4_PROCUREMENT_JustificationBook_Army_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "M80101"
        },
        "LineItemTitle": {
            "val": "Rapid Equipping Soldier Support Equipment"
        },
        "P1LineNumber": {
            "val": "169"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "90"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "2170.279"
                },
                "PriorYear": {
                    "val": "25"
                },
                "CurrentYear": {
                    "val": "22.38"
                },
                "BudgetYearOneBase": {
                    "val": "17.937"
                },
                "BudgetYearOneOCO": {
                    "val": "8.5"
                },
                "BudgetYearOne": {
                    "val": "26.437"
                },
                "BudgetYearTwo": {
                    "val": "4.286"
                },
                "BudgetYearThree": {
                    "val": "4.611"
                },
                "BudgetYearFour": {
                    "val": "4.257"
                },
                "BudgetYearFive": {
                    "val": "4.46"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "2170.279"
                },
                "PriorYear": {
                    "val": "25"
                },
                "CurrentYear": {
                    "val": "22.38"
                },
                "BudgetYearOneBase": {
                    "val": "17.937"
                },
                "BudgetYearOneOCO": {
                    "val": "8.5"
                },
                "BudgetYearOne": {
                    "val": "26.437"
                },
                "BudgetYearTwo": {
                    "val": "4.286"
                },
                "BudgetYearThree": {
                    "val": "4.611"
                },
                "BudgetYearFour": {
                    "val": "4.257"
                },
                "BudgetYearFive": {
                    "val": "4.46"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "2170.279"
                },
                "PriorYear": {
                    "val": "25"
                },
                "CurrentYear": {
                    "val": "22.38"
                },
                "BudgetYearOneBase": {
                    "val": "17.937"
                },
                "BudgetYearOneOCO": {
                    "val": "8.5"
                },
                "BudgetYearOne": {
                    "val": "26.437"
                },
                "BudgetYearTwo": {
                    "val": "4.286"
                },
                "BudgetYearThree": {
                    "val": "4.611"
                },
                "BudgetYearFour": {
                    "val": "4.257"
                },
                "BudgetYearFive": {
                    "val": "4.46"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "25"
                                },
                                "CurrentYear": {
                                    "val": "22.38"
                                },
                                "BudgetYearOneBase": {
                                    "val": "17.937"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "8.5"
                                },
                                "BudgetYearOne": {
                                    "val": "26.437"
                                },
                                "BudgetYearTwo": {
                                    "val": "4.286"
                                },
                                "BudgetYearThree": {
                                    "val": "4.611"
                                },
                                "BudgetYearFour": {
                                    "val": "4.257"
                                },
                                "BudgetYearFive": {
                                    "val": "4.46"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "25"
                    },
                    "CurrentYear": {
                        "val": "22.38"
                    },
                    "BudgetYearOneBase": {
                        "val": "17.937"
                    },
                    "BudgetYearOneOCO": {
                        "val": "8.5"
                    },
                    "BudgetYearOne": {
                        "val": "26.437"
                    },
                    "BudgetYearTwo": {
                        "val": "4.286"
                    },
                    "BudgetYearThree": {
                        "val": "4.611"
                    },
                    "BudgetYearFour": {
                        "val": "4.257"
                    },
                    "BudgetYearFive": {
                        "val": "4.46"
                    }
                }
            }
        },
        "Description": {
            "val": "The Rapid Equipping Force (REF) supports Combatant Command (COCOM)\/Army Service Component Command (ASCC) based on emerging rapid equipping requirements.  The REF is an enduring organization (Base funded) per Headquarters, Department of the Army, memorandum, SUBJECT:  Implementation Plan for Stabilization of the Rapid Equipping Force (REF), signed by the Under Secretary of the Army, dated 30 January 2014. \n\nThe United States Army REF was established in 2002 as a unique, singular organization designed to address an Army-wide, systemic deficiency in providing immediate technology solutions.  The REF adds value for the Army by rapidly providing urgent capabilities to U.S. Army Forces employed globally by harnessing technologies in order to improve operational effectiveness.  The REF canvasses the military, industry, academia and science communities for readily available commercial and government solutions that do not currently exist in the Army inventory, and then transitions successes to the Army Materiel Command (AMC) for sustainment and in appropriate cases back to the Army Acquisition community as a Program of Record, for future life-cycle management.  Additionally, the REF facilitates the early deployment of Army-managed solutions to meet emerging requirements.\n\nThe REF harnesses current and emerging technologies to provide rapid solutions to U.S. Army Forces employed globally.  The REF combines and integrates functions that cross several Army staff elements and ASCCs to accelerate materiel solutions and technology insertion to U.S. Army Forces employed globally.   The REF is the Army's quick reaction capability with the ability to develop, prototype, acquire, integrate and sustain Commercial-Off-The-Shelf (COTS), Government Off-The-Shelf (GOTS) and Non-Developmental Item (NDI) solutions to meet urgent combat requirements for forces employed globally.  It develops and inserts selected future force technologies, capabilities, and surrogate materiel solutions into deployed, deploying, select prepared to deploy, and transformational forces for operational evaluation, assessment, and evolutionary development.  The REF plans and executes assessments and studies of Army practices and issues concerning operational needs, desired future force capabilities, and relevant Army business practices to provide feedback to Senior Army Leaders.  \n\nThe REF bridges the gap between the traditional acquisition process and immediate equipping needs.  The REF pursues tangible solutions that can be equipped rapidly with a goal of 180 days.  The REF focuses on finding effective game-changing capabilities to increase Soldier effectiveness, protection, and lethality in any operational environment.  The REF process provides the mechanism to respond rapidly to an adaptive enemy who changes in days and months, not years.  The REF coordinates in theater work with the ASCC of the COCOMs to understand their urgent needs, for which the REF acquisition capability may identify, procure, deliver, and sustain solutions to the deployed units.  This fiscal flexibility is significant in that it permits the REF to allocate funds against emerging threats and requirements in the year of fiscal execution."
        },
        "Justification": {
            "val": "FY16 procurement dollars in the amount of $17.937million (Base) and $8.500 million (OCO) meets urgently needed state-of-the-art technology for immediate warfighter needs for deployed and pre-deploying forces across all ASCCs of the COCOMs. \nThe REF works directly with Operational Commanders at all levels, but focuses on Brigade level and below to find solutions to identified capability gaps.  These solutions may result in procurement of new or existing military\/commercial materiel equipment, or accelerated development of a future force materiel solution for insertion into the current force now.  \n\nThe REF key tasks are:\n\n- Partner with the Asymmetric Warfare Group (AWG) and the ASCCs to be responsive to tactical unit commanders in a global operating environment.\n- Bridge specific Operational Needs Statement (ONS)\/Joint Urgent Operational Needs Statement (JUONS)\/Joint Emergent Operational Needs Statement (JEONS) gaps to meet urgent needs.\n- Develop materiel solutions to counter emerging global asymmetric threats with reduced Soldiers in the operational environment.\n- Ensure training, transportation, and sustainment are provided with every capability.\n- Cultivate and rapidly insert emerging technologies into Soldiers' hands.\n- Conduct operational assessments to provide useful operator feedback to the Army. \n- Transition effective projects through the appropriate Army process for long-term sustainment.\n- Be aggressive and push the acquisition envelope, but operate within the law.\n- Integrate with existing Army organizations and systems to enable them to recognize and solve problems for tactical units.\n\nThe current REF Integrated Priority List (RIPL) consists of the REF top priorities based on requirements received from deployed units and drives all REF efforts.  \n\n1.  Dismounted Improvised Explosive Device (IED) Defeat \n2.  Small Combat Outpost (COP)\/Patrol Base (PB) Sustainment \n3.  Small Combat Outpost (COP)\/Patrol Base (PB) Force Protection \n4.  Dismounted Operations Support \n5.  Intelligence, Surveillance, and Reconnaissance (ISR) Shortfalls in Environmentally Inhospitable Operational Environments (OEs) \n6.  Dismounted Blue Force Tracking and Mission Command \n7.  Other\n\nThe Army anticipates the REF working similar priorities in FY16 and beyond.   The REF average cost per requirement is ~$1.1 million to $1.3 million based on historical data.\n\nIn accordance with Ms. Heidi Shyu (Army Acquisition Executive) Memorandum, Subject:  Acquisition Decision Memorandum (ADM) to Change the Milestone Decision Authority (MDA) for the Rapid Equipping Force (REF) Program, dated May 28, 2014, the overarching goal of institutionalizing the acquisition authorities within the REF is to preserve the autonomy of action that has proven successful through the past decade of war.  Program Executive Office (PEO) Soldier has been assigned as the MDA to provide proper acquisition oversight while enhancing visibility of these efforts.  The MDA will ensure flexibility and speed focused on the needs of Soldiers serviced by the dedicated REF Program Management Office (PMO).   A formal reporting scheme leveraging existing venues, (e.g., Program Status Reviews (PSRs), Acquisition Category (ACAT) III Reporting will ensure ASA(ALT) visibility, oversight, and direction."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Rapid Equipping Soldier Support Equipment"
                    },
                    "ItemNumber": {
                        "val": "M80101"
                    },
                    "SecondaryDistribution": {
                        "ComponentList": {
                            "Component": [
                                {
                                    "Name": {
                                        "val": "Army Active"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "25"
                                            },
                                            "CurrentYear": {
                                                "val": "22.38"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "17.937"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "8.5"
                                            },
                                            "BudgetYearOne": {
                                                "val": "26.437"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "2170.279"
                            },
                            "PriorYear": {
                                "val": "25"
                            },
                            "CurrentYear": {
                                "val": "22.38"
                            },
                            "BudgetYearOneBase": {
                                "val": "17.937"
                            },
                            "BudgetYearOneOCO": {
                                "val": "8.5"
                            },
                            "BudgetYearOne": {
                                "val": "26.437"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "2170.279"
                            },
                            "PriorYear": {
                                "val": "25"
                            },
                            "CurrentYear": {
                                "val": "22.38"
                            },
                            "BudgetYearOneBase": {
                                "val": "17.937"
                            },
                            "BudgetYearOneOCO": {
                                "val": "8.5"
                            },
                            "BudgetYearOne": {
                                "val": "26.437"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "2170.279"
                            },
                            "PriorYear": {
                                "val": "25"
                            },
                            "CurrentYear": {
                                "val": "22.38"
                            },
                            "BudgetYearOneBase": {
                                "val": "17.937"
                            },
                            "BudgetYearOneOCO": {
                                "val": "8.5"
                            },
                            "BudgetYearOne": {
                                "val": "26.437"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Dismounted IED Defeat"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "434.829"
                                                        },
                                                        "PriorYear": {
                                                            "val": "2.222"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.056"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.797"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.378"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.175"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Small COP\/PB Sustainment"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "3.241"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.9"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.399"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.189"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.588"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Small COP\/PB Force Protection"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "521.372"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2.998"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "2.591"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "1.228"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "3.819"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dismounted Operations Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "377.134"
                                                        },
                                                        "PriorYear": {
                                                            "val": "5.556"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "7.094"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "6.677"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "3.164"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "9.841"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ISR Shortfalls In Inhospitable OE's"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "415.597"
                                                        },
                                                        "PriorYear": {
                                                            "val": "4.537"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2.745"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.897"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.425"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.322"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Small COP\/Patrol Base Force Protection"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "4.352"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dismounted Blue Force Tracking Mission"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "1.111"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.76"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.199"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.094"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.293"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other (Current Requirements)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "421.347"
                                                        },
                                                        "PriorYear": {
                                                            "val": "3.981"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "5.827"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "6.377"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "3.022"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "9.399"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "2170.279"
                                            },
                                            "PriorYear": {
                                                "val": "25"
                                            },
                                            "CurrentYear": {
                                                "val": "22.38"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "17.937"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "8.5"
                                            },
                                            "BudgetYearOne": {
                                                "val": "26.437"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2170.279"
                                        },
                                        "PriorYear": {
                                            "val": "25"
                                        },
                                        "CurrentYear": {
                                            "val": "22.38"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.937"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "8.5"
                                        },
                                        "BudgetYearOne": {
                                            "val": "26.437"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}