{
    "id": "b8db52ff7415b9ac68a1cf9b56aa62bd1b04b224",
    "meta": {
        "filename": "dod-2016_PROCUREMENT_2016_NAVY_OTHER_BA4_PROCUREMENT_JustificationBook_Navy_PB_2016.zzz_unzipped_PROCUREMENT_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "5253"
        },
        "LineItemTitle": {
            "val": "Tomahawk Support Equipment"
        },
        "P1LineNumber": {
            "val": "120"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Ordnance Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Ship Missile Systems Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "418.375"
                },
                "PriorYear": {
                    "val": "63.371"
                },
                "CurrentYear": {
                    "val": "60.062"
                },
                "BudgetYearOneBase": {
                    "val": "71.245"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "71.245"
                },
                "BudgetYearTwo": {
                    "val": "73.995"
                },
                "BudgetYearThree": {
                    "val": "73.505"
                },
                "BudgetYearFour": {
                    "val": "73.007"
                },
                "BudgetYearFive": {
                    "val": "73.118"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "418.375"
                },
                "PriorYear": {
                    "val": "63.371"
                },
                "CurrentYear": {
                    "val": "60.062"
                },
                "BudgetYearOneBase": {
                    "val": "71.245"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "71.245"
                },
                "BudgetYearTwo": {
                    "val": "73.995"
                },
                "BudgetYearThree": {
                    "val": "73.505"
                },
                "BudgetYearFour": {
                    "val": "73.007"
                },
                "BudgetYearFive": {
                    "val": "73.118"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "418.375"
                },
                "PriorYear": {
                    "val": "63.371"
                },
                "CurrentYear": {
                    "val": "60.062"
                },
                "BudgetYearOneBase": {
                    "val": "71.245"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "71.245"
                },
                "BudgetYearTwo": {
                    "val": "73.995"
                },
                "BudgetYearThree": {
                    "val": "73.505"
                },
                "BudgetYearFour": {
                    "val": "73.007"
                },
                "BudgetYearFive": {
                    "val": "73.118"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.158"
                },
                "CurrentYear": {
                    "val": "0.387"
                },
                "BudgetYearOneBase": {
                    "val": "0.161"
                },
                "BudgetYearOne": {
                    "val": "0.161"
                },
                "BudgetYearTwo": {
                    "val": "0.216"
                },
                "BudgetYearThree": {
                    "val": "0.22"
                },
                "BudgetYearFour": {
                    "val": "0.277"
                },
                "BudgetYearFive": {
                    "val": "0.152"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Theater Mission Planning Center (TMPC) previously referred to as Tomahawk Command and Control System (TC2S) consists of Commercial and Government Off-The-Shelf (COTS\/GOTS) software and COTS hardware. TMPC provides targeting, mission planning, strike planning, mission distribution, command & control, and employment capabilities for Tomahawk Land Attack Missile (TLAM). Continuous TMPC software modification decreases mission planning time and increases the quality and accuracy of each mission while reducing complexity. TMPC provides mission planning at the theater and operational levels and is designed for high rate mission planning production responsive to national strategic, operational, and tactical requirements.  TMPC develops and distributes missions for the Tomahawk Missile; provides command information services for TWS; provides strike planning, execution, coordination, control and reporting, and provides Maritime Component Commanders (MCC) the capability to plan or modify conventional Tomahawk Land-Attack Missile (TLAM) missions.  TMPC has evolved into scalable configurations deployed in four configurations at 180 sites: Cruise Missile Support Activities (CMSAs) (3+1 FMS), Tomahawk Strike Mission Planning Cells (TSMPCs) (3 - C5F, C6F, C7F), Carrier Strike Groups (CSGs) (16 - 10 CVN), Firing Units (FRUs) (84 Surface\/56 Submarines), Fleet Training Sites and Labs (17). \n\nFunds provide for systems engineering, testing, Independent Verification & Validation (IV&V), Security Accreditation, installation, Site Acceptance Testing (SAT), user familiarization of products and hardware to support command and control nodes. The Selective Availability Anti-Spoofing Module (SAASM) Global Positioning System (GPS) capability, workflow improvements to Mission Planning, Strike Planning & Execution and TWS Single System initiative are included in this line to transition to a Service Oriented Architecture, improve TCS \"Kill Chain\" planning and communications architecture and system effectiveness. Also, this funding line provides for Commercial-off-the-Shelf\/Government-off-the-Shelf (COTS\/GOTS) refreshment, engineering changes, software upgrades, and associated SSNs\/DDGs\/CGs\/CVN logistics, and infrastructure to maintain compatibility and interoperability with existing and future TMPC system configurations. \n\nSurface and Submarine Tactical Tomahawk Weapon Control System (TTWCS) is a post milestone III program executing its first major tech refresh since its 2004 IOC. The first phase of this tech refresh partially resolves processor component obsolescence. The final phase completes all hardware and software obsolescence efforts and will be fleet released in 2016. TTWCS functions include: Tasking validation (missile mission matching), planning of over the water routes, initialization, preparation and launch of BLK III\/IV missiles. TTWCS reduced response time and increased operational flexibility through addition of Launch Platform Mission Planning (LPMP), and in-flight monitoring and control of Blk IV missiles.  Final Phase efforts began in FY12 and consist of the completion of full TTWCS hardware technology refresh, C4I Web services interfaces and operability to be fielded in backfit firing units. In addition, funds provided to continue TTWCS viability in TTWCS v5.6 and ensure compliance with cyber security mandates, continue to address hardware obsolescence through periodic COTS hardware refresh and periodically refresh of GOTS software to address obsolescence, support migration from 32 bit to 64 bit architecture and migrate away from legacy Ada code. Finally it will allow reduction of system complexity and incorporation of critical software fixes. Program options are being identified that will enable TWS integration into future platforms. Included in those options will be changes necessary for TTWCS to ensure required functionality as the missile is modernized beginning in FY19."
        },
        "Justification": {
            "val": "Funding is required to resolve remaining TTWCS hardware\/software obsolescence issues (v5.4.0.2) and continue fielding version 5.4.0. Funds also provide for integration, modernization and interoperability efforts necessary to keep pace with changes, retain capability and exploit capabilities of internal (TWS All-Up-Round missile and TTWCS) and external (Modernized Integrated Data Base (MIDB)), National Geospatial Intelligence Agency (NGA) products, Distributed Common Ground Systems (DCGS) Integrated Backbone (DIB) compliance, Future Imagery Architecture (FIA) imagery formats and Intelligence Surveillance & Reconnaissance (ISR) interfaces, Network Centric Enterprise Services (NCES), Global Information Grid\/Internet Protocol (GIG\/IP) (V)6, FORCEnet compliance systems\/interfaces to the effectiveness of the TWS, into TMPC deployed configurations. Funding supporting TTWCS is appropriately phased to complete the 1st major tech refresh since IOC in 2004.\n\nAdditional funding is required FY16 to comply with commercial hardware\/software supportability mandates, obsolescence, information assurance requirements and to maintain pace with modern computing architectures.\n\nFunds are also required to initiate and continue the upgrade of unsupportable and obsolete software in the Tomahawk Planning System (TPS). The current TPS software is rapidly becoming obsolete, unsupportable, and incompatible with DoD security mandates making it more susceptible to Cyber-attack. Funding also addresses the National Geospatial-Intelligence Agency (NGA) imagery format change planned for June 2018. The Tomahawk Weapon System cannot execute a mission successfully without the NGA imagery used by  TMPC for precision targeting and mission planning. This line also funds the implementation of the TMPC Enterprise Network (TEN) necessary to rapidly and effectively manage the distribution of software patches to all operational sites without compromising system's Authority to Operate (ATO). Instead of funding costly site installation teams, new TMPC software releases and patches would be deployed to all operational sites electronically. The TEN would be capable of: (1) remote promulgation of security policies, Information Assurance Vulnerability Assessments (IAVA) security patches, and anti-virus definitions to keep pace with increasing IA mandates; (2) remote Configuration Management (CM) from a central location for the definition, control, distribution and implementation of official releases and configurations; (3) remote audit and help desk maintenance support for all TMPC configurations; and (4) Continuity of Operations (COOP) during site system failures or natural disasters.  FY16 continues TEN implementation and the TPS rewrite upgrade."
        },
        "MDAPCode": {
            "val": "289"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "525300, TOMAHAWK Support Equipment"
                    },
                    "ItemNumber": {
                        "val": "1"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "418.375"
                            },
                            "PriorYear": {
                                "val": "63.371"
                            },
                            "CurrentYear": {
                                "val": "60.062"
                            },
                            "BudgetYearOneBase": {
                                "val": "71.245"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "71.245"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "418.375"
                            },
                            "PriorYear": {
                                "val": "63.371"
                            },
                            "CurrentYear": {
                                "val": "60.062"
                            },
                            "BudgetYearOneBase": {
                                "val": "71.245"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "71.245"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "418.375"
                            },
                            "PriorYear": {
                                "val": "63.371"
                            },
                            "CurrentYear": {
                                "val": "60.062"
                            },
                            "BudgetYearOneBase": {
                                "val": "71.245"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "71.245"
                            }
                        },
                        "InitialSpares": {
                            "PriorYear": {
                                "val": "0.158"
                            },
                            "CurrentYear": {
                                "val": "0.387"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.161"
                            },
                            "BudgetYearOne": {
                                "val": "0.161"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "TTWCS"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "Increases in the TTWCS Hardware cost code for FY16 are to address Hardware obsolescence through periodic COTS Hardware refresh.",
                                                    "val": "1.1.1) Tactical Tomahawk Weapon Control System (TTWCS) Hardware"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "8.94"
                                                        },
                                                        "PriorYear": {
                                                            "val": "1.417"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.46"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.504"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.504"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "8.94"
                                            },
                                            "PriorYear": {
                                                "val": "1.417"
                                            },
                                            "CurrentYear": {
                                                "val": "1.46"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.504"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.504"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "8.94"
                                        },
                                        "PriorYear": {
                                            "val": "1.417"
                                        },
                                        "CurrentYear": {
                                            "val": "1.46"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.504"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.504"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "HARDWARE RECURRING SUPPORT - TTWCS"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "Decrease in product improvement cost code from FY14-FY15 is associated with the transition of software development to operational test events in the laboratory and onboard ships.  Increase in product improvement cost code in FY16 is due to introduction in FY12 of a 100% COTS hardware\/software baseline with the introduction of v5.4.0. Consequently, additional product improvement resources are required to comply with commercial hardware\/software supportability mandates, obsolescence, information assurance requirements and to maintain pace with modern computing architectures.",
                                                    "val": "2.1.1) TTWCS Product Improvement"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "102.592"
                                                        },
                                                        "PriorYear": {
                                                            "val": "11.201"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "9.116"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "15.495"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "15.495"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "102.592"
                                            },
                                            "PriorYear": {
                                                "val": "11.201"
                                            },
                                            "CurrentYear": {
                                                "val": "9.116"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "15.495"
                                            },
                                            "BudgetYearOne": {
                                                "val": "15.495"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "102.592"
                                        },
                                        "PriorYear": {
                                            "val": "11.201"
                                        },
                                        "CurrentYear": {
                                            "val": "9.116"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.495"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.495"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "TMPC"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "Procures hardware and software for installations of system upgrades at all 180 sites where TMPC systems configurations are deployed.  This also includes hardware and software for the developers and the Washington Planning Center. FY16  increases initiate the deployment of TMPC 5.0.1 at the Cruise Missile Support Activities  and Tomahawk Strike  Mission Planning  Cells .",
                                                    "val": "3.1.1) Tomahawk Mission Planning Center (TMPC) Hardware"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "13.805"
                                                        },
                                                        "PriorYear": {
                                                            "val": "2.769"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2.427"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "3.87"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "3.87"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "13.805"
                                            },
                                            "PriorYear": {
                                                "val": "2.769"
                                            },
                                            "CurrentYear": {
                                                "val": "2.427"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "3.87"
                                            },
                                            "BudgetYearOne": {
                                                "val": "3.87"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "13.805"
                                        },
                                        "PriorYear": {
                                            "val": "2.769"
                                        },
                                        "CurrentYear": {
                                            "val": "2.427"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.87"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.87"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "HARDWARE RECURRING SUPPORT - TMPC"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "Provides for software engineering efforts associated with the delivery of system modernization and improvements by the prime developers. The current TPS software is rapidly becoming obsolete, unsupportable, and incompatible with DoD security mandates making it more susceptible to Cyber-attack. This recode effort supports upgrades necessary to address IA requirements as well. Funding also addresses the National Geospatial-Intelligence Agency (NGA) imagery format change planned for June 2018. The Tomahawk Weapon System cannot execute a mission successfully without the NGA imagery used by TMPC for precision targeting and mission planning. In FY16 this line also funds the implementation of TEN which is necessary to rapidly and effectively manage the distribution of software patches to all operational sites without compromising system's ATO.  Funding also provides software upgrades to the submarine community to specifically address system interfaces.",
                                                    "val": "4.1.1) TMPC Product Improvements"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "85.083"
                                                        },
                                                        "PriorYear": {
                                                            "val": "17.724"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "18.224"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "18.636"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "18.636"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "85.083"
                                            },
                                            "PriorYear": {
                                                "val": "17.724"
                                            },
                                            "CurrentYear": {
                                                "val": "18.224"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "18.636"
                                            },
                                            "BudgetYearOne": {
                                                "val": "18.636"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "85.083"
                                        },
                                        "PriorYear": {
                                            "val": "17.724"
                                        },
                                        "CurrentYear": {
                                            "val": "18.224"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.636"
                                        },
                                        "BudgetYearOne": {
                                            "val": "18.636"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "@footnote": "The decrease in FY16 is associated with costs associated with the fabrication of ship sets for SSGNs.",
                                                "val": "5.1) TTWCS Production Engineering"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "20.362"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.713"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.048"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.018"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.018"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Decreases within the TTWCS Integrated Logistic Support cost in FY16 attributed to phased retirement of 15 CG's; FY16 did not include planned CG retirements and funding will be utilized to continue planned TTWCS software installations.",
                                                "val": "5.2) TTWCS Integrated Logistic Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "66.617"
                                                    },
                                                    "PriorYear": {
                                                        "val": "12.144"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "10.048"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "9.982"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9.982"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "86.979"
                                        },
                                        "PriorYear": {
                                            "val": "12.857"
                                        },
                                        "CurrentYear": {
                                            "val": "11.096"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Support - TTWCS"
                                }
                            },
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "@footnote": "Provides systems engineering support for system design and definition requirements necessary to evaluate all functional aspects of the TMPC subsystems and workflows that directly impact strike & execution and mission planning products. It includes reviewing TWS and external interfaces for impacts resulting from design upgrades\/changes within TWS and by external organizations, Independent Verification & Validation (IV&V), and security accreditation activities.  The increase from FY15 funding levels to FY16 is due to increased software engineering efforts to support the TPS rewrite effort for cybersecurity.",
                                                "val": "6.1) TMPC Production Engineering"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "24.302"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.208"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.84"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.295"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.295"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Funds activities that directly support system upgrades requirements such as user events, requirements validation, PDR\/CDR events, SW formal qualification testing, and delta training documentation. Increase in funding levels in FY16 is the result of added scope to support the TPS rewrite effort for cybersecurity.",
                                                "val": "6.2) TMPC Production Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "23.229"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.448"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.665"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.032"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.032"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Funds installations support associated with the deployment of new TMPC system upgrades to the CMSAs, TSMPCs, Carriers, FRUs, Labs and training sites. Increase in FY16 completes initial fielding of TMPC 5.0.1 to shore installations to include the Cruise Missile Support Activity, Pacific (CMSAPAC), and the  Tomahawk Strike Mission Planning Cells (TSMPCs).  FY16 funds the deployment of TMPC 5.0.1 and TMPC 6.0 software to the Fleet.",
                                                "val": "6.3) TMPC Integrated Logistic Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "49.417"
                                                    },
                                                    "PriorYear": {
                                                        "val": "9.747"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "10.234"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "12.413"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "12.413"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "96.948"
                                        },
                                        "PriorYear": {
                                            "val": "17.403"
                                        },
                                        "CurrentYear": {
                                            "val": "17.739"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.74"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.74"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "TMPC"
                                }
                            },
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "7.1) FMP Installations"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "15.139"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "15.139"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "ILS INSTALLATIONS"
                                }
                            },
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "8.1) TTWCS Other Cost"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "8.889"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "8.889"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Miscellaneous"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}