{
    "id": "0231f88bee16e5e7804133f2a1af229a97d8b4ed",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA4_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603308A"
        },
        "ProgramElementTitle": {
            "val": "Army Space Systems Integration"
        },
        "R1LineItemNumber": {
            "val": "55"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "9.557"
            },
            "CurrentYear": {
                "val": "9.876"
            },
            "BudgetYearOne": {
                "val": "13.592"
            },
            "BudgetYearOneBase": {
                "val": "13.592"
            },
            "BudgetYearTwo": {
                "val": "14.602"
            },
            "BudgetYearThree": {
                "val": "14.014"
            },
            "BudgetYearFour": {
                "val": "20.170"
            },
            "BudgetYearFive": {
                "val": "23.412"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The program element funds space systems integration efforts performed by the US Army Space and Missile Defense Command\/ Army Forces Strategic Command (USASMDC\/ARSTRAT) and the Program Executive Office for Intelligence, Electronic Warfare\n\nUSASMDC\/ARSTRAT:  Headquarters, Department of the Army General Order Number 37, dated 16 October 2006, designated USASMDC\/ARSTRAT as the Army proponent for space and ground-based midcourse defense (GMD), the Army integrator for global missile defense, and the Army Service Component Command of U.S. Strategic Command (USSTRATCOM).  As such, USASMDC\/ARSTRAT is responsible to develop warfighting concepts, conduct warfighting experiments to validate those concepts, identify capabilities needed to implement the validated concepts, and develop Doctrine, Organization, Training, Material, Leadership & Education, Personnel and Facilities (DOTMLPF) solutions to realize those space related capabilities.  Army Regulation (AR) 10-87 Army Commands, Army Service Component Commands, and the Direct Reporting Units, dated 4 September 2007 and AR 5-22 The Army Force Modernization Proponent System dated 19 August 2009 designates USASMDC\/ARSTRAT as the Army specified proponent for Global Missile Defense and Space\/High Altitude Capabilities.\n\nProject #990 funds USASMDC\/ARSTRAT to integrate warfighting concepts and technologies, validate concepts, and identify capabilities need to implement the validated concepts, and develop DOTMLPF solutions to realize those space and high altitude related capabilities.  Sustains Joint Friendly Force Tracking (J-FFT) Mission Management Center and its associated testbed for both operations and spiral development for 24\/7 Friendly Force Tracking integration into a real-time common operating picture for Combatant Commanders, Joint Task Force Commanders (JTF) and Coalition partners.  The MMC injects real-time J-FFT information into the Common Operating Picture for COCOMs, JTFs and Coalition partners.  USSTRATCOM, in accordance with CJCSI 3910.01 (reference V.4.) is designated one of three coordinating agencies for J-FFT within DoD.  CJCSI 3910.01 directs eight specified tasks to USSTRATCOM.  USSTRATCOM SI 534-5 (reference V.6.) and annually published USSTRATCOM operations orders have designated USASMDC\/ARSTRAT as the lead USSTRATCOM component command for FFT."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.763"
                },
                "CurrentYear": {
                    "val": "9.876"
                },
                "BudgetYearOne": {
                    "val": "11.648"
                },
                "BudgetYearOneBase": {
                    "val": "11.648"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.557"
                },
                "CurrentYear": {
                    "val": "9.876"
                },
                "BudgetYearOne": {
                    "val": "13.592"
                },
                "BudgetYearOneBase": {
                    "val": "13.592"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.206"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.944"
                },
                "BudgetYearOneBase": {
                    "val": "1.944"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.206"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.944"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.944"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "990"
                    },
                    "ProjectTitle": {
                        "val": "Space And Missile Defense Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.557"
                        },
                        "CurrentYear": {
                            "val": "9.876"
                        },
                        "BudgetYearOne": {
                            "val": "11.592"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.592"
                        },
                        "BudgetYearTwo": {
                            "val": "11.102"
                        },
                        "BudgetYearThree": {
                            "val": "9.914"
                        },
                        "BudgetYearFour": {
                            "val": "15.970"
                        },
                        "BudgetYearFive": {
                            "val": "19.112"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project 990 funds United States Army Space and Missile Command\/Army Strategic Command (USASMDC\/ARSTRAT) efforts to develop, analyze and mature warfighting concepts, and conduct warfighting experiments for space and high altitude capabilities.  The program also funds development and integration of new data sources and data services into the Joint Friendly Force Tracking Mission Management Center.  The Mission Management Center (MMC) injects real-time Joint Friendly Force Tracking (J-FFT) information into the Common Operating Picture for Combatant Commands (COCOMs), Joint Task Forces (JTFs) and Coalition partners.  USASMDC\/ARSTRAT is the proponent for space \/ high altitude capabilities and is responsible for determining and integrating Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) for the Army. \n\nUSSTRATCOM, in accordance with CJCSI 3910.01 (reference V.4.) is designated one of three coordinating agencies for J-FFT within DOD.  CJCSI 3910.01 directs eight specified tasks to USSTRATCOM.  USSTRATCOM SI 534-5 (reference V.6.) and annually published USSTRATCOM operations orders have designated USASMDC\/ARSTRAT as the lead USSTRATCOM component command for J-FFT.\n\nIn FY12 and FY13 funding for J-FFT was cut because of a RDTE contract being coded as a service contract, these funds were restored in FY14 and FY15 resulting in the perceived increase in funding for FY14 and FY15."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Architecture Development, Wargames and Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.723"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plan, develop, and execute architectures and combat development solutions for Army integration of space systems, space control capabilities, missile defense and high altitude systems.  Represent Army positions and defend Army equities relative in Joint\/DoD and inter-Service activities; e.g., Executive Agent for Space Program Assessments, etc.  Participate and provide support to wargames and experiments where space, high altitude, and missile defense capabilities and technologies can be integrated and evaluated in the most realistic operating environment possible.  This is necessary to ensure that space and high altitude capabilities gaps are identified and capabilities are correctly represented, so that the Army uses of these capabilities are explored.  Develop space modernization strategies and sponsor exploration of future space, high altitude, and missile defense warfighting concepts.  The Future Warfare Center (FWC) will continue efforts to enhance the resiliency and effectiveness of critical space-based assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.779"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.779"
                                            },
                                            "Text": {
                                                "val": "Plan, develop, and execute architectures and combat development solutions for Army integration of space systems, space control capabilities, missile defense and high altitude systems.  Represent Army positions and defend Army equities relative in Joint\/DoD and inter-Service activities; e.g., Executive Agent for Space Program Assessments, etc.  Participate and provide support to wargames and experiments where space, high altitude, and missile defense capabilities and technologies can be integrated and evaluated in the most realistic operating environment possible.  This is necessary to ensure that space and high altitude capabilities gaps are identified and capabilities are correctly represented, so that the Army’s use of these capabilities is explored.  Develop space modernization strategies and sponsor exploration of future space, high altitude, and missile defense warfighting concepts.  The Future Warfare Center (FWC) will continue efforts to enhance the resiliency and effectiveness of critical space-based assets. Continue JCIDS capability development activities for space superiority, high altitude persistent platforms, nano-satellites and tactical launch systems.  Perform force development activities to refine the force design of the AN\/TPY-2 FBM radar via a force design update."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space and High Altitude System Integration and Experimentation"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.421"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue experimentation in support of operational responsive space. Complete migration of Space Operations System capabilities to both classified and unclassified Distributed Common Ground System - Army (DCGS-A) variants.  The Future Warfare Center will continue efforts to enhance the resiliency and effectiveness of critical space-based assets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Concept Development, Wargames and Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.034"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to plan, develop, and execute concepts and combat development solutions for Army integration of space systems, space control capabilities, missile defense and high altitude systems.  Represent Army positions and defend Army equities relative in Joint\/DoD and inter-Service activities; e.g., National Security Space Architect (NSSA) Program Assessments, etc.  Participate and provide support to all Unified Quest and other wargames and experiments to ensure that space and high altitude capabilities gaps are identified and capabilities are correctly represented, so that the Army use of these capabilities are explored. Develop space modernization strategies and sponsor exploration of future space, high altitude, and missile defense warfighting concepts. Provide integrated force and capability development activities; conduct Joint Capabilities Integration & Development System (JCIDS) activities to document requirements across the Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities domains for Space, High Altitude, and Global Missile Defense capabilities; horizontally and vertically integrates capabilities.  Develop the materiel requirements and force development for the AN\/TPY-2 Forward Based Mode (FBM) Radar via a Capabilities Production Document and a Force Design Update.  Develop organizational designs and models for SRC 40 force structure within the Army’s force development process.  Continue JCIDS capability development activities for space superiority, high altitude persistent platforms and Joint Tactical Ground Station (JTAGS) theater missile warning capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technolgy Program Support"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.785"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support the Solid State Laser Testbed (SSLT) - Couple the 100 kW laser with the existing Tactical High Energy Laser (THEL) pointer-tracker subsystem and begin the basic lethality program against a variety of static and dynamic targets of interest to the Army, Navy, Air Force and OSD at tactical ranges of interest. Support the initiation of propagation experiments with high power at 1.06Î¼m using the SSLT facility.  Support the completion of Option 2 phase of Robust Electric Laser Initiative (RELI) (risk reduction for 100 kW system) and begin Option 1, i.e. the fabrication of 50 kW hardware for integration onboard the High Energy Laser Technology Demonstrator (HELMD) vehicle beginning in 2015.  Provide technical support for the integration a COTS 10kW class fiber laser onboard the HELMD platform to demonstrate high power operation of the HELMD beam control system and engage mortars and UAVs.  Support risk-reduction activities for future upgrades to higher-power SSL devices.  Incorporate adaptive optics into the HELMD to improve performance and increase the range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.770"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.770"
                                            },
                                            "Text": {
                                                "val": "Support SSLT operations at High Energy Laser Systems Test Facility (HELSTF) to evaluate 100kW class SSL performance against a variety of static and dynamic targets of interest to the Army, Navy, Air Force and OSD at tactical ranges of interest.  Support collection of propagation and lethality data with the SSLT and analyze results for model comparison.   Support the development of tactics, techniques, and procedures (TTPs) in support of future fielding of HEL weapon system.  Continue supporting the Option 1 RELI program (50 kW) by evaluating and assessing the ruggedized efficient high power laser PDR and CDR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Friendly Force Tracking (J-FFT) Testbed"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.102"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The J-FFT Testbed will support specific task as directed by STRATCOM.  These tasks include integrating new data sources, hardware and software devices, and data services into the J-FFT Mission Management Center (MMC).  Continue to develop Friendly Force Tracking FFT capabilities for deployed and collation forces including Afghan National Forces.  The Joint Friendly Force Tracking Division coordinates and executes USSTRATCOM-directed FFT tasks in order to assure continuous 24\/7 FFT data services support to authorized users to include the Combatant Commands, the Services, agencies, allies, and coalition partners in order to improve their situational awareness (SA), enhance command and control (C2), and reduce fratricide in combat, homeland defense, civil and contingency operations. Additionally the J-FFT will be used to provide special tracking capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.368"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "As enhancements are made to network-enabled command and control systems and other systems are integrated into Combat Commanders friendly force tracking requirements the J-FFT Testbed will be used to integrate hardware and software prior to its deployment to the field.  The FWC will continue to support development of FFT capabilities for deployed and collation forces.  The Joint Friendly Force Tracking Division coordinates and executes USSTRATCOM-directed FFT tasks in order to assure continuous 24\/7 FFT data services support to authorized users to include the Combatant Commands, the Services, agencies, allies, and coalition partners in order to improve their situational awareness (SA), enhance command and control (C2), and reduce fratricide in combat, homeland defense, civil and contingency operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.043"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.043"
                                            },
                                            "Text": {
                                                "val": "As enhancements are made to network-enabled command and control systems and other systems are integrated into Combat Commanders friendly force tracking requirements the J-FFT Testbed will be used to integrate hardware and software prior to its deployment to the field.  The FWC will continue to support development of FFT capabilities for deployed and coalition forces.  The Joint Friendly Force Tracking Division coordinates and executes USSTRATCOM-directed FFT tasks in order to assure continuous 24\/7 FFT data services support to authorized users to include the Combatant Commands, the Services, agencies, allies, and coalition partners in order to improve their situational awareness (SA), enhance command and control (C2), and reduce fratricide in combat, homeland defense, civil and contingency operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this effort.\n\nE. Performance Metrics\n\nBasic research projects lined to operations concepts or needs.\nSMDC\/ARSTRAT is developing critical enabling technologies.\nLegacy or emerging systems have interoperability solutions identified.\n\n\nF. Major Performer \n \nBAE is under contract to develop software to support integration of new tracking data services into the J-FFT and support special tracking capabilities.  This ensures 24\/7 J-FFT data is available to support Combatant Commanders as coalition forces and technology change."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Enhancement of J-FFT"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Colorado Springs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.029"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.400"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.043"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.043"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "28.572"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GOVT SUPPORT & SUPPORT CONTRACTS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various in Colorado Springs CO, Washington DC, and Huntsville AL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "92.940"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.457"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.476"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.549"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.549"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EB7"
                    },
                    "ProjectTitle": {
                        "val": "Army Space System Enhancement\/Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.500"
                        },
                        "BudgetYearThree": {
                            "val": "4.100"
                        },
                        "BudgetYearFour": {
                            "val": "4.200"
                        },
                        "BudgetYearFive": {
                            "val": "4.300"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The purpose of the project is to conduct classified research efforts.  The details of the efforts may be provided upon request to appropriately cleared individuals."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified"
                                    },
                                    "Description": {
                                        "val": "The purpose of this project is to conduct classified research"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "classified"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "classified"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "NA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}