{
    "id": "047905d9a000de18119fa93ead0734f05c3771c8",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603225D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint DOD\/DOE Munitions Technology Development"
        },
        "R1LineItemNumber": {
            "val": "34"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.538"
            },
            "CurrentYear": {
                "val": "20.032"
            },
            "BudgetYearOne": {
                "val": "19.305"
            },
            "BudgetYearOneBase": {
                "val": "19.305"
            },
            "BudgetYearTwo": {
                "val": "20.628"
            },
            "BudgetYearThree": {
                "val": "20.332"
            },
            "BudgetYearFour": {
                "val": "20.664"
            },
            "BudgetYearFive": {
                "val": "21.065"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Department of Defense (DoD)\/Department of Energy (DOE) Joint Munitions Technology Development Program (JMP) is to develop new and innovative warhead, explosive, fuzing, and lifecycle technologies and tools to enable major improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment to this effort.  The DoE matches the DoD JMP funds budgeted in this justification dollar for dollar.  Through this interdepartmental cooperation, DoD’s relatively small investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs have provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services.\n\nThe JMP seeks to develop:  improved modeling and simulation tools for munitions design and evaluation, including evaluation of vulnerability (for example:  design of insensitive munitions (IM)); novel experimental techniques and material property databases to support modeling and simulation; higher power and safer explosives and propellants; miniaturized, lower cost, and higher reliability fuzes, initiators, power systems, and sensors; design tools to enable development of higher performance warheads and weapons such as penetrators that are hardened against high impact loads; and tools to assess the health and reliability of the munitions stockpile and predict lifetimes based on these assessments.\n\nThe JMP is aligned with Department strategic plans and policies such as:\n\n– Munitions for contingency operations, particularly for the reduction of unintended collateral effects.\n– Reducing time and cost for acquisition of munitions.\n– Rapidly transitioning science and technology (S&T) to support the warfighter in today’s conflicts.\n– Establishing future core capabilities and maintaining our national S&T capabilities through joint investment and interagency cooperation and teaming.\n– Aiding in recruiting and retaining high-caliber scientists and engineers at DoD S&T organizations.\n– Developing advanced munitions technologies to support the increased role of conventional weapons to deter and respond to non-nuclear attack, as described in the Nuclear Posture Review report.\n– Developing safer munitions that are compliant with IM standards to meet statutory and Department policy requirements.\n\nThe JMP has established a successful collaborative community of DoD and DOE scientists and engineers.  This community develops technologies of interest to both Departments within a structured framework of technical reviews and scheduled milestones.  The JMP is administered and monitored by the Office of the Secretary of Defense (OSD) and reviewed annually by the Technical Advisory Committee (TAC), which is comprised of over 25 senior executives from the Army, Navy, Air Force, Special Operations Command, the Defense Threat Reduction Agency, OSD, and DOE.  Projects are organized in eight Technology Coordinating Groups (TCG) that bring together the disciplines necessary to properly evaluate technical content, relevance, and progress.  The TCG conduct semi-annual technical peer reviews of JMP projects and plans.  DoD Service laboratory technical experts lead each of the TCG to ensure that the technologies under development address high-priority DoD needs.  The JMP also promotes more in-depth technical exchange via short-term visiting scientist and engineer assignments at both the DOE and the DoD laboratories.\n\nThe JMP has a long history of successful transitions and significant Return on Investment (ROI).\n\n– The JMP is the primary provider of high performance structural mechanics computer codes used by DoD.  According to the FY 2010 High Performance Computing Modernization Program (HPCMP) Requirements Analysis Report, the DOE computer codes are used for over 70 percent of all (classified and unclassified) structural mechanics simulations and for virtually all of the classified calculations run by DoD on HPCMP platforms.  The Department expects this heavy reliance on DOE codes to grow for several reasons including: preference for using DOE codes because they are export-controlled; DOE codes are scalable, incorporate multiphysics, and run on massively parallel computer systems; and the Department can obtain source codes to modify for individual Service needs.\n– A significant number of defense industrial contractors also use the DOE structural mechanics computer codes.\n– CHEETAH, a standalone thermochemical computer code, is the most widely used code by DoD and defense contractors for predicting performance of energetic materials.\n– The Army Research & Engineering Development Center (ARDEC) has stated that the DOE computer codes are now routinely used to design all new warheads.  The use of these tools has reduced the number of validation tests required for each new warhead from about five to one with concomitant cost and time savings.\n– The Army Research Laboratory has used DOE computer codes to develop and deploy new armor solutions to Iraq and Afghanistan with unprecedented speed.\n– New munitions’ case material and explosive fill technologies provide the warfighter with a lethal and low collateral damage capability.  These technologies have been transitioned to the Focused Lethality Munition variant of the Small Diameter Bomb, which is currently fielded.  The technologies are also the basis for a new GBU 129 weapon that is currently under rapid development to meet a Joint Urgent Operational Need requirement for a low-collateral Mk-82 class weapon.\n– The Joint Improvised Explosive Device Defeat Organization (JIEDDO) has supported applications of JMP technologies, including: compact synthetic aperture radar (SAR) systems for counter-Improvised Explosive Device (IED) efforts; pre-deployment training of military personnel by DOE explosive experts on how to recognize feed stocks and processes for homemade explosives; and use of massively parallel, multiphysics computer codes to understand how explosive blast waves cause brain injury and how to mitigate these injuries.\n– An erosive initiator technology developed under the JMP has been transitioned to the Services for use in selectable output weapons and self-destruct capabilities.\n– A novel approach to controlling the sensitivity and therefore the initiability of explosives using microwave energy, as well two new, insensitive energetic materials have transitioned to development projects in the Joint Insensitive Munitions Technology and Joint Fuze Technology Programs.\n– Reliability analysis tools were used by Army Missile Command to assess Rolling Airframe Missile (RAM), Advanced Medium Range Air to Air Missile (AMRAAM), and Tube-launched, Optically-tracked, Wire command data-linked guided Missile (TOW).\n– Robotic demilitarization processing systems were installed at several locations, including a system at Hawthorne Army Depot to recover copper shape charge liners, Comp A5, and grenade bodies. \n\nThe JMP also works with the Defense Ordnance Technology Consortium (DOTC) and the National Warheads and Energetics Consortium (NWEC) of industrial suppliers to equitably and efficiently transition JMP technologies to defense industrial contractors.  In addition to the computer codes mentioned earlier, the JMP has transitioned case technology for low-collateral weapons, low-temperature co-fired ceramic technology for smaller, less expensive fuze electronic components, and erosive initiator technology for selectable effects weapons to defense industrial suppliers.\n\nThe integrated DoD and DOE efforts within the JMP are transitioning new munitions’ technologies to the Department and the defense industrial base through the advanced development process.  The JMP is a focal point for collaborative work by nearly 300 DoD and DOE scientists and engineers.  Technical leaders from both Departments consider the JMP a model of cooperation, both within their respective departments and between departments.  The highly challenging technical objectives of the approximately 35 JMP projects require multi-year efforts and sustained, long-term investments to achieve success.\n\nThe JMP projects are divided into five technical focus areas:  Computational Mechanics and Material Modeling; Energetic Materials; Initiators, Fuzes, and Sensors; Warhead and Penetration Technology; and Munitions Lifecycle Technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.651"
                },
                "CurrentYear": {
                    "val": "20.032"
                },
                "BudgetYearOne": {
                    "val": "19.965"
                },
                "BudgetYearOneBase": {
                    "val": "19.965"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.538"
                },
                "CurrentYear": {
                    "val": "20.032"
                },
                "BudgetYearOne": {
                    "val": "19.305"
                },
                "BudgetYearOneBase": {
                    "val": "19.305"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.113"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.660"
                },
                "BudgetYearOneBase": {
                    "val": "-0.660"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.107"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.660"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.660"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.006"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 baseline adjustments are reflective of DoD S&T priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P225"
                    },
                    "ProjectTitle": {
                        "val": "Joint DOD\/DOE Munitions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.538"
                        },
                        "CurrentYear": {
                            "val": "20.032"
                        },
                        "BudgetYearOne": {
                            "val": "19.305"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.305"
                        },
                        "BudgetYearTwo": {
                            "val": "20.628"
                        },
                        "BudgetYearThree": {
                            "val": "20.332"
                        },
                        "BudgetYearFour": {
                            "val": "20.664"
                        },
                        "BudgetYearFive": {
                            "val": "21.065"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The mission of the Department of Defense (DoD)\/Department of Energy (DOE) Joint Munitions Technology Development Program (JMP) is to develop new and innovative warhead, explosive, fuzing, and lifecycle technologies and tools to enable major improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment to this effort.  The JMP funds budgeted in this justification are matched dollar for dollar by DOE funds.  Through this interdepartmental cooperation, DoD’s relatively small investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs has provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services.\n\nThe JMP seeks to develop: improved modeling and simulation tools for munitions design and evaluation, including evaluation of vulnerability (for example:  design of insensitive munitions (IM)); novel experimental techniques and material property databases to support modeling and simulation; higher power and safer explosives and propellants; miniaturized, lower-cost, and higher reliability fuzes, initiators, power systems, and sensors; design tools to enable development of higher performance warheads and weapons—such as penetrators—that are hardened against high impact loads; and tools to assess the health and reliability of the munitions stockpile and predict lifetimes based on these assessments.\n\nThe JMP is aligned with Department strategic plans and policies such as:\n\n– Munitions for contingency operations, particularly for the reduction of unintended collateral effects.\n– Reducing time and cost for acquisition of munitions.\n– Rapidly transitioning science and technology (S&T) to support the warfighter in today’s conflicts.\n– Establishing future core capabilities and maintaining our national S&T capabilities through joint investment and interagency cooperation and teaming.\n– Aiding in recruiting and retaining high-caliber scientists and engineers at DoD S&T organizations.\n– Developing advanced munitions technologies to support the increased role of conventional weapons to deter and respond to non-nuclear attack, as described in the Nuclear Posture Review report.\n– Developing safer munitions that are compliant with IM standards to meet statutory and Department policy requirements.\n\nThe JMP has established a successful collaborative community of DoD and DOE scientists and engineers.  This community develops technologies of interest to both Departments within a structured framework of technical reviews and scheduled milestones.  The JMP is administered and monitored by the Office of the Secretary of Defense (OSD) and reviewed annually by the Technical Advisory Committee (TAC), which is comprised of over 25 senior executives from the Army, Navy, Air Force, Special Operations Command, the Defense Threat Reduction Agency, OSD, and DOE.  Projects are organized in eight Technology Coordinating Groups (TCG) that bring together the disciplines necessary to properly evaluate technical content, relevance, and progress.  The TCG conduct semi-annual technical peer reviews of JMP projects and plans. DoD Service laboratory technical experts lead each of the TCG to ensure that the technologies under development address high-priority DoD needs.  The JMP also promotes more in-depth technical exchange via short-term visiting scientist and engineer assignments at both the DOE and the DoD laboratories.\n\nThe JMP has a long history of successful transitions and significant Return on Investment (ROI).\n\n– The JMP is the primary provider of high performance structural mechanics computer codes used by DoD.  According to the FY 2010 High Performance Computing Modernization Program (HPCMP) Requirements Analysis Report, the DOE computer codes are used for over 70 percent of all (classified and unclassified) structural mechanics simulations and for virtually all of the classified calculations run by DoD on HPCMP platforms.  The Department expects this heavy reliance on DOE codes to grow for several reasons including: preference for using DOE codes because they are export-controlled; DOE codes are scalable, incorporate multiphysics, and run on massively parallel computer systems; and the Department can obtain source codes to modify for individual Service needs.\n– A significant number of defense industrial contractors also use the DOE structural mechanics computer codes.\n– CHEETAH, a standalone thermochemical computer code, is the most widely used code by DoD and defense contractors for predicting performance of energetic materials.\n– The Army Research & Engineering Development Center (ARDEC) has stated that the DOE computer codes are now routinely used to design all new warheads. The use of these tools has reduced the number of validation tests required for each new warhead from about five to one with concomitant cost and time savings.\n– The Army Research Laboratory has used DOE computer codes to develop and deploy new armor solutions to Iraq and Afghanistan with unprecedented speed.\n– New munitions’ case material and explosive fill technologies provide the warfighter with a lethal and low collateral damage capability.  These technologies have been transitioned to the Focused Lethality Munition variant of the Small Diameter Bomb, which is currently fielded.  The technologies are also the basis for a new GBU 129 weapon that is currently under rapid development to meet a Joint Urgent Operational Need requirement for a low-collateral Mk-82 class weapon.\n– The Joint Improvised Explosive Device Defeat Organization (JIEDDO) has supported applications of JMP technologies, including: compact synthetic aperture radar (SAR) systems for counter-Improvised Explosive Device (IED) efforts; pre-deployment training of military personnel by DOE explosive experts on how to recognize feed stocks and processes for homemade explosives; and use of massively parallel, multiphysics computer codes to understand how explosive blast waves cause brain injury and how to mitigate these injuries.\n– An erosive initiator technology developed under the JMP has been transitioned to the Services for use in selectable output weapons and self-destruct capabilities.\n– A novel approach to controlling the sensitivity and therefore the initiability of explosives using microwave energy, as well two new, insensitive energetic materials have transitioned to development projects in the Joint IM Technology and Joint Fuze Technology Programs.\n– Reliability analysis tools were used by Army Missile Command to assess Rolling Airframe Missile (RAM), Advanced Medium Range Air to Air Missile (AMRAAM), and Tube-launched, Optically-tracked, Wire command data-linked guided Missile (TOW).\n– Robotic demilitarization processing systems were installed at several locations, including a system at Hawthorne Army Depot to recover copper shape charge liners, Comp A5, and grenade bodies. \n\nThe JMP also works with the Defense Ordnance Technology Consortium (DOTC) and the National Warheads and Energetics Consortium (NWEC) of industrial suppliers to equitably and efficiently transition JMP technologies to defense industrial contractors.  In addition to the computer codes mentioned earlier, the JMP has transitioned case technology for low-collateral weapons, low-temperature co-fired ceramic technology for smaller, less expensive fuze electronic components, and erosive initiator technology for selectable effects weapons to defense industrial suppliers.\n\nThe integrated DoD and DOE efforts within the JMP are transitioning new munitions’ technologies to the Department and the defense industrial base through the advanced development process.  The JMP is a focal point for collaborative work by nearly 300 DoD and DOE scientists and engineers.  Technical leaders from both Departments consider the JMP a model of cooperation, both within their respective departments and between departments.  The highly challenging technical objectives of the approximately 35 JMP projects require multi-year efforts and sustained, long-term investments to achieve success.\n\nThe JMP projects are divided into five technical focus areas:  Computational Mechanics and Material Modeling; Energetic Materials; Initiators, Fuzes, and Sensors; Warhead and Penetration Technology; and Munitions Lifecycle Technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Computational Mechanics and Material Modeling"
                                    },
                                    "Description": {
                                        "val": "Projects in this technical focus area develop computational tools, material models, and calibration and validation databases which support the design and development of weapon systems.  These capabilities are intended to predict the complex phenomena across significant length (meso to continuum) and time (microsecond to minute) scales.  The tools will provide coupled, multi-physics and chemistry modeling capabilities that are scalable to massively parallel architectures for solving very diverse problems across the weapons systems’ research and development and acquisition communities.  Numeric tools are the foundation that makes possible the integration of mechanics, materials science, physics, and chemistry.  \nThis focus area also includes an extensive experimental component consisting of phenomenological or “discovery” experiments that drive model development; calibration experiments to compliment models; and experiments for model and code validation.\n\nThe specific projects in computational mechanics and material modeling are:\n\n– CTH, SIERRA shock physics code & model development, and experiments:  impact initiation of high explosives; composite material modeling; mesoscale experiments, model development, and analysis; coupled physics code development; and models for localization and failure.\n– Arbitrary Lagrangian-Eulerian (ALE3D) code and model development.\n– Composite case technology and modeling.\n– Dynamic properties of materials.\n– Energetic materials and polymers under dynamic and thermal loading.\n– Fragment impact and response experiments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.576"
                                            },
                                            "Text": {
                                                "val": "– Applied damage model to experimental data to discern propagation and interaction of shock waves in damaged material.\n– Gained insight into preferred dynamic damage initiation sites from interrogation of shocked copper polycrystal via High Energy Diffraction Microscopy.\n– Applied CartaBlanca to three-dimensional (3D) fracture and fragmentation problems.\n– Completed ball impact test series on covered PBXN-9 charges.\n– Completed preliminary tests to assess utility of extended Floret test to determine explosive initiation and performance data.\n– Completed multi-scale analysis of underlying fiber failure physics in composites.\n– Developed a reliable, low-cost and low-variance compression test specimen for measuring composite compression strength.\n– Next release of ALE3D with improvements in:  two-dimensional (2D) and 3D detonation shock dynamics (DSD); smooth particle hydrodynamics (SPH); glassy amorphous polymer model; material property database; and embedded grids.\n– Completed validation and verification of AMC 2D hydrodynamic-structure coupling and 2D hydrodynamic-light rigid body coupling.\n– Completed next generation high explosive mechanical models.\n– Coupled ViscoSCRAM micro-damage to Finite Element Model macro-damage.\n– Completed initial study of shock shear initiation of explosives.\n– Released CTH versions 10.2 and 10.3 with:  physics-based fracture; material interface improvements; and material property consolidation.\n– Demonstrated embedded beam\/spar elements for modeling composite structures such as reinforced concrete.\n– Implemented new statistical models for shock analysis of reactive composite energetic materials.\n– Completed shock characterization of fiber composite materials.\n– Completed shockless dynamic compression of heated and cooled explosive materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.331"
                                            },
                                            "Text": {
                                                "val": "– 2D and 3D simulation using Tonks model and experimentally determine microstructure.\n– Incorporate interface particles into CartaBlanca.\n– Complete tests to determine influence of temperature on impact response of pristine and damage energetic materials.\n– Thermal sensitivity models of composite materials implemented into ALE3D or other coders and validated against experimental data.\n– Microstructurally-based damage models of composite materials implemented into ALE3D or other codes.\n– Next release of ALE3D with improvements in:  implicit beams \/ shells; embedded grids; coupled element erosion with SPH; and DSD of inert boundaries.\n– Implement next generation high explosive mechanical model into ABAQUS and EPIC codes.\n– Develop polymer constitutive model with improved damage physics.\n– Generalize and extend SIERRA explosives finite element model (XFEM) capabilities to model pervasive failure mechanisms.\n– Release CTH versions 11.0 and 11.1 with:  energy\/momentum discards; new tabular equation of state format; adaptive mesh refinement compatible with manual rezone; and a model for non-ideal explosive behavior.\n– Compete line velocity interferometer system for any reflector (VISAR) measurements of high explosive to support heterogeneous material modeling and statistical analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.981"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.981"
                                            },
                                            "Text": {
                                                "val": "- Incorporate shear into two-component localization model to move toward a general damage model capability.\n- Incorporate phase transitions in material models to increase accuracy of constitutive models in any calculations involving high-pressure shocks.\n- Perform impact and direct initiation experiments on off-specification PBXN-9 to ascertain change in performance and safety.\n- Complete analysis of PBXN-9 data set to provide consistent parameter sets for DoD and the DOE codes.\n- Implement rate-sensitive damage model into ALE3D or other codes validated against experimental data.\n– Complete initial manufacturing variable study of composite materials.\n– Release of ALE3D with improvements in: updated high explosive lighting times with detonation shock dynamics as the analysis progresses.\n- Enhance the ALE3D\/ALE3D code coupling through FEusion interface by providing a parallel implementation.\n- Complete energetics damage experiments (rubbery tear, interfacial damage, friability).\n- CTH Versions 11.2 and 11.3 Released:  Improved memory management, and improved parallel processing\/communications.\n– Implement robust and accurate coupling between Sierra\/SM and CTH."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energetic Materials (EM)"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new energetic materials (EM) and supporting technologies to satisfy the competing requirements for smaller, more lethal, and safer munitions.  Work is primarily focused on explosives, gun and rocket propellants, and, to a lesser extent, pyrotechnics.  The projects include development of:  new EM, including new molecules in a range of particle size and morphologies; new EM formulations; a fundamental understanding of energetic properties and performance; and computational tools for analysis of performance and sensitivity.  New materials and formulations are developed with the recognition that cost must be feasible, chemical feed stocks reliable, and manufacturing processes suitable for scale-up to production levels.\n\nBoth federal statute and Department policy direct the development of safer, less sensitive munitions.  Making munitions less sensitive while maintaining explosive or propellant performance is a difficult challenge.  This goal is best attained through a combination of new EM development, EM characterization, and more sophisticated modeling and simulation tools.  It is cost-prohibitive to qualify weapons for compliance with insensitive munitions requirements through testing alone.  A better, in many cases, the only means to qualify these weapons is with the combination of analysis based on validated computational tools and a few well-designed tests.\n\nThe Department requires munitions that provide selectable effects.  To achieve these effects, weapons designers need to thoroughly understand the performance of EM used in both the main weapon fill and the initiation systems.  Distributed fuzing systems can provide selectable effects as well as safer munitions, but such complex small-scale systems require more complete knowledge of EM detonation physics and in, some cases, new EM designed for this application.\n\nThe desire for smaller and lighter munitions is driven in large part by the increasing dependence on unmanned weapons platforms and to some extent by the need to reduce logistical burden, especially energy consumption.  New EM are needed to meet the munitions weight and size requirements while maintaining lethality and safety.\n\nThe Department is working to increase the range and velocity of weapons and to develop weapons against hardened targets.  These applications subject the EM to high accelerations and shock loads.  To support the development of these new systems, we need to improve our ability to model EM under impact loads and to characterize relevant properties to determine their ability to survive in these aggressive environments.  We may also need to develop new, more robust EM that survive impact loads while maintaining lethality and initiability.\n\nThe specific projects in the energetic materials technical focus area are:\n– Synthesis, properties, and scale-up of new energetic compounds.\n– Insensitive munitions and surety.\n– New energetic materials formulation and characterization.\n– CHEETAH thermochemical code development and experiments.\n– Micro- and nano-energetics synthesis and initiation.\n– Hazards analysis of energetic materials.\n– Reaction processes of energetic materials.\n– Microfluidic reactor synthesis of sensitive explosives.\n– Energetics chemistry and properties.\n– Microstructural and kinetic effects on energetic materials behavior.\n– Microwave sensitization and initiation of energetic materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.457"
                                            },
                                            "Text": {
                                                "val": "– Synthesized insensitive energetic materials.\n– Implemented full thermal kinetic model for high melting explosives (HMX) into ALE3D.\n– Established relationships between internal pressure and convective and conductive burn rates in PBX 9501.\n– Lab-scale production, dielectric property characterization, and energetic performance testing of microwave-sensitive energetic materials.\n– Developed preliminary model for microwave sensitivity of filled IMX-101.\n– Constructed CTH model of a hemispherical microwave-sensitized explosive system using a kinetics-based burn model and compared to a preliminary onionskin experiment.\n– Synthesized new oxadiazole-based explosives using tricyclic nitrofurazan derivatives.\n– Calibrated and validated new precision rate-stick design to extract reliable equation of state data.\n– Implemented, calibrated, and tested ionic equilibrium option in CHEETAH for ideal explosives and halogenated explosives.\n– Expanded liquids and solids equation of state (EOS) library in CHEETAH for more accurate modeling of metal-loaded explosives.\n– High pressure and temperature EOS data for acid mixtures, oxides, and silicon compounds added to support further development of CHEETAH.\n– Implemented multiphase convective burn model spiral two and HERMES spiral two model for impact response of energetic materials in latest release of ALE3D.\n– Completed shock initiation measurements of PBXN-112 and AFX-757 at different pressures to refine ignition and growth model parameters.\n– Deposited a large area of thin-film explosive with good uniformity.\n– Completed multi-point detonation transfer in the thin explosive films.\n– Developed cook-off pre-ignition models that incorporate pressure dependence and gas generation and validated the models for triaminotrinitrobenzene (TATB) explosives and ammonium perchlorate (AP) propellants.\n– Determined the effect of confinement on ignition in fast cook-off.\n– Demonstrated use of Simultaneous Thermogravimetric Modulated Beam Mass Spectrometery and Chemical Imaging Precision Mass Analysis to ignition and initiation processes of energetic materials at low and moderate temperatures.\n– Prepared and characterized modified AP for IM propellants.\n– Completed preliminary microfluidic nitration reactor design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.479"
                                            },
                                            "Text": {
                                                "val": "– Complete synthesis and characterization of insensitive energetic materials for booster applications.\n– Design deflagration to detonation transition experiments for proton radiography.\n– Compare simulations with pop plot behavior and onionskin experiments for microwave-sensitized explosives.\n– Release CHEETAH version seven, which will provide enhanced accuracy for a wide range of energetic formulations, including those containing fluorine, chlorine, bromine, boron, silicon, and tungsten.\n– Expand detonation calorimetry capabilities with post-shot analysis techniques.\n– Complete mesoscale simulations of energetic materials under stress and pressure\/confinement.\n– Develop technique to characterize high-pressure deflagration.\n– Scale-up the syntheses of new energetic material compounds to produce 20-30 grams for performance testing and heat of formation measurements.\n– Scale thin-film deposition of explosives to gram scale.\n– Develop and validate models for thermally induced damage in TATB explosives and AP propellants.\n– Complete thermal decomposition study of propellant binder PNO with and without candidate stabilizers.\n– Determine low and moderate temperature reaction networks for pyrotechnic actuator materials.\n– Complete initial microfluidic nitration reactor experiments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.305"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.305"
                                            },
                                            "Text": {
                                                "val": "- Complete characterization of trinitromethyl and dinitromethyl compounds.\n- Perform burn rate studies on N4BIM salts.\n- Collect thermal data on IMX formulation.\n- Complete analysis of pre-ignition behavior and ignition timing data for IMX-101. \n- Develop CHEETAH thermochemistry for major metallic additives and other relevant elements and compounds to enable thermochemical predictions for complex and novel formulations.\n- Systematically evaluate and improve CHEETAH code predictions at low pressures and high temperature for specific impulse calculations.\n- Release CHEETAH version 8.0.\n- Validate new heat of detonation experiment by comparing to data from trinitrotoluene (TNT) and triaminotrinitrobenzene (TATB).\n- Perform simulation of shock to detonation transition (SDT) in minimum smoke propellant (MSP) Army Burn-to-Violent Reaction (ABVR) test for Insensitive Munitions Project Arrangement (IM PA) with the United Kingdom.\n- Synthesize new tri-, quadri- and pentacyclic oxadiazoles as both high-power and insensitive target molecules.\n- Synthesize 25-50 grams of LLM-196 and LLM-198 and their nitrogenous salts.\n- Complete characterization of damage evolution of PBX 9502 and ammonium perchlorate (AP) propellant.\n- Complete aging study to determine how particular lots of RDX powder display enhanced shock sensitivity. \n- Complete initial nitration reactor experiments for energetic material synthesis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Initiators, Fuzes, and Sensors"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new materials, components, diagnostic techniques, and modeling and simulation tools for fuzing systems.  Initiators, fuzes, and sensors must work reliably together to prevent unintended detonation, to correctly detect intended targets, and to initiate detonation when required.  Projects in this focus area support the Department’s needs to miniaturize fuzing systems.  Smaller systems are required for several reasons including: compatibility with smaller and lighter weapons systems; trading volume in munitions for other components such as additional explosive, larger power sources, or guidance systems; increasing reliability through redundancy (use two or more smaller initiating systems); and upgrading existing sub-munitions with smarter and more reliable fuzing systems.  The miniaturization of fuzing systems requires new material and components, new power systems, new diagnostic techniques, and improved modeling tools for microdetonics.  The Department also needs weapons systems with selectable effects and these effects can be achieved with multi-point initiation systems.  Such systems are inherently more complex and require improved characterization of initiator materials and components as well as more sophisticated modeling and simulation tools.  To attain greater precision and to avoid unintended collateral effects when weapons are used in the complex environment of counter-insurgency or counter-terrorist operations, target sensors must be reliable and provide high-fidelity discrimination.  Two projects in this focus area are developing technologies to achieve this level of performance in compact packages.\nThe specific projects in the initiators, fuzes, and sensors technical focus area are:\n– Firing systems technology:  FireMod firing set code model development and validation, 1.6 hazard classification detonator development, and initiation and detonation physics on the millimeter scale.\n– Safe, Arm, Fuze and Fire Technology:  Initiation & Detonation; Advanced Firing System Components.\n– Advanced initiation systems:  diagnostics development, microdetonics, miniature initiation systems, and detonators for enhanced safety.\n– Thermal Battery Performance Modeling. \n– MESASAR synthetic aperture radar (SAR) sensors.\n– Vertical cavity surface emitting laser (VCSEL) sensors for proximity fuzing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.444"
                                            },
                                            "Text": {
                                                "val": "– Completed large-scale Schlieren diagnostic capability for initiation systems.\n– Completed study of detonation transfer across gaps.\n– Continued to collect and catalog Schlieren images of DoD detonators.\n– Measured RSI-007 detonator threshold parameters for electric gun-launched flyer plates.\n– Measured EDF-11 detonator threshold parameters and detonation velocity as a function of charge diameter.\n– Completed study of RSI-007 run-to-detonation distances.\n– Incorporated experimental data into reactive flow models for RSI-007 and EDF-11 detonators.\n– Final summary of novel heat source development and increased power capability for advanced thermal batteries released.\n– Completed thermal battery electrochemical model for single cell battery.\n– Released thermal battery thermal modeling capability within SIERRA simulation suite of codes.\n– Developed thermal battery thermo-mechanical modeling for a single cell battery.\n– Measured ignition and growth in the thin-film energetic materials.\n– Evaluated deflagration to detonation transition (DDT) in polymer-bound thin-film explosives.\n– Completed performance testing as a function of morphology for hexanitrostilbene (HNS) explosive.\n– Summarized equation of state (EOS) data for HNS based on density function theory molecular dynamics simulations and diamond anvil cell experiments.\n– Compared two processes for producing small particle size triaminotrinitrobenzene (TATB).\n– Performed chip slapper initiation threshold testing of micronized TATB.\n– Developed and scaled-up synthesis of tetragonal barium titanate nanoparticles.\n– Developed process for tape casting nanoparticle lead zirconate titanate into devices.\n– Completed simulations of different packaging methods to improve survivability of a single electronic component under harsh thermal and mechanical environments.\n– Completed a design for improved flux coupling in flyback transformers.\n– Built and tested first prototype flyback transformer using new tape-cast materials.\n– Built and range-tested a prototype Ku-Band active antenna array.\n– Mature technology and fabrication processes for low-temperature co-fired ceramic multi-chip modules for insertion into radar fuze systems completed.\n– Demonstrated Geiger mode detection operation of vertical cavity surface emitting laser detector arrays."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.351"
                                            },
                                            "Text": {
                                                "val": "– Validate thermal battery thermo-mechanical model for single cell battery.\n– Implement thermal battery electrochemical model into SIERRA code.\n– Create validated tabular equation of state for the explosive HNS.\n– Determine burn model parameters (reaction rates, run distance) for the explosive HNS.\n– Determine initiation threshold and performance data for micronized TATB.\n– Develop physics-based ALEGRA model of exploding foil initiator (EFI) bridge burst and flyer launch.\n– Develop a methodology to assess the safety and reliability of slapper-based fuze systems based on initiation threshold criterion.\n– Develop physics-based ALEGRA model of EFI bridge burst and flyer launch.\n– Build and test second prototype flyback transformer using new tape-cast materials.\n– Demonstrate ALE3D model of Department of Defense (DoD) slapper detonator.\n– Complete optimization of 3D chip slapper shape optimization.\n– Assess modified three phase equation of state for metals (GRAY EOS) for predicting slapper performance.\n– Perform experiments to assess the effect of spot size on LX-10 (high explosive).\n– Integrate Schlieren Inverse Analysis Software (SIAS) with ALE3D.\n– Perform a full series of 2-D axi-symmetric small-scale gap tests to study detonation across gaps for explosive materials.\n– Utilize photonic doppler velocimetry (PDV) diagnostic suite to characterize the output of large size detonators in order to provide baseline performance data.\n– Develop and range-test a prototype Ku-Band active antenna array.\n– Complete the conceptual design of Ka-Band active antenna array.\n– Improve the power density of 980 nm vertical cavity surface laser emitter arrays."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.246"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.246"
                                            },
                                            "Text": {
                                                "val": "– Demonstrate electrochemical modeling for single cell battery.\n– Increase the mechanical robustness of explosives for incorporation into MEMS.\n– Validate tabular equations of state for CL-20, TATB and other explosives.\n– Perform experimental validation of flyer state predictions and trends for detonators.\n– Investigate coupled physics (thermal stress plus dynamics), modal response, impact, and preloads for predicting the response of electrical components.\n– Build and test third prototype flyback transformer using new tape-cast materials.\n– Perform Hugoniot measurement of using gas-gun experiments to improve unreacted equations of state on high explosives (HE).\n– Create theoretical model of wave divergence using Probabilistic Shock Threshold Criterion to account for the spot-size effect on the explosive threshold.\n– Complete testing of the next generation transmit and receive test circuits for a Ka-Band active array antenna (AAA).\n– Build the first prototype of a Ku-Band low temperature co-fired ceramic (LTCC) multi chip transmit \/ receive module.\n– Complete a conceptual design for a miniaturized, broadband digitally steered array antenna.\n– Develop mass-replicated micro-optics for detectors and lasers for a VCSEL based proximity fuze."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warhead and Penetration Technology"
                                    },
                                    "Description": {
                                        "val": "This focus area supports the development of new warheads and penetrator weapons through advances in materials processing and characterization, instrumentation, and computational codes.  In recent years there have been very large increases in warhead performance directly attributed to our ability to understand and accurately model the physics and fine details of new warhead designs, and to advances in increasingly sophisticated material processing.  The Department’s requirement to achieve more precise weapon effects with minimum collateral damage is supported by work on controlled fragmentation, non-fragmenting warhead cases, and multiphase blast explosives (MBX).  More recently, increases in performance and reductions in vulnerability are being achieved through improved warhead integration into munitions using a systems-oriented approach.\n\nThe goals for penetrator weapons are to investigate, develop, and transition advanced technologies for the design, development, and performance assessment of the next generation of high performance, precision strike weapons.  This effort directly supports national initiatives to defeat hard and deeply buried targets, which are proliferating worldwide, and to deny\/defeat weapons of mass destruction.  The work addresses high-velocity penetration into granular materials (sand and soil), penetration into advanced concrete, new penetrator materials and designs, and non-inertial onboard instrumentation.\n\nThe specific projects in the warhead and penetration technology focus area are:\n– Multiphase blast munitions (MBX) technology.\n– Erosive initiation technology.\n– Dynamic behavior of sand.\n– Integrated munitions modeling & experimentation.\n– Modeling of strategic structures.\n– Concrete perforation and penetration modeling & experiments.\n– High-g MEMS (micro electrical mechanical system) sensor development.\n– Structural dynamics and vibration effects.\n– High-speed pressure-shear experiments on granular materials.\n– Explosive\/metal interactions.\n– Structure, mechanical & shock-loading response, & modeling of materials.\n– Controlled effects warhead materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.850"
                                            },
                                            "Text": {
                                                "val": "– Created a model to provide a deterministic physical description of a metal expanding under the action of explosive drive.\n– Completed initial characterization \/ constitutive modeling of HF-1 steel and Cast Ductile Iron (CDI) warhead materials.\n– Completed initial dynamic tensile extrusion experiments on Zr, Ta, depleted uranium (DU), and U-6Nb as function of temperature.\n– Completed shear localization studies of high purity Fe as a function of stress state.\n– Developed a multiphase explosive burn model guided by mesoscale simulations and experiments.\n– Transitioned the standalone KRAKEN code to the larger Department of Energy (DOE) code SIERRA.\n– Implemented markers with deviatoric stress capability in CTH for the analysis of the blast and\/or penetration of reinforced concrete and thin walled structures.\n– Performed dynamic friction measurements with modified torsional bar.\n– Performed perforation experiments through high-strength concrete.\n– Provided high strength concrete model to Sandia CTH development team.\n– Completed quasi-static and dynamic testing of new MEMS sensor package for recording the local force on the surface of the projectile during ballistic events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.758"
                                            },
                                            "Text": {
                                                "val": "– Complete baseline data collection on 4340, Ti, and copper.\n– Perform initial shock experiments on Ag-Cu eutectic, dynamic melting.\n– Complete Oblique HE-driven shock hardening and damage microstructural quantification on Cu and Ta and complete initial oblique HE-driven spall on U-6Nb.\n– Conduct sweeping detonation-wave loading experiment on Fe to quantify the effect on phase transition.\n– Identify key mechanisms in particle-target interaction in multiphase blast explosives.\n– Perform code verification and validation for multiphase blast explosives model.\n– Complete quasi-static and laser-driven shock experiments on controlled microstructure materials made from alloy mixture and from W\/Bi.\n– Simulate laser-based shock experiments with ALE-3D.\n– Perform KRAKEN simulations of spall, Taylor impact, cylinder expansion.\n– Initial release of KRAKEN fragmentation analysis system.\n– Implement first part of mixture theory in CTH.\n– Apply enhanced sand model in impact simulations.\n– Complete dynamic friction study.\n– Perform first suite of penetration and perforation experiments into complex targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.628"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.628"
                                            },
                                            "Text": {
                                                "val": "– Apply high magnification imaging infrared to dynamic defect studies.\n– Implement multi-field techniques into Pagosa+.\n– Improve modeling of sweeping detonation-wave loading spallation and dynamic sphere extrusion experiments.\n– Complete oblique high explosive (HE) driven shock hardening and damage microstructural characterization on Zr and Cu-Pb alloy.\n– Enhance predictive capability of multiphase blast explosives model.\n– Perform quasi-static and laser-based shock experiments on first batch of samples of W-Fe-Ni alloy powders with dilute concentrations of low melting point Bi-Sn alloy powders.\n– Simulate engineering microstructures with multi-phase material fragmentation simulations.\n– Acquire data from fragmentation tests for validation of KRACKEN code. \n– Implement second part of mixture theory in CTH.\n– Deliver improved constitutive sand model to the GEODYN material library.\n– Perform field scale penetrator tests into sand and update model.\n– Conduct probabilistic studies of projectile penetration\/perforation into complex targets.\n– Perform compression, shear, and tensile experiments in order to investigate a variety of interface configurations including friction, preload effects, interface orientation, and shock mitigating materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Lifecycle Technologies"
                                    },
                                    "Description": {
                                        "val": "This focus area supports improving the Department’s ability to understand, measure, predict, and mitigate safety and reliability problems caused by materials aging and degradation in weapons systems.  Current stockpile assessment methods typically focus on addressing materials aging and reliability problems after they occur, rather than anticipating and avoiding future problems or failure mechanisms.  The overall objective of this work is to develop a toolset of computational models that are able to quantitatively predict materials aging processes and ultimately improve the long-term reliability of weapons systems, sub-assemblies, and\/or components.  These objectives are achieved by:  identifying aging mechanisms, quantifying the rates at which those aging mechanisms occur, developing predictive models, and using these models to predict the munitions stockpile reliability.  An additional objective of this work is to develop technologies and methodologies to enable munitions health management and condition-based maintenance.\n\nThe specific projects in the warhead and penetration technology focus area are:\n– Predictive materials aging including: solder interconnect reliability, corrosion of electronics, and adhesive degradation.\n– MEMS reliability.\n– Military use of commercial, off the shelf (COTS) electronics.\n– Complex system health assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.211"
                                            },
                                            "Text": {
                                                "val": "– Developed methodology to identify best resource allocation using Pareto front approach to design of experiments for weapon system health assessment.\n– Developed methodology for optimizing weapon system usage pattern based on health assessment.\n– Developed method to characterize adhesive degradation to due temperature and humidity changes. \n– Demonstrated success in mitigating thermal degradation of Silicon used for MEMS fabrication via forming a protective oxide on the devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.113"
                                            },
                                            "Text": {
                                                "val": "– Couple environmental data to weapon system reliability in health assessment.\n– Initiate accelerated aging studies of glassy, rubbery, and nickel platelet-filled rubbery coatings for tin whisker mitigation on Sn-plated components.\n– Validate and calibrate engineered aging structures to collect environmental data at the bondpad surface for Cu and Al corrosion in electronics.\n– Determine silicon on insulator (SOI) sidewall and high temperature degradation of MEMS silicon at high temperatures.\n– Publish best practices for trusted COTS process that include avoidance and detection of counterfeit and adversarial threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.145"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.145"
                                            },
                                            "Text": {
                                                "val": "– Validate bondpad corrosion model with modified plastic encapsulated microelectronics (PEM) parts.\n– Asses the role of adhesive swelling due to water absorption on the stress state of the adhesive. \n– Quantify initial predictive aging and reliability model with results from COTS MEMS device testing.\n– Methodology and software to perform multiple objective assessments of resource allocation and general management strategies of weapon system usage.\n– Validation of a general model to connect condition-based measures (age, environmental factors) at the component level failure mode to system reliability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1) Transitions of technologies developed by the Program are tracked and documented. In FY 2010 there were more than 25 transitions to DoD.\n2) Attendance and technical interactions at the biannual meetings of the nine Technology Coordinating Groups (TCGs) are tracked and documented.\n3) Laboratory Five Year Plans are prepared, evaluated, and analyzed by management and technical staff.\n4) TCG Chairmen's Annual Assessments for each TCG are critically reviewed by the Technical Advisory Committee to determine progress, validate transition plans, and verify relevance of each project.\n5) Project progress toward goals and milestones is assessed at each biannual TCG meeting and critically reviewed annually by the Technical Advisory Committee.\n6) Annual technical reports and papers are tracked and documented."
                        }
                    }
                }
            ]
        }
    }
}