{
    "id": "04abb991fffc478a3a9249be232474b0a9c0b6ca",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605804D8Z"
        },
        "ProgramElementTitle": {
            "val": "Development Test & Evaluation"
        },
        "R1LineItemNumber": {
            "val": "162"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.389"
            },
            "CurrentYear": {
                "val": "15.110"
            },
            "BudgetYearOne": {
                "val": "15.451"
            },
            "BudgetYearOneBase": {
                "val": "15.451"
            },
            "BudgetYearTwo": {
                "val": "16.091"
            },
            "BudgetYearThree": {
                "val": "16.636"
            },
            "BudgetYearFour": {
                "val": "16.917"
            },
            "BudgetYearFive": {
                "val": "17.246"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Developmental Test and Evaluation (DT&E) program element is budgeted in the Research and Development budget activity as it supports and assesses the DT&E efforts of each Major Defense Acquisition Program (MDAP), Major Automated Information System, and other Special Interest acquisition programs as designated by Under Secretary of Defense for Acquisition, Technology & Logistics (USD(AT&L)); assesses the DT&E capabilities of the Military Departments and Department of Defense (DoD) Components, oversees the Test and Evaluation career field of the defense acquisition workforce; develops policy and guidance for the conduct of DT&E within DoD; and produces the annual DT&E report to Congress.\n\nThe Department of Operational Energy Plans and Programs (DOEPP) is funded within this program element for technical analysis and policy guidance for theDoD operational energy programs and initiatives, including institutionalizing energy in DoD’s business processes (e.g., Fully Burdened Cost of Fuel and the Energy Efficiency Key Performance Parameters (KPPs))."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.621"
                },
                "CurrentYear": {
                    "val": "15.110"
                },
                "BudgetYearOne": {
                    "val": "15.708"
                },
                "BudgetYearOneBase": {
                    "val": "15.708"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.389"
                },
                "CurrentYear": {
                    "val": "15.110"
                },
                "BudgetYearOne": {
                    "val": "15.451"
                },
                "BudgetYearOneBase": {
                    "val": "15.451"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.232"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.257"
                },
                "BudgetYearOneBase": {
                    "val": "-0.257"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.226"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.257"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.257"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.006"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 baseline adjustments are reflective of DoD priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P804"
                    },
                    "ProjectTitle": {
                        "val": "Development Test & Evaluation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.389"
                        },
                        "CurrentYear": {
                            "val": "14.310"
                        },
                        "BudgetYearOne": {
                            "val": "15.451"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.451"
                        },
                        "BudgetYearTwo": {
                            "val": "16.091"
                        },
                        "BudgetYearThree": {
                            "val": "16.636"
                        },
                        "BudgetYearFour": {
                            "val": "16.917"
                        },
                        "BudgetYearFive": {
                            "val": "17.246"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the assessment of the Developmental Test and Evaluation (DT&E) efforts of each Major Defense Acquisition Program (MDAP), Major Automated Information System, and Special Interest acquisition programs as designated by USD(AT&L). It also provides for the assessment of DT&E capabilities of the Military Departments and DoD Components, oversees the T&E career field of the defense acquisition workforce, develops policy and guidance for the conduct of DT&E within DoD, and produces the annual DT&E report to Congress. Specific activities include the following:\n\n- Work with MDAP\/MAIS\/SI Program Managers to develop a comprehensive DT&E strategy that supports acquisition decision milestones. Ensure that the test strategy is documented in the Test and Evaluation Master Plans (TEMPs). The Deputy Assistant Secretary of Defense (DASD) DT&E also approves or disapproves the developmental test and evaluation plans in the TEMPs.\n- Coordinate with the Director of Systems Engineering to ensure that the DT&E activities of the DoD are fully integrated into, and consistent with, the systems engineering and development planning processes of the Department.\n- Provide formal DT&E Assessments prior to major milestone decisions to inform the Acquisition decision-makers  on the readiness of programs to proceed into Engineering and Manufacturing Development (MS B), Production and Deployment (MS C), and Operations and Sustainment (FRP) with the goal of reducing discovery of performance issues late in the acquisition cycle.\n- Develop policy and guidance to ensure efficient and effective DT&E across DoD, including policy and guidance for developmental testing of interoperability and information assurance in coordination with the Joint Staff and DoD CIO.\n- Provide DT&E assessments in support of Nunn-McCurdy certification review teams, and the Director, Performance Assessment and Root Cause Analysis (PARCA).\n- Review the organizations and capabilities of the military departments with respect to developmental test and evaluation and identify needed changes or improvements to such organizations and capabilities, and provide input regarding needed changes or improvements for the test and evaluation strategic plan developed by Test Resource Management Center (TRMC).\n-As the T&E Functional Leader, establish, oversee, and maintain the education, training and experience requirements including competencies and certification standards to enhance T&E acquisition workforce. Monitor and facilitate Defense Acquisition University (DAU) updates of T&E courses to ensure the curriculum supports the certification standards and provides the appropriate education and training."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Developmental Test and Evaluation Accomplishments and Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.389"
                                            },
                                            "Text": {
                                                "val": "-Worked with MDAP\/MAIS\/SI Program Managers to develop comprehensive DT&E strategies to support the program development and acquisition. Reviewed and approved 33 TES\/TEMPs submitted to OSD for approval.\n-Developed the DT&E portion of the Joint Annual Report to Congress that provided an assessment of MDAP DT&E progress and assesses the T&E workforce.\n-Refined DT&E policies and methodologies addressing DT&E across all MDAP, MAIS, and Special Interest programs.\n-Published data-based DT&E assessments of system performance for all MDAP and MAIS programs in support of scheduled Defense Acquisition Board (DAB) decisions for each major milestone.\n-Established the Scientific Test & Analysis Techniques (STAT) T&E Center of Excellence (COE) in coordination with the US Air Force at the Air Force Institute of Technology.\n- Funded STAT T&E Center of Excellence in order to provide direct support to 20 Service-nominated MDAPs.\n-Planned and conducted InterTec Cyber Event (ICE) to support the development of the DT&E Cybersecurity methodology.\n-Promoted the application of sound systems engineering, DT&E, and related technical disciplines across the Department's acquisition community and programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.310"
                                            },
                                            "Text": {
                                                "val": "-Work with MDAP\/MAIS\/SI Program Managers to develop comprehensive DT&E strategies to support capability development and acquisition. Review and approve all TEMPs submitted to support major acquisition reviews.\n-Develop the DT&E portion of the Joint Annual Report to Congress that provides an assessment of MDAP DT&E progress and assesses the T&E workforce.\n-Refine DT&E policies and methodologies addressing DT&E across all MDAP, MAIS and Special Interest programs.\n-Publish formal DT&E Assessments in support of Milestone C and Operational Test decision processes-Review and approve all TEMPs submitted to support major acquisition reviews for MDAPs.\n-Provide data-based assessments of system performance in support of all scheduled Defense Acquisition Board decisions.\n-Sustain the STAT COE.\n-Plan and conduct events that support DT&E Cybersecurity strategy.\n-Promote the application of sound DT&E and related technical disciplines across the Department's acquisition community and programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.451"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.451"
                                            },
                                            "Text": {
                                                "val": "-Work with MDAP Program Managers to develop comprehensive DT&E strategies to support the program development and acquisition. \n- Review and approve all TEMPs submitted to support major acquisition reviews for MDAPs.\n-Develop the DT&E Annual Report to Congress that provides an assessment of MDAP DT&E progress and assesses the T&E workforce.\n-Refine DT&E policies and methodologies addressing DT&E across all MDAP, MAIS and Special Interest programs.\n-Publish data-based DT&E assessments of system performance for all MDAP and MAIS programs in support of scheduled Defense Acquisition Board (DAB) decisions for each major milestone.\n-Review and approve all TEMPs submitted to support major acquisition reviews for MDAPs.\n-Sustain the STAT COE.\n-Plan and conduct additional Cybersecurity events that apply the DT&E Cybersecurity methodology.\n-Promote the application of sound DT&E and related technical disciplines across the Department's acquisition community and programs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "• Engaged and conducted oversight on all AT&L-designated MDAP, MAIS, and Special Interest Programs.\n• Advised at Defense Acquisition Board (DABs), Overarching Integrated Product Teams (OIPTs), and Nunn-McCurdy Reviews.\n• Reviewed and approved Test and Evaluation Master Plans (TEMPs) for MDAP, MAIS, and AT&L-designated Special Interest programs.\n• Prepared formal DT&E assessments to inform Acquisition decision makers of readiness for Initial Operational Test & Evaluation.\n• Implemented the education requirements for the T&E career field to require a hard science degree to support the T&E of increasingly more complex systems.\n• Participated in the development of a major revision to the DoDI 5000.02.\n• Supported OSD led Peer Reviews.\n• Refined a DT&E cybersecurity strategy composed of four areas: process (policy and guidance), methodology (best test practices), workforce training, and infrastructure (enclosed and distributed ranges).\n• Sustained Scientific Test & Analysis Techniques Center of Excellence.\n• Planned and executed pilot events to focus on cybersecurity test infrastructure gaps and to examine different test methodologies."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P806"
                    },
                    "ProjectTitle": {
                        "val": "Energy"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.800"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project, co-sponsored by ASD(R&E) and ASD(OEPP), addresses advanced technology development of hybrid energy storage associated with providing the capability to enhance fuel efficiency, maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation Army and USMC battlefield generators and vehicles, Air Force and Navy aircraft, and Navy ships.  The goals of this project are to demonstrate in each of these areas energy storage systems, with high power and energy densities, high rate capability, scalable to all power levels, that reduces total logistics replenishment of fuel and material, increases platform and vehicle ability to sustain operations during engagement, and reduce non mission capable and maintenance events.  Once demonstration is complete, this technology will be further sustained by the Services.  In collaboration, this program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy’s Advanced Research Projects Agency – Energy (ARPA-E). AMPED technology will be used to potentially extend the operational performance benefits and safety for these applications beyond the hybrid storage module baseline design configurations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Energy Storage Module Program"
                                    },
                                    "Description": {
                                        "val": "This project, co-sponsored by ASD(R&E) and ASD(OEPP), addresses advanced technology development of hybrid energy storage associated with providing the capability to enhance fuel efficiency, maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation Army and USMC battlefield generators and vehicles, Air Force and Navy aircraft, and Navy ships.  The goals of this project are to demonstrate in each of these areas energy storage systems, with high power and energy densities, high rate capability, scalable to all power levels, that reduces total logistics replenishment of fuel and material, increases platform and vehicle ability to sustain operations during engagement, and reduce non mission capable and maintenance events.  Once demonstration is complete, this technology will be further sustained by the Services.  In collaboration, this program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy’s Advanced Research Projects Agency – Energy (ARPA-E). AMPED technology will be used to potentially extend the operational performance benefits and safety for these applications beyond the hybrid storage module baseline design configurations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "The key new initiatives in FY 2013 will be the initiation of Air Force and Navy aircraft, and Navy ships HESM demonstrator development.  Further energy storage technology demonstration effort associated with safe operation of energy storage impacting all three military application areas will be initiated.  The goal of this effort is to develop and demonstrate a safe energy storage structure which is capable of not only buffering against life-reducing high operating temperatures due to aggressive cycling operations but also preventing or limiting thermal runaway conditions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}