{
    "id": "0c71f5360d671ca75b3f753f9707189e4549fc79",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602211A"
        },
        "ProgramElementTitle": {
            "val": "AVIATION TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "43.430"
            },
            "CurrentYear": {
                "val": "51.607"
            },
            "BudgetYearOne": {
                "val": "55.615"
            },
            "BudgetYearOneBase": {
                "val": "55.615"
            },
            "BudgetYearTwo": {
                "val": "57.280"
            },
            "BudgetYearThree": {
                "val": "51.185"
            },
            "BudgetYearFour": {
                "val": "58.980"
            },
            "BudgetYearFive": {
                "val": "60.947"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) conducts rotary wing vehicle component design, fabrication and evaluation to enable Army aviation transformation.  Emphasis is on developing rotary wing platform technologies to enhance manned and unmanned rotary wing vehicle combat and combat support operations for attack, reconnaissance, air assault, survivability, logistics and command and control missions.  Project 47A researches and evaluates components and subsystems for air vehicles in the areas of aviation and aircraft weapons technology.  Project 47B researches and evaluates components and subsystems for air vehicles in the areas of propulsion and structures.  Focus areas include: engines & drive trains; rotors & vehicle management systems; platform design & structures; aircraft & occupant survivability; aircraft weapons & sensors; maintainability & sustainability; and unmanned & optionally manned systems. This PE supports the National Rotorcraft Technology Center (NRTC), a partnership of government, industry, and academia.  \n\nWork in this PE contributes to the Army S&T air systems portfolio and is fully coordinated with efforts in PE 0603003A (Aviation-Advanced Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602303A (Missile Technology) and PE 0603710A (Night Vision Advanced Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy.\nWork in this PE is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), located at Redstone Arsenal, AL; Joint Base Langley Eustis, VA; Moffett Field, CA; and at the Army Research Laboratory (ARL), located at Adelphi, MD; Aberdeen Proving Ground, MD; Hampton, Va; and Cleveland, OH."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "44.539"
                },
                "CurrentYear": {
                    "val": "51.607"
                },
                "BudgetYearOne": {
                    "val": "53.663"
                },
                "BudgetYearOneBase": {
                    "val": "53.663"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "43.430"
                },
                "CurrentYear": {
                    "val": "51.607"
                },
                "BudgetYearOne": {
                    "val": "55.615"
                },
                "BudgetYearOneBase": {
                    "val": "55.615"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.109"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.952"
                },
                "BudgetYearOneBase": {
                    "val": "1.952"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.071"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.609"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.952"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.952"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.429"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "47A"
                    },
                    "ProjectTitle": {
                        "val": "AERON & ACFT Wpns Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "37.946"
                        },
                        "CurrentYear": {
                            "val": "45.898"
                        },
                        "BudgetYearOne": {
                            "val": "48.812"
                        },
                        "BudgetYearOneBase": {
                            "val": "48.812"
                        },
                        "BudgetYearTwo": {
                            "val": "48.597"
                        },
                        "BudgetYearThree": {
                            "val": "42.458"
                        },
                        "BudgetYearFour": {
                            "val": "50.568"
                        },
                        "BudgetYearFive": {
                            "val": "52.051"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project designs and evaluates technologies for Army\/Department of Defense (DoD) vertical lift and unmanned air systems to increase strategic and tactical mobility\/deployability, improve combat effectiveness, increase aircraft and crew survivability; and improve combat sustainability. Areas of research address desired characteristics applicable to all aviation platforms, such as enhanced rotor efficiencies, improved survivability, increased structure and airframe capability, improved engine performance, improved sustainability, improved mission avionics performance, and reduced cost. This project supports the National Rotorcraft Technology Center (NRTC), a partnership of government, industry, and academia. This project leverages work accomplished in collaboration with the National Aeronautics and Space Administration (NASA).  Technologies within this project transition to advanced technology development programs with application to future, as well as current, Army\/DoD aircraft systems.  \n  \nWork in this project is fully coordinated with PE 0603003A (Aviation Advanced Technology) and work in this project related to aircraft weapons integration is also fully coordinated with PE 0602624A (Weapons and Munitions Technology), PE 0602303A (Missile Technology), and PE 0603710A (Night Vision Advanced Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Aviation Development Directorate of the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), (located at the NASA Ames Research Center, Moffett Field, CA; and Joint Base Langley Eustis, VA)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "National Rotorcraft Technology Center (NRTC)"
                                    },
                                    "Description": {
                                        "val": "The goal of the NRTC is to focus government, US rotorcraft industry and academia resources on pre-competitive, high priority, military focused technology development to maintain U.S. preeminence in rotorcraft capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.057"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted an icing evaluation of a spinning rotor in the NASA Icing Research Tunnel (IRT) to validate prediction tools complete; conducted hover stand evaluation of rotor with Miniature Trailing-edge Effector (MiTE) actuation system; performed validation testing of an in-flight acoustic detection footprint prediction system and in-cockpit display; and validated analytic predictions with UH-60 wind tunnel and flight test data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.912"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct static and cyclic testing to validate thick laminate delamination propagation prediction tools applicable to composite structures; evaluate composite material coupons to determine the effect of nano-particles on strength and weight properties; systematically investigate severe maneuvers using high-fidelity computational fluid dynamic\/structural analyses with tight coupling for UH-60 design pull-up maneuver and diving turns; investigate autonomous autorotation landing on a fixed-base simulator; develop an automatic overset grid generation tool to support the use of the Army\/NASA Navier-Stokes aerodynamic code for rotorcraft analyses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.064"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.064"
                                            },
                                            "Text": {
                                                "val": "Will develop modeling tools to determine lubricated\/loss-of-lube gear performance and measurable criteria for repairable gear tooth damage and standardized repair methods; and will execute extensive correlation efforts for time-accurate, analytic coupling methods for model-scale rotors in hover and full scale rotors in forward flight."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotor Technology"
                                    },
                                    "Description": {
                                        "val": "Evaluate performance enhancements gained from advanced rotor technologies, including on-blade controls.  This effort continues in FY13 under the Rotors & Vehicle Management Technologies effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.794"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Applied advanced, high performance computing tools, simulating UH-60 rotor measurements, to assess accuracy of computed rotor structural loads, deflections and flowfield measurements; performed pre-test computations and participated in an international evaluation of an active twist rotor; and applied aeromechanics analysis tools to rotorcraft configurations for improved performance in support of PE 0603003A, Project 313."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Controls"
                                    },
                                    "Description": {
                                        "val": "Develop advanced rotor and aircraft flight control architectures as well as control laws to permit enhanced vehicle performance over expanded and more challenging flight envelopes.  This effort continues in FY13 under the Rotors & Vehicle Management Technologies effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.663"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated integrated control of large rotorcraft using feedback of rotor state, external loads, and structural measurements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotors & Vehicle Management Technologies"
                                    },
                                    "Description": {
                                        "val": "Design and investigate advanced airfoil and rotor blade technologies, including active control elements, to support goals of increased hover and cruise efficiency. Design and evaluate advanced flight control and vehicle management component technologies to support goals of increased maneuverability, reliability, and reduced weight and cost.  This effort consolidates and continues efforts initiated prior to FY13 under the Rotor Technology effort and the Flight Controls effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.429"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess advanced computational methods for prediction of helicopter main rotor and pylon aerodynamic interaction with fixed tail surfaces; perform post-test computations for an international active twist rotor experiment; continue to analyze rotorcraft configurations for improved performance; complete new software that includes the ability to model full vehicle interactional aerodynamics including main-rotor, fuselage and tail-rotor interactions; and initiate flight mechanics modeling and handling qualities criteria development for advanced aircraft configurations, including compounds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.856"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.856"
                                            },
                                            "Text": {
                                                "val": "Will conduct a small-scale rotor test to refine current modeling and simulation tools for rotor structural loads; will conduct sub-scale experimental studies in drag reduction using active and passive techniques where combined rotor and fuselage flows are complex; will analyze rotorcraft configurations for improved performance, including both aerodynamics and structural dynamics; will complete new software that includes the ability to model high fidelity simulations of helicopter missile launch; will conduct analysis and simulation to evaluate autonomous multi-ship teaming (e.g., twin lift); will develop and validate flight simulation models of compound high-speed configurations for handling qualities requirements; and will initiate development of flight control architectures for advanced configurations with many control surfaces and widely changing dynamic responses over the flight envelope."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft and Occupant Survivability Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate advanced technologies to reduce susceptibility and vulnerability of aircraft to damage from threats or accidents, as well as technologies to defeat small arms, rocket and missile threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.473"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began design of advanced infra-red(IR)\/electro-optical (EO) signature control materials; and developed improved materials and airframe structural configurations that provide threat protection against non-conventional weapons, to include directed energy, blast\/overpressure, and high velocity low mass fragments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.147"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue research into advanced IR\/EO signature control materials to counter current and emerging threat sensors; continue investigation and validation of improved materials and airframe structural configurations that provide threat protection against conventional and nonconventional weapons, to include directed energy, blast\/overpressure, and high velocity low mass fragments; design and validate active crash energy management subsystems; and evaluate and validate fuel containment technologies that provide self-sealing capability independent of fuel type."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.943"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.943"
                                            },
                                            "Text": {
                                                "val": "Will begin coupon testing of developed EO\/IR materials for signature control and environmental durability; will begin design of advanced systems\/subsystems and configurations that provide threat protection against conventional ballistic threats and non-conventional weapons to include directed energy, active crash protection for full spectrum crashworthiness, and crashworthy ballistic tolerant fuel containment systems independent of fuel type."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engine and Drives Technologies"
                                    },
                                    "Description": {
                                        "val": "Design and evaluate advanced turboshaft engine component technologies to support goals of reduced fuel consumption, engine size, weight, and cost, as well as improved reliability and maintainability.  Design and evaluate advanced drive system component technologies to support multi-speed transmissions, lighter weight gearboxes, and reduced costs, while improving reliability and maintainability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.542"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "For a cargo sized aircraft, completed advanced mechanical systems fabrication for improved engine performance and structural life; completed evaluation of advanced compressor for improved engine performance and reduced weight; and transitioned technologies to engine advanced development efforts under PE 0603003A, Project 447."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.049"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete component testing of advanced mechanical systems technology in a dynamic laboratory environment for improved engine performance and structural life; complete fabrication of advanced combustor design for reduced size, weight, and cost; and complete design of advanced power turbine design for improved performance and operational capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.028"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.028"
                                            },
                                            "Text": {
                                                "val": "Will complete component testing of advanced combustor designs for reduced size, weight, and cost; will complete fabrication of advanced power turbine for improved performance and operational capability; will investigate clutch and gear systems to permit multi-speed transmissions required for high speed rotor and prop\/rotor operation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System Concepts Studies"
                                    },
                                    "Description": {
                                        "val": "Enables new rotorcraft configurations by evaluating critical advanced technology using design and analysis methods with greater modeling fidelity.  Introduces high fidelity methodology for improved performance and design predictions earlier in the development and acquisition process.  This effort continues in FY13 under the Platform Design & Structures Technologies effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.028"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed small scale wind tunnel test to validate performance predictions and documented requirements for multi-role configuration technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Platform Design & Structures Technologies"
                                    },
                                    "Description": {
                                        "val": "Enables new rotorcraft configurations by evaluating critical advanced aviation technologies using design and analysis methods with greater modeling fidelity.  Introduces high fidelity methodology for improved performance and design predictions earlier in the development and acquisition process. Prior to FY13, efforts were exhibited under System Concept Studies, Network Operations and System Integration (advanced rotary wing concept), and Durability & Sustainment Technologies (platform durability & damage tolerance)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.735"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Update advanced technology representations at the component level for design codes used for joint vertical lift aircraft concept size, weight, and performance estimation; assess modeling and simulation methods for rotorcraft application, including rotor hubs, airfoils, blades, and interactional aerodynamics of rotors and fuselage with focus on performance improvements; and apply modeling and simulation technologies developed to inform Joint Multi-Role and future aircraft designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.377"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.377"
                                            },
                                            "Text": {
                                                "val": "Will expand the vehicle design analysis and modeling environment to improve analytic efficiency, including enhanced component weights methodology, incorporation of vehicle cost methodologies, and linkage of design tools to specialized higher fidelity analytic codes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Operations and System Integration"
                                    },
                                    "Description": {
                                        "val": "Perform feasibility, operations, and concept studies to identify promising candidate technologies for improved and new platform capabilities.  The human\/machine interface work of this effort continues in FY13 under the Unmanned and Optionally Manned Technologies effort.  The advanced rotary wing weapons integration concept work of this effort continues in FY13 under the Aircraft Weapon & Sensor Technologies effort.  The advanced rotary wing concepts work of this effort continues in FY13 under the Platform Design and Structures Technologies effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.428"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated Unmanned Aerial System (UAS) supervisory control techniques applied in relevant tactical operations through flight evaluation; and investigated integration of advanced lethality concepts for application to manned and unmanned aviation assets, addressing energy storage, system pointing accuracy, stabilization, and incapacitation effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned and Optionally Manned Technologies"
                                    },
                                    "Description": {
                                        "val": "Design and develop collaboration and cooperation algorithms to support goal of intelligent teaming for manned-unmanned operations.  Design and develop advanced unmanned aerial system (UAS) components to support goal of improved small UAS performance.  Prior to FY13, human\/machine interface work was exhibited in the Network Operations and System Integration effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.278"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate UAS supervisory control techniques from the cockpit for manned-unmanned teaming in high fidelity simulation; complete UH-60 flight test of symbology sets for degraded visual environment and integrated forward perspective displays for improved flight path and landing precision."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.311"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.311"
                                            },
                                            "Text": {
                                                "val": "Will complete evaluation of brown-out symbology software in actual brown-out conditions at Yuma Proving Ground for approach-to-landing, hover and take-off flight regimes; will evaluate simulation of BOSS symbology for forward tactical flight regimes; will evaluate the use of high priority \"plays\", or pre-defined UAS operational functions, based on pilot feedback from Manned\/Unmanned-Teaming (MUM-T) simulation studies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Weapon & Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Design and develop innovative approaches for integrating advanced weapons and sensors on aircraft platforms, including smart dispensers, data transfer, and post-launch weapon communication.  Prior to FY13, the advanced rotary wing weapons integration concept work was exhibited in the Network Operations and System Integration effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.521"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate advanced lethality concepts to include on-the-move fire control for improved hit probability and reduced collateral damage, and apply concepts to inform future system level demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.624"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.624"
                                            },
                                            "Text": {
                                                "val": "Will research and determine applicability of advanced sensor technologies for improved situational awareness; will research lightweight remote control weapons turrets to eliminate the need for dual door gunners, and advanced weapons system management algorithms for reconnaissance, attack, and utility aircraft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintainability & Sustainability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop prognostic and system health assessment technologies to enable transition to a Condition Based Maintenance supportability structure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.961"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed prognostic algorithms for predicting remaining life of engine controls, sensors, and lubrication systems; performed evaluation of data fusion of structural integrity algorithms for extending component time on wing and damage tolerance; and developed algorithms to assess rotor component health and vehicle control systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.827"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop prognostic technologies for predicting and isolating failures within aircraft electrical wiring systems; validate algorithms for engine controls, sensors, and lubrication systems; develop a multi-functional sensor to provide improved bearing prognostics and reduce system weight; and develop and validate a combined crack and corrosion detection sensor for improved accuracy on airframe structural components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.609"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.609"
                                            },
                                            "Text": {
                                                "val": "Will develop technologies to enable lighter weight designs through loads monitoring of critical components; will develop multi-use sensors to monitor cracking and delamination in composites as well as crack growth algorithms; will develop wireless sensors for on-component processing of part health and usage history; will investigate probabilistic failure initiation and progression analysis methods to estimate remaining component life, including improved analysis techniques for metallic and composite rotating and non-rotating structures; will investigate mission based probabilistic life methodologies to allow for probability of failure predictions based on vehicle current state and anticipated mission, and develop improved load and usage spectrum characterization techniques; and will investigate durable structural concepts including application of high-strain capability designs through advanced design, analysis and\/or material solutions, while also considering repairability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability For Degraded Visual Environment Operations"
                                    },
                                    "Description": {
                                        "val": "Will research advanced sensor and cockpit display technologies to provide ability to maintain terrain and obstacle situational awareness during degraded visual environments caused by dust and snow particulates (brown-out & white-out)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Characterize sensor transmission as a function of wavelength, particulate size and volumetric density; define required spatial resolution for safe pilotage, scan rates for terrain updates, and sensor transmission relative to operational dust and snow volumetric densities; investigate multi-band sensor fusion techniques to enhance performance; and investigate cockpit display technology (heads-up and heads-down) to provide terrain representation to aircrew."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Will execute studies that include simulation, laboratory, ground test, and flight test to develop the parametric relationship between aircraft handling qualities, sensors and cueing to allow safe flight operations in degraded visual environments; will define and test required levels of handling qualities, appropriate sensor trade-offs to include active and synthetic fusion, as well as visual display (symbology) and tactile cueing.."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "47B"
                    },
                    "ProjectTitle": {
                        "val": "Veh Prop & Struct Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.484"
                        },
                        "CurrentYear": {
                            "val": "5.709"
                        },
                        "BudgetYearOne": {
                            "val": "6.803"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.803"
                        },
                        "BudgetYearTwo": {
                            "val": "8.683"
                        },
                        "BudgetYearThree": {
                            "val": "8.727"
                        },
                        "BudgetYearFour": {
                            "val": "8.412"
                        },
                        "BudgetYearFive": {
                            "val": "8.896"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates engine, drive train, and airframe enabling technologies such as multifunctional materials, fluid mechanics and high temperature, high strength, low cost shaft materials.\n\nWork in this project complements and is fully coordinated with PE 0603003A (Aviation Advanced Technology). \n \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Army Research Laboratory (ARL) at the NASA Glenn Research Center, Cleveland, OH, the NASA Langley Research Center, Hampton, VA, and the Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rotor and Structure Technology"
                                    },
                                    "Description": {
                                        "val": "Devise improved tools and methodologies to more accurately design for improved component reliability and durability, resulting in platforms that are lighter in weight and less costly to acquire and maintain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed wind-tunnel evaluation of high performance active twist rotor blades and validated prognostics and diagnostics technologies and framework for computation of remaining useful life of vehicle structures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.043"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enhance damage tolerance analysis and analytical methods to support the Army joint multi-role aircraft development; conduct flight studies using an unmanned aircraft vehicle, as a cost effective surrogate for full scale manned and unmanned rotorcraft, equipped with a health and usage monitoring system to assess and validate advanced sensors for prognostics and diagnostics; assess structural health monitoring methods to optimize sensing strategies for reducing Army maintenance labor; validate a modeling and simulation capability for the study of improved rotor system performance; and investigate nanosecond pulsed plasma actuators for on-blade separated flow control to increase the performance of rotor systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.269"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.269"
                                            },
                                            "Text": {
                                                "val": "Will develop and demonstrate seat damper technology using \"smart magnetic material\" that will enhance the crash-worthness of rotorcraft; evaluate the performance of an advanced, structurally-integrated, trailing edge rotor flap for its simplicity of operation and aerodynamic control authority; will perform prognostic and diagnostic (P&D) inspection experiments aimed at improving structural risk assessment; will develop self sensing strategies to monitor damage precussors; will incorporate optimized sensing strategies into P&D systems; will commission operation of, and begin data collection on the full scale helicopter landing gear test stand facility; will utilize mult-functional structural materials to augment sensing, power and energy storage, or actuation in micro air and ground vehicles.  Will also develop coupled plasma\/fluid models and utilize computational models to quantitatively assess potential impacts of plasma on rotor aerodynamic performance; will begin experimental studies to determine the potential of nanosecond pulsed plasma discharges for enhancing current and next-gen rotorcraft speed, range, and payload; will develop quantitative technology payoff assessment and analysis models; will expand models from first-order relationships to comprehensive codes.  Models will allow researchers to understand which technologies are the most critical to achieving future aviation capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engine and Drive Train Technology (previously titled Propulsion and Drive Train Technology)"
                                    },
                                    "Description": {
                                        "val": "Investigate high temperature materials, advanced models for flow physics and improved methods for predicting propulsion system mechanical behavior to increase fuel efficiency and reduce propulsion system weight."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.503"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated the feasibility of fabricating hybrid ceramic\/metal turbine engine components for future air platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.666"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct evaluations of the potential for variable speed power turbines to enable efficient operation of gas turbine engines at reduced power operating conditions to enable faster rotorcraft vehicles; and characterize the dynamics of a pericyclic variable transmission (PVT) for use in rotorcraft applications to reduce transmission weight."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.934"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.934"
                                            },
                                            "Text": {
                                                "val": "Will complete evaluation of the potential for variable speed power turbines to enable efficient operation of gas turbine engines at reduced power operating conditions to enable faster rotorcraft vehicles; complete dynamic characterization of a PVT to reduce the weight of PVTs for rotorcraft applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Micro\/Small Scale Unmanned Aerial Systems"
                                    },
                                    "Description": {
                                        "val": "Investigate platform, aerodynamic, actuation, transmission, and control technologies for handheld autonomous Unmanned Aerial Systems (UAS); provide small units with significantly increased tactical mobility and deployability by extending soldier perception to real-time local Intelligence, Surveillance, and Reconnaissance (ISR) with handheld organic assets, and by minimizing the supporting infrastructure needed for deployment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Develop and use various levels of model fidelity, including High-Performance Computing (HPC) modeling and simulation, experimentation, and evaluation, to advance and improve the coupled wing-actuator-control system or its\ncomponents; component level investigation includes, but is not limited to, aspects of low speed airfoil design, airfoil turbulence sensitivity analysis, implementation-plausible (at the handheld-scale) flow control, membrane and tendon-like actuation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}