{
    "id": "0da4d53af72ad2541ee897d4af69285967d46bea",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602102F"
        },
        "ProgramElementTitle": {
            "val": "Materials"
        },
        "R1LineItemNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "142.417"
            },
            "CurrentYear": {
                "val": "114.166"
            },
            "BudgetYearOne": {
                "val": "116.846"
            },
            "BudgetYearOneBase": {
                "val": "116.846"
            },
            "BudgetYearTwo": {
                "val": "116.504"
            },
            "BudgetYearThree": {
                "val": "118.484"
            },
            "BudgetYearFour": {
                "val": "116.758"
            },
            "BudgetYearFive": {
                "val": "119.016"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops advanced materials, processing, and inspection technologies to reduce life cycle costs and improve performance, sustainability, availability, affordability, supportability, reliability, and survivability of current and future Air Force systems and operations. The program has four projects that develop: (1)  structural, propulsion, and sub-systems materials and processes technologies; (2)  electronic, optical, and survivability materials and processes technologies; (3)  sustainment materials, processes technologies, and advanced non-destructive inspection methodologies; and (4) air base operations technologies including deployable base infrastructure, force protection, and fire fighting capabilities.  Efforts in the program have been coordinated through the coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary materials technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "144.219"
                },
                "CurrentYear": {
                    "val": "114.166"
                },
                "BudgetYearOne": {
                    "val": "121.176"
                },
                "BudgetYearOneBase": {
                    "val": "121.176"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "142.417"
                },
                "CurrentYear": {
                    "val": "114.166"
                },
                "BudgetYearOne": {
                    "val": "116.846"
                },
                "BudgetYearOneBase": {
                    "val": "116.846"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.802"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-4.330"
                },
                "BudgetYearOneBase": {
                    "val": "-4.330"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.802"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.330"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.330"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY14 is due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "624347"
                    },
                    "ProjectTitle": {
                        "val": "Materials for Structures, Propulsion, and Subsystems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "88.824"
                        },
                        "CurrentYear": {
                            "val": "58.464"
                        },
                        "BudgetYearOne": {
                            "val": "60.381"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.381"
                        },
                        "BudgetYearTwo": {
                            "val": "53.257"
                        },
                        "BudgetYearThree": {
                            "val": "52.689"
                        },
                        "BudgetYearFour": {
                            "val": "51.543"
                        },
                        "BudgetYearFive": {
                            "val": "52.609"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the materials and processing technology base for aircraft, spacecraft, launch systems, and missiles to improve affordability, maintainability, and performance of current and future Air Force systems. A family of affordable lightweight materials is being developed, including metals, polymers, ceramics, metallic and nonmetallic composites, and hybrid materials to provide upgraded capabilities for existing aircraft, missile, and propulsion systems to meet the future system requirements. The project develops high-temperature turbine engine materials that will enable engine designs to double the turbine engine thrust-to-weight ratio. Advanced high temperature protection materials are being developed that are affordable, lightweight, dimensionally stable, thermally conductive, and\/or ablation and erosion resistant to meet aerospace and missile requirements. Alternative or replacement materials are being developed to maintain the performance of aging operational systems. Materials for thermal management including coolants, adaptive thermally conductive materials, coatings, friction and wear-resistant materials, and other pervasive nonstructural materials technologies are being developed for directed energy, propulsion, and subsystems on aircraft, spacecraft, and missiles. The project develops nanostructured and biological materials for aircraft structures, munitions, air vehicle subsystems, and personnel. The project develops novel materials for electromagnetic interactions with matter for electromagnetic pulse (EMP), high power microwave, and lightning strike protection.  The project concurrently develops advanced processing methods to enable adaptive processing of aerospace materials."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Nanotechnology Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Composites"
                                    },
                                    "Description": {
                                        "val": "Develop ceramic, ceramic matrix composite, and hybrid materials technologies for performance and supportability improvement in propulsion systems and high temperature aerospace structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.630"
                                            },
                                            "Text": {
                                                "val": "Advanced development of new processing methods, environmental coatings, and life prediction for higher temperature capable ceramic matrix composites. Continued validation of the life prediction model to address time dependent degradation associated with environmental exposure. Continued validation of the severe environment durability of advanced ceramic composite systems with advanced interfaces via mechanical testing. Continued development of new ceramic matrix composites systems with higher temperature capability. Continued validation of suitable materials and materials process technologies for applications in combined optical and radio frequency (RF) communication system apertures. Initiated development of new hybrid materials and materials process technologies for applications in combined optical and RF communication system apertures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.628"
                                            },
                                            "Text": {
                                                "val": "Continue development of new advanced processing methods, coating technologies, and behavioral life prediction for higher temperature capable ceramic matrix composites. Transition life prediction model to address time dependent degradation associated with environmental exposure. Demonstrate severe environment durability of advanced ceramic composite systems via mechanical testing. Advance development of new ceramic matrix composites systems with higher temperature capability. Demonstrate materials and processes for applications in combined optical and RF communication system apertures. Continue development of new hybrid materials and processes for applications in combined optical and RF communication system apertures. Develop ceramic and organic matrix composite materials and processes for propulsion systems and aerospace structures. Use computational analysis to enhance understanding of environment for structural characterization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.770"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.770"
                                            },
                                            "Text": {
                                                "val": "Continue to analyze and develop new advanced processing methods, coating technologies, and behavioral life prediction for higher temperature capable ceramic matrix composites. Continue transition of life prediction model to address time dependent degradation associated with environmental exposure. Continue to demonstrate severe environment durability of advanced ceramic composite systems via mechanical testing. Advance development of new ceramic matrix composites systems with higher temperature capability. Continue to demonstrate materials and processes for applications in combined optical and RF communication system apertures. Continue to analyze and develop new hybrid materials and processes for applications in combined optical and RF communication system apertures. Continue to develop ceramic and organic matrix composite materials and processes for propulsion systems and aerospace structures. Use computational analysis to enhance understanding of environment for structural characterization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Metamaterials"
                                    },
                                    "Description": {
                                        "val": "Develop nanostructured materials and nanoscale architectures to address electromagnetic applications. Develop metamaterials for sensors, antennas, electronics, and optical elements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.371"
                                            },
                                            "Text": {
                                                "val": "Investigated new material systems and nano geometries to improve electrochemical energy storage including development of long-life electrodes. Accelerated applications development for optical metamaterials. Investigated concepts for RF passive metamaterials-based components. Continued to develop RF\/Infrared (IR) photonics for compact air vehicle applications. Continued to develop fabrication and characterization for Electro-optic (EO)\/IR metamaterials and emerging metamaterial applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.669"
                                            },
                                            "Text": {
                                                "val": "Demonstrate concepts for RF passive metamaterials-based components.  Demonstrate use of RF\/IR photonics for compact air vehicle applications. Analyze nanoscale materials to understand and characterize the transport of mass, momentum, and energy at the atomic level. Note: In FY13, decrease is due to higher Department of Defense priorities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate concepts for RF Passive metamaterials based components. Continue to develop metamaterials for multiple applications.  Continue to analyze nanoscale materials to understand and characterize the transport of mass, momentum, and energy at the atomic level."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Metals"
                                    },
                                    "Description": {
                                        "val": "Develop lightweight metallic\/inter-metallic high temperature materials, life prediction, and metals processing technologies for sustainment issues such as lower costs, increased durability, and improved reliability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.442"
                                            },
                                            "Text": {
                                                "val": "Continued development of advanced blade and disk system concept for insertion into advanced propulsion concepts for air platforms. Continued development of advanced computation methods to support material development and characterization modeling for advanced aerospace systems. Continued development and validation of quantitative, predictive models for performance of metallic-based thermal management systems. Determined relationships between microstructure, processing, and the functional properties and performance of metallic, hybrid, nano, and composite materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.566"
                                            },
                                            "Text": {
                                                "val": "Transition advanced blade and disk system into advanced turbine engine systems. Demonstrate advanced computation methods to support material development and characterization modeling. Demonstrate quantitative, predictive models for performance of metallic based thermal management systems. Analyze relationships between microstructure, processing, functional properties, and performance of metallic, hybrid, nanoscale, and composite materials. Develop metals materials and processes for higher reliability, lower cost and more durability sustainment propulsion systems and aerospace structures. Initiate development of advanced electromagnetic protection technologies for propulsion systems and aerospace structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.711"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.711"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate advanced computation methods to support material development and characterization modeling. Continue to demonstrate quantitative, predictive models for performance of metallic based thermal management systems. Analyze relationships between microstructure, processing, functional properties, and performance of metallic, hybrid, nanoscale, and composite materials. Continue to develop metals materials and processes for higher reliability, lower cost and more durability sustainment propulsion systems and aerospace structures. Continue to develop advanced electromagnetic protection technologies for propulsion systems and aerospace structures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hypersonic Materials"
                                    },
                                    "Description": {
                                        "val": "Explore new material systems for expendable supersonic\/hypersonic weapon system applications. Develop and evaluate lightweight, active, adaptive, multifunctional, high temperature, and durable composite and hybrid materials for extreme environments. Develop composite and hybrid life prediction tools for engine and airframe applications. Develop computational materials science techniques and models to characterize high performance materials for expendable space and supersonic\/hypersonic applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.309"
                                            },
                                            "Text": {
                                                "val": "Continued to demonstrate improved performance of new material systems for space and supersonic\/hypersonic vehicle applications. Continued to develop lightweight, active, adaptive, multifunctional, high temperature, and durable composite and hybrid materials for extreme environments including hypersonic applications. Evaluated advanced carbon fibers modified by carbon nanotubes. Developed tailorable\/adaptive high performance thermal interfaces, coolants, thermoelectric, and energy storage materials and models for air, space, propulsion, and directed energy applications. Initiated development of novel materials and processes for improved thermal transport, storage, and thermal management for Air Force applications. Continued to transition high-performance material systems for space and high-speed vehicle applications. Developed composite and hybrid life prediction tools for engine and airframe applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.821"
                                            },
                                            "Text": {
                                                "val": "Evaluate advanced carbon fibers modified by carbon nanotubes. Develop tailorable\/adaptive high performance thermal interfaces, coolants, thermoelectric, and energy storage materials and models for air, space, propulsion, and directed energy applications. Develop novel materials and processes for improved thermal transport, storage, and thermal management for Air Force applications. Develop composite and hybrid life prediction tools for engine and airframe applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.800"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate advanced carbon fibers modified by carbon nanotubes. Continue to develop tailorable\/adaptive high performance thermal interfaces, coolants, thermoelectric, and energy storage materials and models for air, space, propulsion, and directed energy applications. Continue development of novel materials and processes for improved thermal transport, storage, and thermal management for Air Force applications. Continue to develop composites for high performance extreme environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Energy Materials"
                                    },
                                    "Description": {
                                        "val": "Develop materials for power, fluids, lubricants, aircraft topcoat, and corrosion resistant coatings using alternative energy and bio-inspired concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.688"
                                            },
                                            "Text": {
                                                "val": "Demonstrated alternative\/renewable energy materials and technologies for deployed applications. Successfuly matured thermal\/friction coating materials for extreme environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Work completed in FY12."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nano-energetic and Nano-biomaterials"
                                    },
                                    "Description": {
                                        "val": "Develop the basic nanomaterial building blocks for munitions and propulsion energetic systems. Develop fundamental science and technology for pervasive device processing mechanisms via bio-inspired concepts and nanoscale technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.732"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and validated nanomaterials for structural nano-energetic (SNE) munitions, high efficiency air-breathing propulsion, and access to space. Developed biological engineering methods to facilitate the generation of sensors, materials, and electro-optic devices for production of complex hybrid materials. Investigated the confluence on nano-materials and bio-materials focusing on transitioning mechanical optical or electronic devices based upon nano-materials and bio-materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.780"
                                            },
                                            "Text": {
                                                "val": "Develop and analyze nano-biomaterials for human performance sensing. Develop computation materials science techniques and models to characterize nanomaterials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.600"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and analyze nano-biomaterials for human performance sensing. Validate computation materials science techniques and models to characterize nanomaterials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Temperature Materials"
                                    },
                                    "Description": {
                                        "val": "Develop high temperature materials, structures, and thermal management concepts to enable furture defense capabilities for prompt global strike concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.652"
                                            },
                                            "Text": {
                                                "val": "Successfully matured and transitioned advanced ceramics, ceramic matrix composites, hybrids, and metallic concepts for reuseable hot structure and thermal protection systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Work completed in FY12."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624348"
                    },
                    "ProjectTitle": {
                        "val": "Materials for Electronics, Optics, and Survivability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.017"
                        },
                        "CurrentYear": {
                            "val": "28.805"
                        },
                        "BudgetYearOne": {
                            "val": "30.302"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.302"
                        },
                        "BudgetYearTwo": {
                            "val": "30.404"
                        },
                        "BudgetYearThree": {
                            "val": "32.586"
                        },
                        "BudgetYearFour": {
                            "val": "33.046"
                        },
                        "BudgetYearFive": {
                            "val": "33.627"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops materials technologies for surveillance and situational awareness systems and subsystems for aircraft and missile applications, including sensor, microwave, and infrared detection and countermeasures devices used for targeting, electronic warfare, and active aircraft protection.  Materials for protection of aircrews, sensors, and aircraft from laser and high-power microwave directed energy threats are also developed.  Electronic and optical materials are being developed to enable surveillance and situational awareness with faster operating speeds, greater tunability, higher power output, improved thermal management (including higher operating temperatures), greater sensitivity, and extended dynamic range.  New materials are being developed to counter the most prominent laser threats and to respond to emerging and agile threat wavelengths without impairing mission effectiveness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Infrared Detector Materials"
                                    },
                                    "Description": {
                                        "val": "Develop IR detector and hybrid materials, materials and processes technologies for performance, affordability, and operational capability of surveillance, tracking, targeting, and situational awareness systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.295"
                                            },
                                            "Text": {
                                                "val": "Demonstrated reproducibility of optimized 2000-by-2000 (2k x 2k) detector and readout integrated circuit design, processing, and packaging for enhanced focal plane array yields. Developed a super-lattice based material system for use in the detector elements of very long wavelength IR detector focal plane arrays. Continued to advance mid-wavelength materials development for high temperature, low-noise operation for use on low-power systems. Validated models of materials optical\/IR behavior for low observable (LO), Intelligence, Surveillance, and Reconnaissance (ISR), and other applications. Initiate development of materials for nano-scale detection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.362"
                                            },
                                            "Text": {
                                                "val": "Transition optimized design of 2k x 2k IR detectors with integrated circuits, processing, and packaging for enhanced focal plane array yields. Continue to develop a super-lattice based material system for use in the detector elements of very-long wavelength IR detector focal plane arrays. Operate a mid-wave IR (MWIR) focal plane array at temperatures above 200 Kelvin to demonstrate overcoming the challenge of cryogenic cooling requirements. Transition mid-wavelength materials for high temperature, low-noise sensing for use on low power systems. Demonstrate models of materials optical\/infrared behavior for LO, ISR, and other applications. Continue to develop nano-scale materials for use in producing detectors. Utilize computational materials science to improve performance prediction models. Develop inorganic quantum materials for aerospace applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.600"
                                            },
                                            "Text": {
                                                "val": "Develop materials for use in high resolution MWIR applications. Develop materials to support and provide persistent air ISR. Continue to demonstrate models of materials optical\/infrared behavior for LO, ISR, and other applications. Continue to develop nano-scale materials for use in producing detectors. Continue to utilize computational materials science to improve performance prediction models. Continue to develop inorganic quantum materials for aerospace applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser Hardened Materials"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to enhance the safety, survivability, and mission effectiveness of aircrews, sensors, viewing systems, and related assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.728"
                                            },
                                            "Text": {
                                                "val": "Continued demonstration of optimized nonlinear optical limiter materials for damage protection and development of new optical limiter materials and material technologies for robust in-band protection. Continued demonstration of enhanced photorefractive hybrid materials concepts for passive protection applications. Developed tunable\/switchable materials and concepts to provide jamming protection to a variety of systems. Developed and demonstrated passive optical coating technology for advanced applications in airborne, space, and personnel systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.818"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of materials and technologies to protect against directed energy threats. Projects include optimized nonlinear optical limiter materials for damage protection, robust in-band optical limiter materials, enhanced photorefractive hybrid materials concepts, tunable\/switchable materials and concepts, and passive optical coating technology for advanced applications in airborne, space, and personnel systems. Develop materials for high energy laser interactions. Utilize computational materials science to enhance multi-scale modeling. Develop materials and processes for hardening and optical materials applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.223"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.223"
                                            },
                                            "Text": {
                                                "val": "Validate and demonstrate materials and technologies to protect against directed energy threats. Projects include optimized nonlinear optical limiter materials for damage protection, robust in-band optical limiter materials, enhanced photorefractive hybrid materials concepts, tunable\/switchable materials and concepts, and passive optical coating technology for advanced applications in airborne, space, and personnel systems. Continue to develop materials for high energy laser interactions. Utilize computational materials science to enhance multiscale modeling. Continue to develop materials and processes for hardening and optical materials applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Power\/Microwave Materials"
                                    },
                                    "Description": {
                                        "val": "Develop materials and processing technologies for power generation and control, and microwave components for surveillance, tracking, targeting, situational awareness, and lethal and non-lethal systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.610"
                                            },
                                            "Text": {
                                                "val": "Developed and validated characterization and modeling tools to analyze material changes that occur at the nanoscale within an operating device. Developed and demonstrated reliable materials and processes to optimize components for compact, lightweight, high power microwave directed energy applications. Continued to develop nanostructured materials using multiple approaches for high energy density capacitors for pulsed power applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.701"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and demonstrate reliable materials and processes to optimize components for compact, lightweight, high power microwave directed energy applications. Develop materials and processes for Polymeric Energy Conversion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and demonstrate reliable materials and processes to optimize components for compact, lightweight, directed energy applications. Continue to develop materials and processes for Polymeric Energy Conversion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biomaterials"
                                    },
                                    "Description": {
                                        "val": "Develop enabling and foundational biotechnologies for guidance and control, rapid tagging, tracking, and identification of targets, and bio-integrated electronics and sensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.328"
                                            },
                                            "Text": {
                                                "val": "Developed bio-materials and nano-based and functionalized materials for tagging, tracking, and locating applications. Developed biological engineering methods for sensors and electro-optic devices for complex hybrid materials. Developed bio-materials and nano-materials that enable broad spectrum mitigation of environmental threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.177"
                                            },
                                            "Text": {
                                                "val": "Continue to develop biological engineering methods for sensors and electro-optic devices for complex hybrid materials. Use pervasive computational materials science to model guided experiments and to enable rapid in-situ experimental data acquisition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and demonstrate biological engineering methods for sensors and electro-optic devices for complex hybrid materials. Use pervasive computational materials science to model guided experiments and to enable rapid in-situ experimental data acquisition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Materials"
                                    },
                                    "Description": {
                                        "val": "Develop materials enabling higher performance lasing media, new laser architectures, optical isolators, beam steering, and other high energy laser components for directed energy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.056"
                                            },
                                            "Text": {
                                                "val": "Developed materials for enabling improved laser source components operating in the mid-infrared range. Continued to develop materials processes for fabricating new laser beam scanning architectures that utilize the latest generation of electro-optic (EO) polymers to enable the high-speed beam steering. Developed and demonstrate materials that increase high energy laser efficiency and gain."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.747"
                                            },
                                            "Text": {
                                                "val": "Demonstrate materials for improved laser source components operating in the mid-infrared range. Develop materials with tailorable properties for beam steering in the newly accessible W band. Demonstrate materials processes for fabricating new laser beam scanning devices that utilize electro-optic polymers to enable high-speed beam steering. Develop and demonstrate materials that increase high energy laser efficiency and output. Utilize computational materials science to improve performance predictions and shorten design cycle time."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.979"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.979"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate materials for improved laser source components operating in the mid-infrared range. Continue to develop materials with tailorable properties for beam steering in the newly accessible W band. Continue to demonstrate materials processes for fabricating new laser beam scanning devices that utilize electrooptic polymers to enable high-speed beam steering. Continue to develop and demonstrate materials that increase high energy laser efficiency and output. Utilize computational materials science to improve performance predictions and shorten design cycle time."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624349"
                    },
                    "ProjectTitle": {
                        "val": "Materials Technology for Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.785"
                        },
                        "CurrentYear": {
                            "val": "26.897"
                        },
                        "BudgetYearOne": {
                            "val": "26.163"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.163"
                        },
                        "BudgetYearTwo": {
                            "val": "32.843"
                        },
                        "BudgetYearThree": {
                            "val": "33.209"
                        },
                        "BudgetYearFour": {
                            "val": "32.169"
                        },
                        "BudgetYearFive": {
                            "val": "32.780"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops materials and materials processing technologies to support operational Air Force mission areas by providing the ability to inspect the quality of delivered systems, transitioning more reliable and maintainable materials, establishing a capability to detect and characterize performance threatening defects, characterizing materials processes and properties necessary for materials transition, and providing quick reaction support and failure analysis to the operational commands and repair centers.  Repair techniques and nondestructive inspection\/evaluation (NDI\/E) methods are developed that are needed for metallic and non-metallic structures, coatings, corrosion control processes, and to support integration of composite structures for aerospace systems.  Various NDI\/E methods are essential to ensure optimum quality in the design and production of aircraft, propulsion, and missile systems.  These NDI\/E methods are also essential to monitor and detect the onset of any service-initiated damage and\/or deterioration due to aging of operational systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop sensing and life prediction technologies to identify damage and characterize the health of aging structures, propulsion systems, and low-observable (LO) materials and structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.153"
                                            },
                                            "Text": {
                                                "val": "Advanced novel sensing modeling, methods, and techniques to detect and track damage to other materials and components for aerospace systems. Conducted applied research to enhance sensing through multiple layers of skin and structures to improve the probabilities of finding deeply imbedded or hidden damage in aerospace systems. Advanced sensing technologies that detect changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Developed and improved affordable prognosis approaches for life cycle management and life extension capability for aerospace structure and turbine engines. Investigated and augmented innovative LO point inspection probes to enable rapid assessment of LO material performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.487"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct applied research to enhance sensing through multiple layers of materials and structures to improve the probabilities of finding deeply imbedded or hidden damage in aerospace systems. Advance sensing technologies to detect and characterize changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Demonstrate design assessment of reliability of  affordable prognosis approaches to life cycle management and life extension for aerospace structures and turbine engines. Continue to develop innovative LO point inspection probes to enable rapid assessment of LO material performance. Initiate research to assess metals performance in aerospace systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.109"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.109"
                                            },
                                            "Text": {
                                                "val": "Validate and demonstrate sensing through multiple layers of materials and structures to improve the probabilities of finding deeply imbedded or hidden damage in aerospace systems. Continue developing advanced sensing technologies to detect and characterize changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Validate design assessment of reliability of affordable prognosis approaches to life cycle management and life extension for aerospace structures and turbine engines. Validate functionality of innovative LO point inspection probes to enable rapid assessment of LO material performance. Continue research to asses metals performance in aerospace systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Production and Repair Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop support capabilities, information, and processes to resolve problems with materials in the production and repair of systems components and structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.788"
                                            },
                                            "Text": {
                                                "val": "Evaluated advanced materials and processes technology to repair Air Force legacy systems and tested failure limits for emerging Air Force systems. Developed and demonstrated test methods and techniques to understand the effects of in-service environments, residual stress and materials processes on structural materials, and to support studies and point design solutions that will extend the life of specific structural components on Air Force systems. Demonstrated and transitioned technologies for improved maintainability and life cycle cost of advanced materials and designs, such as conductive outer-moldline, aircraft films, coatings, access panel treatments, and multifunctional systems. Extruded access panel treatments and rain erosion tape evaluation for edge repair demonstrated on 5th Generation Air Force fighter aircraft. Developed and demonstrated laboratory test methods to evaluate and characterize candidate space materials for properties and material behavior suitable for use in space applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.370"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate advanced materials and processes technology to repair Air Force legacy systems. Investigate failure limits for emerging Air Force systems. Develop test methods and techniques to understand effects of service environments, corrosion, residual stresses, and material processes on structural materials. Conduct studies and support designs that will extend the life of specific structural components on Air Force systems. Transition advanced materials technologies and designs for improved maintainability and life cycle cost of conductive outer-moldline films, coatings, access panel treatments, and multifunctional systems. Initiate development of lab test methods and models to understand and evaluate material degradation and corrosion in built-up aircraft structures. Use computational materials science to perform 3D analysis to predict and analyze material boundary conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.054"
                                            },
                                            "Text": {
                                                "val": "Validate and demonstrate advanced materials and processes technology to repair Air Force legacy systems. Continue to investigate failure limits for emerging Air Force systems. Continue to validate and demonstrate test methods and techniques to understand effects of service environments, residual stresses, and material processes on structural materials. Continue to conduct studies and support designs that will extend the life of specific structural components on Air Force systems. Continue to transition advanced materials technologies and designs for improved maintainability and life cycle cost of conductive outer-moldline films, coatings, access panel treatments, and multifunctional systems. Develop  improved lab test methods and models to understand and evaluate material degradation and corrosion in built-up aircraft structures. Continue developing techniques for using computational materials science to perform 3D analysis to predict and analyze material boundary conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Failure Analysis Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop support capabilities, information, and processes to resolve materials problems and provide electronic and structural failure analysis of components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.844"
                                            },
                                            "Text": {
                                                "val": "Performed quick response failure analysis and materials investigations. Determined root cause and recommended corrective actions for multiple electrical and structural mishap\/failures. Provided advanced materials solutions to ensure system availability and safety of flight. Initiated development of Microelectromechanical System (MEMS) failure analysis capabilities. Developed advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems. Demonstrated advanced test methodologies for analyzing electrical and structural failures of emerging materials. Transitioned Computed Radiography for all applications except weld inspections to minimize cost, inspection time, and use of environmentally hazardous materials. Developed advanced wiring materials technologies to replace aging wiring systems and new wiring technologies for emerging weapon systems. Defined new aging test criteria in assessing Air Force wiring insulation materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.040"
                                            },
                                            "Text": {
                                                "val": "Continue to perform quick response failure analyses and materials investigations. Continue to provide advanced materials solutions to ensure critical warfighter system availability and safety of flight. Continue development of MEMS failure analysis capabilities. Validate advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems. Transition advanced test methods for analyzing electrical and structural failures of emerging materials. Validate test criteria and demonstrate advanced wiring materials  technologies to replace aging wiring systems. Demonstrate new wiring technologies for emerging weapon systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Continue to perform quick response failure analyses and materials investigations. Initiate investigation of improved analysis techniques to determine root cause materials failure\/degradation. Continue to provide advanced materials solutions to ensure critical warfighter system availability and safety of flight. Continue development of MEMS failure analysis capabilities. Continue to validate advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems. Continue to transition advanced test methods for analyzing electrical and structural failures of emerging materials. Continue to validate and demonstrate advanced wiring materials technologies to replace aging wiring systems. Continue to validate and demonstrate new wiring technologies for emerging weapon systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624915"
                    },
                    "ProjectTitle": {
                        "val": "Deployed Air Base Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.791"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops new deployable airbase technologies to reduce airlift and manpower requirements, setup times, and sustainment costs, and to improve protection and survivability of deployed Air Expeditionary Force (AEF) warfighters.  Affordable, efficient technologies are developed for base infrastructure, fire fighting, and force protection to improve Expeditionary Combat Support operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Infrastructure Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop deployable infrastructure airbase technologies to reduce airlift and manpower requirements, setup times, and sustainment costs in support of AEF operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.923"
                                            },
                                            "Text": {
                                                "val": "Investigated and developed innovative airbase alternative energy generation capability, power grid conditioning, and distribution methods. Explored and continued development of high operating temperature materials and technologies for aircraft operating surfaces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Work completed in FY12.  Future work in this area transitioned to the Air Force Civil Engineering Center."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop affordable technologies to provide force protection and survivability to AEF deployed warfighters and infrastructure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.868"
                                            },
                                            "Text": {
                                                "val": "Developed technologies for airbase structural protection against blast and fragmentation. Explored technology to enhance structural integrity. Investigated composite material combustion processes and developed modeling for aircraft fires. Developed innovatve technologies for airbase fire fighting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Work completed in FY12.  Future work in this area transitioned to the Air Force Civil Engineering Center."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "(U)  This project has been coordinated through the Reliance 21 process to harmonize efforts and eliminate duplication."
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}