{
    "id": "0eb81b916280492225b95a9c62eac626006f9a5d",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA3_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603772A"
        },
        "ProgramElementTitle": {
            "val": "Advanced Tactical Computer Science and Sensor Technology"
        },
        "R1LineItemNumber": {
            "val": "53"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "29.937"
            },
            "CurrentYear": {
                "val": "25.226"
            },
            "BudgetYearOne": {
                "val": "33.012"
            },
            "BudgetYearOneBase": {
                "val": "33.012"
            },
            "BudgetYearTwo": {
                "val": "40.046"
            },
            "BudgetYearThree": {
                "val": "37.050"
            },
            "BudgetYearFour": {
                "val": "36.852"
            },
            "BudgetYearFive": {
                "val": "36.471"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 funding increase to support mission command capability demonstrations."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates technologies that allow the Warfighter to effectively collect, analyze, transfer and display situational awareness information in a network-centric battlefield environment. It matures and demonstrates architectures, hardware, software and techniques that enable synchronized command and control (C2) during rapid, mobile, dispersed and Joint operations. Project 101 matures and develops software, algorithms, services and devices to more effectively integrate mission command (MC) across all echelons and enable more effective utilization of Warfighter resources. Project 243 matures and demonstrates signal processing and information\/intelligence fusion software, algorithms, services and systems for Army sensors; radio frequency (RF) systems to track and identify enemy forces and personnel; and multi-sensor control and correlation software and algorithms to improve reconnaissance, surveillance, tracking, and target acquisition.\n\nWork in this PE is complimentary of PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (EW Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602782A (Command, Control, Communications Technology), and PE 0603270A (EW Technology); and fully coordinated with PE 0602783A (Computer and Software Technology) and PE 0603008A (Electronic Warfare Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering, Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.552"
                },
                "CurrentYear": {
                    "val": "25.226"
                },
                "BudgetYearOne": {
                    "val": "27.413"
                },
                "BudgetYearOneBase": {
                    "val": "27.413"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "29.937"
                },
                "CurrentYear": {
                    "val": "25.226"
                },
                "BudgetYearOne": {
                    "val": "33.012"
                },
                "BudgetYearOneBase": {
                    "val": "33.012"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.615"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.599"
                },
                "BudgetYearOneBase": {
                    "val": "5.599"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.615"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "5.599"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.599"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "101"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Command and Control"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.037"
                        },
                        "CurrentYear": {
                            "val": "11.590"
                        },
                        "BudgetYearOne": {
                            "val": "22.353"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.353"
                        },
                        "BudgetYearTwo": {
                            "val": "20.614"
                        },
                        "BudgetYearThree": {
                            "val": "16.366"
                        },
                        "BudgetYearFour": {
                            "val": "16.361"
                        },
                        "BudgetYearFive": {
                            "val": "16.111"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates software, algorithms, services and devices that move and display timely and relevant information across the battlefield to provide commanders at all echelons with situational awareness (SA) that allows them to understand, decide and act faster than their adversaries. This project also matures and demonstrates software, algorithms and devices supporting information storage and retrieval; digital transfer and display of battlefield SA and navigation (nav), position (pos) and location information; synchronization of combined and Joint force operations; software, algorithms and services optimized for Command and Control (C2) On-the-Move (OTM) and C2 of unmanned air and ground robotic systems.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence portfolio.\n\nNote: In FY14 Mission Command (MC) funding from PE\/Project 0603008A\/TR2 has been moved into this PE\/Project to consolidate MC efforts into a single PE\/Project.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command, Communications-Electronics Research, Development, and Engineering, Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Mission Command (MC)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies that allow forces to effectively collect, analyze, transfer, and display information in a net-centric battlefield environment across multiple computing environment (CEs). In order to manage acquisition costs and reduce duplicative efforts the Army has introduced the notion of the Common Operating Environment (COE) composed of several distinct CEs such as the Mobile (hand held devices) and the Mounted (vehicle based devices) CEs. Technology areas in this effort are designed to support all applicable CEs and include intelligent software agents, server virtualization, knowledge management, and automated query technologies. Work accomplished under PE 0602782A\/project 779 compliments this effort. In FY 13 and FY14 this effort supports Technology Enabled Capability Demonstration 3.a: Surprise\/Tactical Intelligence-Mission Command."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.691"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated proof-of-concept for mission context data aggregation and alert algorithm for more effective use of available information; further created and demonstrated methods to assess information sharing, decision making and collaboration in network-enabled operations to better understand how to align these technologies with Warfighter needs; demonstrated technologies that enable the software to track progress in meeting mission goals and provide mechanisms that offer the commander a real-time assessment of the mission; demonstrated technologies permitting the Warfighter to customize and\/or extend decision-enabling software in response to unique and evolving mission needs; wrote algorithms to monitor text-based chat conversations, evaluated content meaning, and suggested information from other related chat sessions that may be applicable."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.155"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Code and demonstrate MC software applications for tasks such as team coordination and situational awareness for dismounted users equipped with hand held devices (a.k.a. Mobile CE) to maximize effective use of available information; code and integrate decision support software capabilities based on information sharing in the Mounted CE to assist in locating and collaborating with friendly forces using tactical communication systems; code MC software capabilities to help with mission planning, execution and tracking unit progress in meeting mission goals within the Command Post CE; code software enabling Soldiers at the company echelon to perform Soldier functions that are typically performed only at battalion and above, such as intelligence and fires; add cognitive enhancements such as question-driven input and pop-up activity-driven suggestions to improve existing MC software systems by automatically assisting users, who may have limited training, to perform at higher levels of efficiency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.104"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.104"
                                            },
                                            "Text": {
                                                "val": "Will architect, design, fabricate, code and integrate a platoon level MC demonstration suite to provide actionable intelligence and timely information sharing over the Army's low bandwidth small unit tactical edge network; code and integrate additional decision support and collaboration tools, including knowledge management and the necessary database connections and deliver information pertinent to a small unit's mission to increase situational awareness\/understanding and decrease tactical surprise; demonstrate this suite's capability to allow Soldiers to access and use all relevant information available on the network most effectively, accounting for the Soldier's cognitive abilities and contextual framework for ease of use and ensure relevance of the delivered information to the unit's mission; analyze social networks and identify in near real-time team strengths, weaknesses, and vulnerabilities and highlight collaboration opportunities which could be leveraged more effectively to foster the efficient use of combat power."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command and Control (C2) for Unmanned Systems"
                                    },
                                    "Description": {
                                        "val": "This effort designs, codes and demonstrates software services that provide coordinated dynamic battle command and tactical control of unmanned systems as well as software tool sets that enable the commander to manage teams of manned and multiple unmanned air and ground platform assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Coded user interface enhancements to facilitate manned\/unmanned interaction, improved ability to monitor multiple unmanned assets, and improved visualization of vehicle status, task progression, and incoming sensor data; continued to evolve mission planning, execution and monitoring software services supporting collaborative UAS\/UGV teaming; continued to enhance software algorithms for UAS\/UGV perception and control technologies that potentially facilitate increased autonomy and mission complexity; continued modeling and simulation activities to evaluate software effectiveness and expand on performance base line."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battle Space Awareness and Positioning"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates position and navigation tools to mitigate the impacts of jamming, terrain features and obstacles such as buildings that limit the performance of Global Positioning System (GPS) receivers to enhance the performance of navigation systems in a GPS denied or degraded environment. Work being accomplished under PE 0602782A\/project 779 compliments this effort. In FY13 and FY14 this effort supports Technology Enabled Capability Demonstration 3.a: Surprise\/Tactical Intelligence-Mission Command."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.946"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed integration of a pos\/nav suite for a software defined radio platform (e.g., Joint Tactical Radio System) combining RF-ranging and network-assisted navigation to provide position location information in all terrains and environments as well as under GPS-degraded conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.435"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Pursue two parallel approaches to integrating novel pos\/nav capabilities, using JTRS radios for one approach and Android smartphones for the other, for both approaches, will implement sensor integration algorithms that incorporate navigation enhancements such as radio frequency-ranging and network assisted navigation in combination with selected pos\/nav sensor equipment; complete fabrication and integration of brassboard radio\/sensor navigation systems for laboratory assessment of system performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.490"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.490"
                                            },
                                            "Text": {
                                                "val": "Will enhance and demonstrate navigation sensors such as pedometry, human motion classification, and visual odometry fused with   radio frequency and smart phone approaches to enhance pos\/nav and improve positional situation awareness; integrate navigation sensor and network algorithms into personal Android based smart phones or tablets and demonstrate situational awareness in a representative platoon size Soldier network; mature, integrate and demonstrate interfaces, software and protocols and that will allow handheld electronics to integrate with emerging M Code capable secure GPS chips."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative Battle Management (moved from PE\/project 0603008A\/TR2)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates mission command (MC) software to improve sharing and understanding of data between the intelligence and operations communities. In FY14 this effort supports Technology Enabled Capability Demonstration 3.a: Surprise\/Tactical Intelligence-Mission Command. (Funding for this effort has been moved here in FY14 from PE\/project 0603008A\/TR2 to consolidate 6.3 Mission Command Work into this PE\/Project)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.759"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.759"
                                            },
                                            "Text": {
                                                "val": "Will design, code, fabricate and demonstrate an enhanced mission command capability with collaborative software tools that allows for faster and more accurate target identification and handoff, real time alerts, natural information collection, Soldier-composable leader tools, and support for operations across diverse human and geographic terrains to enable tactical overmatch for the small units by acting before the adversary can respond; develop these capabilities to operate in a platoon level low bandwidth tactical network using planned Army infrastructure."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "243"
                    },
                    "ProjectTitle": {
                        "val": "Sensors And Signals Processing"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.900"
                        },
                        "CurrentYear": {
                            "val": "13.636"
                        },
                        "BudgetYearOne": {
                            "val": "10.659"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.659"
                        },
                        "BudgetYearTwo": {
                            "val": "19.432"
                        },
                        "BudgetYearThree": {
                            "val": "20.684"
                        },
                        "BudgetYearFour": {
                            "val": "20.491"
                        },
                        "BudgetYearFive": {
                            "val": "20.360"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates improved radar, sensor fusion, and correlation software, services, devices and systems for wide area reconnaissance, surveillance, tracking and targeting of platforms and individuals in all terrains, including complex and urban environments. Sensor fusion efforts mature and demonstrate software, algorithms and services for sensor management, data correlation, and relationship discovery for a multi-intelligence fusion system. Sensor and simulated sensor candidates may include moving-target-indicator\/synthetic aperture radar, electro-optical\/infrared (EO\/IR), signals intelligence (SIGINT), measurements and signatures intelligence (MASINT), human intelligence (HUMINT) and biometrics.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Ground and Air portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command, Communications - Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Measurement and Signature Intelligence Technologies (MASINT) for clandestine tagging, tracking and locating (TTL)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates MASINT sensors and software techniques capable of detecting, tracking, and\/or identifying human activities and\/or infrastructures. The emphasis is to identify appropriate technical approaches, demonstrate embedded processing, and mature algorithms for multi-mode fusion of sensor data. Candidate technologies include: fiber optic seismic\/magnetic sensors, highly sensitive for detection of walking personnel with\/without weapons and\/or tunneling detection; air deployable (air droppable) networked sensor system for a jungle environment (integration of seismic\/acoustic sensor with jungle canopy relay); human infrastructure detection technologies (algorithms, sensors, etc); radio frequency MASINT detector, ultra-light multi-target indicator radar for unattended ground sensors and unmanned air vehicles. Work accomplished under PE 0602120A\/project H16 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.265"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and fabricated contactless identification sensors that enable clandestine tagging and observation of targets from a distance, extended operational persistence and range of the sensors and designed and coded forward based fusion and processing software and algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.870"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and fabricate an extended range facial recognition sensor and optimize code of associated facial-matching algorithms; demonstrate the positive identification of an individual as a person-of-interest and the tracking of that individual throughout a forward operating area using a network of unattended facial recognition sensors communicating with intelligence\/biometrics databases over a secure network in near real time."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapon-Locating (Ground) radar technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates medium-range sensor technologies for locating indirect fire weapons and extending traditional counter-fire target acquisition to shooters operating into or from within natural and urban canyons and firing in improvised fashions (tracks rocket, artillery and mortar targets)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.235"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed brassboard weapon-locating radar system hardware; conducted component and system level engineering and performance assessment against rocket, artillery and mortar targets fired at non-traditional trajectories; integrated mature radar and components under the PM Radars Lightweight Counter Mortar Radar (LCMR(V)3) pre-planned product inprovement program and into new radar developments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative ISR Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort fabricates multi-function ISR sensors and sensor management systems that act collaboratively to improve their individual performance and increase the effectiveness and action-ability of battlespace awareness\/intelligence data in an area of operations. Efforts focus on existing, modified and emerging radar technologies in support of area\/base camp protection. This effort implements an open architecture that is extensible to multiple base sizes and environments and allows growth for future ISR sensors. Work being accomplished under PE 62270\/906 complements this effort. In FY 14 this effort supports Technology Enabled Capability Demonstration 1.a: Force Protection-Basing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.701"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Code, demonstrate and assess software algorithms that allow existing radar systems to track targets and perform air surveillance simultaneously; integrate software algorithm into counter target acquisition systems (lightweight counter-mortal radar (LCMR)) to improve the accuracy of target recognition, identification and classification; code software and firmware to correlate data from existing short range (LCMR) and long range (Enhanced Firefinder Radar (EQ-36)) radar systems to more accurately validate and verify threats at increased ranges and combine targeting information into a single display."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.095"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.095"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate improved target recognition, identification and classification for Counter-Target Acquisition (CTA) and air Defense Surveillance radars (LCMR and EQ-36); demonstrate increased detection, identification and classification range and accuracy gained from correlating short (LCMR) and long range (EQ-36) radar systems; develop a \nmethod to allow ground sensors to cue airborne radars to events on the ground and allow them to track the scene in that area (i.e. cueing a ground moving target indicator radar to follow insurgents away from a rocket launch point after CTA radar has discovered the rocket's point of origin)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Omni-directional Situational Awareness (SA) (Airborne) radar technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates low power multi-function SA sensors for small unmanned aerial systems (UAS) and other aircraft to improve sensing and detection capabilities in support of wide-area persistent surveillance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated networking radar-EO\/IR sensor pairs using ad-hoc methods; analyzed and assessed network bandwidth and security requirements for downlink from UAS; further matured antenna design and processing techniques to support multi-sensor capability and cross-cue to narrower fields of view and auto-tracker; modified sensor payload to reduce size, weight and power; hardened antenna and electronics design for field environment; designed and coded application for radar command, control, and data display on handheld device (PDA, smart-phone, or similar)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced All Source Fusion"
                                    },
                                    "Description": {
                                        "val": "This effort develops software technologies for intelligence\/mission command (Intel\/MC) mission collaboration to provide faster and higher quality decision making support for the Commander and his key staff. Specific efforts focus on integrating intelligence, surveillance and reconnaissance (ISR) planning and execution at the task force\/battalion through troop-level, as well as efforts that provide the capability to identify, fuse, and trace\/track specific targets in an asymmetric environment. Work accomplished under PE 0602270A\/project 906 compliments this effort. In FY 14 this effort supports Technology Enabled Capability Demonstration 3.b: Surprise\/Tactical Intelligence-Actionable Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Analyzed, assessed and designed a common data model that provides integrity for all data types to include data inter-relationships (time, locations, links, etc) that provide source-agnostic extraction and exploitation capabilities; integrate software products for extracting data, identifying, fusing, and tracking of specific entities into the Intelligence Enterprise (DCGS-A, INSCOM, JIEDDO); coded entity extractors, relational reasoning engines, and visualization products; integrated human assisted extraction, interactive correlation and data mining techniques to enable the data fusion process and assist intel analysts with activity and relationship discovery; integrated these technologies into DCGS-A Systems Integration Laboratory and architecture; integrated biometric data matching and fusion algorithms for use in non-cooperative intelligence collection environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.065"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Compose, code and assess automated exploitation and fusion analysis tools, applications, and services that provide advanced planning, execution and assessment capabilities to support the tactical edge user; code and demonstrate applications and services to generate actionable intelligence in support of simultaneous offense, defense, stability, and civil support missions; define new data fields and associated values necessary to improve action-ability of tactical intelligence products; code and assess new correlation and pattern analysis algorithms that incorporate these new data fields; code and assess complex analysis and prediction software to aid the decision making process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.564"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.564"
                                            },
                                            "Text": {
                                                "val": "Will continue to assess the utility of automated exploitation and fusion analysis tools for tactical edge users in a network constrained environment; mature data transformation services to provide intelligence data as situational awareness (SA) reports for a small unit; employ correlation and pattern analysis algorithms to provide actionable and timely intelligence that is relevant to small units based on their geographic area, mission type and objective; integrate automated exploitation and fusion analysis tools, intelligence\/SA transformation services, threat prediction software, and enterprise data feeds into a proactive data service framework that supports timely situation understanding for a small unit; will conduct networked laboratory experiments to validate this framework and gather user feedback."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}