{
    "id": "0fbdfd0967ce8758578406eb65086e915c34cbf3",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DARPA_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602303E"
        },
        "ProgramElementTitle": {
            "val": "INFORMATION & COMMUNICATIONS TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "343.383"
            },
            "CurrentYear": {
                "val": "392.421"
            },
            "BudgetYearOne": {
                "val": "413.260"
            },
            "BudgetYearOneBase": {
                "val": "413.260"
            },
            "BudgetYearTwo": {
                "val": "393.462"
            },
            "BudgetYearThree": {
                "val": "357.192"
            },
            "BudgetYearFour": {
                "val": "368.037"
            },
            "BudgetYearFive": {
                "val": "391.760"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Information and Communications Technology program element is budgeted in the applied research budget activity because it is directed toward the application of advanced, innovative computing systems and communications technologies.  \n\n     The High Productivity, High-Performance Responsive Architectures project is developing the necessary computing hardware and the associated software technology base required to support future critical national security needs for computationally-intensive and data-intensive applications.  These technologies will lead to new multi-generation product lines of commercially viable, sustainable computing systems for a broad spectrum of scientific and engineering applications; it will include supercomputer, embedded computing systems, and novel design tools for manufacturing of defense systems.\n\n     The Information Assurance and Survivability project is developing the technology required to make emerging information system capabilities (such as wireless and mobile code\/mobile systems) inherently secure, and to protect DoD's mission-critical systems against attack upon or through the supporting information infrastructure.  These technologies will enable our critical systems to provide continuous correct operation even when they are attacked, and will lead to generations of stronger protection, higher performance, and more cost-effective security and survivability solutions scalable to several thousand sites.  \n\n     The Language Translation project will develop and test powerful new Human Language Technology that will provide critical capabilities for a wide range of national security needs.  This technology will enable systems to a) automatically translate and exploit large volumes of speech and text in multiple languages obtained through a variety of means; b) to have two-way (foreign-language-to-English and English-to-foreign-language) translation; c) enable automated transcription and translation of foreign speech and text along with content summarization; and d) enable exploitation of captured, foreign language hard-copy documents.\n\n     The Cyber Technology project supports long term national security requirements through the development and demonstration of technology to increase the security of military information systems.  This involves networking, people, platforms, weapons sensors, and decision aids to create a whole that is greater than the sum of its parts.  The results are networked forces that operate with increased speed and synchronization and are capable of achieving massed effects without the physical massing of forces as required in the past."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "354.125"
                },
                "CurrentYear": {
                    "val": "392.421"
                },
                "BudgetYearOne": {
                    "val": "428.541"
                },
                "BudgetYearOneBase": {
                    "val": "428.541"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "343.383"
                },
                "CurrentYear": {
                    "val": "392.421"
                },
                "BudgetYearOne": {
                    "val": "413.260"
                },
                "BudgetYearOneBase": {
                    "val": "413.260"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-10.742"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-15.281"
                },
                "BudgetYearOneBase": {
                    "val": "-15.281"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.091"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-9.651"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-15.281"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-15.281"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012:  Decrease reflects reductions for the SBIR\/STTR transfer and internal below threshold reprogrammings.\nFY 2014:  Decrease reflects minor repricing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "IT-02"
                    },
                    "ProjectTitle": {
                        "val": "HIGH PRODUCTIVITY, HIGH-PERFORMANCE RESPONSIVE ARCHITECTURES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "72.569"
                        },
                        "CurrentYear": {
                            "val": "96.697"
                        },
                        "BudgetYearOne": {
                            "val": "105.691"
                        },
                        "BudgetYearOneBase": {
                            "val": "105.691"
                        },
                        "BudgetYearTwo": {
                            "val": "85.092"
                        },
                        "BudgetYearThree": {
                            "val": "89.556"
                        },
                        "BudgetYearFour": {
                            "val": "111.704"
                        },
                        "BudgetYearFive": {
                            "val": "130.704"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The High Productivity, High-Performance Responsive Architectures project is developing high-productivity, high-performance computer hardware and the associated software technology base required to support future critical national security needs for computationally-intensive and data-intensive applications.  These technologies will lead to new multi-generation product lines of commercially viable, sustainable computing systems for a broad spectrum of scientific and engineering applications; it will include both supercomputer and embedded computing systems.  One of the major challenges currently facing the DoD is the prohibitively high cost, time, and expertise required to build large complex software systems.  Powerful new approaches and tools are needed to enable the rapid and efficient production of new software, including software that can be easily changed to address new requirements and can adjust dynamically to platform and environmental perturbations.  The project will ensure accessibility and usability to a wide range of application developers, not just computational science experts.  This project will also focus on novel design tools for the manufacture of complex ground and aerospace systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "META"
                                    },
                                    "Description": {
                                        "val": "The goal of the META program is to develop novel design flows, tools, and processes to enable a significant improvement in the ability to design complex defense and aerospace systems that are correct-by-construction.  The program seeks to develop a design representation from which system designs can quickly be assembled and their correctness verified with a high degree of certainty.  Such a \"fab-less\" design approach is complemented by a foundry-style manufacturing capability, consisting of a factory capable of rapid reconfiguration between a large number of products and product variants through bitstream re-programmability, with minimal or no resultant learning curve effects.  Together, the fab-less design and foundry-style manufacturing capability is anticipated to yield substantial---by a factor of five to ten---compression in the time to develop and field complex defense and aerospace systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "34.000"
                                            },
                                            "Text": {
                                                "val": "-  Matured the initial set of tools developed to implement model-based design, integration and verification to a productized version that may be released for open use with an appropriate license and will be utilized by the crowd-sourced design infrastructure.\n-  Developed a domain-specific component model library for the drivetrain\/mobility subsystems of a military ground vehicle through extensive characterization of desirable and spurious interactions, dynamics, and properties of all physics domains.\n-  Developed context models to reflect various operational environments.\n-  Developed and implemented an infrastructure for publishing and maintaining detailed component models using an ontology incorporating NATO taxonomies to expand the design space for subsequent efforts to design and build a military ground vehicle.\n-  Developed a mechanism for the feedback of manufacturability constraints into the design and design tradespace exploration process.\n-  Developed and integrated a library of fabrication processes and associated manufacturing elements, i.e., machines and techniques employed to produce the various constituent elements of the military ground vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a domain-specific component model library for the chassis and survivability subsystems of an amphibious infantry fighting vehicle (IFV) through extensive characterization of desirable and spurious interactions, dynamics, and properties of all physics domains.\n-  Transmit the winning design from the first Fast Adaptable Next Generation Ground (FANG) Challenge to the iFAB foundry for fabrication of an IFV drivetrain and mobility subsystem.\n-  Begin expanded development of META tool suite to include qualitative and relational abstraction modeling, probabilistic certificate of correctness calculations, complexity metric evaluation, non-linear Partial Differential Equation (PDE) analysis and cyber design evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.691"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.691"
                                            },
                                            "Text": {
                                                "val": "-  Develop domain-specific component model library for a full amphibious IFV through extensive characterization of desirable and spurious interactions, dynamics, and properties of all constituent components down to the numbered part level.\n-  Transmit the winning design from the second FANG Challenge to the iFAB foundry to fabricate an IFV chassis and integrated survivability subsystem.\n-  Complete development of full META tool suite necessary for the third FANG Challenge."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Instant Foundry Adaptive Through Bits (iFAB)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly part of the META Program\n\nInstant Foundry Adaptive Through Bits (iFAB), will lay the groundwork for the development of a foundry-style manufacturing capability--taking as input a verified system design specified in an appropriate metalanguage--capable of rapid reconfiguration to accommodate a wide range of design variability and specifically targeted at the fabrication of military ground vehicles.  The iFAB vision is to move away from wrapping a capital-intensive manufacturing facility around a single defense product, and toward the creation of a flexible, programmable, potentially distributed production capability able to accommodate a wide range of systems and system variants with extremely rapid reconfiguration timescales.  The specific goals of the iFAB program are to rapidly design and configure manufacturing capabilities to support the fabrication of a wide array of infantry fighting vehicle models and variants.\nOnce a given design is developed and verified, iFAB aims to take the formal META design representation and automatically configure a digitally-programmable manufacturing facility, including the selection of participating manufacturing facilities and equipment, the sequencing of the product flow and production steps, and the generation of computer-numerically-controlled (CNC) machine instruction sets as well as human instructions and training modules.  iFAB is mostly an information architecture.  Only the final assembly capability needs to be co-located under a single roof in anything resembling a conventional fabrication facility; the rest of iFAB can be geographically distributed and can extend across corporate and industrial boundaries, united only by a common model architecture and certain rules of behavior and business practices.  The final assembly node of the iFAB facility for infantry fighting vehicles (IFV) is currently slated to be at the Joint Manufacturing and Technology Center at the Rock Island Arsenal."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Began the assembly and integration of foundry-style manufacturing capability for military ground vehicles.\n-  Developed coarse-level determination of manufacturability time and cost for traditional and composite designs from Computer-Aided Design (CAD) models of moderate complexity.\n-  Created a manufacturing library describing machine tools, processes, and human capabilities for application to the Fast Adaptable Next Generation Ground (FANG) vehicle challenges.\n-  Developed an open source visualization of a foundry, including distributed network and assembly facility, for the verification and accurate assessment of time\/accessibility\/reachability for human operations within the foundry.\n-  Defined manufacturing requirements for drivetrain and mobility subsystem, including 140+ standard fixtures.\n-  Developed an open source assembly planner using collision detection tools to determine possible build sequences.\n-  Coordinated placement of iFAB Foundry final assembly facility at the Joint Manufacturing Technology Center at Rock Island Arsenal, IL."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct a preliminary design review and critical design review (CDR) for the iFAB Foundry.\n-  Mature and integrate foundry infrastructure tools developed under iFAB, including manufacturing feedback and process planning.\n-  Develop foundry infrastructure tools to assess assembly processes and requirements.\n-  Upgrade the Rock Island Arsenal final assembly facility of the iFAB Foundry, and install equipment for the first FANG challenge for an amphibious IFV drivetrain and mobility subsystem.\n-  Test process planning, manufacturing assessment and building capabilities of the distributed foundry through pre-challenges in preparation for the first FANG challenge for an IFV drivetrain and mobility subsystem.\n-  Provide manufacturability feedback to the META design process in support of the first FANG challenge for an IFV drivetrain and mobility subsystem.\n-  Reconfigure the iFAB foundry and build the winning drivetrain and mobility subsystem design from the first FANG Challenge."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct a CDR for changes required within Foundry for building an IFV chassis and survivability subsystem.\n-  Provide manufacturability feedback to the META design process in support of the second FANG challenge for an IFV chassis and survivability subsystem.\n-  Reconfigure the iFAB foundry and build the winning chassis and survivability subsystem design from the second FANG Challenge."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power Efficiency Revolution For Embedded Computing Technologies (PERFECT)"
                                    },
                                    "Description": {
                                        "val": "The Power Efficiency Revolution For Embedded Computing Technologies (PERFECT) program will provide the technologies and techniques to overcome the power efficiency barriers which currently constrain embedded computing systems capabilities and limit the potential of future embedded systems.  The warfighting problem this program will solve is the inability to process future real time data streams within real-world embedded system power constraints.  This is a challenge for embedded applications, from Intelligence, Surveillance and Reconnaissance (ISR) systems on unmanned air vehicles through combat and control systems on submarines.  The PERFECT program will overcome processing power efficiency limitations using near threshold voltage operation, massive and heterogeneous processing concurrency, new architecture concepts, and hardware and software approaches to address system resiliency, combined with software approaches to effectively utilize resulting system concurrency to provide the required embedded system processing power efficiency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.337"
                                            },
                                            "Text": {
                                                "val": "-  Completed Ubiquitous High Performance Computing (UHPC) high level architectural designs.\n-  Released runtime system support tools for attributing runtime costs and pinpointing system performance and stability bottlenecks.\n-  Developed interactive compilation framework incorporating affine (linear loop parallelization) and software pipelining (find and exploit parallelization in serial codes) optimizations to automate code parallelization.\n-  Released dynamic system and performance characterization tools to enhance compiler performance via runtime performance feedback, incorporating the use of off line learning engines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.697"
                                            },
                                            "Text": {
                                                "val": "-  Discover power kernels for embedded DoD applications, including intelligence, surveillance and reconnaissance (ISR) and encryption capabilities.\n-  Establish initial simulation infrastructure for evaluating temporal and power efficiency for DoD embedded subsystems.\n-  Develop theoretical near threshold voltage and resiliency trade-offs for power efficiency.\n-  Identify key language extensions and approaches required for the development of massively parallel software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop an analytical modeling framework for fundamental design trade-off analysis and documentation for local resilience and power optimizations and global optimization methodologies and techniques.\n-  Establish algorithmic analysis and design methodologies for power efficient and resilient processing.\n-  Define power efficient, heterogeneous, highly concurrent conceptual architectural design approaches.\n-  Define and evaluate the impact of 3D approaches for power efficient processing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Integrated Reliability"
                                    },
                                    "Description": {
                                        "val": "The Adaptive Integrated Reliability program goals are to leverage real-time monitoring and the ability to effect fine-grained real-time control to significantly increase the lifecycle reliability of complex aerospace and defense systems.  The program will also develop and demonstrate technology to reduce the incidence of catastrophic failure in complex aerospace defense systems through real-time detection and adaptation.  The program will develop novel in-situ prognostication and health monitoring techniques applicable to complex air and space platforms.  The program will develop tractable approaches to predict, identify, and respond to failures endemic to complex systems such as failure cascades, destructive emergent behavior, and off-nominal responses.  To accomplish this, the program will leverage recent advances in adaptive control for fault isolation and mitigation. Adaptive Integrated Reliability will culminate with installation of the integrated reliability management system on a complex air or space platform and demonstrate 2X reliability improvement via accelerated lifecycle testing with representative stimuli.  This reliability enhancement capability will enable development of a new generation of dependable complex systems and enable the compression of system test timelines by trading off testing for lifecycle reliability.  The requisite design and production tools and techniques developed in the program will have immediate application to space systems and aircraft programs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of the integrated reliability monitoring and prediction approach to include design, analysis, processing, and appropriate sensor and platform architectures.\n-  Initiate development of embedded sensors that possess the requisite size, energy, and environmental durability to support the Adaptive Integrated Reliability approach.\n-  Initiate development of techniques for installation of the sensors during the platform fabrication processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High-Productivity Computing Systems (HPCS)"
                                    },
                                    "Description": {
                                        "val": "The High-Productivity Computing Systems (HPCS) program created a new generation of economically viable, high-productivity computing systems for the national security and industrial user communities.  HPCS technologies were targeted at enabling nuclear stockpile stewardship, weapons design, cryptanalysis, weather prediction, and other large-scale problems that cannot be addressed productively with today's computers.  The goal of this program was to develop revolutionary, flexible and well-balanced computer architectures that will deliver high performance with significantly improved productivity for a broad spectrum of applications.  Additionally, programming such large systems will be made easier so engineers and scientists can better harness the power of high-performance computers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.232"
                                            },
                                            "Text": {
                                                "val": "-  Monitored the two HPCS performers until program completion and completed prototype demonstrations with stakeholders."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "IT-03"
                    },
                    "ProjectTitle": {
                        "val": "INFORMATION ASSURANCE AND SURVIVABILITY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "179.901"
                        },
                        "CurrentYear": {
                            "val": "174.295"
                        },
                        "BudgetYearOne": {
                            "val": "172.004"
                        },
                        "BudgetYearOneBase": {
                            "val": "172.004"
                        },
                        "BudgetYearTwo": {
                            "val": "175.274"
                        },
                        "BudgetYearThree": {
                            "val": "179.695"
                        },
                        "BudgetYearFour": {
                            "val": "195.085"
                        },
                        "BudgetYearFive": {
                            "val": "204.808"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Information Assurance and Survivability project is developing the core computing and networking technologies required to protect DoD's information, information infrastructure, and mission-critical information systems.  These technologies will enable DoD information systems to operate correctly and continuously even when they are attacked, and will provide cost-effective security and survivability solutions.  Technologies developed under this project will benefit other projects within this program element as well as projects in the Command, Control, and Communications program element (PE 0603760E), the Network-Centric Warfare Technology program element (PE 0603764E), the Sensor Technology program element (PE 0603767E), and other projects that require secure, survivable, network-centric information systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Genome"
                                    },
                                    "Description": {
                                        "val": "The Cyber Genome program develops techniques to automatically characterize, analyze, and identify malicious code and determine the evolutionary relationship between new never-before-seen malware samples and older known malware.  This enables the automatic detection of future malware variants.  Such automation is critically important because the global production of malware is growing explosively and threatens to overwhelm current labor-intensive practices.  Cyber Genome also develops advanced capabilities to enable positive identification of malicious code substructures and functionality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "-  Created lineage trees for a class of digital artifacts to support malware evolution forensics.\n-  Developed and demonstrated co-clustering and binary analysis techniques for automatically identifying re-used components in submitted malware samples.\n-  Created graph-based displays of malware lineage and achieved 80% accuracy on samples with known relationships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.949"
                                            },
                                            "Text": {
                                                "val": "-  Develop techniques to automatically and reliably extract forensically-meaningful traits such as authorship, compiler, toolkit, and obfuscation techniques.\n-  Enhance co-clustering and binary analysis techniques to enable the automatic identification of re-used components.\n-  Develop operationally relevant use case test scenarios with transition partner and conduct initial use case validation tests.\n-  Implement prototypes incorporating the most effective techniques to transition partner specifications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate significant improvement to provenance determination through the use of the automatically extracted traits.\n-  Demonstrate final prototypes capable of detecting a single interesting targeted threat from a stream of at least 10K uninteresting mass-infection malware samples.\n-  Evaluate the effectiveness of prototype systems in conjunction with transition sponsors and complete transition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrity Reliability Integrated CircuitS (IRIS)"
                                    },
                                    "Description": {
                                        "val": "The integrated circuit (IC) is a core component of many electronic systems developed for the Department of Defense.  However, the DoD consumes a very small percentage of the total IC production in the world.  As a result of the globalization of the IC marketplace, much of the advanced IC production has moved to offshore foundries, and these parts make up the majority of ICs used in today's military systems.\n\nWithout the ability to influence and regulate the off-shore fabrication of ICs, there is a risk that parts acquired for DoD systems may not meet stated specifications for performance and reliability.  This risk increases considerably with the proliferation of counterfeit ICs in the marketplace, as well as the potential for the introduction of malicious circuits into a design.\n\nThrough the IRIS program, DARPA seeks to develop techniques that will provide system developers the ability to derive the function of digital, analog and mixed-signal ICs non-destructively, given limited operational specifications.  These techniques will include advanced imaging and device recognition of deep sub-micron Complementary Metal-Oxide Semiconductor (CMOS) circuits, as well as computational methods to solve the NP-complete problem of determining device connectivity.\n\nFinally, the IRIS program will produce innovative methods of device modeling and analytic processes to determine the reliability of an IC by testing a limited number of samples.  The current understanding of IC aging mechanisms, including negative bias temperature instability (NBTI), hot carrier injection (HCI), time dependent dielectric breakdown (TDDB) and electromigration (EM) will be leveraged to develop unique diagnostic test techniques."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed fabrication of digital and mixed-signal IC test articles for functional derivation and reliability studies.\n-  Completed definition of functional requirements for algorithms that determine circuit functionality without prior knowledge of their underlying logic and design.\n-  Demonstrated the ability to resolve design features of a CMOS 90nm IC for circuit extraction through non-destructive methods.\n-  Demonstrated functional derivation of un-altered digital and mixed-signal ICs at the 45 nm CMOS node.\n-  Demonstrated reliability derivation from reduced sample sizes of digital ICs at the 90 nm CMOS node and mixed-signal ICs at the 130 nm CMOS node.\n-  Developed tools for functional derivation from third-party Intellectual Property (IP) blocks for both Application Specific Integrated Circuits (ASICs) and Field Programmable Gate Arrays (FPGAs).\n-  Demonstrated the ability to observe free charges flowing in a 90 nm CMOS semiconductor device through the use of laser probing.\n-  Demonstrated the ability to identify logic cell connections in 90 nm CMOS designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the ability to identify design primitives (transistors, capacitors, resistors, etc.), memory elements and interconnect through non-destructive imaging, and derive a \"flattened\" netlist from these components.\n-  Demonstrate functional derivation of modified digital and mixed-signal ICs at the 45 nm CMOS node.\n-  Demonstrate reliability derivation from reduced sample sizes of modified ICs.\n-  Demonstrate non-destructive techniques for reverse engineering a digital IC.\n-  Demonstrate tools for functional derivation from third-party IP (Intellectual Property) blocks for both ASICs and FPGAs.\n-  Develop digital and mixed-signal test articles appropriate for testing techniques for identifying unintended circuits and circuit functions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Refine methods for non-destructive imaging, circuit extraction and functional derivation for improved accuracy and efficacy. \n-  Refine methods for reliability analysis for improved accuracy, functionality and efficacy.\n-  Encourage and support collaborative efforts among performers to develop cohesive and robust solutions for each technical thrust.\n-  Establish advanced metrics to characterize and evaluate performer efforts for potential transition activity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Clean-slate design of Resilient, Adaptive, Secure Hosts (CRASH)"
                                    },
                                    "Description": {
                                        "val": "The Clean-slate design of Resilient, Adaptive, Secure Hosts (CRASH) program will develop cyber security technologies using the mechanisms of biological systems as inspiration for radically re-thinking basic hardware and system designs.  Higher level organisms have two distinct immune systems: the innate system is fast and deadly but is only effective against a fixed set of pathogens; the adaptive system is slower, but can learn to recognize novel pathogens.  Similarly, CRASH will develop mechanisms at the hardware and operating system level that eliminate known vulnerabilities exploited by attackers.  However, because novel attacks will be developed, CRASH will also develop software techniques that allow a computer system to defend itself, to maintain its capabilities, and even heal itself.  Finally, biological systems show that diversity is an effective population defense; CRASH will develop techniques that make each computer system appear unique to the attacker and allow each system to change over time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.000"
                                            },
                                            "Text": {
                                                "val": "-  Implemented two complete hardware tagged security processors capable of defeating common vulnerabilities and supporting novel, provably secure prototype operating systems.\n-  Demonstrated full scale systems capable of detecting and recovering from penetrations.\n-  Scaled automatic patch generation to more complete coverage and to work on commercial scale systems.\n-  Automatically synthesized, using formal methods, hundreds of variants of a single distributed protocol, each of which is automatically proven correct.\n-  Implemented a compiler that generates thousands of unique variants of programs that are demonstrated to be robust against return oriented programming attacks.\n-  Developed a virtualization environment that provides improved security, better performance, and new functionality compared to current approaches. \n-  Demonstrated a web-application environment that employs information flow to produce applications with strong information confidentiality guarantees without requiring additional effort by the application developer in order to maintain the guarantees.\n-  Transitioned CRASH network software development, retroactive patching, and code anti-tamper technologies to commercial industry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.502"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate moving target defense with automatically constructed diverse implementations of algorithms and programs.\n-  Implement web-based application on secure operating systems and verify its resistance to attacks through heterogeneity.\n-  Produce formally-verified operating system kernel modules.\n-  Integrate tagged security processor prototypes with secure operating system, development environments for correct-by-design software, and multiple applications.\n-  Demonstrate roll-back and recovery on production-scale system with substantially reduced human involvement.\n-  Demonstrate, using policy weaving, automated implementation of security policies in applications and operating systems for a broad range of security policy frameworks.\n-  Transition CRASH research products into commercial router for military use."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.000"
                                            },
                                            "Text": {
                                                "val": "-  Produce and demonstrate automation tools for constructing formally-verified operating system kernels.\n-  Automatically produce diverse instantiations of one or more complete operating systems.\n-  Deliver web server that enables creation of secure web sites from untrusted code.\n-  Demonstrate real-time, continuous validation of system compliance with security specifications.\n-  Demonstrate the ability of two or more complete systems to block, survive, and recover from multiple attacks and automatically repair vulnerabilities. \n-  Validate security of systems and prototypes through red team and external challenges.\n-  Transition CRASH research products into one or more embedded systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Safer Warfighter Computing (SAFER)"
                                    },
                                    "Description": {
                                        "val": "The Safer Warfighter Computing (SAFER) program is creating a technology base for assured and trustworthy Internet communications and computation, particularly in untrustworthy and adversarial environments.  SAFER creates automated processes and technologies enabling military users to send and receive content on the Internet, utilizing commercially available hardware and software, in ways that avoid efforts to deny, locate, or corrupt communications.  SAFER is also developing technology for performing computations on encrypted data without decrypting it first through fully homomorphic encryption and interactive, secure multi-party computation schemes.  This will enable, for example, the capability to encrypt queries and compute an encrypted search result without decrypting the query.  This technology will advance the capability to run programs on untrusted hardware while keeping programs, data, and results encrypted and confidential.  This mitigates the important aspect of supply chain compromise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated enhanced security and availability capabilities with an order of magnitude increase in scalability and support for full web access in addition to existing applications.\n-  Performed initial independent, adversarial assessment of the effectiveness of SAFER technologies to prevent communication localization and detection.\n-  Continued development of decoy routing to support unblockable connectivity short of complete disconnection from the Internet.\n-  Implemented rich policy support for onion routing to enhance anonymity in the face of compromised routers.\n-  Performed initial, independent benchmarks of fully homomorphic encryption, garbled-circuit secure multiparty computation, and secret-sharing secure multiparty computation.\n-  Computed benchmarks of the fully homomorphic encryption evaluation of the Advanced Encryption Standard demonstrating more than an order of magnitude performance improvement.\n-  Started design for program-wide application programming interface (API) for encrypted computation using either fully homomorphic encryption or secure multiparty computation.\n-  Designed program-wide API for low level mathematics to support encrypted computation using either fully homomorphic encryption or secure multiparty computation.\n-  Demonstrated optimized software implementations of second generation fully homomorphic encryption algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.680"
                                            },
                                            "Text": {
                                                "val": "-  Perform follow up independent, adversarial assessment of the effectiveness of SAFER technologies to prevent communication localization and detection, including newly developed adversarial techniques.\n-  Demonstrate field programmable gate array implementation of fully homomorphic encryption offering an order of magnitude performance improvement over optimized software implementation.\n-  Perform follow-up, independent benchmarks of fully homomorphic encryption, garbled-circuit secure multiparty computation, and secret-sharing secure multiparty computation.\n-  Demonstrate two orders of magnitude improvement in performance of fully homomorphic encryption.\n-  Design program-wide APIs for cryptographic protocols to support encrypted computation using either fully homomorphic encryption or secure multiparty computation.\n-  Implement prototype for new programming language to support computation on encrypted data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.150"
                                            },
                                            "Text": {
                                                "val": "-  Integrate decoy routing, parallelized group messaging, dynamic traffic camouflage, and rendezvous strategy technologies into common internet browsing applications.\n-  Demonstrate safe, anonymous internet communications applications such as web access, Voice over Internet Protocol (VOIP), and streaming video, at scale.\n-  Conduct the final independent, adversarial assessment of the effectiveness of SAFER technologies to prevent communication localization and detection, including newly developed adversarial techniques.\n-  Reduce ciphertext expansion while improving software performance in fully homomorphic encryption, garbled-circuit secure multiparty computation, and secret-sharing secure multiparty computation, and perform independent benchmarks.\n-  Refine field programmable gate array implementation of fully homomorphic encryption to yield a further order of magnitude performance improvement over optimized software implementation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anomaly Detection at Multiple Scales (ADAMS)"
                                    },
                                    "Description": {
                                        "val": "The Anomaly Detection at Multiple Scales (ADAMS) program will develop and apply algorithms for detecting anomalous, threat-related behavior of systems, individuals, groups\/organizations, and nation-states over hours, days, months, and years.  ADAMS will develop flexible, scalable and highly interactive approaches to extracting actionable information from information system log files, sensors, and other instrumentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Prototyped a scalable, distributed architecture to correlate relevant data from heterogeneous sources over extended periods of time.\n-  Formulated techniques for determining whether a system, individual, or group\/organization is exhibiting anomalous behavior suggestive of a threat.\n-  Created an experimental testbed that includes real-world data sets at scale and supports novel red-teaming capabilities. \n-  Initiated assessment and validation of insider-threat indicators with counter-intelligence transition partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Refine and create techniques for detecting malicious insiders, delineate assumptions\/conditions under which they are valid\/invalid, and specify their effective combination.\n-  Create a comprehensive library of test data and quantify probabilities of detection and false alarm for anomalous non-threat and threat behaviors.  \n-  Develop technologies to manage the number of anomalies, focus computing resources on ambiguous results, and prioritize threats.\n-  Demonstrate the capability to identify anomalous behavior suggestive of a threat in real time on streaming data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.612"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.612"
                                            },
                                            "Text": {
                                                "val": "-  Develop and implement technology to capture analyst expertise for assessing and explaining detected anomalies and for incorporating such user feedback in ADAMS decision loops.\n-  Develop an integrated prototype anomaly\/threat detection system suitable for rapid deployment in an operational environment.\n-  Harden ADAMS prototype and obtain approval for use on military networks including DOD Information Assurance Certification and Accreditation Process (DIACAP) certification.\n-  Conduct and evaluate initial ADAMS implementation in an operational environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission-oriented Resilient Clouds*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Resilient Clouds\n\nThe Mission-oriented Resilient Clouds (MRC) program will create technologies to enable cloud computing systems to survive and operate through cyber attacks.  Vulnerabilities found in current standalone and networked systems will be amplified in cloud computing environments.  MRC will address this by creating advanced network protocols and new approaches to computing in potentially compromised distributed environments.  Particular attention will be focused on adapting defenses and allocating resources dynamically in response to attacks and compromises.  MRC will create new approaches to measuring trust, reaching consensus in compromised environments, and allocating resources in response to current threats and computational requirements.  MRC will develop new verification and control techniques for networks embedded in clouds that must function reliably in complex adversarial environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.389"
                                            },
                                            "Text": {
                                                "val": "-  Identified algorithmic advances and protocol re-design opportunities and requirements to achieve high levels of assurance in networked\/cloud computing systems.\n-  Delivered library of new algorithms and protocols for high-assurance computation in networked\/cloud computing systems.\n-  Developed techniques for presenting a diverse, changing target to attackers without impacting the usability of applications running on these systems.\n-  Created approaches and algorithms for expanding self-monitoring hosts into a cooperative self-monitoring cloud.\n-  Demonstrated new algorithms to dynamically reallocate prioritized network resources.\n-  Implemented a new resilient microkernel on both cloud and embedded hardware platforms.\n-  Refined cloud security requirements with DISA and focused specific projects on activities that will support future transitions into DISA and other DoD organizations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop new behavior-based algorithms for detecting compromised machines.\n-  Measure the effectiveness of new algorithms and protocols for high-assurance computing in cloud computing systems that are under attack.\n-  Validate that new components are addressing resilience goals through independent red-team assessments.\n-  Demonstrate a cloud computing environment that produces correct, mission-relevant results when individual computing and network elements have been compromised.\n-  Develop intrusion-tolerant communication protocols for cloud monitoring and control.\n-  Validate the extension of host-level monitoring and adaptation to cloud-level monitoring and adaptation.\n-  Begin evaluating multiple MRC technologies in DISA testbeds to facilitate transitions into DoD clouds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.071"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.071"
                                            },
                                            "Text": {
                                                "val": "-  Produce a cloud task allocation system that maximizes mission effectiveness by employing redundancy in the context of current system loads without significantly increasing hardware costs.\n-  Implement a trustworthy programmable switch controller.\n-  Demonstrate dynamic adjustment of replication and communications in response to estimated and predicted attack levels.\n-  Implement self-healing functionality for cloud applications.\n-  Transition MRC research products into DoD cloud environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Assurance Cyber Military Systems"
                                    },
                                    "Description": {
                                        "val": "The High Assurance Cyber Military Systems program will develop and demonstrate the technologies required to secure mission-critical embedded computing systems.  The DoD is making increasing use of networked computing in systems such as military vehicles, weapon systems, ground sensors, smartphones, personal digital assistants, and other communication devices.  This dependence makes it critically important that the embedded operating system provides high levels of inherent assurance.  This operating system must also integrate the computational, physical, and networking elements of the system while running on a processor with very limited size, weight, and power.  Consequently, it can only devote a limited share of its computational resources to security while satisfying hard real-time constraints.  Recent advances in program synthesis, formal verification techniques, low-level and domain-specific programming languages, and operating systems mean that fully verified operating systems for embedded devices may be within reach at reasonable costs.  Systems that admit static verification can provide both high assurance and high performance to avoid the many dynamic checks otherwise necessary to provide high assurance.  The program will develop, mature, and integrate these technologies to produce an embedded computing platform that provides a high level of assurance for mission-critical military applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.250"
                                            },
                                            "Text": {
                                                "val": "-  Performed detailed requirements and systems engineering analyses to identify embedded devices requiring high assurance levels and a corresponding concept of operations.\n-  Produced a high-level design for identified embedded computing platforms that provides a high level of assurance for military users.\n-  Developed approaches to reduce the time to produce high-assurance embedded systems by leveraging existing high assurance systems, both through a modular architecture and through tool reuse."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.064"
                                            },
                                            "Text": {
                                                "val": "-  Perform static and dynamic baseline assessments of selected militarily relevant vehicles before any modifications are made.\n-  Develop initial techniques and build prototype tools to assist in the rapid creation of high-assurance embedded computing systems on a variety of vehicles.\n-  Construct core pieces of a high-assurance embedded operating system and attack-resilient control system for two militarily relevant vehicles using developed tools and techniques.\n-  Formally verify full functional correctness for core operating system and targeted control-systems for selected vehicles.\n-  Demonstrate required security properties that follow from correctness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.117"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.117"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate compositionality which is the ability to construct high assurance systems out of high assurance components.\n-  Extend the core high-assurance embedded operating system with additional functionality, including automatically generated device drivers and communication protocols.\n-  Automatically synthesize correct-by-construction control systems from high-level specifications.\n-  Perform static and dynamic assessments after modifications are made on the militarily-relevant vehicles to evaluate the effectiveness of the synthesis and formal-methods tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vetting Commodity Computing Systems for the DoD*"
                                    },
                                    "Description": {
                                        "val": "*Previously part of High Assurance Cyber Military Systems\n\nThe Vetting Commodity Computing Systems for the DoD (VET) program will develop tools and methods to uncover backdoors and other hidden malicious functionality in the software and firmware on commodity IT devices.  The international supply chain that produces the computer workstations, routers, printers, and mobile devices on which DoD depends provides many opportunities for our adversaries to insert hidden malicious functionality.  VET technologies will also enable the detection of software and firmware defects and vulnerabilities that can facilitate adversary attack."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Create supply chain attack scenarios, formulate program analysis approaches, specify diagnostic tool functionality, develop relevant Application Programming Interfaces (APIs), and define formal semantics for the programming languages to be analyzed.\n-  Develop the initial infrastructure required to support the development of a sufficient number of challenge programs containing hidden malicious functionality to support realistic evaluations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.954"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.954"
                                            },
                                            "Text": {
                                                "val": "-  Produce initial prototype attack scenario generation, program analysis, and diagnostic tools.\n-  Produce initial set of challenge programs for use in the first competitive engagement.\n-  Perform the first competitive engagement between research and adversarial challenge performers to produce measurements of research progress against program metrics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Logan*"
                                    },
                                    "Description": {
                                        "val": "*Previously part of Cyber Fast Track\n\nThe Logan program will provide DoD enhanced capabilities to conduct Computer Network Attack (CNA). Techniques will be developed to disrupt and degrade adversary information systems and network operations, with particular interest in techniques likely to be robust to adversary countermeasure strategies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Formulate CNA techniques and implement in initial software routines.\n-  Develop manual prototypes for operational transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.100"
                                            },
                                            "Text": {
                                                "val": "-  Automate and test prototypes in conjunction with transition partner.\n-  Optimize and harden prototypes and complete transition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Cyber Analysis System (ICAS)*"
                                    },
                                    "Description": {
                                        "val": "*Previously part of Cyber Insider Threat (CINDER) in PE 0603760E, Project CCC-04.\n\nThe Integrated Cyber Analysis System (ICAS) program will develop techniques to automate the discovery of probes, intrusions, and persistent attacks on enterprise networks.  At present, discovering the actions of capable adversaries requires painstaking forensic analysis of numerous system logs by highly skilled security analysts and system administrators.  The ICAS program will develop technologies to correlate interactions and behavior patterns across all system data sources and thereby rapidly uncover aberrant events and detect compromise.  This includes technologies for automatically representing, indexing, and reasoning over diverse, distributed, security-related data and system files."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop techniques for transforming log\/system file formats into a unified schema as the basis for an actionable view of enterprise operational security.\n-  Develop indexing schemes specialized to system files\/security data and suitable for use across federated enterprise architectures.\n-  Develop a rigorous, quantitative, risk-management framework to serve as the basis for automated real-time network forensics and rapid detection of targeted attacks and persistent threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and implement algorithms for automatically identifying and quantifying specific security risks extant on an enterprise network.\n-  Integrate, evaluate, and optimize algorithms via testing against targeted attack\/persistent threat scenarios provided by potential DoD users.\n-  Initiate transition of the most promising technologies to enterprises throughout the DoD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Cyber Defense (ACD)"
                                    },
                                    "Description": {
                                        "val": "The Active Cyber Defense (ACD) program will enable DoD cyber operators to more fully leverage their inherent home field advantage when defending the cyber battlespace.  For example, in the cyber environment the defender has detailed knowledge of and unlimited access to the system resources that the attacker is attempting to compromise.  ACD technologies, drawn from discoveries realized in the Cyber Fast Track program, will build on these advantages and increase the attacker's work factor by enabling cyber defenders to counter adversary cyber tradecraft in real time."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Text": {
                                                "val": "-  Formulate concepts for shaping the cyber battlespace in ways that benefit cyber defenders.\n-  Develop approaches for countering adversary cyber tradecraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Text": {
                                                "val": "-  Implement techniques for countering adversary cyber tradecraft in early prototype software applications.\n-  Demonstrate and evaluate active cyber defense early prototypes and initial capabilities in exercises with transition partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Fast Track"
                                    },
                                    "Description": {
                                        "val": "The Cyber Fast Track program will create more flexible, responsive methods for securing computing systems that operate in challenging environments and will reduce security risk without requiring lengthy development cycles.  Under Cyber Fast Track, small agile teams will work under rapid development cycles to create cyber security applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Made 77 contract awards, 22 of which have already resulted in successful field demonstrations, covering a broad range of cyber security technologies including detection and correction of software vulnerabilities, mobile device security, penetration testing automation, trust, traffic analysis, and wireless security.\n-  Developed and demonstrated tools, methods, and techniques to reduce attack surface areas. \n-  Refined pop-up threat list with CYBERCOM and coordinated work with other potential transition sponsors including NSA, AFRL, and the Navy Cyber Warfare Development Group."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.800"
                                            },
                                            "Text": {
                                                "val": "-  Further expand outreach to additional potential customers\/transition sponsors.\n-  Complete efforts and transition technologies.\n-  Transition of the Cyber Fast Track business model to DoD agencies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Planning (RP)"
                                    },
                                    "Description": {
                                        "val": "The Rapid Planning (RP) program developed planning and replanning tools for rapid generation and adaptation of robust plans in the presence of uncertainty, imprecision, incomplete, and contradictory data and assumptions.  These enable the capability to monitor plans and continuously replan.  RP addressed the need for mathematical methods to improve optimization including new branch and bound, mixed integer programming, and sub-modularity methods."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.169"
                                            },
                                            "Text": {
                                                "val": "-  Developed tools to facilitate various aspects of the mission planning process including formal plan representation, task sequence and timing analysis, mixed-initiative\/man-machine interaction, and robust plan generation.\n-  Created a \"Mobile Task Assistant\" portable workflow\/collaborative planning application."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Software"
                                    },
                                    "Description": {
                                        "val": "The Trusted Software program addressed DoD demands for reliable and robust software using technology to diagnose software for inefficiencies, design errors, redundant code, and overall software inconsistencies.  Current software projects are massive, dynamic social efforts involving distributed teams of developers, marketers, and users.  Without the proper tools, the software engineers create errors and redundancies providing unintended and exploitable security flaws.  This program developed specific techniques for building and validating trustworthy software."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.093"
                                            },
                                            "Text": {
                                                "val": "-  Developed an approach for automatically detecting and correcting integer-related vulnerabilities in source code. \n-  Formulated a code protection technique that will provide a means to determine if an application is running in its original state or if it has been modified."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "IT-04"
                    },
                    "ProjectTitle": {
                        "val": "LANGUAGE TRANSLATION"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "66.430"
                        },
                        "CurrentYear": {
                            "val": "71.429"
                        },
                        "BudgetYearOne": {
                            "val": "75.098"
                        },
                        "BudgetYearOneBase": {
                            "val": "75.098"
                        },
                        "BudgetYearTwo": {
                            "val": "71.248"
                        },
                        "BudgetYearThree": {
                            "val": "57.941"
                        },
                        "BudgetYearFour": {
                            "val": "61.248"
                        },
                        "BudgetYearFive": {
                            "val": "56.248"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Language Translation project is developing powerful new technologies for processing foreign languages that will provide critical capabilities for a wide range of military and national security needs, both tactical and strategic.  The technologies and systems developed in this project will enable our military to automatically translate and exploit large volumes of speech and text in multiple languages obtained through a variety of means.  Current U.S. military operations involve close contact with a wide range of cultures and peoples.  The warfighter on the ground needs hand-held, speech-to-speech translation systems that enable communication with the local population during tactical missions.  Such tactical applications imply the need for two-way (foreign-language-to-English and English-to-foreign-language) translation.  Because foreign-language news broadcasts, web-posted content, and captured foreign-language hard-copy documents can provide insights regarding local and regional events, attitudes, and activities, language translation systems also contribute to the development of strategic intelligence.  Such strategic applications require one-way (foreign-language-to-English) translation.  Exploitation of the resulting translated content requires the capability to automatically collate, filter, synthesize, summarize, and present relevant information in near real-time."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Broad Operational Language Translation (BOLT)"
                                    },
                                    "Description": {
                                        "val": "The Broad Operational Language Translation (BOLT) program will enable communication regardless of medium (voice or text) or genre (conversation, chat, or messaging) through new approaches to automated language translation, human-machine multimodal dialogue, and language generation.  BOLT will enable warfighters and military\/government personnel to readily communicate with coalition partners and local populations and will enhance intelligence through better exploitation of all language sources.  The program will also enable sophisticated search of stored language information and analysis of the information by enabling machines to perform deep language comprehension."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.907"
                                            },
                                            "Text": {
                                                "val": "-  Developed algorithms for processing and translating the informal genres used in Arabic and Chinese internet chat by automatically analyzing and interpreting unstructured language and handling incorrect or incomplete syntax.\n-  Created and annotated two-million word web discussion group corpora for both Arabic and Chinese including translation, word alignment, and grammatical analysis.\n-  Developed databases, tools, and algorithms to analyze and translate Egyptian dialectal Arabic including methods to compute the differences in the lexicon, morphology, and grammar between Egyptian dialectal Arabic (used in informal settings) and Modern Standard Arabic (used in newswire and broadcasts).\n-  Developed initial methods and algorithms for machines to perform sophisticated search of informal genres including pragmatic analysis to retrieve information and remove redundancies.\n-  Developed the means to detect errors in automatic speech recognition (e.g., incorrect choice of homonyms) and implemented these to create robust bi-lingual human-human dialogue systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "44.062"
                                            },
                                            "Text": {
                                                "val": "-  Develop improved algorithms for processing and translating informal genres of Arabic and Chinese to enable comprehension of colloquialisms and idiomatic speech in a variety of dialects.\n- Expand the annotated corpora of Arabic and Chinese messages by adding new dialects and enhance utility by incorporating additional annotations.\n-  Use methods developed for Egyptian dialectal Arabic to develop databases, tools, and algorithms to analyze and translate a second Arabic dialect.\n-  Develop improved methods and algorithms for sophisticated search of informal genres of chats and messaging including techniques to remove redundancies through entailment analysis, synonym expansion, and homonym\/homograph disambiguation.\n-  Develop enhanced automatic speech recognition techniques capable of handling errors due to the occurrence of words outside the vocabulary of the machine as well as garbled speech and integrate these into a robust bi-lingual human-human dialogue system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.729"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.729"
                                            },
                                            "Text": {
                                                "val": "-  Develop a prototype robust machine translation system for colloquial Arabic and Chinese, handling multiple genres of text, conversational speech, disfluencies, and repetitions.\n-  Add spoken colloquial data to the Arabic and Chinese annotated corpora.\n-  Incorporate disambiguation capabilities into a robust machine translation prototype.\n-  Optimize methods and algorithms for sophisticated search of the informal genres of chats, messaging, and conversational speech.\n-  Improve the accuracy and usability of systems for human-human cross-language communication by incorporating robust error detection and correction techniques in human-machine dialogue systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deep Exploration and Filtering of Text (DEFT)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Deep Extraction from Text \n\nThe Deep Exploration and Filtering of Text (DEFT) program will enable automated extraction, processing, and inference of information from text in operationally relevant application domains.  A key DEFT emphasis is to determine the implied and hidden meaning in text through probabilistic inference, anomaly detection, and disfluency analysis. To accomplish this, DEFT will develop and apply formal representations for basic facts, spatial, temporal, and associative relationships, causal and process knowledge, textually entailed information, and derived relationships and correlated actions\/events.  DEFT inputs may be in English or in a foreign language and sources may be completely free-text or semi-structured reports, messages, documents, or databases.  DEFT will extract knowledge at scale for open source intelligence and threat analysis.  Planned transition partners include the intelligence community and operational commands."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.946"
                                            },
                                            "Text": {
                                                "val": "-  Develop methods to derive meaning from context for words that may have implicit or hidden meanings.\n-  Develop methods and algorithms to infer implicit information from multiple facts and statements.\n-  Implement algorithms to use domain knowledge to discover implicit\/hidden meaning, answer questions, and make predictions.\n-  Develop data sets and queries for science and technology, human-behavioral-social-cultural, and asymmetric threat domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.369"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.369"
                                            },
                                            "Text": {
                                                "val": "-  Develop methods and algorithms for reasoning about both explicitly and implicitly expressed opinions and beliefs.\n-  Develop methods for finding hidden meaning based on anomalous usages and disfluencies.\n-  Develop methods and algorithms for extracting causal and implied knowledge from a document or set of documents.\n-  Demonstrate feasibility of deep extraction and filtering for selected end-user applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robust Automatic Translation of Speech (RATS)"
                                    },
                                    "Description": {
                                        "val": "The Robust Automatic Transcription of Speech (RATS) program addresses conditions in which speech signals are degraded by distortion, reverberation, and\/or competing conversation.  Robust speech processing technologies will enable soldiers to hear or read clear English versions of what is being said in their vicinity, despite a noisy or reverberant environment.  RATS technology will isolate and deliver pertinent information to the warfighter by detecting periods of speech activity and discarding silent portions, determining the language spoken, identifying the speaker, and recognizing key words in challenging environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.895"
                                            },
                                            "Text": {
                                                "val": "-  Improved processing techniques for increasingly noisy environments, including speech activity detection, language identification, speaker identification, and keyword spotting.\n-  Evaluated technology on program-generated data.\n-  Worked with transition partners to obtain field-collected data to train and test systems in realistic environments as a precursor to transition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.421"
                                            },
                                            "Text": {
                                                "val": "-  Finalize successful processing techniques for noisy environments, including speech activity detection, language identification, speaker identification, and keyword spotting and research additional techniques.\n-  Conduct final test of training systems on field collected data and test systems in realistic environments.\n-  Transition to additional customers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multilingual Automatic Document Classification, Analysis and Translation (MADCAT)"
                                    },
                                    "Description": {
                                        "val": "The Multilingual Automatic Document Classification, Analysis and Translation (MADCAT) program is developing and integrating technology to enable exploitation of foreign language, hand-written documents.  This technology is crucial to the warfighter, as documents including notebooks, letters, ledgers, annotated maps, newspapers, newsletters, leaflets, pictures of graffiti, and document images captured in the field may contain extremely important time-sensitive information.  The MADCAT program will address this need by producing devices that will convert such captured documents from Arabic into readable English in the field.  MADCAT will substantially improve applicable technologies, in particular document analysis and optical character recognition\/optical handwriting recognition.  MADCAT will tightly integrate these improved technologies with translation technology and create prototypes for field trials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.870"
                                            },
                                            "Text": {
                                                "val": "-  Improved the accuracy of MADCAT techniques.\n-  Developed additional language independent and script independent technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Transition tightly integrated technology prototypes to military and intelligence operations centers.\n-  Train and test on larger sets of field collected data.\n-  Work with newly-collected field data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Global Autonomous Language Exploitation (GALE)"
                                    },
                                    "Description": {
                                        "val": "The Global Autonomous Language Exploitation (GALE) program created an integrated product enabling automated transcription and translation of foreign speech and text with targeted information retrieval.  When applied to foreign language broadcast media and web-posted content, GALE systems enhanced open-source intelligence and local\/regional situational awareness by reducing the cost and effort of translation and analysis.  GALE produced a fully-mature architecture and dramatically improved transcription and translation accuracy by broader exploitation of context.  GALE technology developed timely alerts for commanders and warfighters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.758"
                                            },
                                            "Text": {
                                                "val": "-  Supported incorporation of sophisticated search capabilities developed in the distillation task of GALE into selected systems.\n-  Transitioned technologies to new customers in the intelligence community and operational commands."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "IT-05"
                    },
                    "ProjectTitle": {
                        "val": "CYBER TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.483"
                        },
                        "CurrentYear": {
                            "val": "50.000"
                        },
                        "BudgetYearOne": {
                            "val": "60.467"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.467"
                        },
                        "BudgetYearTwo": {
                            "val": "61.848"
                        },
                        "BudgetYearThree": {
                            "val": "30.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cyber Technology project develops technology to increase the security of military information systems and the effectiveness of cyber operations.  Over the past decade the DoD has embraced net-centric warfare by integrating people, platforms, weapons, sensors, and decision aids.  Adversaries seek to limit this force multiplier through cyber attacks intended to degrade, disrupt, or deny military computing, communications, and networking systems.  Technologies developed under the Cyber Technology project will ensure DoD net-centric capabilities survive adversary cyber attacks and will enable new cyber-warfighting capabilities.  Promising technologies will transition to system-level projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Foundational Cyber Warfare (Plan X)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Cyber Situational Awareness\n\nThe Foundational Cyber Warfare (Plan X) program will develop technologies to enable comprehensive awareness and understanding of the cyber battlespace as required for visualizing, planning, and executing military cyber warfare operations.  This includes intelligence preparation of the cyber battlespace, indications and warning of adversary cyber actions, detection of cyber-attack onset, cyber-attacker identification, and cyber battle damage assessment.  Plan X will also create new graphical interfaces that enable intuitive visualization of events on hosts and networks to aid in the planning and execution of cyber warfare.  Plan X will extend operationally meaningful measures to project quantitatively the collateral damage of executed cyber warfare missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.350"
                                            },
                                            "Text": {
                                                "val": "-  Conceptualized new graphical interfaces enabling intuitive visualization of the cyber battlespace.\n-  Created a cyber warfare domain specific language prototype.\n-  Developed a robust list of cyber warfare scenarios that planners may encounter.\n-  Prototyped a cyber warfare planning optimization and verification engine."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.818"
                                            },
                                            "Text": {
                                                "val": "-  Finalize and implement the cyber warfare domain specific language.  \n-  Establish a testing infrastructure to simulate a real network topology of at least 5,000 nodes.\n-  Deliver a Plan X version 1.0 prototype working with static network topology snapshots.\n-  Initiate operation of a cyber planning and operations cell with military personnel.\n-  Prototype a hardened cyber weapon platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.000"
                                            },
                                            "Text": {
                                                "val": "-  Release a Plan X version 2.0 prototype working with dynamic network topology snapshots.\n-  Develop real-time network mapping updates and incorporate in planning and execution processes.\n-  Finalize concept of operations for a cyber planning and operations cell.\n-  Test on increasingly complex scenarios submitted by operational components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Crowd Sourced Formal Verification (CSFV)"
                                    },
                                    "Description": {
                                        "val": "The Crowd-Sourced Formal Verification (CSFV) program will create technologies that enable crowd-sourced approaches to securing software systems through formal verification.  Formal software verification is a rigorous method for proving that software has specified properties, but formal verification does not currently scale to the size of software found in modern weapon systems.  CSFV will enable non-specialists to participate productively in the formal verification process by transforming formal verification problems into user-driven simulations that are intuitively understandable."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.537"
                                            },
                                            "Text": {
                                                "val": "-  Began development of approaches for mapping high-level formal software verification problems into user-driven simulations.\n-  Identified and explored techniques for inferring specification and coding errors from the results of these simulations and for automatically generating the appropriate annotations.\n-  Began architecture design for web-based infrastructure to support large scale program verification workflows."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.182"
                                            },
                                            "Text": {
                                                "val": "-  Develop approaches for mapping high-level formal software verification problems into user-driven simulations.\n-  Develop techniques for inferring specification and coding errors from the solutions to these simulations and for automatically generating the appropriate annotations to aid formal verification.\n-  Develop web-based infrastructure to support large scale formal software verification workflows."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.230"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.230"
                                            },
                                            "Text": {
                                                "val": "-  Develop five web-based interactive computer simulations based on mapped high-level software specifications and codes.\n-  Launch public web site to attract the widest possible base for crowd-sourcing formal verifications.\n-  Map solutions as code annotations back into formal verification tools and assess the effectiveness of these solutions by verifying the absence of errors on the MITRE Common Weakness Enumeration\/SANS Institute Top 25 lists.\n-  Refine initial simulations and develop new simulations for greater verification effectiveness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Warfare Control System (CWCS)"
                                    },
                                    "Description": {
                                        "val": "The Cyber Warfare Control System (CWCS) program will create a semi-automated system that can sense and respond to cyber attacks more rapidly than human operators.  CWCS will combine fully-automated cyber defense with man-in-the-loop cyber offense to bring to bear the full range of cyber responses allowed under applicable policies.  Technologies to be developed and integrated may include anomaly detection, big data analytics, case-based reasoning, heuristics, game theory, and stochastic optimization.  The CWCS capability is needed because highly-scripted, distributed cyber attacks exhibit speed, complexity, and scale that exceed the capability of human cyber defenders to respond in a timely manner.  A CWCS prototype system should be capable of competing at a high level in cyber competitions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.237"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.237"
                                            },
                                            "Text": {
                                                "val": "-  Develop the high-level architecture for a semi-automated\/man-in-the-loop cyber warfare control system.\n-  Identify signals exploitable for cyber warfare and develop new instrumentation approaches for obtaining these signals.\n-  Develop a rigorous analytic formulation for cyber warfare using techniques from game theory, stochastic optimization, and other quantitative disciplines."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Camouflage, Concealment, and Deception (C3D)"
                                    },
                                    "Description": {
                                        "val": "The Cyber Camouflage, Concealment, and Deception (C3D) program is developing novel approaches for protecting cyber systems that mimic camouflage, concealment, and deception in the physical world.  These will make attackers expend more resources to achieve their goals and provide an asymmetric advantage for the defender.  C3D will enable the creation, deployment, management, and control of synthetic entities, objects, resources, and identities that produce uncertainties for attackers and make their task significantly more difficult, perhaps even intractable.  With C3D, infrastructure and other enterprise resources such as switches, servers, and storage could be virtually replicated to confound enemy targeting.  Decoy file systems could confuse attackers thereby greatly decreasing their odds for success."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.596"
                                            },
                                            "Text": {
                                                "val": "-  Developed a prototype web application security platform that enables operators to embed simulated vulnerabilities into existing production websites and uses a set of match, action, and report processes to target the activities of malicious insiders.\n-  Coordinated with network security and counter-intelligence personnel about the possibility of a pilot deployment on a particular military network."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a framework for the creation, deployment, management, and control of synthetic entities, objects, resources, and identities on enterprise information systems.\n-  Develop approaches for creating multiple plausible versions of file systems and data where provenance will be uncertain for the attacker.\n-  Explore techniques capable of deceiving an attacker into believing they have executed a successful phishing attack when in fact they have been deceived by an intelligent synthetic user."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}