{
    "id": "114dfe2bc8a41345f2f5b88e90d808795b6d5b57",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DISA_RDTE_JustificationBook_Defense_Information_Systems_Agency_PB_2014.zzz_unzipped_RDTE_JustificationBook_Defense_Information_Systems_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305208K"
        },
        "ProgramElementTitle": {
            "val": "Distributed Common Ground\/Surface Systems"
        },
        "R1LineItemNumber": {
            "val": "233"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "33.853"
            },
            "PriorYear": {
                "val": "3.154"
            },
            "CurrentYear": {
                "val": "3.247"
            },
            "BudgetYearOne": {
                "val": "3.348"
            },
            "BudgetYearOneBase": {
                "val": "3.348"
            },
            "BudgetYearTwo": {
                "val": "3.403"
            },
            "BudgetYearThree": {
                "val": "3.403"
            },
            "BudgetYearFour": {
                "val": "3.441"
            },
            "BudgetYearFive": {
                "val": "3.494"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "As the sole joint interoperability certification agent, the Joint Interoperability Test Command established and maintains a Distributed Development and Test Enterprise for the Department of Defense (DoD) Distributed Common Ground\/Surface System (DCGS) program, as directed by the Office of the Under Secretary of Defense (Intelligence).  DCGS is an integral and critical component of the overall DoD Intelligence, Surveillance, and Reconnaissance interoperability and data integration strategy which provides world-wide capabilities to receive, process, exploit, and disseminate data from airborne and national reconnaissance sensors\/platforms and commercial sources."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.154"
                },
                "CurrentYear": {
                    "val": "3.247"
                },
                "BudgetYearOne": {
                    "val": "3.384"
                },
                "BudgetYearOneBase": {
                    "val": "3.384"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.154"
                },
                "CurrentYear": {
                    "val": "3.247"
                },
                "BudgetYearOne": {
                    "val": "3.348"
                },
                "BudgetYearOneBase": {
                    "val": "3.348"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.036"
                },
                "BudgetYearOneBase": {
                    "val": "-0.036"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.036"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.036"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2014 decrease of -$0.036 supports higher Agency priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "NF1"
                    },
                    "ProjectTitle": {
                        "val": "Distributed Common Ground\/Surface Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "33.853"
                        },
                        "PriorYear": {
                            "val": "3.154"
                        },
                        "CurrentYear": {
                            "val": "3.247"
                        },
                        "BudgetYearOne": {
                            "val": "3.348"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.348"
                        },
                        "BudgetYearTwo": {
                            "val": "3.403"
                        },
                        "BudgetYearThree": {
                            "val": "3.403"
                        },
                        "BudgetYearFour": {
                            "val": "3.441"
                        },
                        "BudgetYearFive": {
                            "val": "3.494"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Joint Interoperability Test Command (JITC) coordinates with the Military Services and Defense Intelligence Agencies to conduct Joint\/Distributed Common Ground\/Surface System (DCGS) testing and analysis, including event coordination, configuration, instrumentation and integration functions on the Distributed Development and Test Enterprise (DDTE).  Under the DCGS Governance, this effort, referred to as the DCGS Test and Evaluation (T&E) Focus Team (FT), is composed of three parts:  the DDTE Focus Group, providing and sustaining a distributed development network; the Strategy Focus Group, looking at current and future net-enabled enterprise T&E methods; and the Execution Focus Group, which leverages the Strategy Focus Group’s methodologies in executing DCGS Enterprise assessment events, such as the annual DCGS demonstration, ENTERPRISE CHALLENGE.  These efforts improve systems engineering and T&E throughout all phases of the DCGS life-cycle, resulting in improved capabilities to share net-centric data and services between the DCGS Programs of Record (PoRs) and the overarching Defense Intelligence Information Enterprise (DI2E).\n\nOperates and maintains the DDTE, providing DCGS PoRs a virtual operationally relevant assessment environment maintaining connectivity between Service facilities, National Agency capabilities, and Coalition partners.  DDTE allows robust integration of modeling and simulation T&E capabilities across Joint DCGS events without introducing vulnerabilities to operational Command and Control networks and has enabled improvements in systems engineering, instrumentation and T&E throughout all phases of the DCGS life cycle. \n\nDCGS PoRs and Coalition partners use the DDTE network, which supports the net-centric maturity assessment of the DCGS Enterprise under the DCGS Governance, to integrate architecture, standards, and capabilities for implementation of the DCGS Integration Backbone and support the migration to net-centricity, including DCGS Enterprise services for the Military Departments, DCGS-Special Operations Forces and the DCGS Intelligence Community.  National Agency capabilities supporting DCGS include Geospatial Intelligence, Signals Intelligence, Measurement and Signature Intelligence and Human Intelligence, which are integrated and tested in the DDTE domain."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Common Ground\/Surface Systems (DCGS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.154"
                                            },
                                            "Text": {
                                                "val": "As part of the DCGS Governance, the Chair of the DCGS T&E FT continued to support DDTE and DI2E enhanced functionality with T&E capability and ability to include more Coalition partners through data sharing.  Provided Enterprise capabilities in a “storefront” context with web services that are visible, accessible, understandable, and interoperable (VAUSI) and can be implemented by DCGS PoRs.  Conducted six DCGS Enterprise Assessment events that measured the net-centric maturity of the DCGS Enterprise in accordance with the Enterprise Maturity Model (EMM) criteria, as defined by the DCGS community and periodically updated to keep pace with technological advances.  Supported both Enterprise Assessment and developmental test activities between PoRs, National Agencies, and Coalition nodes to refine and demonstrate enhanced capabilities for sharing of net-centric data and Enterprise web services.  Continued development and instrumentation for data collection and testing support on the 15 DCGS network domains and enclaves and leveraged existing PoR operational testing and interoperability testing\/certification efforts as data collection opportunities for Enterprise Assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.247"
                                            },
                                            "Text": {
                                                "val": "Continue supporting DDTE and providing enhanced automated assessment capabilities of net-centric data and web services.  Continue to determine the extent the DCGS data assets and services comply with the VAUSI metrics, and to ensure these metrics are captured by the EMM.  Provide Enterprise T&E support by continuing to measure the net-centric maturity of the DCGS Enterprise in accordance with the EMM criteria by conducting Enterprise-level assessments for the DCGS PoRs, National Agencies and Coalition Partners.  Continuing to develop instrumentation for data collection and testing support on the 15 DCGS network domains and enclaves.   \n\nThe increase of +$0.093 from FY 2012 to FY 2013 is due to the net effect of savings to support the Secretary of Defense initiative on improving DoD business operations and adjustments for inflation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.348"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.348"
                                            },
                                            "Text": {
                                                "val": "Will continue to support DDTE and provide enhanced functionality with expanding T&E capability, with a focus on increasingly automated evaluations of net-centric data and web services.  To further DCGS Enterprise capabilities, will determine the extent they comply with established VAUSI standards that make them available and accessible in a “storefront” that enhances the sharing of net-centric data and services.  Will host or provide access to a T&E framework that provides validated, automated test tools for compliance testing, and will support reciprocity with other T&E organizations using accepted T&E environments and tools to provide data for DCGS Enterprise maturity assessments.  Enterprise T&E support will continue to include Enterprise-level assessment events for the DCGS PoRs, National Agencies and Coalition Partners.  Will continue development and instrumentation for data collection and testing support on the 15 DCGS network domains and enclaves.  These efforts will continue to be measured by the EMM.\n\nThe increase of +$0.101 from FY 2013 to FY 2014 is due to the net effect of adjustments for inflation, program cost growth and transfers to support higher Agency priorities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Effective FY 2013, a T&E Mission Support Services (MSS) cost plus and firm fixed price contract will provide T&E support by performing a wide range of non-personal services to encompass testing, scientific, engineering, logistic, administrative, and ancillary support of the DISA T&E missions."
                        },
                        "PerformanceMetrics": {
                            "val": "The T&E Focus Team (FT) performs a minimum of three DCGS Enterprise assessments per year.  At the end of the year assessment results are consolidated into T&E FT input to the State of the Enterprise (SoE) Report.  A comparison of multi-year SoE Reports shows measurable DCGS Enterprise net-centric maturity progress. The T&E FT will also leverage Joint Interoperability Certification testing to support the evaluation of DCGS Enterprise maturity.  Of the six DCGS PoR systems, three hold current Joint Staff, Command, Control, Communications, & Computers\/Cyber (J6) Interoperability (IOP) Certifications, while the other three PoRs remain in prototype status, which precludes them from completing Joint IOP Certifications.  Efforts will continue to collect data on these emerging systems towards overall J6 IOP Certification as they mature.  Due to increased automation and advances in Enterprise maturity, the T&E FT increased the number of net-centric evaluations from approximately 150 data assets and 120 web services in 2011 to over 400 data assets and over 300 web services in 2012.  This effort provides the basis for the DCGS Enterprise Assessment, allowing the Office of the Under Secretary of Defense (Intelligence) to measure the level of maturity of the DCGS Enterprise supporting the DCGS Governance."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "In-House Contracts"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "N\/A"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "N\/A"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.350"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.766"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.974"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.004"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.004"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering\/Technical Services 1"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Interop"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Hua, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.247"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.443"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.690"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.690"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering\/Technical Services 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NGMS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Hua, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.078"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.511"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.589"
                                                    },
                                                    "TargetValue": {
                                                        "val": "12.589"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering\/Technical Services 3"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NGIT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Hua, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.178"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.434"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.612"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.612"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.273"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.344"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.344"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "DCGS T&E IPT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Connectivity to Other Testbeds & Test Event Conduct"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Operation and Maintenance Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}