{
    "id": "13bf24e55257e22f7f6d15f30cb417a6edf82e0f",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DARPA_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603286E"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED AEROSPACE SYSTEMS"
        },
        "R1LineItemNumber": {
            "val": "37"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "94.303"
            },
            "CurrentYear": {
                "val": "174.316"
            },
            "BudgetYearOne": {
                "val": "149.804"
            },
            "BudgetYearOneBase": {
                "val": "149.804"
            },
            "BudgetYearTwo": {
                "val": "184.227"
            },
            "BudgetYearThree": {
                "val": "183.422"
            },
            "BudgetYearFour": {
                "val": "183.281"
            },
            "BudgetYearFive": {
                "val": "183.923"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Aerospace Systems program element is budgeted in the Advanced Technology Budget Activity because it addresses high pay-off opportunities to dramatically reduce costs associated with advanced aeronautical systems and provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  Research and development of integrated system concepts, as well as enabling vehicle subsystems will be conducted.  Studies conducted under this project include examination and evaluation of emerging aerospace threats, technologies, concepts, and applications for missiles, munitions, and vehicle systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "98.878"
                },
                "CurrentYear": {
                    "val": "174.316"
                },
                "BudgetYearOne": {
                    "val": "124.530"
                },
                "BudgetYearOneBase": {
                    "val": "124.530"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "94.303"
                },
                "CurrentYear": {
                    "val": "174.316"
                },
                "BudgetYearOne": {
                    "val": "149.804"
                },
                "BudgetYearOneBase": {
                    "val": "149.804"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.575"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "25.274"
                },
                "BudgetYearOneBase": {
                    "val": "25.274"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.880"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.695"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "25.274"
                                },
                                "BudgetYearOneBase": {
                                    "val": "25.274"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012:  Decrease reflects reductions for the SBIR\/STTR transfer and internal below threshold reprogrammings. \nFY 2014:  Increase reflects continuation of Long Range Anti-Ship Missile Demonstration program efforts and expanded research in Hypersonics."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AIR-01"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED AEROSPACE SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "94.303"
                        },
                        "CurrentYear": {
                            "val": "174.316"
                        },
                        "BudgetYearOne": {
                            "val": "149.804"
                        },
                        "BudgetYearOneBase": {
                            "val": "149.804"
                        },
                        "BudgetYearTwo": {
                            "val": "184.227"
                        },
                        "BudgetYearThree": {
                            "val": "183.422"
                        },
                        "BudgetYearFour": {
                            "val": "183.281"
                        },
                        "BudgetYearFive": {
                            "val": "183.923"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Aerospace Systems program element is budgeted in the Advanced Technology Budget Activity because it addresses high pay-off opportunities to dramatically reduce costs associated with advanced aeronautical systems and provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  Research and development of integrated system concepts, as well as enabling vehicle subsystems will be conducted.  Studies conducted under this project include examination and evaluation of emerging aerospace threats, technologies, concepts, and applications for missiles, munitions, and vehicle systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Triple Target Terminator (T3)"
                                    },
                                    "Description": {
                                        "val": "The Triple Target Terminator (T3) program will develop a high speed, long-range missile that can engage air, cruise missile, and air defense targets.  T3 would be carried internally on stealth aircraft or externally on fighters, bombers, and UAVs.  The enabling technologies are: propulsion, data links, and digital guidance and control.  T3 would allow any aircraft to rapidly switch between air-to-air and air-to-surface capabilities.  T3's speed, maneuverability, and network-centric capabilities would significantly improve U.S. aircraft survivability and increase the number and variety of targets that could be destroyed on each sortie.  The program is jointly funded with, and will transition to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.720"
                                            },
                                            "Text": {
                                                "val": "-  Conducted hardware-in-the-loop integrated subsystem testing.\n-  Conducted propulsion system ground testing.\n-  Completed fabrication of small form factor radios for network testing and design integration.\n-  Initiated range coordination with Point Mugu Test Range to receive flight test approval."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "38.500"
                                            },
                                            "Text": {
                                                "val": "-  Fabricate and ground test flight test articles.\n-  Obtain final flight test approval from Point Mugu Test Range.\n-  Conduct captive carry test of flight test articles.\n-  Conduct separation and boost tests of flight test articles.\n-  Begin airborne launch demonstrations of test articles against three target types."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete airborne launch demonstrations of test articles against three target types.\n-  Complete and deliver final test report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Close Air Support (PCAS)"
                                    },
                                    "Description": {
                                        "val": "The Persistent Close Air Support (PCAS) program will significantly increase close air support (CAS) capabilities by developing a system to allow continuous CAS availability and lethality to the supported ground commander.  The enabling technologies are: manned\/unmanned attack platforms, next generation graphical user interfaces, data links, digital guidance and control, and advanced munitions.  PCAS will demonstrate the ability to digitally task a CAS platform from the ground to attack multiple\/simultaneous targets.  PCAS will allow the Joint Tactical Air Controller (JTAC) the ability to rapidly engage multiple moving targets simultaneously within the area of operation.  PCAS's ability to digitally task a CAS platform to attack multiple\/simultaneous targets would improve U.S. ground forces operations and speed of attack.  The system will be designed to reduce collateral damage and potential fratricide to friendly forces.  The anticipated transition partner is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Text": {
                                                "val": "-  Conducted system requirements reviews of the unmanned A-10 demonstration aircraft and prototype JTAC kit.\n-  Conducted preliminary design reviews to encapsulate trade studies, technology maturation plan, and program risk reduction activities to begin integration of PCAS A-10 and JTAC kit components.\n-  Completed government furnished equipment transfer of A-10 aircraft, LITENING Targeting pods, and targeting software.\n-  Secured munitions acquisitions and test range support for demonstration planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.249"
                                            },
                                            "Text": {
                                                "val": "-  Integrate subcomponent developer critical enabling technology components into system integrator A-10 and JTAC kit designs.\n-  Perform field testing of Government furnished JTAC targeting software with Service partners.\n-  Perform modifications to unmanned A-10 demonstration aircraft and conduct software and hardware ground testing.\n-  Complete designs of next generation JTAC kit and perform hardware and software breadboard testing.\n-  Continue modifications to the unmanned A-10 demonstration aircraft based on software and hardware ground testing results.\n-  Conduct flight tests of unmanned A-10 aircraft for preliminary safety evaluations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.304"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.304"
                                            },
                                            "Text": {
                                                "val": "-  Perform ground test of A-10 demonstration aircraft vehicle management system, flight controls, and weapons employment architecture.\n-  Conduct flight tests of unmanned A-10 systems and LITENING targeting Pod with advanced datalink capabilities.\n-  Complete hardware\/software fabrication and field test of prototype PCAS kit for dismounted JTAC.\n-  Conduct technical readiness review of A-10 systems and JTAC kit.\n-  Prepare for live fire demonstrations of PCAS demonstration system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Anti-Ship Missile Demonstration (LRASM)"
                                    },
                                    "Description": {
                                        "val": "In response to emerging threats, DARPA is building on recent technology advances to develop and demonstrate standoff anti-ship strike technologies to reverse the significant and growing U.S. naval surface strike capability deficit.  The Long Range Anti-Ship Missile (LRASM) program is investing in advanced component and integrated system technologies capable of providing a dramatic leap ahead in U.S. surface warfare capability focusing on organic wide area target discrimination in a network denied environment, innovative terminal survivability in the face of advanced defensive systems, and high assurance target lethality approaches.  Specific technology development areas will include: robust precision guidance, navigation and control with GPS denial, multi-modal sensors for high probability target identification in dense shipping environments, and precision aimpoint targeting for maximum lethality.  Component technologies are being developed, demonstrated, and integrated into a complete weapon system.  The program will result in a high fidelity demonstration to support military utility assessment.  LRASM is a joint DARPA\/Navy effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.015"
                                            },
                                            "Text": {
                                                "val": "-  Developed integrated hardware-in-the-loop platforms.\n-  Completed missile seeker captive carry testing against surrogate targets.\n-  Held critical design review for long range target sensor.\n-  Completed integrated system detail designs.\n-  Completed weapon data link ground testing.\n-  Commenced fabrication, assembly, integration, and checkout of flight test vehicles for initial incremental test events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "39.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct high fidelity independent government performance assessment of detailed designs against key performance criteria.\n-  Update supporting documentation including concepts of operations, flight test and safety plans, lifecycle cost estimates, and transition plans.\n-  Complete final integration and checkout of guided test vehicles in preparation for flight testing.\n-  Complete end-to-end system flight demonstrations.\n-  Validate demonstrated system performance.\n-  Modify booster adapter structure which mates standard Mk-114 booster clamp to missile body aft end.\n-  Complete detailed design of new hybrid canister with solid-wall section on forward end and corrugated side panels on aft end.\n-  Analyze shock and fly-out performance for the missile and canister.\n-  Complete minor airframe design modifications for canister fit and internal structure\/composite skin strengthened to react to vertical launch loads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete missile and canister integration for a surface launched system.\n-  Perform two controlled test vehicle flights from the Vertical Launching System."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aerospace System Concepts"
                                    },
                                    "Description": {
                                        "val": "Studies conducted under this program examine and evaluate emerging aerospace technologies and system concepts for applicability to military use.  This includes the degree and scope of potential impact\/improvements to military operations, mission utility, and warfighter capability.  Studies are also conducted to analyze emerging aerospace threats along with possible methods and technologies to counter them.  The feasibility of achieving potential improvements, in terms of resources, schedule, and technological risk, is also evaluated.  The results from these studies are used, in part, to formulate future programs or refocus ongoing work.  Topics of consideration include: methods of defeating enemy anti-aircraft attacks; munition technologies to increase precision, range, endurance, and lethality of weapons for a variety of mission sets; novel launch systems; air vehicle control, power, propulsion, materials, and architectures; and payload and cargo handling systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted modeling and simulation of system architectures and scenarios.\n-  Performed feasibility experiments of candidate technologies and system concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform trade studies and modeling and simulation for novel technologies.\n-  Conduct enabling technology and sub-system feasibility experiments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Define performance constraints and determine design flexibility.\n-  Validate sub-system performance and conduct sub-system risk reduction testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Hypersonics (IH)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Hypersonic Technologies\n\nThe goal of the Integrated Hypersonics (IH) program is to develop, mature, and test next-generation technologies needed for global-range, maneuverable, hypersonic flight at Mach 20 and above for missions ranging from time-critical, survivable transport to conventional prompt global strike.  IH seeks technological advances in the areas of: next generation aero-configurations; thermal protection systems and hot structures; adaptive guidance, navigation, and control; enhanced range and data collection methods; and advanced propulsion concepts, including real-time trajectory planning.  The IH program is designed to address technical challenges and improve understanding of long-range hypersonic flight through an initial full-scale baseline test of an existing hypersonic test vehicle, followed by a series of subscale flight tests, innovative ground-based testing, expanded modeling and simulation, and advanced analytic methods, culminating in a test flight of a full-scale hypersonic demonstrator.  This program will leverage advances made by the previously funded Falcon program.  The Integrated Hypersonics (IH) program results are planned for transition to the Air Force."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "38.000"
                                            },
                                            "Text": {
                                                "val": "-  Implement improvements in highly coupled hypersonic toolsets incorporating assessed uncertainties of key technologies from prior flight tests and ground testing.\n-  Refine hypersonic boost glide knowledge base and designs through enhanced developmental testing in the areas of aerodynamics, aerothermodynamics, guidance, navigation and control, instrumentation, vehicle recovery, and propulsion.\n-  Improve high temperature materials base for hypersonic flight and re-entry vehicles applications through improved manufacturing, modeling, and ground based testing.\n-  Improve flight test range asset affordability and mission flexibility including options for large scale telemetry collection.\n-  Initiate focused hypersonic technology development efforts to advance the state-of-the-art in analytic methods, computational modeling and simulation, and ground-based testing of technologies for the future demonstration flight.\n-  Perform long-lead procurement and sub-system builds and begin assembly, integration, and ground testing of a baseline hypersonic technology test flight vehicle utilizing an existing aeroshell and incorporating refined modeling, toolsets, and design, in preparation for flight test."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "45.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "45.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete assembly, integration, and ground testing of a baseline hypersonic technology test flight vehicle.\n-  Complete launch vehicle assembly, integration, and ground testing in preparation for the baseline flight.\n-  Complete baseline flight range planning and range safety activities; and begin procurement of baseline flight test range assets.\n-  Conduct ground-based testing and subscale flight tests to mature next generation aero-configurations thermal protection systems and hot structures; adaptive guidance, navigation, and control; enhanced range and data collection methods; and advanced propulsion technologies.\n-  Develop preliminary design configurations of a full-scale demonstrator incorporating next generation technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactically Exploited Reconnaissance Node (TERN)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly VTOL (Vertical Take-Off and Landing) X-Plane\n\nThe goal of the Tactically Exploited Reconnaissance Node (TERN) is to dramatically advance the aviation capability of smaller, lower-cost ships.  The program will demonstrate the technology for launch and recovery of large, medium altitude, long-endurance aircraft capable of providing persistent 24\/7 Intelligence, Surveillance, and Reconnaissance (ISR) and strike capabilities at long radius orbits.  By extending the ISR\/strike radius and simultaneously increasing time on station beyond current capabilities from smaller ships, TERN will enable novel operational concepts including responsive, persistent deep overland ISR\/strike without requirement for forward basing.  To achieve these goals, the program will create new concepts for aircraft launch and recovery, aircraft logistics and maintenance, and aircraft flight in regimes associated with maritime operating conditions.  The program will culminate in a launch and recovery demonstration.  Application of TERN technologies and operationally concepts will enable a novel and cost efficient approach for mission sets including ship identification, overland or maritime surveillance, and strike.  The anticipated transition partner is the Navy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.600"
                                            },
                                            "Text": {
                                                "val": "-  Perform launch and recover technique evaluations and trade studies.\n-  Perform studies on integration with existing Service systems and systems architectures.\n-  Study aircraft design trades and approaches to best meet performance goals at minimum lifecycle cost."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Begin development of simulation and control schemes to achieve high precision approach.\n-  Identify existing aircraft content suitable for reuse and re-purposing for TERN application.\n-  Identify equipment and interface requirements for ship segment.\n-  Conduct enabling technology, component, and sub-system feasibility trades and experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Air Dominance Study"
                                    },
                                    "Description": {
                                        "val": "The Next Generation Air Dominance study will define the projected threat domains and capability gaps for the 2020-2050 timeframe.  DARPA will conduct a study of current air dominance efforts in coordination with the United States Air Force and Navy and explore potential technology developmental areas to ensure the air superiority of the United States in the future.  The study will consider roles of manned and unmanned platforms; the relative performance of alternative integrated systems concepts that combine various mixes of capabilities networked together; and the cost effectiveness of alternative balances of platforms and systems that provide surveillance, command and control, electronic warfare, and weapons functions.  Innovative platform concepts for airframe, propulsion, sensors, weapons integration, avionics, and active and passive survivability features will be explored as a central part of the concept definition effort.  This effort will also explore the expanded development and use of automated and advanced aerospace engineering design tools, modeling, and simulation in areas that can increase the likelihood of producing more capable products with improved efficiency.  Following the initial multi-agency study, DARPA will present technical challenges to industry to allow them to explore and present potential solutions.  Enabling technologies are next generation platforms, advanced networking capabilities, reliable navigation, passive and active defense, electronic attack, area denial, advanced sensors, and cyber technologies.  After the study, it is envisioned that high potential prototype programs will emerge to develop technologies for future air dominance.  Early planning for future technologies will also help to define the funding baselines for DOD research and development and acquisition programs.   This effort is funded from PE 0602702E, Project TT-07, and from PE 0603286E, Project AIR-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Define projected 2020-2050 threat domains and capability gaps.\n-  Identify funded baselines for DoD efforts for R&D and acquisition.\n-  Identify high value technologies and prototype opportunities.\n-  Out-brief senior leadership on threat picture and high value opportunities.\n-  In-brief industry and obtain feedback on potential technology opportunities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate technology and prototype developments.\n-  Conduct Technical Interchange Meeting (TIM) to coordinate between development efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Sensor Is Structure (ISIS)"
                                    },
                                    "Description": {
                                        "val": "The joint DARPA\/Air Force Integrated Sensor Is Structure (ISIS) program is developing a sensor of unprecedented proportions that is fully integrated into a stratospheric airship that will address the nation's need for persistent wide-area surveillance, tracking, and engagement for hundreds of time-critical air and ground targets in urban and rural environments.  ISIS is achieving radical sensor improvements by melding the next-generation technologies for enormous lightweight antenna apertures and high-energy density components into a highly integrated lightweight multi-purpose airship structure - completely erasing the distinction between payload and platform.  The ISIS concept includes ninety-nine percent on-station 24\/7\/365 availability for simultaneous Airborne Moving Target Indicator (AMTI) (600 kilometers) and Ground-Based Moving Target Indicator (GMTI) (300 kilometers) operation; ten years of autonomous, unmanned flight; hundreds of wideband in-theater concealed communications links; responsive reconstitution of capabilities lost by any failed space assets; plus CONUS-based sensor analysis and operation.  The ISIS technologies will be made available to the Air Force and other Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed radar panel manufacturing process validation.\n-  Developed power system long-term bench testing.\n-  Completed envelope material seaming process development.\n-  Completed risk reduction plan."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Test assembly and electro-mechanics of radar panels on pill structure.\n-  Implement radar risk reduction by testing antenna panels in a system integration laboratory for calibration and metrology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Refine antenna panel design based upon calibration and metrology results.\n-  Incorporate and test panels with radar componentry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vulture"
                                    },
                                    "Description": {
                                        "val": "The objective of the Vulture program is to demonstrate the required technology to enable an airborne payload to remain persistently on-station, uninterrupted and unreplenished, for over five years performing strategic and tactical communications, position\/navigation\/timing (PNT) and intelligence, surveillance, and reconnaissance missions over an area of interest.  Vulture technology enables a re-taskable, persistent pseudo-satellite capability, in a notional aircraft package.  The technology challenges include structural integrity of very lightly-loaded airframe structure, efficient and reliable energy collection, storage\/retrieval and management, and reliability technologies capable of allowing the aircraft to operate continuously for five years.  The remaining Vulture program will conduct subscale demonstration activities to prove out critical technologies.  The anticipated transition partners are the Air Force and Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed system preliminary design review.\n-  Completed anti-reflective coating trade studies.\n-  Completed solar spectrum analysis.\n-  Initiated solid oxide fuel cell (SOFC) power density and degradation testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct power subsystem critical design review.\n-  Conduct tests of anti-reflective coatings.\n-  Complete solar array fatigue testing.\n-  Develop engineering ground demonstrator and flight-like ground demonstrator for energy storage system.\n-  Conduct engineering ground demonstration testing.\n-  Conduct flight-like ground demonstration testing.\n-  Generate final report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative Hypersonic Research (CHR)"
                                    },
                                    "Description": {
                                        "val": "The Collaborative Hypersonic Research (CHR) program will leverage sub-scale boost-glide hypersonic flight vehicles as risk-reduction activities for full-scale maneuvering flight vehicles envisaged in the Integrated Hypersonics program.  CHR will establish a deeper foundation of data and investigate aero\/thermal and guidance, navigation and control challenges and establish parametric similarity frameworks and tools.  By incrementally tackling key technology areas while updating the modeling and simulation (M&S) capabilities, CHR will provide key information to the conventional prompt global strike and hypersonics communities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.967"
                                            },
                                            "Text": {
                                                "val": "-  Develop baseline designs sub-scale boost-glide hypersonic flight test vehicles.\n-  Develop a parametric similarity framework to generalize sub-scale flight results to a wide spectrum of hypersonic vehicle designs.\n-  Evaluate plans for sub-scale flight testing to support full-scale hypersonics development activities.\n-  Assess launch vehicle and range options across the Services and international partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous High Altitude Long Endurance (HALE) Refueling (AHR)"
                                    },
                                    "Description": {
                                        "val": "The Autonomous High Altitude Long Endurance (HALE) Refueling (AHR) program demonstrated high altitude refueling capabilities between unmanned aircraft.  The program used two NASA RQ-4 Global Hawk unmanned aircraft as surrogate platforms to inform the development of next generation HALE aircraft built around aerial refueling, which has proven vital to manned military aviation.  Specific challenges included precise control of limited flight performance aircraft under high-altitude conditions, redundant safe separation, and complex unmanned flight operations.  The program also promoted the application of autonomy for better effectiveness, efficiency, and safety in challenging environments.  The anticipated transition partners are the Air Force and Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.068"
                                            },
                                            "Text": {
                                                "val": "-  Completed aircraft component installations and software validation.\n-  Conducted flight tests and demonstrated key capabilities for refueling.\n-  Conducted aerial refueling close formation flight demonstration.\n-  Completed data analysis and documented autonomous aerial refueling lessons learned."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Integrated Sensor Is Structure"
                                    },
                                    "Title": {
                                        "val": "Air Force PE 0305205F Project 675372F"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.900"
                                        },
                                        "CurrentYear": {
                                            "val": "21.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Integrated Sensor Is Structure:"
                                    },
                                    "Title": {
                                        "val": "Air Force PE 0603203F Project 665A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.200"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "LRASM"
                                    },
                                    "Title": {
                                        "val": "Navy"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "25.500"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Triple Target Terminator (T3)"
                                    },
                                    "Title": {
                                        "val": "Air Force"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.050"
                                        },
                                        "CurrentYear": {
                                            "val": "41.730"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}