{
    "id": "13f0ce852c9252859f661b182e5a25b0462dd4da",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA3_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603005A"
        },
        "ProgramElementTitle": {
            "val": "Combat Vehicle and Automotive Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "33"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "142.833"
            },
            "CurrentYear": {
                "val": "104.359"
            },
            "BudgetYearOne": {
                "val": "97.043"
            },
            "BudgetYearOneBase": {
                "val": "97.043"
            },
            "BudgetYearTwo": {
                "val": "104.204"
            },
            "BudgetYearThree": {
                "val": "92.861"
            },
            "BudgetYearFour": {
                "val": "104.145"
            },
            "BudgetYearFive": {
                "val": "105.582"
            }
        },
        "ProgramElementNote": {
            "val": "Not applicable for this item."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures, integrates and demonstrates combat and tactical vehicle automotive technologies that enable a lighter, more mobile and more survivable force.  Project 221 matures and demonstrates protection and survivability technologies such as active protection systems (APS), advanced vehicle armors, blast mitigation and safety devices to address both traditional and asymmetric threats to ground vehicles.  Project 441 matures and demonstrates advanced ground vehicle power and mobility technologies such as powertrains, power generation and storage, force projection, microgrids and running gear subsystems for military ground vehicles to enable a more efficient, mobile and deployable force.  Project 497 matures, integrates, and demonstrates vehicle electronics hardware (computers, sensors, communications systems, displays, and vehicle command\/control\/driving mechanisms) and software that result in increased crew efficiencies, vehicle performance, reduced size, weight, and power (SWaP) burdens and vehicle maintenance costs.  Project 515 matures and demonstrates unmanned ground vehicle (UGV) technologies with a focus on sensors, perception hardware and software, and robotic control algorithms that enable UGV systems to maneuver on- and off-road at speeds which meet mission requirements with minimal human intervention.  \n \nWork in this PE is coordinated with, PEs 0602105A (Materials), 0602120A (Sensors and Electronic Survivability, Robotics Technology), 0602601A (Combat Vehicle and Automotive Technology), 0602618A (Ballistics Technology), 0602624A (Weapons and Munitions Technology), 0602705A (Battery\/Ind Power Technology), 0603004A (Weapons and Munitions Advanced Technology), and 0708045A (Manufacturing Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n \nWork in this PE is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, Michigan."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "145.914"
                },
                "CurrentYear": {
                    "val": "104.359"
                },
                "BudgetYearOne": {
                    "val": "103.140"
                },
                "BudgetYearOneBase": {
                    "val": "103.140"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "142.833"
                },
                "CurrentYear": {
                    "val": "104.359"
                },
                "BudgetYearOne": {
                    "val": "97.043"
                },
                "BudgetYearOneBase": {
                    "val": "97.043"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.081"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-6.097"
                },
                "BudgetYearOneBase": {
                    "val": "-6.097"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.508"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.573"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-6.097"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.097"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "221"
                    },
                    "ProjectTitle": {
                        "val": "Combat Veh Survivablty"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "42.666"
                        },
                        "CurrentYear": {
                            "val": "53.322"
                        },
                        "BudgetYearOne": {
                            "val": "49.513"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.513"
                        },
                        "BudgetYearTwo": {
                            "val": "48.617"
                        },
                        "BudgetYearThree": {
                            "val": "43.864"
                        },
                        "BudgetYearFour": {
                            "val": "48.076"
                        },
                        "BudgetYearFive": {
                            "val": "48.504"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures, integrates and demonstrates protection and survivability technologies such as active protection systems (APS), advanced vehicle armors, blast mitigation and occupant safety devices to address both conventional and asymmetric threats to ground vehicles. This project integrates complimentary survivability technologies to enable advanced protection suites, providing greater survivability and protection against emerging threats.\n\nWork in this project supports the Army S&T Ground Portfolio. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this project is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, Michigan."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Active Protection Systems (APS) against Kinetic Energy (KE) and Long-Range Threats:"
                                    },
                                    "Description": {
                                        "val": "This effort conducts essential trade studies, technical evaluations, and demonstrations of APS components\/subsystems designed for protection against KE penetrators and long-range threats. Coordinated work is also being conducted under Program Elements (PE) 0602624A, 0603004A, and 0603313A."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support closeout of KE APS program including collection and archiving of documents and artifacts enabling knowledge preservation and transition feasibility."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Wheeled Vehicle (TWV) Survivability:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates viable integrated survivability suites that can be tailored to meet current and future threats for light, medium, and heavy tactical wheeled vehicles. Coordinated work is also being performed under Program Elements (PE) 0602601A, 0602618A, and 0602105A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Applied the lessons learned from the systems engineering evaluation and survivability suite; began work on an optimized suite of survivability systems that focused on convoy protection; defined, fabricated, integrated and evaluated an advanced active protection system for tactical vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vision Protection:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and integrates devices to protect occupant's eyes, vehicle cameras and electro-optic fire control systems against anti-sensor laser devices as well as reduce the sensor's optical signature. Anti-sensor laser devices can deny vision either temporarily or permanently, by flooding the sensor with too much light (jamming) or by damaging the sensor. These jamming or damaging effects can slow our battle tempo, disrupt fire control solutions, or prevent vehicles from completing their mission entirely. This effort focuses on optical systems that protect sensors to maintaining fire control capability, situational awareness and protect Warfighter vision from pulsed, continuous wave and future laser threats. Coordinated work is also being performed in Program Elements (PE) 0602120A, 0602705A, 0602712A, and 0602786A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.566"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated vision protection technologies at TRL 6; explored application of protection techniques to other Heavy Brigade platforms and performed laboratory assessments to address evolving threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a laser-protected optical design for the Abrams Gunner's Primary Sight providing protection for the gunner's eye; design and integrate a laser-protected day camera solution for the gunner."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.947"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.947"
                                            },
                                            "Text": {
                                                "val": "This effort will initiate vulnerability studies of electro-optical (day-camera) sensors against pulsed-laser energy threats to determine pixel, column and kill energy levels for the sensors; will refine the integration technique required to apply the laser protection technology to those sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armor Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates, integrates and evaluates advanced ground vehicle armor systems such as emerging base armor, applique armor, multifunctional armor systems (embedded antennas and health monitoring devices); matures scalable \/ modular \/ common armor system integration design standards; creates armor system test & evaluation standards; refines armor modeling and simulation system engineering process; matures armor system manufacturing processes. This effort is done in coordination with efforts in 0602601A, project C05."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.323"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated and evaluated combat and tactical wheeled vehicle armor recipes and improved mine kit designs against objective threats while reducing armor weights; integrated armors on demonstrator vehicles and began performance evaluations; validated platform-level mine-blast response modeling and simulation tools to include crew\/occupant response to support system level analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.970"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate various methods for reducing delamination and rock strike damage of transparent armor and demonstrates improved performance while maintaining armor visual transparency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.004"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "This effort will mature and integrate advanced tactical and combat vehicle armor technologies by performing environmental, automotive and ballistic testing; will explore new integration techniques for armor systems; and will procure long-lead for future integrated armor attachment durability performance testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Performance Lightweight Track (Blast Mitigation):"
                                    },
                                    "Description": {
                                        "val": "This effort improves lightweight track durability and survivability. This effort is done in coordination with PE 0603005A projects 441 and 497."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.975"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed validation of track performance in an operational environment and transition design to PM Bradley Engineering Change Proposal (ECP) program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Integration Laboratory:"
                                    },
                                    "Description": {
                                        "val": "This effort provides for continuous improvements to ground vehicles to include technology trades, integration, concepts and configuration management designs and development of a ground system vertical test rig to enable in-house Occupant Centric Survivability evaluations. The system vertical test rig will simulate the vertical forces that occur from an underbelly explosive event (initial vertical and drop-down forces). This test device evaluates the occupant and restraint system (seat, seat belt, floor kits) response to the vertical forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.047"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initial occupant protection suites analyzed for tradeoff studies, balancing protection against performance and payload; conducted an in-progress review to present analysis results and make recommendations for a program selection of demonstrator platform and occupant protection technologies; designed, built, and integrated the selected technologies onto the demonstrator vehicle and optimization of the ideal occupant cab."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Underbody Blast Methodology:"
                                    },
                                    "Description": {
                                        "val": "Advancement of modeling and simulation to improve the survivability of ground vehicle occupants to underbody blast threats. Beginning in FY13, this effort is captured in the Blast Mitigation effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.325"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated vehicle and underbody Soldier blast protection and modeling to address information knowledge gaps that include sensitivity of the elements of the blast kill chain, human effects and injury modeling, blast insult to injury mechanisms and optimization of form, fit and performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Occupant Centric Survivability (OCS):"
                                    },
                                    "Description": {
                                        "val": "This effort develops and validates design philosophies, guidelines, military standards, handbooks, etc. that embody a focused, systems engineering approach to occupant-centric protection in vehicle design. This is accomplished using tools such as modeling and simulation (M&S), full vehicle and subsystem demonstrators, evaluations and component optimizations. This effort will address and validate the products from requirements generation through design and build to incorporate occupant centric philosophies. This effort is done in coordination with efforts in 0602601A, project C05. In FY13 and FY14, this effort supports Technology Enabled Capability Demonstration 1.c: Force Protection - Occupant Centric Platform."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.271"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Establish baseline of state-of-the-art commercial occupant protection components such as seats, restraints, and shock absorbing materials; conduct M&S of an OCS design demonstrator as well as legacy vehicles to optimize occupant centric philosophies, guidelines and processes; build physical prototypes, models and proofs of concept to validate M&S and reduce risk; mature and demonstrate technologies such as energy absorbing materials and storage systems for securing equipment\/gear for potential transition to tactical and combat vehicle producers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.132"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.132"
                                            },
                                            "Text": {
                                                "val": "This effort will integrate occupant protection technologies onto demonstrators using an approach that focuses on protecting the occupants by designing from the inside out; will refine processes for establishing occupant centric standards and guidelines; will conduct assessments using physical models and proofs of concepts of occupant protection capabilities to validate M&S and to reduce risks; and will design and integrate solutions to reduce injuries from secondary effects such as loose cargo becoming flying hazards in blast crash and rollover events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast Mitigation:"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates and matures advanced survivability and protection components, tools and subsystems for enhanced protection against vehicle mines, improvised explosive devices (IEDs) and other underbody threats, and crash events. This effort also integrates and improves occupant protection technologies such as seats and restraints. This effort creates the laboratory capability needed to enable expeditious research and development of blast-mitigating technologies in such areas as active and passive exterior\/hull\/cab\/kits, interior energy absorbing capabilities for seats, floors, restraints, sensors for active technologies and performance evaluation, M&S, experimentation and instrumentation.This effort is done in coordination with efforts in 0602601A, project C05. In FY13 and FY14, this effort supports Technology Enabled Capability Demonstration 1.c: Force Protection - Occupant Centric Platform."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.827"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate, mature and integrate energy absorbing technologies on the interior and exterior of vehicle systems to mitigate the effects of blast and crash. Technologies include padding for walls and floors, energy absorbing seats, integrated restraints and airbags, and sensors for active components. Exterior technologies include unique hull shaping and energy absorbing materials. Leverage use of M&S, produce data to validate models and improve modeling capabilities; mature and integrate sensors and instrumentation capabilities to support active technologies as well as collect higher fidelity blast\/crash\/impact data in live fire, test, and evaluation (LFT&E) and in theater attacks; fabricate and integrate lab evaluation capabilities such as a linear impact sled system to refine experimentation methodologies and standards for occupant protection technologies; design lab devices for simulating fuller effects of blast\/crash\/impact events; create methodologies and protection standards for crash, rollover and side improvised explosive device (IED) events; conduct component and sub-system level evaluation of occupant protection technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.207"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.207"
                                            },
                                            "Text": {
                                                "val": "This effort will continue to develop and will demonstrate technologies to mitigate injuries due to underbody blast events, crashes and rollovers; will develop interior technologies to mitigate blast effects and develop vehicle exterior technologies such as energy absorbing materials in structural design, hull shaping and floor designs; will improve test and evaluation methods to validate existing M&S models; will design methodologies and assessments of blast mitigation products; will improve lab and instrumentation capabilities to assess components, sub-system and system level blast mitigation capabilities; and will create and maintain standards, guidelines and methodologies for specific blast mitigation technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Fire Protection:"
                                    },
                                    "Description": {
                                        "val": "This effort designs, matures, integrates and demonstrates technologies to minimize vehicle and crew vulnerabilities to fires in current and future military ground vehicles. Supporting technologies include M&S, sensor systems, software, chemical agents, fire-resistant materials and hardware components. This effort is done in coordination with efforts in 0602601A, project C05. In FY13 and FY14, this effort supports Technology Enabled Capability Demonstration 1.c: Force Protection - Occupant Centric Platform."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.612"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate better fire protection for vehicles and crews by improving designs and form\/fit\/function of existing and new chemical extinguishing agents, sensor systems, and fire-resistant materials in an in-house laboratory; design, fabricate and evaluate common Automatic Fire Extinguishing System (AFES) components for combat and tactical vehicles; enhance modeling and simulation tools optimize system detection and response to vehicle fire events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.468"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.468"
                                            },
                                            "Text": {
                                                "val": "This effort will continue to demonstrate enhanced fire protection technologies for military platforms; evaluate and verify Common Automated Fire Extinguishing System (AFES) components to establish compliance to the AFES requirements; will integrate design of the Common Crew AFES into a vehicle platform to determine integration, test, safety, and fielding requirements for AFES on demonstrators designed for Occupant Centric military platforms; will validate M&S capabilities that were established for the OCP and improve modeling capabilities; and will enhance in-house laboratory capabilities to improved assessment and demonstration of vehicle fire protection technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hit Avoidance:"
                                    },
                                    "Description": {
                                        "val": "This effort designs and matures active protection components and systems to a maturity level acceptable for transition to acquisition programs and\/or tactical\/combat vehicle producers and builds laboratory evaluation capabilities to conduct maturation activities. This effort also seeks to understand and define the process and requirements of fielding active protection systems (APS) including developing safety release criteria, identifying vehicle integration constraints and engaging the user to determine how hit avoidance will change tactics and procedures. In executing the development process, fieldable hard kill and softkill active protection technologies are matured for future transition to tactical and combat vehicle platforms. This effort is done in coordination with efforts in 0602601A, project C05."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.467"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct evaluation and verification of hardkill and softkill active protection system components and establish component level compliance to the requirements; determine technology gaps in existing APS systems; integrate design of the hardkill APS onto a vehicle platform to determine safety, integration, test, and fielding requirements for APS on military platforms; develop open software architecture for future component and system development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.755"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.755"
                                            },
                                            "Text": {
                                                "val": "Will complete system analysis of Active Protection (AP) technologies and utilize the analysis to develop component specifications for active protection systems (APS); continue development of fuze board-compliant common APS command and control processor\/fire control module to enable APS commonality across vehicle fleet; develop and provide bus protocols, common interface specifications and standards to industry for APS common architecture; conduct hardware in the loop analyses of AP components during development and integration of AP component technologies with the common processor; incorporate a laser decoy countermeasure (CM) capability into an existing infrared softkill CM; enhance capability of softkill jam lab and utilize to test and mature softkill countermeasure; complete softkill countermeasure environmental and live fire assessments to mature the countermeasure to TRL 6."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "441"
                    },
                    "ProjectTitle": {
                        "val": "Combat Vehicle Mobilty"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.559"
                        },
                        "CurrentYear": {
                            "val": "36.028"
                        },
                        "BudgetYearOne": {
                            "val": "31.595"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.595"
                        },
                        "BudgetYearTwo": {
                            "val": "34.450"
                        },
                        "BudgetYearThree": {
                            "val": "33.138"
                        },
                        "BudgetYearFour": {
                            "val": "38.068"
                        },
                        "BudgetYearFive": {
                            "val": "38.753"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates advanced mobility and electric technologies for advanced propulsion, power, and electrical components and subsystems to enable lightweight, agile, deployable, fuel efficient, and survivable ground vehicles. This project will also mature and demonstrate advanced mechanical and electrical power generation systems to ensure that future capabilities such as next generation communications and networking, improvised explosive device (IED) jamming systems and next generation sensor devices that can be integrated onto combat and tactical vehicles. \n\nWork in this project supports the Army S&T Ground Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI, in conjunction with Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Electric Component Development:"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on meeting the Army's demand for more onboard vehicle electric power to enable technologies such as advanced survivability systems, situational awareness systems and the Army network. This effort matures, integrates and demonstrates electrical power generation machines and their associated power conversion boxes such as inverters and converters, advanced control algorithms, and high efficiency power conversion (mechanical to electrical) components. Additionally, it matures and integrates advanced electric machines such as integrated starter generators and their controls for mild hybrid electric propulsion and high power electric generation. Coordinated work is also being conducted under Program Elements (PE) 0602601A, project H91 and PE 0603005A, project 497. In FY13 and FY14, this effort supports Technology Enabled Capability Demonstration 4a: Sustainability\/Logistics-Basing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.994"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated SiC power conversion components, such as SiC DC-DC converter, DC\/AC motor inverter and AC\/DC generator inverter to evaluate their performance at higher inlet coolant temperatures, to assess their impact on the total system efficiency and cooling burden, and the effect on total system reliability; matured thermal systems to increase HVAC efficiency; and demonstrated electronics cooling technologies for increased performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.439"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate on board vehicle power (OBVP) components, high temperature inverters, and controls development for Integrated Starter Generator (ISG) and mild hybrid capabilities. These demonstration efforts are being used to validate combat vehicle OBVP component models and the effectiveness of high power \/ high temperature inverters to reduce high power electronics cooling burden. These activities are validating high voltage architecture to support growing combat vehicle electric power requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.992"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.992"
                                            },
                                            "Text": {
                                                "val": "This effort will integrate onboard vehicle power (OBVP) components onto the vehicles to demonstrate increased vehicle power generation capabilities; will evaluate performance of vehicle with OBVP against baseline vehicle performance; will evaluate reliability of hybrid vehicle components, including electric motors and controllers; and will demonstrate bidirectional vehicle to grid power flow and mobile microgrid capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Running Gear:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates running gear components and advanced suspension technologies to increase vehicle mobility and durability in response to increased ground vehicle platform weights. Components and subsystems include new elastomer compounds, lightweight, survivable track systems and road wheels, advanced compensating track tensioners, advanced damping suspension technologies, energy regenerative suspension systems, Electronic Stability Control (ESC) systems, and preview sensing technologies linked to advanced suspension designs. Coordinated work is also being conducted under Program Elements (PE) 0602601A, project H91 and PE 0603005A, projects 221 and 497. In FY13 and FY14, this effort supports Technology Enabled Capability Demonstration 1c: Force Protection - Occupant Centric Platform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.730"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated reformulated track elastomer improvements through on-vehicle evaluation to determine effectiveness in increasing track system durability and survivability. Constructed and completed demonstration of material improvements to the T-161 track system with the goal to reduce the track system weight by over 1,000 lbs. Matured advanced suspension systems such as energy regenerative suspensions, for integration on-vehicle platforms.  Established components necessary to increase vehicle stability in conjunction with on-board vehicle braking systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.860"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and demonstrate performance of an energy regenerative suspension system for a large combat wheeled vehicle platform in a controlled environment; install, tune, and evaluate (ESC) systems for tactical vehicles to mitigate vehicle rollover events; mature lightweight materials for track systems to reduce platform weight; demonstrate high durability, fire resistant elastomers for combat tracked vehicle systems; develop an extensive evaluation suite to characterize running gear rolling resistance in order to inform future fuel efficiency improvement efforts of legacy track systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.623"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.623"
                                            },
                                            "Text": {
                                                "val": "This effort will fabricate, evaluate and qualify lightweight track technology improvements for the Bradley Fighting Vehicle in direct support of improving vehicle occupant survivability; will investigate, baseline and characterize low rolling resistant tire compounds for tactical military applications with the goal of increased fuel efficiency; will design, fabricate and laboratory test track width adjusting suspension systems to improve vehicle stability; and will asses flush backed track designs to establish baseline data on design improvements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power Management:"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates power management components to meet objective tactical and combat vehicle power requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated and integrated advanced intelligent (learning and adaptive) control architecture to control multiple vehicular power sources and loads and validated the modeling and simulation toolset. Future work in power management being conducted under Program Element (PE) 0603005A \/ Project 497."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Storage Systems Development:"
                                    },
                                    "Description": {
                                        "val": "The goal of this work is to enable silent watch capability and improve survivability through energy storage components for electromagnetic armor. This is accomplished through the maturation and demonstration of advanced ground vehicle energy storage devices such as advanced chemistry batteries and ultra capacitors. This effort also leverages commercial industry battery development efforts to reduce battery volume and weight while improving their energy and power densities. Finally, it also develops a common specification for battery management systems to improve the battery state of charge indicator accuracy and battery state of health information to reduce the frequency of battery replacement, optimize starting, lighting, and ignition functions.  Coordinated work is also being conducted under Program Elements (PE) 0602601A , project H91."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.054"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improved battery energy density resulting in reduced battery size and weight thereby minimizing component footprint on vehicle platform for pulse power electromagnetic armor applications (module level Energy Density 75-85 Whr\/kg and Power Density 1000W\/kg)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.569"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and integrate a battery monitoring and battery management system for accurate state of charge and state of health information. Mature and demonstrate a second generation power brick battery to provide energy storage for advanced armors by optimizing volume, power density and extreme temperature performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.879"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.879"
                                            },
                                            "Text": {
                                                "val": "This effort will mature and optimize an advanced battery system with improved energy and power density; will validate the battery system in a military footprint for reducing logistics burdens; will test the system to mil-specs; will integrate battery system onto a vehicle platform; will conduct performance characterization; and will validate and integrate second generation power brick battery into pulse power electromagnetic armor system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pulse Power:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates high energy, compact pulse power components, subsystems and systems that enable significantly improved survivability and lethality applications comprising of elements such as DC to DC chargers, high energy batteries, pulse chargers, high density capacitors, solid state switches, control systems and electro-magnetic armor panels.  Coordinated work is also being conducted under Program Elements 0602601A, and 0602705A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.679"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began integration of power brick based electro-magnetic armor components for ground combat systems schedule, and  build of generation 2 Programmable Pulse Power supply for the High Energy Laser (HEL) Technology Demonstrator at Space and Missile Defense Center (SMDC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.235"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate first generation power brick based electro-magnetic armor system, begin development of a second generation power brick based electro-magnetic armor system (reduced form factor) and continue development of the second generation high energy laser programmable pulse power supply."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Primary Power Systems:"
                                    },
                                    "Description": {
                                        "val": "This effort will exploit, mature, and demonstrate Auxiliary Power Unit (APU) technologies such as a small modular\/scalable engine based APUs, fuel cell reformer system to convert JP8 to hydrogen, sulfur tolerant JP8 fuel cell APU, and novel engine based APUs for military ground vehicles and unmanned ground systems. This effort will also create interface control documents for simplified integration of current and future APUs, improve reliability to reduce logistic burden, as well as reduce acoustic signature for silent operation. Additionally, this effort will exploit JP8 fuel cell and engine APUs to optimize prime power in unmanned ground systems.  Coordinated work is also being conducted under Program Elements (PE) 0602601A , Project H91."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.531"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": ": Integrated JP-8 reformer\/fuel cell system into a relevant Abrams space claim; finalized JP-8 reformer\/fuel cell system design; began testing engine based auxiliary power units in a relevant environment; integrated small engine technologies for use on small unmanned ground vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.374"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a JP8 fuel cell APU system in a laboratory environment; improve small engine based APU performance for operational environments (shock, vibration and cooling); reduce acoustic signature through laboratory demonstrations; perform vehicle integration and demonstration of small engine APUs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.533"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.533"
                                            },
                                            "Text": {
                                                "val": "This effort will demonstrate a small engine on an unmanned ground system; will select hardware for modular\/scalable small engine into a high power APU (25kW); will initiate active noise control hardware on an engine-based APU; and will evaluate performance of various APU technologies for higher power applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Propulsion and Thermal Systems:"
                                    },
                                    "Description": {
                                        "val": "This effort researches, designs and evaluates high power density engines and transmission systems needed to offset increasing combat vehicle weights (armor), increased electrical power generation needs (onboard communications, surveillance and exportable power ), improved fuel economy (fuel cost & range), enhanced mobility (survivability), and reduced cooling system burden (size, heat rejection). Currently, less than 1\/3 of the total available energy from the fuel is converted into usable mechanical work (propulsion). This effort also researches and matures thermal management technologies and systems including heat energy recovery, propulsion and cabin thermal management sub-systems to utilize waste heat energy and meet objective power and mobility requirements on all ground vehicles. Lastly, this effort maximizes efficiencies within propulsion and thermal systems to reduce burden on the vehicle while providing the same or greater performance capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.037"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced powertrain technologies by increasing thermal efficiency and reducing heat rejection of diesel engines; improved the development and integration of sensors and control algorithms for closed-loop control of diesel engines; validated advanced high efficiency transmissions; evaluated and matured control strategies for powertrain systems; adapted power generation components through powertrain analysis; improved and matured components to reduce engine cooling burden."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.256"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalize the design, fabricate and integrate components for high output, power-dense combat and tactical vehicle powertrain systems; conduct evaluation of advanced powertrain systems utilizing highly efficient transmissions and advanced algorithms and control strategies;  evaluate the integration of energy recovery components onto powertrain subsystems to determine system performance characteristics and engine issues associated with integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.384"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.384"
                                            },
                                            "Text": {
                                                "val": "This effort will perform advanced powertrain systems integration and validation testing to include energy efficiencies and performance capabilities by utilizing highly efficient transmissions and engines incorporating advanced algorithms and control strategies, low heat rejection and high power density systems; will evaluate waste heat recovery technologies at a system level in a laboratory environment for performance validation; will complete the power take off (PTO) system and fan control strategies for increased efficiency in engine cooling performance; and will develop an additional PTO system for a second combat vehicle platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Projection:"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on reducing the logistics footprint, improving fuel efficiency, and ensuring mobility by maturing and demonstrating technologies in areas such as water purification, wastewater treatment and reuse, water generation, water quality monitoring, water storage and distribution, petroleum quality monitoring, petroleum storage and distribution, fuel filtration, lightweight bridging materials, new bridging design concepts, bridge health monitoring, military load classification, mine roller concepts, mine roller materials, mine roller integration, hybrid hydraulic technology, efficient hydraulic technology, semi autonomous safety and effectiveness advances, alternative fuels, fuel additives, lubricants, power train fluids, coolants, and petroleum, oil, and lubricant products to support new military technology requirements (i.e. anti-lock brakes, semi-active suspension, etc.). This effort is done in coordination with efforts in PE 0602601A, project H91. In FY13 and FY14, this effort supports Technology Enabled Capability Demonstration 4a: Sustainability\/Logistics-Basing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.234"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed field evaluation, military utility assessment and refurbishment of water from air demonstrators, fabricated hand held and in-line monitoring technology for water treatment process monitoring, developed wastewater treatment and recycle technology, developed nanofluid technology that suspends nanoparticles in coolants and lubricants to improve thermal, friction, and wear properties and evaluate alternative fuels for use in ground systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.295"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature wastewater treatment and recycling technology for demonstration in a field environment; demonstrate successful in-line water quality and processes monitoring capability from previous development; characterize alternative fuels and fuel additives that improve performance and diversify energy sources; assess the impact of using emerging alternative fuels in tactical equipment to identify and address potential changes needed in fuel specifications; create and evaluate Petroleum, Oils and Lubricants to meet new military technology requirements (i.e. anti-lock brakes and semi-active suspension) while exceeding future and legacy equipment performance and technical requirements; evaluate nanocoolants, gear oils and hydraulic fluids which promote improved energy efficiencies and are longer lasting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.184"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.184"
                                            },
                                            "Text": {
                                                "val": "This effort will conduct performance assessments of waste water treatment and recycling technologies; will demonstrate transition ready in-line water quality and process monitoring capability; will characterize selected alternative fuels and fuel additives to improve performance and diversify energy sources; will assess the suitability of candidate alternative fuels in military ground systems; will evaluate fuel efficient gear oils and hydraulic fluids; and will evaluate candidate Petroleum, Oil, Lubricants and coolants to meet new military technology requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "497"
                    },
                    "ProjectTitle": {
                        "val": "Combat Vehicle Electro"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.700"
                        },
                        "CurrentYear": {
                            "val": "6.620"
                        },
                        "BudgetYearOne": {
                            "val": "7.353"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.353"
                        },
                        "BudgetYearTwo": {
                            "val": "9.850"
                        },
                        "BudgetYearThree": {
                            "val": "6.911"
                        },
                        "BudgetYearFour": {
                            "val": "7.564"
                        },
                        "BudgetYearFive": {
                            "val": "7.700"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures, integrates, and demonstrates vehicle electronics hardware such as computers, sensors, communications systems, displays, and vehicle command\/control\/driving mechanisms as well as vehicle software to enhance crew performance, increase vehicle fuel efficiency, reduced Size, Weight, and Power (SWAP) burdens and reduce vehicle maintenance costs. This project also advances open system architectures (power and data) for military ground vehicles to enable common interfaces, standards and hardware implementations. Additionally this project matures integrated condition based maintenance technologies that reduce the operation and sustainment costs of vehicle electronics and electrical power devices. Technical challenges include: increased levels of automation for both manned and unmanned systems, secure data networks, interoperability of intra-vehicle systems, and advanced user interfaces. Overcoming these technical challenges enables improved and increased span of collaborative vehicle operations, efficient workload management, commander's decision aids, embedded simulation for battlefield visualization and fully integrated virtual test\/evaluation. \n\nWork in this project supports the Army S&T Ground Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improved Mobility and Operations Performance through Autonomous Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort matures indirect vision technologies to provide the Soldier with full hemispherical situational awareness in closed hatched vehicle operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.930"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated advanced crew stations with state of the art Electro-Optic Indirect Vision (EOIV) (high resolution threat interrogation and driving sensors, digital video recording and displays), assisted mobility aids, mounted Soldier assessment and dismounting Soldier local situational awareness technologies; conducted the final experiment to quantify system performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Vehicle Technologies to Improve Lightweight Track Reliability:"
                                    },
                                    "Description": {
                                        "val": "This effort will improve\/optimize lightweight segmented band track technology through utilization of high performance elastomers and design with the goal of improving track durability. This effort is done in coordination with related efforts in PE 0603005A projects 221 and 441."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.928"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated and evaluated the optimized track health monitoring system design performance including wear gauges, damage algorithms, and diagnostic\/prognostics algorithms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Electronics Integration and Power Architecture:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates military ground vehicle electronics, electrical power architectures and technologies such as video\/data networking and computing equipment, Silicon Carbide (SiC) high voltage power electronics, low voltage power distribution, and crew station controls\/displays. This effort is coordinated with efforts in 0602601A, project H91 and PE 0603005, project 441."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.842"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported technical standards development or modification to existing standards for military ground vehicle electrical systems. Performed trade analyses of existing and future combat and tactical vehicle electrical systems and developed architectural design concepts for intra-vehicle data and video networks, general purpose computing resources, input\/output devices, and associated software architectures. Also, supported technical standards development or modification to existing standards for low, medium, and high voltage power systems for military ground vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.220"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate the use of a high voltage and 28V power distribution system within the Vehicle Electronic Architecture (VEA) Research System Integration Laboratory (SIL); establish the hardware architecture of the VEA SIL; evaluate displays and control technologies along with networking and computing equipment with a goal of assessing the performance and size, weight, and power - cooling (SWaP-C) impacts of these technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.344"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.344"
                                            },
                                            "Text": {
                                                "val": "This effort will implement the electrical data architecture using the FY13 evaluations and market studies of potential data management and computing equipment; will demonstrate computing technology that is smaller and uses less power while performing more functions than currently available on military ground vehicles; and will merge the data architecture with the electrical power architecture to demonstrate a complete advanced vehicle electrical architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Electronics Architecture and Standards:"
                                    },
                                    "Description": {
                                        "val": "This effort matures and integrates new electronic and electrical power architectures, technologies and standards for existing and future combat and tactical vehicle ground vehicles. Technical standards such as Vehicular Integration for C4ISR\/EW Interoperability (VICTORY, the Army's non-proprietary intra-vehicle data network), Institute of Electrical and Electronics Engineers (IEEE) 1588 and Display Port will be identified, evaluated or modified for military ground vehicle electrical systems. This effort also analyzes and designs electronic, and electrical power architectures to support the efficient integration of systems such as intra-vehicle data and video networks, general purpose computing resources, input\/output devices, low, medium, and high voltage power systems, and associated software architectures. This effort is coordinated with 0602601A, project H91 and PE 0603005, project 441."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support technical standards writing and modification of existing standards for low, medium, and high voltage power systems for military ground vehicles; initiate new open vehicle electronics architectures to address future requirements for military ground vehicles in compliance with VICTORY; perform trade analyses of existing and future combat and tactical vehicle electrical systems to create architectural design concepts; begin VICTORY SIL development and interoperability evaluation;  finalize Vehicle Electronic Architecture (VEA) Research SIL designs; begin SIL subsystem integration, fabrication, verification and validation activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.009"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.009"
                                            },
                                            "Text": {
                                                "val": "This effort will continue supporting and refining the VICTORY architecture effort; will expand the VICTORY SIL with new functionality to further optimize the performance of the VICTORY architecture; will continue providing architecture support to the VEA SIL in preparation for a TRL 5 next generation data and computing architecture demonstration; and will perform VICTORY architecture compliance testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "515"
                    },
                    "ProjectTitle": {
                        "val": "Robotic Ground Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.971"
                        },
                        "CurrentYear": {
                            "val": "8.389"
                        },
                        "BudgetYearOne": {
                            "val": "8.582"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.582"
                        },
                        "BudgetYearTwo": {
                            "val": "11.287"
                        },
                        "BudgetYearThree": {
                            "val": "8.948"
                        },
                        "BudgetYearFour": {
                            "val": "10.437"
                        },
                        "BudgetYearFive": {
                            "val": "10.625"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates Unmanned Ground Vehicle (UGV) technologies including sensor technologies, perception hardware and software, and robotic control technologies that enable UGV systems to maneuver on- and off-road at militarily significant speeds with minimal human intervention, thereby enabling the Soldier to perform other mission tasks. Challenges addressed include: obstacle avoidance, overcoming perception limitations, intelligent situational behaviors, command and control by Soldier operators, frequency of human intervention, operations in adverse weather, and robots protecting themselves and their surroundings from intruders. Mature technologies are incorporated in UGV technology demonstrators so that performance can be evaluated for tactical maneuver and sustainment applications.  \n\nThe approach builds upon, complements, and does not duplicate previous and ongoing investments conducted under the Joint Robotics Program Office, in program element (PE) 0602601A, project H91 (Ground Vehicle Technology) and by the Army Research Laboratory (ARL) PE 0602120A (Sensors and Electronic Survivability). \n\nWork in this project supports the Army S&T Ground Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI, in collaboration with the Army Research Laboratory (ARL), Adelphi and Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Safe Operations of Unmanned systems for Reconnaissance:"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates perception, control and tactical behavior technologies to safely conduct unmanned urban operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.971"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed integration of all developed technologies on relevant test bed platforms and conduct a final Warfighter evaluation designed to examine resultant capabilities for a group of heterogeneous unmanned systems to conduct urban operations; collected and provided performance data that will be validated through M&S and live experimentation to support transition into future systems; Ensured interoperability and began integration of subsystems, assessed system design through modeling and simulation; Matured relevant technologies for systems integration, gained safety approval for testing, and matured robotic control station."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned Ground Systems Technology:"
                                    },
                                    "Description": {
                                        "val": "This project leverages perception, control and tactical behavior technologies created for the Safe Operations of Unmanned systems for Reconnaissance (SOURCE) effort and matures, integrates and demonstrates advanced robotic and autonomous technologies to the tactical and combat vehicle fleets. Unmanned ground systems technologies will be employed to overcome critical Army challenges to include automated resupply and sustainment, improved tactical intelligence, and reduced physical and cognitive burden. Challenges will be met by utilizing relevant technologies such as maneuver and tactical behavior algorithms, autonomy kits, sensor and weapons integration, advanced navigation and planning, vehicle self-protection, manipulation, local situational awareness, advanced perception, vehicle and pedestrian safety, and robotic command and control. This effort is coordinated with efforts in 0602601A, project H91 and PE 0603005, projects 441 and 497.  In FY13 and FY14, this effort supports Technology Enabled Capability Demonstration 1c: Force Protection - Occupant Centric Platform and 2a: Overburdened-Physical Burden."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.389"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate autonomous maneuver hardware, software, algorithms and control interfaces, as well as weapon and sensor payloads onto a robotic demonstrator vehicle to provide demonstrations of armed unmanned vehicle missions, validate emerging safety methodology and tactics, techniques and procedures for armed robotic operations; integrate scalable autonomy kits and control interfaces into tactical wheeled vehicles to increase soldier safety, operational efficiency and effectiveness and culminate with technical demonstrations of this technology in a relevant environment; begin integration of scalable autonomy kits and control interfaces onto tracked and wheeled combat vehicles to increase soldier and system performance, operational tempo and mission effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.582"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.582"
                                            },
                                            "Text": {
                                                "val": "This effort will integrate advanced autonomous maneuver, active safety and Soldier load reduction hardware, software, algorithms, control interfaces, and sensor payloads onto demonstrator vehicles to provide substantiation of optionally manned\/unmanned vehicle missions and validate emerging safety methodology and tactics, techniques and procedures; will expand integration of scalable autonomy kits and control interfaces onto representative tactical wheeled vehicles to increase soldier safety, operational efficiency and effectiveness and culminate with technical demonstrations and robust data analysis in a relevant operational environment; and will begin integration of interoperability standards compliant components and systems onto manned\/unmanned robotic platforms to increase re-use and reduce costs of current\/future systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "53D"
                    },
                    "ProjectTitle": {
                        "val": "NAC Demonstration Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.937"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These are Congressional Interest Items"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Alternative Energy Research"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "39.937"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Alternative Energy Research"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}