{
    "id": "16739ae35a397ae46d4263ae2df4831a740bddf8",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA3_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603125A"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism - Technology Development"
        },
        "R1LineItemNumber": {
            "val": "41"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.939"
            },
            "CurrentYear": {
                "val": "9.716"
            },
            "BudgetYearOne": {
                "val": "15.054"
            },
            "BudgetYearOneBase": {
                "val": "15.054"
            },
            "BudgetYearTwo": {
                "val": "10.136"
            },
            "BudgetYearThree": {
                "val": "10.222"
            },
            "BudgetYearFour": {
                "val": "10.394"
            },
            "BudgetYearFive": {
                "val": "10.581"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 increase for Technology Development Adaptive Red Teaming."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element demonstrates technologies with high payoff potential to address current technology shortfalls or future force capability gaps.  Efforts include: hybrid electric power technologies to reduce use of fossil fuel generators; rapidly deployable force protection technologies to enable troops at small, remote bases or integrated within local communities to detect, assess and defend against a range of enemy threats; and technology system red-teaming to stress and assess emerging systems earlier in the life-cycle, and provide a more holistic understanding of employment and performance risks in realistic environments and against potential threats.\n\nThis project supports the Command, Control, Communications and Intelligence (C3I), Ground and Innovation Enablers Portfolios.\n\nWork in this project is complementary to and is fully coordinated with PE 0602105A (Materials Technology), PE 0602303A (Missile Technology), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602784A (Military Engineering Technology), 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603710A (Night Vision Advanced Technology), and PE 0603734A (Military Engineering Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM); the Army Engineer Research and Development Center; and the Space and Missile Defense Command (SMDC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.172"
                },
                "CurrentYear": {
                    "val": "9.716"
                },
                "BudgetYearOne": {
                    "val": "10.054"
                },
                "BudgetYearOneBase": {
                    "val": "10.054"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.939"
                },
                "CurrentYear": {
                    "val": "9.716"
                },
                "BudgetYearOne": {
                    "val": "15.054"
                },
                "BudgetYearOneBase": {
                    "val": "15.054"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.233"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.000"
                },
                "BudgetYearOneBase": {
                    "val": "5.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.233"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "5.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DF5"
                    },
                    "ProjectTitle": {
                        "val": "Agile Integration & Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.948"
                        },
                        "CurrentYear": {
                            "val": "9.716"
                        },
                        "BudgetYearOne": {
                            "val": "15.054"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.054"
                        },
                        "BudgetYearTwo": {
                            "val": "10.136"
                        },
                        "BudgetYearThree": {
                            "val": "10.222"
                        },
                        "BudgetYearFour": {
                            "val": "10.394"
                        },
                        "BudgetYearFive": {
                            "val": "10.581"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project demonstrates technologies with high payoff potential to address current technology shortfalls or future force capability gaps.  Efforts include: hybrid electric power technologies to reduce use of fossil fuel generators; rapidly deployable force protection technologies to enable troops at small, remote bases or integrated within local communities to detect, assess and defend against a range of enemy threats; and technology system red-teaming to stress and assess emerging systems earlier in the life-cycle, and provide a more holistic understanding of employment and performance risks in realistic environments and against potential threats.\n\nThis project supports the Command, Control, Communications and Intelligence (C3I), Ground and Innovation Enablers Portfolios.\n\nWork in this project is complementary to and is fully coordinated with PE 0602105A (Materials Technology), PE 0602303A (Missile Technology), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602784A (Military Engineering Technology), 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603710A (Night Vision Advanced Technology), and PE 0603734A (Military Engineering Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM); the Army Engineer Research and Development Center; and the Space and Missile Defense Command (SMDC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Intelligent Power (HI Power)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates intelligent power management hardware and software to reduce the use of fossil fuel in tactical generators while increasing energy security. The intelligent power management technologies will be plug-and-play to enable faster power grid setup times and to eliminate human error as well as to reduce soldier planning burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.632"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and demonstrated an autonomous hybrid power grid architecture for the power range of 3 to 60 kilowatt capable of accepting direct current (DC) input from 20 volts DC to 32 volts DC, and be scalable to 500 kilowatts; developed and demonstrated advance control hardware and software; developed and assessed a standard secure communication protocol; continued development of a draft system specification."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.859"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate performance of autonomous hybrid power grid architectures and advanced control hardware and software; fabricate and demonstrate a universal generator and Environmental Control Unit (ECU) modification (MOD) kit to enable automatic start\/stop controls; fabricate microgrid power management hardware representative Brigade tactical operations center and integrate for user assessments; complete a draft performance specification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.997"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.997"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop and demonstrate standards and protocols for tactical microgrids; develop a universal device controller able to monitor and manage power sources and loads; continue to advance technologies that enable the use of renewable power sources and energy storage systems for storing any excess grid power; demonstrate a grid power manager that can utilize all power assets on the battlefield to insure optimum power utilization based on mission requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapidly Deployable Force Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort improves design, development and employment of force protection technologies that are rapidly deployable to support troops operating in forward areas.  These technologies must be readily transportable; require minimal set up, take down, and operational effort; and easily adaptable across a variety of missions, environments, and threats. This effort is coordinated with PE 0602784A,  PE 0602786A, PE 0603734A,, and PE 0603313A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.316"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined and updated criteria for deployable force protection technologies in order to meet capability gaps based on stakeholder input; matured and evolved promising technologies identified and assessed in prior year's effort; identified new and emerging force protection technologies that meet the rapidly deployable construct; selected and assessed candidate force protection technologies to support a system of systems design for force protection based on prioritized needs from stakeholders; included advanced assessments of technology improvements based on prior year's efforts; designed and conducted a series of demonstrations and experiments to assess performance of selected force protection technologies and to identify improvements in design, development and implementation including assessing systems vulnerabilities regarding the ability to conduct force protection effectively; and coordinated improvements with designers, developers, and stakeholders."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.857"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and conduct a series of experiments, including live scenarios, and coordinated demonstrations to identify the most promising new and emerging technologies for remaining high-priority gaps in deployable force protection; to stress and assess developing systems for both individual and collective systems performance in operationally relevant environments and realistic scenarios that include adaptive enemies; and to provide feedback to developers so that they can improve systems and make them more robust for operational use; expand experiments across a range of realistic, relevant environments that represent current and future areas of operations and adaptive threats and incorporate complimentary sets of experimental designs; mature and evolve high-payoff technologies by improving deployability; by increasing systems of systems integration and interoperability; and by identifying and reducing systems and systems of systems vulnerabilities through deliberate methodologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.057"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.057"
                                            },
                                            "Text": {
                                                "val": "Will analyze emerging threats that expeditionary units operating at remote bases or integrated with local communities may face in the future; select high-priority threats and develop a set of experiments using live, virtual, and mixed scenarios to stress deployable force protection developing technologies and identify vulnerabilities; incorporate Soldiers from a variety of military occupations and specialties as part of experiments and demonstrations; integrate assessments of technology-enabled capabilities for logistics basing and other force protection basing developments; expand the deployable force protection warfighter technology tradespace methodology and portfolio analysis; provide feedback for systems improvement and needed research areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technology Development Adaptive Red Teaming"
                                    },
                                    "Description": {
                                        "val": "This effort seeks to challenge conventional approaches to technology and systems development and insertion, and increase the awareness of risks and opportunities earlier in the lifecycle in order to improve system design, development and employment.  It builds on the concepts and methodology developed under the Deployable Force Protection Adaptive Red Teaming effort and applies them to other high-priority areas for the Army.  It designs and conducts a series of live, virtual and mixed scenarios and demonstrations to evaluate the most promising technologies.  It stresses and assesses developing technology systems for both individual and system-of-system performance across a representation of operational environments, realistic scenarios and emerging threats.  Activities include: identifying, integrating and examining technology performance at live demonstration venues with experienced operators; emulating emerging threats and alternative futures to challenge assumptions regarding scenarios and system employment; and identifying and informing of potential vulnerabilities in systems and systems-of-systems, including but not limited to, training, logistics and adaptability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will select developing technology systems for demonstration and evaluation; analyze emerging threats and select high-priority threats for use in technology experimentation; will develop a set of experiments to stress performance and identify potential vulnerabilities when employed; will incorporate Soldiers from a variety of Military Occupation Specialties to acquire user feedback; will apply and expand the warfighter technology tradespace methodology and analysis; and will provide feedback to inform technology development, systems integration, training, logistics and technology employment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW4"
                    },
                    "ProjectTitle": {
                        "val": "Energy Technologies (Congressional Adds (CAs))"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.991"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project contains Congressional add funding for Alternative Energy for Deployed Forces."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Alternative Energy for Deployed Forces"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional interest item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.991"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and demonstrated power architectures on the Soldier that incorporate modular design principles within the Soldier worn architecture; developed a 15-20 W soldier wearable power source system; developed thin, lightweight Soldier-worn Li-Ion batteries that will increase energy independence while decreasing the current power sustainment footprint and supporting domestic manufacturing capability; conducted independent demonstrations and evaluations of existing plasma gasification systems offered by several manufacturers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}