{
    "id": "16ee415028114910535f2f4be529affdb513fb3b",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603826D8Z"
        },
        "ProgramElementTitle": {
            "val": "Quick Reactions Special Projects (QRSP)"
        },
        "R1LineItemNumber": {
            "val": "63"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "63.029"
            },
            "CurrentYear": {
                "val": "107.002"
            },
            "BudgetYearOne": {
                "val": "78.532"
            },
            "BudgetYearOneBase": {
                "val": "78.532"
            },
            "BudgetYearTwo": {
                "val": "80.583"
            },
            "BudgetYearThree": {
                "val": "94.383"
            },
            "BudgetYearFour": {
                "val": "103.338"
            },
            "BudgetYearFive": {
                "val": "91.225"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Quick Reactions Special Projects (QRSP) Program supports five separate projects that provide rapid funding to expedite development and transition of new technologies to the warfighter.  These projects are:  1) Quick Reaction Fund (QRF); 2) Rapid Reaction Fund (RRF); 3) Research, Development, Test, and Evaluation (RDT&E) Architecture and Integration (RAI) program; 4) Joint Rapid Acquisition Cell (JRAC) support; and 5) Strategic Multi-Layered Assessment (SMA) support.  QRSP provides the flexibility to respond to emergent Department of Defense (DoD) issues and address technology surprises and needs within the years of execution outside the two year budget cycle. \n\nThe QRF Program objectives are to respond to emergent conventional warfare needs during the execution years that take advantage of breakthroughs in rapidly evolving technologies.  The QRF is executed by the Rapid Reaction Technology Office.  Examples of the types of projects that are envisioned include:  force protection projects to enhance anti-access and area denial capabilities, undersea offensive capabilities and broad electronic warfare capabilities.  The QRF focuses on maturing technologies critically needed for the Combatant Commands.  QRF projects are typically 12 months in duration and produce prototypes with new capabilities for demonstration and evaluation.\n \nThe RRF objectives are to leverage the DoD science and technology (S&T) base and those of the other federal departments, and to provide feedback to the S&T community to guide long term developmental strategies.  The RRF is executed by the Rapid Reaction Technology Office (RRTO).  RRTO works to anticipate adversaries’ exploitation of new technologies and advanced capabilities and develop counters to those capabilities.  Additionally, RTTO works to leverage technology developed outside of the DoD in the commercial sector, academia, international arenas, and small, non-traditional businesses to expose them to specific DoD needs areas as identified by Combatant Commanders, Military Service organizations, other Defense agencies and interagency organizations.  The typical length of an RTTO program falls within a 6 to 12 month range in order to more effectively aid the warfighter.  The RRF consistently exceeds the transition objective of 30 percent for demonstration programs (DoD Strategic Objective 4-3). \n\nThe RDT&E Architecture and Integration (RAI) program objectives are to enhance and expand rapid technology architecture and assessment capabilities in general; and, to enhance the Joint Experimentation Range Complex (JERC), Stiletto maritime test platform and the Thunderstorm ISR exercise series.  The JERC provides a venue to evaluate a wide range of new technologies in a dessert environment.  The requested funding will also support Stiletto, a maritime test vessel that routinely hosts numerous new technologies for evaluation in a maritime environment.  Thunderstorm, an ongoing Intelligence, Surveillance, and Reconnaissance (ISR) exercise series, is also supported by this budget line.  Thunderstorm brings emerging ISR technologies together in a common architecture for exercise and operational demonstration.   \n\nThe JRAC Program objectives focus on responding to Joint Urgent Operational Needs (JUONS) that have been submitted by Combatant Commanders and validated by the Joint Staff.  In addition, the JRAC’s objectives are to manage the delivery of capabilities as requested by the Combatant Command (COCOM) in a time frame acceptable to the COCOM.  Efforts, in most instances, are conducted outside of the processes described in the Defense Acquisition System in DoD Directive 5000.1 and utilize contingency and other rapid acquisition authorities.\n\nThe SMA cell program objective is to support all Combatant Commands (COCOMs), Joint Force Commanders, and other government agencies by assessing complex operational\/technical challenges which require multi-agency and multi-disciplinary approaches.  With input from across the United States Government, academia, and the private sector, the SMA cell develops solution options to COCOM generated challenging problems and informs the command’s senior leadership.  Each SMA cell effort is initiated at the request of COCOM senior leadership. Priorities for SMA Cell programs are set by the Joint Staff Deputy for Operations.  Products are typically produced within six months and directly contribute to the decision-making process of the COCOM’s senior leaders."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "58.970"
                },
                "CurrentYear": {
                    "val": "107.002"
                },
                "BudgetYearOne": {
                    "val": "88.155"
                },
                "BudgetYearOneBase": {
                    "val": "88.155"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "63.029"
                },
                "CurrentYear": {
                    "val": "107.002"
                },
                "BudgetYearOne": {
                    "val": "78.532"
                },
                "BudgetYearOneBase": {
                    "val": "78.532"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.059"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-9.623"
                },
                "BudgetYearOneBase": {
                    "val": "-9.623"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.077"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-9.623"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-9.623"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.018"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012: Increase of $4.059 million is due to a reprogramming of $5.900 million to support Cloudbreak command and control architecture efforts, and net adjustments of -$1.841 million from SBIR\/STTR and other reprogrammings and adjustments to support OSD efforts.\n\nFY 2014: Decrease of $9.623 million is a baseline adjustment reflective of DoD priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P826"
                    },
                    "ProjectTitle": {
                        "val": "Quick Reaction Fund"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.044"
                        },
                        "CurrentYear": {
                            "val": "37.902"
                        },
                        "BudgetYearOne": {
                            "val": "26.728"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.728"
                        },
                        "BudgetYearTwo": {
                            "val": "28.189"
                        },
                        "BudgetYearThree": {
                            "val": "29.400"
                        },
                        "BudgetYearFour": {
                            "val": "32.496"
                        },
                        "BudgetYearFive": {
                            "val": "28.396"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Quick Reaction Special Projects (QSRP) Program supports five separate projects that provide rapid funding to expedite development and transition of new technologies to the warfighter.  The QSRP Program provides the flexibility to respond to emergent DoD issues and addresses technology surprises and needs that may arise outside the two year budget cycle.\n\nThe Quick Reaction Fund (QRF) Program provides the Services, Components, Combatant Commands (COCOMs), and force providers opportunities to capitalize on technologies that are at a relatively high Technology Readiness Level (TRL) and to rapidly field-test promising new operational prototypes that can have immediate impact on military operations.  QRF initiatives are limited to those that will deliver a military operational prototype application within twelve months of being funded. \n\nThe QRF Program also focuses on projects that have the potential to address conventional, disruptive, catastrophic, and irregular threats.  More specifically, initiatives that address the following interest areas: Anti-Access and Area Denial; Base Protection; Electromagnetic Bandwidth and Spectrum Enhancement; Persistent Intelligence, Surveillance, and Reconnaissance (ISR); Newly Emerging National Threats; Directed Energy Capabilities; Low-Cost Precision Engagement Capabilities; Operational Field Demonstrations; Unmanned and Robotics Systems; Over the Horizon-Radar Technologies; and Counter-Electronic Warfare Technologies. \n\nIn FY 2013 and FY 2014, the QRF Program will continue to identify and fund new projects that respond to critical operational needs and new technology opportunities.  Current and future efforts that show significant effectiveness can be leveraged by additional investments in order to accelerate transition to operational forces."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Matsu"
                                    },
                                    "Description": {
                                        "val": "Project Matsu was an open source software project that uses data mining frameworks and related applications for processing very large amounts of hyper-spectral data, and other large Intelligence, Surveillance and Reconnaissance (ISR) data sets.  Matsu utilized unique analytics to discover changes and other significant features in cubes of hyper-spectral data.  Quick detection of changes in hyper-spectral data improves situational awareness, which can protect the warfighter.  A typical architecture for processing hyper-spectral data today uses a file system to store the data, a relational database to store the metadata, and custom code to process the data.  The Matsu system is based upon open source software architecture that can efficiently process very large amounts of data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.229"
                                            },
                                            "Text": {
                                                "val": "Matsu resulted in the development of an open source system that can process and analyze very large cubes of hyper-spectral data as well as other large ISR data sets efficiently.  This enabled remote data processing, which in turn reduces the forward deployed logistics and manpower footprint.  Matsu worked with the National Security Agency (NSA) Cyber Pilot to transition the technology to the Services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Home on Global Positioning System (GPS) Jammer Study"
                                    },
                                    "Description": {
                                        "val": "This effort supported the development of GPS Jammer homing munitions.  The effort investigated currently inventoried weapon systems to identify those most acceptable for modification into a Home on GPS Jammer capable system.  Key factors used to determine weapon feasibility included integration complexity\/cost, weapon cost, weapon employment concept, weapon delivery platforms and capability delivered to the warfighter.  Follow-on work identified the mechanical and electrical interface integration requirements for the selected platform(s)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.529"
                                            },
                                            "Text": {
                                                "val": "The Home on GPS Jammer project identified the most appropriate candidate weapons from within current weapons systems inventory suitable for modification to achieve a Home on GPS Jammer capability, identified the interface and modifications required to enable direct attack of GPS jammers and provided an engineering prototype to facilitate follow-on development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CAESAR"
                                    },
                                    "Description": {
                                        "val": "The CAESAR project developed and demonstrated a new collection system for a specific class of electronic signals.  Current collection of these signals was lacking and CAESAR provided a cost-effective, scalable solution.  The data provided by CAESAR is structured to support DoD customers through system characterization and near real-time notification.  The details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.444"
                                            },
                                            "Text": {
                                                "val": "CAESAR achieved its project objectives on schedule and capabilities developed during this project were delivered and accepted by operational users.  Details are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Boat Radar"
                                    },
                                    "Description": {
                                        "val": "The Small Boat Radar project developed algorithms that were incorporated in a commercial radar system.  The resulting capability will fill a COCOM's need.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.730"
                                            },
                                            "Text": {
                                                "val": "The project launched in late FY 2012."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The prototype system will be fielded for an operational evaluation.  The project will be completed later in FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Positioning, Navigating, and Timing (PNT) Demonstration in Triple Canopy"
                                    },
                                    "Description": {
                                        "val": "The Positioning, Navigating, and Timing (PNT) Demonstration in Triple Canopy project executed a demonstration of iGPS in triple canopy and contested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.112"
                                            },
                                            "Text": {
                                                "val": "The PNT Demo executed field testing and utility evaluations of High Integrity Global Positioning System (iGPS) prototype Core Modules in operational-like testing with the Marines.  The project will continue into FY2013."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Tests along with pre-acquisition risk reduction activities planned will enable transition of the iGPS program to an ACAT III Program of Record."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "ACAT III Program of Record will begin."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Over the Horizon Radar (OTHR) Scan"
                                    },
                                    "Description": {
                                        "val": "The Over the Horizon Radar (OTHR) Scan project developed a robust electronic attack approach to deny\/interrupt the wide area sensing capability of adversary detection, tracking and targeting sensors that jeopardize the free movement of US Naval forces.  A self-contained small deployable prototype was used to verify system level capability."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.751"
                                            },
                                            "Text": {
                                                "val": "OTHR Scan will be tested in a laboratory and limited operational settings.  Data collection will focus on the protection of small air and maritime targets.  This effort will be completed later this year."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Access\/Area Denial"
                                    },
                                    "Description": {
                                        "val": "In FY 2013 and FY 2014, the focus areas will be in projects that concentrate on developing capabilities in anticipation of emerging needs to mitigate losses due to the effect of Electronic Warfare (EW) in the air-to-air engagement.  The Rapid Reaction Technology Office (RRTO) will ensure the QRF efforts are not duplicative with other electromagnetic bandwidth and spectrum enhancement efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Text": {
                                                "val": "Anti-Access\/Area Denial investment decisions during the budget year will respond to Combatant Command (COCOM), Service and other government organization requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD, Federally Funded Research and Development Centers (FFRDCs), other government agencies, industry and academia will help identify areas critical to developing future anti-access\/area denial technological enhancement efforts.  Anticipate funding seven projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.183"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.183"
                                            },
                                            "Text": {
                                                "val": "As emerging requirements and threats within the Anti-Access\/Area Denial focal area surface, programmatic and investment decisions will be resourced to respond to COCOM, Services and other government organizations' requirements.  Anticipate funding nine projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Bandwidth and Spectrum Enhancement"
                                    },
                                    "Description": {
                                        "val": "In anticipation of emerging needs, the focus areas for FY 2013 and FY 2014 include:  technologies to reduce prime power, weight and space of radio frequency (RF) components, and increase level of integration of related components.  In addition, projects will include novel bandwidth compression techniques with emphasis on on-board data processing and size reduction technologies.  The Rapid Reaction Technology Office (RRTO) will ensure the QRF efforts are not duplicative with other Electromagnetic Bandwidth and Spectrum Enhancement efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.798"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Bandwidth and Spectrum Enhancement investment decisions during the budget year will respond to COCOM, Service and other government organization requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD, FFRDCs, other government agencies, industry and academia will help identify areas critical to developing future Electromagnetic Bandwidth and Spectrum Enhancement efforts.  Anticipate the funding of six projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.182"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.182"
                                            },
                                            "Text": {
                                                "val": "As threats and opportunities within the Electromagnetic and Spectrum Enhancement focal areas emerge, programmatic and investment decisions will be resourced to respond to COCOM, Services, and other government organization requirements.  Anticipate the funding of three projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Undersea Offensive Capabilities"
                                    },
                                    "Description": {
                                        "val": "In anticipation of emerging needs, the focus areas for FY 2013 and FY 2014 include: undersea weapons or sensor delivery systems to meet critical operation requirements identified by COCOM.  The Rapid Reaction Technology Office (RTTO) will ensure the QRF efforts are not duplicative with other Undersea Offensive capability efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.798"
                                            },
                                            "Text": {
                                                "val": "Undersea Offensive Capabilities investment decisions during the budget year will respond to COCOM, Service and other government organization requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD, FFRDCs, other government agencies, industry and academia will help identify areas critical to developing future Undersea Offensive Capability efforts.  Anticipate the funding of five projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.181"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.181"
                                            },
                                            "Text": {
                                                "val": "As threats and opportunities within Undersea Offensive Capability focal areas emerge, programmatic and investment decisions will be resourced to respond to COCOM, Services, and other government organizations requirements.  Anticipate the funding of three projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational Field Demonstrations"
                                    },
                                    "Description": {
                                        "val": "In anticipation of emerging needs, the focus areas for FY 2013 and FY 2014 include: operational prototyping, field demonstrations of technologies, and fully integrated systems in direct response to critical operational needs.  Emphasis will be on demonstration of conventional technologies with transition within a period of no more than one year.  The Rapid Reaction Technology Office (RTTO) will ensure the QRF efforts are not duplicative with other Operational Field Demonstration efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.805"
                                            },
                                            "Text": {
                                                "val": "Operational Field Demonstrations investment decisions during the budget year will respond to COCOM, Service and other government organization requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD, FFRDCs, other government agencies, industry and academia will help identify areas critical to Operational Field Demonstrations efforts.  Anticipate the funding of three projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.182"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.182"
                                            },
                                            "Text": {
                                                "val": "As emerging requirements, threats and opportunities within the Operational Field Demonstrations focal area surface, programmatic and investment decisions will be resourced to respond to COCOM, Services and other government organizations.  Anticipate the funding of three projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Protection of Critical Missions"
                                    },
                                    "Description": {
                                        "val": "The Department of Defense (DoD) has developed a Trusted Systems strategy which integrates Protection Planning for the development of capabilities, the use of proven mitigation techniques and tools, the ongoing refinement of risk management processes, and creation of needed technology. Current program protection and supply chain risk management efforts primarily target individual Major Defense Acquisition Programs of Record (POR). However, this approach currently lacks a strategic or operational mission focus to identify and assure critical DoD missions, which are comprised of acquisition programs, as well as legacy systems and infrastructure.\n\nGlobalization of Information and Communications Technology (ICT) markets creates unprecedented opportunities for sophisticated adversaries to defeat not only individual systems, but DoD capabilities through supply chain exploits or other malicious tampering. Defense Planning Guidance, Defense Science Board Reports, and recent deliberations on Nuclear Command, Control and Communications have all acknowledged the problem, and identified the requirement to protect critical missions from cyber and supply chain vulnerabilities.\n\nThis Quick Reaction Fund effort provides funding for the Department to pilot initial activities to develop methodologies to assess critical mission vulnerability to cyber or supply chain exploit, and assess the utility of available tools, processes and models in conducting such a cross cutting vulnerability assessment. This project will seek to demonstrate the application or expansion of current program protection and supply chain methodologies to a mission-level assessment, focusing on selected exemplar missions. This project will result in an identified mission vulnerability assessment method and available tools, as well as critical gaps in tools in order to inform future development and application of this type of assessment as a standard practice."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "This effort will provide support to Program Protection Planning of Critical Missions through analysis of critical missions to\ndetermine critical system dependencies, analysis of critical systems and their linkages to determine vulnerabilities that lead to\nmission degradation, identification of techniques and toolsets to assess and mitigate vulnerabilities, and identification of gaps\nwhere techniques and tools are needed."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2014, generic performance metrics applicable to the Quick Reaction Fund (QRF) includes attainment of DoD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology (S&T) program\" and the metric for this objective is to transition 40 percent of completing demonstrations per year.  Each project has a period of performance of approximately 12 months.  All QRF projects are monitored for schedule deviation, transition outcome, reporting requirements and deliverables such as test reports, studies, components, and equipment.  For projects that were completed in FY 2012, the QRF achieved a transition rate of approximately 88 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P828"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Reaction Fund"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.111"
                        },
                        "CurrentYear": {
                            "val": "55.054"
                        },
                        "BudgetYearOne": {
                            "val": "47.956"
                        },
                        "BudgetYearOneBase": {
                            "val": "47.956"
                        },
                        "BudgetYearTwo": {
                            "val": "48.421"
                        },
                        "BudgetYearThree": {
                            "val": "60.890"
                        },
                        "BudgetYearFour": {
                            "val": "66.628"
                        },
                        "BudgetYearFive": {
                            "val": "58.479"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Quick Reaction Special Projects (QSRP) Program supports five separate projects that provide rapid funding to expedite development and transition of new technologies to the warfighter.  The QSRP Program provides the flexibility to respond to emergent DoD issues and addresses technology surprises and needs that may arise outside the two-year budget cycle. \n\nThe Rapid Reaction Fund (RRF) is fully executed through the Rapid Reaction Technology Office (RRTO).  The RRTO was established to provide rapid response to enhance operations in Iraq, Afghanistan and other theaters; and, to accelerate the transition of high-potential science and technology (S&T) projects into operationally useful products in the execution years.  The RRTO leverages the Department of Defense (DoD) S&T base and those of the other Federal Departments; stimulates interagency coordination and cooperation; accelerates the fielding of capabilities and concepts to counter emerging threats; and, provides feedback to the S&T community to guide long term developmental strategies.  With projects supporting each Combatant Command and with a global perspective, the RRTO anticipates adversaries' exploitation of technology, including available and advanced commercial capabilities. \n\nIn prior years, RRTO has explored methods and approaches of persistent surveillance stimulation for counter-insurgency; developed alternate power sources for sensors and systems; expanded human, social and cultural knowledge; increased small unit situational awareness; advanced the interface between law enforcement and military operations; developed biometrics and forensics capabilities; supported denied area operations; strategic multi-layer assessments; and, established an innovation outreach cell that is facilitating better interactions with small companies with emerging technologies that do not normally do business with the DoD.  \n\nIn FY 2013 and FY 2014, RRTO will continue to explore new and emerging capabilities to support irregular warfare operations while working to support the Under Secretary of Defense (Acquisition Technology & Logistics) (USD (AT&L)), the Assistant Secretary of Defense (Research and Engineering) (ASD(R&E)) and the Deputy Assistant Secretary of Defense, Rapid Fielding (DASD RF) goals.  With project selection occurring during the execution year, the RRTO's potential focus areas for FY 2013 and FY 2014 Rapid Reaction Technology Office projects include:  Forward Operating Base (FOB) protection; persistent Intelligence, Surveillance, and Reconnaissance (ISR) architecture; ISR sensors; interface of law enforcement and military operations; biometrics and forensics S&T; autonomous operations; data processing, exploitation and dissemination (PED); cyber security; exploitation of new and emerging cell phone technologies; support to border patrol initiatives; counter proliferation initiatives; capabilities to exploit denied areas; strategic communications and multi-layer assessments; and, non-traditional approaches to leverage innovative businesses.  \n\nThe typical length of a RRTO project falls within a 6 to 12 month range in order to more effectively respond to the Warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multiple Projects Less Than One Million Dollars Each"
                                    },
                                    "Description": {
                                        "val": "The Rapid Reaction Fund completed and transitioned multiple minor resource projects in the areas of Unmanned Autonomous Vehicles, Detection of Explosives and Weapons of Mass Destruction, Deterrence of Violent Extremism, Exploitation of Off-the-Shelf Technology, Exploitation of Communications Technologies, Small Footprint Operations, and other emerging technology areas.  These projects delivered prototypes for evaluation or assessment to warfighters and interagency users.  FY 2013 minor resource projects include:  Three-dimensional (3D) Thermal FOPEN Imaging, Perseus (non-traditional unmanned underwater vehicle development), Exploiting Space-Based Assets, Aluminum Combustion, Motion Imagery Synthetic Aperture Radar (MISAR), SATCOM High Data Rate Demonstration, Accedo (Doppler-based geolocation), Arms Verification and Control Unmanned Aerial Vehicle (UAV) Testbed, Humanitarian Data Mining, Mobility Applications, Railgun Study, TIDES (exploitation of vehicle tire pressure monitoring systems), Anvil (exploitation of cell phone technology), XCapture (knowledge capture and management system), Enhanced Tactical High Frequency Exploitation (ETHEX), Self-contained Underwater Dispersant Delivery System (SCUDDS), Just Doesn’t Look Right (documentation of expertise and first-hand experience in identification of suicide bombers), Language Exploitation and Analysis from Dynamic Sources, Undersea Technologies Course, Assessment and Visualization of Nuclear Proliferation, Heterogeneous Cooperative Unmanned Vehicles, CellRad (radiation detection by cell phones), RealVision Eye Display (high-definition, three-dimensional display compatible with night vision cameras), SHARC Byte (exfiltration of data from unmanned underwater vehicle), CyPhy (tethered unmanned aerial vehicle), FMV-On-Target, Dynamic Photoacoustic Spectroscopy, HARE (detection of trace explosives in human hair), Tire Ball (low-weight multi-cell tire inflation system to enable operational vehicles to run with multiple punctures), Interactive Causal Decision Aid, Instant Eye (low-cost micro-UAV), Tertiary Proliferation Signatures, Anti-Swimmer (a distributed underwater harbor detection system), Iris on Android (biometric iris identification on android smartphones), High Temperature Carbon Nanotube Composite, Solar Hydrogen Subsystem, Technology Solutions for Manufacturing Advanced Products, TriBand SlimSAR (tri-band single aperture radar capable of being flown on a medium-sized UAV), Technology Assessments for Innovative Solutions, Nadir-Looking SAR, Multi-Sensor Airborne Intelligence, Reconnaissance, and Surveillance, and Human-Propelled Mini-Submarine."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.413"
                                            },
                                            "Text": {
                                                "val": "The following projects were completed and transitioned to operational users:  3D Thermal FOPEN Imaging, Perseus, Exploiting Space-Based Assets, Aluminum Combustion, MISAR, ACCEDO, Arms Verification and Control UAV Testbed, Humanitarian Data Mining, Mobility Applications, Railgun Study, TIDES, XCapture, ETHEX, SCUDDS, Just Doesn’t Look Right, Language Exploitation and Analysis from Dynamic Sources, Undersea Technologies Course, Assessment and Visualization of Nuclear Proliferation, Heterogeneous Cooperative Unmanned Vehicles, CellRad, RealVision Eye Display, SHARC Byte, IBEAM, CyPhy, FMV-On-Target, Dynamic Photoacoustic Spectroscopy, HARE, Tire Ball, Instant Eye, Tertiary Proliferation Signatures, Anti-Swimmer, Iris on Android, High Temperature Carbon Nanotube Composite, Solar Hydrogen Subsystem, Technology Solutions for Manufacturing Advanced Products, TriBand SlimSAR, Multi-Sensor Airborne Intelligence, Reconnaissance, and Surveillance, and Human-Propelled Mini-Submarine."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tech Assessments"
                                    },
                                    "Description": {
                                        "val": "The Joint Experimental Range Complex (JERC) is a remote test site located at the Yuma Proving Grounds (YPG) that is designed to rapidly evaluate prototype technologies.  These limited proof-of-concept evaluations allow for integration and development of Intelligence, Surveillance, and Reconnaissance (ISR) training and Concept of Operation (CONOPS) development.  Since its establishment in late FY 2003, the Rapid Reaction Technology Office (RRTO) has sponsored evaluation of more than 275 systems at the JERC.  This funding is utilized to provide assessments of technology and contribute to emergent upgrades to capabilities to the site."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.395"
                                            },
                                            "Text": {
                                                "val": "Executed six two-weeks evaluation periods for interested industry and government representatives to test emerging capabilities in a realistic desert environment.  Use of the results of these evaluations has informed the development\/procurement process for future enhanced capabilities and informed operational users of capabilities in development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Conduct two two-weeks evaluation periods for interested industry and government representatives to test emerging capabilities in a realistic desert environment.  Use the results of these evaluations to inform the development\/procurement process for future enhanced capabilities and to inform operational users of capabilities in development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "Conduct six two-weeks evaluation periods for interested industry and government representatives to test emerging capabilities in a realistic desert environment.  Use the results of these evaluations to inform the development\/procurement process for future enhanced capabilities and to inform operational users of capabilities in development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "South Asia (SA) Geo-Political Stability"
                                    },
                                    "Description": {
                                        "val": "In FY 2012, SMA conducted an assessment on South Asia (SA) Geo-Political Stability.  This effort was an assessment of regional stability in SA, and included identifying both direct drivers of interstate conflict, as well as, sources of internal instability that allow safe haven for violent extremist organizations and exacerbate interstate tensions.  This assessment directly assisted in decision making, as well as, crisis planning, involving either India, Pakistan or both."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.303"
                                            },
                                            "Text": {
                                                "val": "The SA Stability effort’s sub-elements produced a Regional Risk Assessment which integrated the results of several Director of National Intelligence\/National Intelligence Council strategic gaming efforts with George Mason University Strategic Modeling into a conflict escalation\/de-escalation assessment.  The effort also provided a Sub-regional Risk Assessment comprised of U. S. Army Training and Doctrine Command and Private Industry, modeling efforts of crisis scenarios as well producing a background report of the confluence of Violent Extremist Organizations (VEO) and criminal networks all of which fed into the Department of Energy National labs’ vulnerability and risk assessments.  Finally the effort converged on developing approaches to countering instability.  The reports have helped inform the U.S. Central Command, U.S. Pacific Command, and U.S. Strategic Command decision making processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "U.S. CENTCOM has requested a follow-on effort to the South Asia Assessment.  This follow on effort will examine the assessment of regional stability in SA and will identify both direct drivers of interstate conflict as well as sources of internal instability. Internal instability which allows for VEO safe havens that may spill-over into, and exacerbate interstate tensions.  The stability and instability factors in the assessment include:  (1) Ethnic divisions, recent anti-regime opposition movements, and other sources of internal social, economic and governing instability that may lead to state failures of various kinds; (2) The domestic and external factors driving regional actors – both state and non-state, (3) The contagion dynamics – including social media and shared narratives -- that transfer instability within and across state borders. This effort will assist Combatant Command (COCOM) planners in assessing strategic long-term and short-term regional stability.  It will also assist the planners in assessing sub-regional stability through various short-term excursions, a threat scenario, and a conflagration scenario.  This effort will also examine long-term decline and will propose a multi-generational Security Strategy Concept designed to avoid conflagration.  The payoff to the warfighter will be a detailed, classified multi-method assessment of regional conditions combined with unclassified (e.g., academic, Subject Matter Expert, etc.) input not generally found in U.S. Government work."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.100"
                                            },
                                            "Text": {
                                                "val": "Continue to actively work with the COCOMs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of the COCOMs and may include areas such as: counter terrorism; counter weapons of mass destruction (state and non-state); counter global or regional social and cultural assessments; and, individual state or national level deterrence studies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biometrics and Forensics Science and Technology Focus Area (FY 2013 and FY2014 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2013 and FY 2014 Biometrics and Forensics Science and Technology projects will address the technology gaps that limit our ability to quickly and accurately identify anonymous individuals who threaten our physical and virtual assets either overseas or in the Homeland.  Additionally, the biometrics and forensics projects will collaborate with interagency partners to attribute enemy activity to a specific individual; and, will operationally evaluate and test biometrics and forensics systems and technologies.  Biometrics and Forensics projects will develop emerging technologies that support evolving identity operations and forensic capabilities required by commanders and warfighters in ongoing and future military activities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "The biometric portfolio will support gaps identified by commanders in the areas of increasing standoff distance for collection, exploration of the use of emerging biometric modalities and collection of biometric data from non-cooperative subjects.  The forensic portfolio will support gaps identified by commanders in the areas of reducing time to collect forensic data, improving accuracy of analysis of data, increasing the types of forensics data collected and increasing the amount of analysis that can be done in a field environment vice a laboratory environment.  Projects will be selected after coordination throughout DoD and across other U.S. Government Departments and Agencies to maximize collaborative investment and prevent redundant research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "The biometric portfolio will support gaps identified by commanders in the areas of increasing standoff distance for collection, exploration of the use of emerging biometric modalities and collection of biometric data from non-cooperative subjects.  The forensic portfolio will support gaps identified by commanders in the areas of reducing time to collect forensic data, improving accuracy of analysis of data, increasing the types of forensics data collected and increasing the amount of analysis that can be done in a field environment vice a laboratory environment.  Projects will be selected after coordination throughout DoD and across other U.S. Government Departments and Agencies to maximize collaborative investment and prevent redundant research."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Commercial Product Vulnerabilities and Applications (FY 2013 and FY 2014 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2013 and FY 2014 Commercial Product Vulnerabilities and Applications projects will explore the use of commercial-off-the-shelf products to address immediate operational needs.  This focus area identifies and exploits technological advances made by commercial industry which may have immediate military utility.  These projects also explore the vulnerabilities of readily available technology used by adversaries."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.439"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities to identify commercial product vulnerabilities and applications.  Anticipate supporting six to eight projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.307"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.307"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities to identify commercial product vulnerabilities and applications.  Anticipate supporting five to six projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming in Support of Rapid Fielding (FY 2013 and FY 2014 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2013 and FY 2014 Red Teaming projects will assess the susceptibility of rapidly fielded capabilities to be defeated by parties not intimately familiar with the technology.  RRTO will leverage the innovative capabilities of Federally Funded Research and Development Centers, academia, and industry to develop a construct that current or future systems can be gamed against in a distributed table top environment against traditional and non-traditional players.  Deliverables will inform enhancement decisions and Concept of Operations development."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.669"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify key technologies and systems to be assessed by red teams.  Deliverables will include recommendations on system operational employment, potential vulnerabilities, likely countermeasures taken by the threat, and potential counter-countermeasures to increase functionality or operational effectiveness of the system.  Anticipate supporting five to six projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.510"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.510"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify key technologies and systems to be assessed by red teams.  Deliverables will include recommendations on system operational employment, potential vulnerabilities, likely countermeasures taken by the threat, and potential counter-countermeasures to increase functionality or operational effectiveness of the system.  Anticipate supporting four to five projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Source Data Analysis and Applications (FY 2013 and FY 2014 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2013 and FY 2014 Open Source Data Analysis and Applications projects include the development of capabilities, software, and tools to analyze open source information.  The data can be structured or unstructured and will include inputs from a broad spectrum of sources."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.012"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  RRF will support development of open source data analysis tools and applications.  Anticipate supporting four to five projects.  Deliverables will include capabilities and tools to exploit open source information and to reduce manpower required to analyze open source documents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.851"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.851"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  RRF will support development of open source data analysis tools and applications.  Anticipate supporting three to four projects. Deliverables will include capabilities and tools to exploit open source information and to reduce manpower required to analyze open source documents."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Countering Violent Extremism and Planning Support (FY 2013 and FY 2014 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2013 and FY 2014 Countering Violent Extremism and Planning Support projects include studies of violent groups, collection of best-practices from a variety of federal organizations, deterrence, social network analysis, effective communication techniques in tribal environments, science and technical capabilities in support of strategic communications, social analysis to support counter-insurgency efforts and development of multi-disciplinary multi-agency approaches to complex operational challenges.  These studies will inform decision makers and facilitate development of capabilities to counter violent extremism."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.828"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities to counter the spread of violent extremism.  Anticipate supporting seven to eight projects.  Deliverables will include strategies and pilot programs to counter violent extremism in theater, analysis of social networks and of the use of social media to proliferate violent extremism, and tools to support communications in theaters of operation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.766"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.766"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities to counter the spread of violent extremism.  Anticipate supporting six to seven projects. Deliverables will include strategies and pilot programs to counter violent extremism in theater, analysis of social networks and of the use of social media to proliferate violent extremism, and tools to support communications in theaters of operation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Innovation Outreach Focus Area (FY 2013 and FY 2014 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Innovation Outreach will support the Department of Defense Better \nBuying Power objectives by leveraging technology and emerging products developed by small, innovative businesses in the commercial sector. Solutions will be sought to meet needs identified by Combatant Commanders, Military Service organizations, other Defense agencies and interagency organizations. The Innovation Outreach Focus Area will support the Department’s objectives of promoting effective competition and fielding affordable capabilities by developing new sources of innovation from commercial R&D investments. The Innovation Outreach Focus Area will include support of emerging capabilities in Communications, Data and Data Analysis, Alternative Energy, Imagery, Sensors, Social Networking and other areas identified during the execution year."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented. Innovation outreach will plan three engagements with DoD users to areas discussed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.782"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.782"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented. Innovation outreach will plan five engagements with DoD users to areas discussed above."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Systems and Behaviors (FY 2013 and FY 2014 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2013 and FY 2014 Autonomous Systems and Behaviors projects include improvements to power systems to facilitate increased performance of unmanned systems, enhanced capabilities for multiple autonomous systems to cooperatively interact, development of sensors for integration aboard unmanned platforms, improvements to data ex-filtration from unmanned sensors and “red teaming” to counter emerging unmanned threats from potential adversaries.  These projects will also examine the establishment of common software platforms to reduce development cost, increase collaboration among disparate unmanned vehicles and support rapid customization of autonomous systems’ architectures."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.090"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  RRF will support development of unmanned autonomous aerial, surface and subsurface systems.  Anticipate supporting five to six projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.877"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.877"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to Combatant Command (COCOM), Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  RRF will support development of unmanned autonomous aerial, surface and subsurface systems.  Anticipate supporting four to five projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Interface of Military Operations with Law Enforcement and Border Patrol (FY 2013 and FY 2014 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2013 and FY 2014 Interface of Military Operations with Law Enforcement and Border Patrol new start projects include collaboration and exercises with law enforcement organizations to identify overlap and synergies between military and law enforcement operations, exploitation of law enforcement data for use in an irregular warfare environment, development of improved border protection capabilities that can be used in military base protection and expanding the capabilities of biometrics and forensics tools."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.912"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities of interest to multiple federal organizations.  Anticipate supporting six to seven projects.  Deliverables will include prototype sensors and knowledge management systems, as well as a demonstration of DoD developed technologies that may fulfill Law Enforcement and Border Patrol requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.806"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.806"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future capabilities of interest to multiple federal organizations.  Anticipate supporting five to six projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, and Reconnaissance (ISR) (FY 2013 and FY 2014 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2013 and FY 2014 ISR new start projects include improved surveillance sensors, tools to facilitate analysis of large data sets, methods to harvest meaningful intelligence from open and classified sources and establishment of more effective processing, exploitation, and dissemination capabilities to facilitate integration of new and existing systems.  Projects in this area generally involve high risk and have high potential reward, and are not being addressed by other organizations.  Projects will also explore technologies to improve ISR in denied areas.  ISR projects will also evaluate methods of increasing the effectiveness of ISR architectures to maximize the capability delivered to the user and to reduce the amount of human analyst manpower required to produce actionable intelligence."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.542"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOM, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future ISR capabilities.  Anticipate supporting four to five projects.  Deliverables will include prototype systems and software for a variety of platforms, as well as analytical capabilities developed to reduce the manpower burden needed to process large sets of ISR data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.601"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.601"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future ISR capabilities.  Anticipate supporting three to four projects. Deliverables will include prototype systems and software for a variety of platforms, as well as analytical capabilities developed to reduce the manpower burden needed to process large sets of ISR data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Urban Characterization Focus Areas (FY 2013 and FY 2014 New Start Focal Area Plans)"
                                    },
                                    "Description": {
                                        "val": "Focal area for FY 2013 and FY 2014 Urban Characterization projects will identify, analyze, and describe typical urban areas for modeling, simulation and planning purposes.  These efforts will inform and enable development of intelligence, surveillance and reconnaissance (ISR), electronic warfare, kinetic\/non-kinetic and other capabilities needed for future military operations in a wide range of urban areas."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.812"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  RRF will support development of open source data analysis tools and applications.  Anticipate supporting five to six projects.  Deliverables will include modeling and simulations systems to support planning efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.606"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.606"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to COCOMs, Service and other government organizations' requirements and as new threats emerge or new opportunities are presented.  RRF will support development of open source data analysis tools and applications.  Anticipate supporting three to four projects. Deliverables will include modeling and simulations systems to support planning efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2014, generic performance metrics applicable to the Rapid Reaction Fund (RRF) includes attainment of DoD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology (S&T) program\" and the metric for this objective is to transition 40 percent of completing project demonstrations per year.  In addition, project performance metrics are specific to each effort and include measures identified in the specific project plans.  Project completions and success are monitored against schedules and deliverables stated in the proposals and statements of work. The metrics include items such as target milestone dates, production measures, fielding dates, and demonstration goals and dates.   For projects completed in FY 2012, the RRF achieved a transition rate of greater than 81 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P830"
                    },
                    "ProjectTitle": {
                        "val": "RDT&E Architecture and Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.164"
                        },
                        "CurrentYear": {
                            "val": "10.316"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The RDT&E Architecture and Integration (RAI) program objectives are to enhance and expand rapid technology architecture and assessment capabilities in general; and, to enhance the Joint Experimentation Range Complex (JERC), Stiletto maritime test platform and the Thunderstorm ISR exercise series.  The JERC provides a venue to evaluate a wide range of new technologies in a dessert environment.  The requested funding will also support Stiletto, a maritime test vessel that routinely hosts numerous new technologies for evaluation in a maritime environment.  Thunderstorm, an ongoing Intelligence, Surveillance, and Reconnaissance (ISR) exercise series, is also supported by this budget line.  Thunderstorm brings emerging ISR technologies together in a common architecture for exercise and operational demonstration.   \n\nWith the drawdown of operations in Afghanistan in FY2014, the requirements for many of the assessments supported by this budget line have been greatly reduced.  The remaining assessment requirements will be addressed by other Program Elements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Experimentation Range Complex (JERC) Architecture and Infrastructure Improvement Program"
                                    },
                                    "Description": {
                                        "val": "This program expanded JERC capabilities by increasing radio frequency range when conducting hardware in the loop (HWIL) testing and networking of multiple test sites.  This enhancement complemented the Assistant Secretary of Defense (Research and Engineering) (ASD R&E) and Joint Improvised Explosive Device Defeat Organization (JIEDDO) Science & Technology (S&T) investment and acquisition strategy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.731"
                                            },
                                            "Text": {
                                                "val": "Projects completed and transitioned included: increase in Radio Frequency Range for Hardware in the Loop (HWIL) testing; Long Term Evolution (LTE) Fourth Generation (4G) cell phone Network Hardware Integration; LTE 4G Network for Remote Sites; Extended Geodetic Reference Stations; and, Remote Base\/Repeater Turn-Key System.  These enhancements complement the Assistant Secretary of Defense (Research and Engineering) (ASD R&E) and Joint Improvised Explosive Device Defeat Organization (JIEDDO) Science & Technology (S&T) investment and acquisition strategy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.200"
                                            },
                                            "Text": {
                                                "val": "Evaluate trends of the emerging threat to blue forces and continue improvements to the testing infrastructure to support evaluation of emerging technologies to counter the evolving threat.  Potential future focus areas could include Fifth Generation (5G) cellular networks, novel enhanced explosives, comprehensive force protection capabilities, more robust Intelligence Surveillance and Reconnaissance (ISR) sensors and improvements to data handling.  These investments will continue to support the ASD(R&E) and JIEDDO S&T investment and acquisition strategy.  Anticipate the funding of three projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cloudbreak"
                                    },
                                    "Description": {
                                        "val": "The CLOUDBREAK project focused on Command and Control (C2) among all Combatant Commands (COCOMs).  CLOUDBREAK drove a common “plug and fight” architecture that provides services and consumes data based on the Defense Information Enterprise Architecture (DIEA) and the Defense Intelligence Information Enterprise (DI2E) frameworks.  CLOUDBREAK demonstrated capabilities which can be provided as composable services on the Global Information Grid (GIG).  Success was achieved when capabilities based on common standards were incorporated into multiple programs of record and other tools to be employed by multiple COCOMs.  The CLOUDBREAK program demonstrated mature capabilities in Cyber, Operations\/Intelligence, Situational Awareness and Regional Domain Awareness that meet COCOM priorities.  Project details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.433"
                                            },
                                            "Text": {
                                                "val": "Cloudbreak capabilities were incorporated into the DIEA and DI2E framework and are supporting multiple COCOM’s.  Further details are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stiletto"
                                    },
                                    "Description": {
                                        "val": "Stiletto is a maritime demonstration platform designed to assist in the rapid transition of emerging technologies across the range of military operations to higher Technology Readiness Levels.  The 88-foot long boat is an experimental, all carbon fiber craft that was purposefully designed to rapidly acquire, integrate, and employ new capabilities to explore the military utility of emerging technologies and concepts of operation for special and expeditionary forces.  The Stiletto program, managed in partnership with the Naval Surface Warfare Center’s Combatant Craft Division and the Naval Air Warfare Center Aircraft Division’s Warfare Innovation Cell, streamlines the experimentation process and helps facilitate the rapid demonstration, exploration, and risk reduction of emerging technologies and capabilities.  Stiletto’s simple application process for experimentation is intended to provide low cost access for industry, government, and academic organizations to install and prove their systems in a realistic maritime environment.  The demonstration process also encourages system developers to engage directly with the warfighter in the maritime environment to rapidly adapt technologies around warfighter needs.  The Stiletto vessel is home-ported in Norfolk, Virginia."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.162"
                                            },
                                            "Text": {
                                                "val": "Stiletto will conduct three Capability Demonstrations in FY 2013, including participation in Trident Warrior and Trident Spectre, in coordination with organizations that include Naval Expeditionary Combat Command, Naval Special Warfare Support Activity-2, US Army Watercraft Systems, and the United Kingdom Ministry of Defense.  Stiletto will also offer Technology Demonstration periods throughout the year to expand the number of opportunities for non-traditional businesses that have not worked with DoD to utilize Stiletto as a low cost, accessible demonstration venue for maturing their systems in a maritime environment.  Priority will be given to demonstrations that directly assist an acquisition program, with specific focus on technology transition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Thunderstorm"
                                    },
                                    "Description": {
                                        "val": "Thunderstorm is an enduring multi-Intelligence technology demonstration for the Office of Secretary of Defense (OSD), interagency partners, Combatant Commanders, Services, academia, government laboratories, and commercial vendors.  The demonstration provides an opportunity to evaluate and assess the capabilities of new, emerging and transformational Intelligence, Surveillance, and Reconnaissance technologies, and related information collection, processing, exploitation, and dissemination (PED) capabilities in mission-related, geographically, and operationally relevant environments prior to full-scale employment.  Thunderstorm demonstration objectives, performance measures, lessons learned, post-demonstration assessments and data evaluation serve to inform future DoD Intelligence, Surveillance, and Reconnaissance concepts of operations and remote PED capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.162"
                                            },
                                            "Text": {
                                                "val": "Thunderstorm Spirals 13-1 and 13-2 planning began in early FY 2013.  Both spirals will build on Spiral 5.0 lessons learned in the Rio Grand Valley Sector.  Spiral 13-1’s primary focus will be to further characterize and counter asymmetrical maritime threats and inform tactics, techniques, and procedures to detect and discriminate suspicious open water, littoral and maritime-to-land transition activity.  Execution of the spring 2013 spiral will leverage partnerships with Customs Border Protection (CBP), Joint Interagency Task Force-South (JIATF-S), Joint Task Force-Northern Command (JTF-N B), the United States Coast Guard (USCG), National Geospatial-Intelligence Agency (NGA), National Reconnaissance Office (NRO), U.S. Southern Command (SOUTHCOM) and U.S. Northern Command (NORTHCOM). Emphasis will be placed on near real-time information dissemination and display.  Spiral 13-2 will be executed in summer 2013.  This spiral builds upon Spiral 13-1 and places emphasis on the maritime-to-land transition activity and the ability for suspicious actors to quickly dissolve themselves into an urban or rural population."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tech Assessments"
                                    },
                                    "Description": {
                                        "val": "The Joint Experimental Range Complex (JERC) is a remote test site located at the Yuma Proving Grounds (YPG) that is designed to rapidly evaluate prototype technologies.  These limited proof-of-concept evaluations allow for integration and development of Intelligence, Surveillance, and Reconnaissance (ISR) training and Concept of Operations (CONOPS) development.  Since its establishment in late FY 2003, the Rapid Reaction Technology Office (RRTO) has sponsored evaluation of more than 275 systems at the JERC.  This funding is utilized to provide assessments of technology and contribute to emergent upgrades to capabilities to the site."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.792"
                                            },
                                            "Text": {
                                                "val": "Execute six two-weeks evaluation periods for interested industry and government representatives to test emerging capabilities in a realistic desert environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NA"
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2013, generic performance metrics applicable to the RDT&E Architecture and Integration initiative includes attainment of DoD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology (S&T) program” and the metric for this objective is to transition 30 percent of completing project demonstrations per year. Project performance metrics are specific to each effort and include schedules and deliverables stated in the proposals and statements of work, production measures, fielding dates, and demonstration goals and dates."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P831"
                    },
                    "ProjectTitle": {
                        "val": "Joint Rapid Acquisition Cell Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.710"
                        },
                        "CurrentYear": {
                            "val": "1.760"
                        },
                        "BudgetYearOne": {
                            "val": "1.819"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.819"
                        },
                        "BudgetYearTwo": {
                            "val": "1.873"
                        },
                        "BudgetYearThree": {
                            "val": "1.930"
                        },
                        "BudgetYearFour": {
                            "val": "1.987"
                        },
                        "BudgetYearFive": {
                            "val": "2.047"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This funding includes support for the Joint Rapid Acquisition Cell (JRAC) to enable management and tracking of Combatant Commander (COCOM) identified and Joint Staff validated immediate warfighter needs.  FY 2012 was the first year for a dedicated funding line for this effort. The funding in this project is under the cognizance of the JRAC and is responsible to: \n(1)  Coordinate review of validated Joint Urgent Operational Needs (JUON) and assign responsibility to appropriate DoD Components for timely funding and resolution. \n(2)  Serve as the review and approval authority for the DoD Components’ strategy to fund and mitigate the identified JUON capability gap. \n(3)  Continually assess actions taken by the DoD Components to resolve JUONs and recommend to the Under Secretary of Defense for Acquisition, Technology, and Logistics (USD(AT&L)) any changes determined appropriate to improve their responsiveness to JUONs.\n(4)  Provide periodic reports to the Secretary of Defense on new and outstanding JUONs.   \n(5)  In coordination with Under Secretary of Defense Comptroller (USD(C)), manage the Rapid Acquisition Fund (RAF) to allocate resources to priority unfunded JUONs.\n(6)  In coordination with the Office of the Chairman of the Joint Chiefs of Staff and the USD(C), make programmatic, budget, and acquisition recommendations for JUONs and identify capability gaps to the Secretary of Defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Rapid Acquisition Cell (JRAC) Management Support"
                                    },
                                    "Description": {
                                        "val": "This funding is utilized to support the staff manning of the JRAC to enable management and tracking of COCOM identified and Joint Staff validated immediate warfighter needs.  This baseline was initiated in FY 2012 to preclude ad hoc and unstable historical programmatic and financial support to the JRAC staff."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.710"
                                            },
                                            "Text": {
                                                "val": "Supported the JRAC to enable management and tracking of COCOM initiated and Joint Staff validated immediate warfighter needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.760"
                                            },
                                            "Text": {
                                                "val": "Support for the JRAC to enable management and tracking of COCOM initiated and Joint Staff validated immediate warfighter needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.819"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.819"
                                            },
                                            "Text": {
                                                "val": "Support for the JRAC to enable management and tracking of COCOM initiated and Joint Staff validated immediate warfighter needs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NA – Capabilities acquired to fulfill JUONs are provided by other DoD components."
                        },
                        "PerformanceMetrics": {
                            "val": "JRAC performance metrics are specific to each JUON and include measures identified in the management approach for each JUON.  In addition, JUON completions and successes are monitored against schedules and deliverables stated in the JUON management approach.  The metrics to which JRAC support correlates is to the number of full time personnel identified in the JRAC support contract with associated pay rates and shall not exceed the specified amounts or hourly rates and\/or firm fixed price."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P833"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Multi-Layered Assessment (SMA) Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.970"
                        },
                        "BudgetYearOne": {
                            "val": "2.029"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.029"
                        },
                        "BudgetYearTwo": {
                            "val": "2.100"
                        },
                        "BudgetYearThree": {
                            "val": "2.163"
                        },
                        "BudgetYearFour": {
                            "val": "2.227"
                        },
                        "BudgetYearFive": {
                            "val": "2.303"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Strategic Multi-Layered Assessment (SMA) project was added in FY 2013 as a result of a net zero functional transfer of resources and mission from United States Strategic Command (USSTRATCOM)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Strategic Multi-Layered Assessment Cell supports all Combatant Commands (COCOMs), Joint Force Commanders and other government agencies by assessing complex operational\/technical challenges which require multi-agency and multi-disciplinary approaches.  With input from across the United States Government, academia and the private sector, the SMA cell develops solution options to COCOM generated challenging problems and informs the command’s senior leadership.  Each SMA effort is initiated at the request of senior COCOM leadership.  Priorities for SMA problems are set by the Joint Staff Deputy for Operations.  Products are typically produced within six months and directly contribute to the decision making process of COCOM's senior leaders."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Multi-Layered Assessment (SMA)"
                                    },
                                    "Description": {
                                        "val": "The SMA cell develops solution options, not generally found in U.S. Government work, to COCOMs generated challenging problems and informs the command’s senior leadership.  Each SMA effort is initiated at the request of senior COCOM leadership.  Priorities for SMA problems are set by the Joint Staff Deputy for Operations.  Products are typically produced within six months and directly contribute to the decision making process of COCOM's senior leaders."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.970"
                                            },
                                            "Text": {
                                                "val": "At the request of U.S. Pacific Command the SMA cell will undertake a Megacities project.  This project consists of three components.  The first component is a research study into methods of conducting socio-cultural analysis including remote sensing techniques for collecting indicator variables of resilience and vulnerability within interrelated megacity and rural systems.  The second component will be a case analysis of the drivers of and buffers to political, social, economic and environmental instability in the Dhaka, Bangladesh population center.  The third component of the study will be an assessment and testing of novel ways to present and visualize megacity stability data.  This will benefit COCOM planners with forecasting socio-cultural trends affecting state, regional, or community level stability.  Also this effort will answer the need for quantitative stability assessment approaches to address key national security considerations including the potential for or resurgence of violent extremism; humanitarian crisis; reinforcement of outlier state behavior and consideration of partner and ally relations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.029"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.029"
                                            },
                                            "Text": {
                                                "val": "The SMA cell will continue to actively work with the COCOMs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of the Combatant Commanders and may include areas such as: counter terrorism; counter weapons of mass destruction (state and non-state); counter global or regional social and cultural assessments; and, individual state or national level deterrence studies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "SMA performance metrics are specific to each effort and include measures identified in the specific project plans.  In addition, project completions and successes are monitored against schedules and deliverables stated in the execution documents.  Each project results are reviewed by a senior review group that is comprised with representatives from the Office of the Secretary of Defense, the Joint Staff, the COCOMs and outside subject matter experts.  The ultimate measure of success is adaption and transition of SMA products by the COCOM and supporting entities."
                        }
                    }
                }
            ]
        }
    }
}