{
    "id": "1fecc1855cbcfd5967189c03bf37b042fea310ab",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA3_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603734A"
        },
        "ProgramElementTitle": {
            "val": "Military Engineering Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "52"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "40.496"
            },
            "CurrentYear": {
                "val": "28.458"
            },
            "BudgetYearOne": {
                "val": "23.717"
            },
            "BudgetYearOneBase": {
                "val": "23.717"
            },
            "BudgetYearTwo": {
                "val": "20.874"
            },
            "BudgetYearThree": {
                "val": "19.451"
            },
            "BudgetYearFour": {
                "val": "20.169"
            },
            "BudgetYearFive": {
                "val": "19.559"
            }
        },
        "ProgramElementNote": {
            "val": "FY12 reprogramming increase for MAPCAT."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates data and information architectures and software applications, as well as sensing systems, that can be used to provide Warfighters with timely, accurate, easily interpretable data and information for the operational and tactical mission environments, focusing physical and human terrain and weather; methodologies, software applications and hardware for improving ground vehicle mobility and countermobility to support ground force operations, including force projection; components, subsystems, and systems to increase the survivability of personnel, critical assets, and facilities through structures, shields, and barriers to combat highly adaptive and increasingly severe threats; and components, systems, and interoperable systems of systems for detecting threats, assessing situations, defending against threats, and communicating information and warnings for deployable force protection.   \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThis work is fully coordinated with and complementary to PE 0602784A (Military Engineering Technology). Deployable force protection activities are coordinated with research, development and engineering centers and laboratories across the US Army, Navy and Air Force.\n\nWork in this PE is led, managed or performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.458"
                },
                "CurrentYear": {
                    "val": "28.458"
                },
                "BudgetYearOne": {
                    "val": "24.198"
                },
                "BudgetYearOneBase": {
                    "val": "24.198"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.496"
                },
                "CurrentYear": {
                    "val": "28.458"
                },
                "BudgetYearOne": {
                    "val": "23.717"
                },
                "BudgetYearOneBase": {
                    "val": "23.717"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.038"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.481"
                },
                "BudgetYearOneBase": {
                    "val": "-0.481"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "5.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.962"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.481"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.481"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "T08"
                    },
                    "ProjectTitle": {
                        "val": "COMBAT ENG SYSTEMS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.496"
                        },
                        "CurrentYear": {
                            "val": "28.458"
                        },
                        "BudgetYearOne": {
                            "val": "23.717"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.717"
                        },
                        "BudgetYearTwo": {
                            "val": "20.874"
                        },
                        "BudgetYearThree": {
                            "val": "19.451"
                        },
                        "BudgetYearFour": {
                            "val": "20.169"
                        },
                        "BudgetYearFive": {
                            "val": "19.559"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates software and architectures for geospatial mapping applications and decision aids for the Warfighter; components, systems, system of systems and decision aids to enable ground vehicle mobility (freedom of movement), including force projection, countermobility to impede movement of threat forces; survivability and force protection to protect personnel, facilities and assets through design and reinforcement of structures, and deployable force protection to detect, assess, and defend against threats for troops deployed at smaller bases (such as bases being compromised or overrun). Work is in support of current and future ground force operations.  Software and architectures for geospatial projects mature and validate geospatial decision tools in support of operations planning and decision making to advance utility for geospatial capability and techniques across the Army, services and coalition and to advance and mature the information architecture that supports the total Army's discovery and access to data, geospatial information and analytical tool suites.  Deployable Force Protection (DFP) activities are focused on filling critical gaps in protecting forces operating at smaller, remote bases and include maturation, integration, and demonstration of components, systems and systems of systems for rapidly deployable threat detection in direct line-of-site and non-line-of-site environments; situation assessment to help reduce false alarms and decrease manpower required to monitor the environment; passive protection to mitigate blasts, direct, and indirect fire effects; and active defense to suppress or eliminate threats and threat systems.  Work in survivability and force protection also includes maturing and demonstrating software to characterize blast effects generated from explosive events, such as improvised explosive device detonation in soils, and support design and decision aids.  Work in mobility and force projection includes maturing and demonstrating software and hardware to assess and improve freedom of movement for ground forces.  \n\nWork in this project supports the Army S&T Ground and Command, Control, Communications and Intelligence (C3I) Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nThis work is fully coordinated with and complementary to PE 0602784A (Military Engineering Technology).  Geospatial activities are coordinated with the National Geospatial Intelligence Agency (NGA).\n\nWork in this project is led, managed or performed by the US Army Engineer Research and Development Center, Vicksburg, MS.  The work in Deployable Force Protection (DFP) is coordinated with research, development and engineering centers and laboratories across the US Army, Navy and Air Force."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defeat of Emerging Adaptive Threats"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, validates, and matures components of protective systems to combat highly adaptable and increasingly severe threats to save lives of warfighters and also increase the survivability of fixed facilities and critical assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and validated performance of novel layered protective systems under live-fire tests in realistic environments; matured components, fabricated prototypes, optimized implementation, and established initial fielding of protective systems to defeat large-caliber rockets, vehicle-borne improvised explosive devices (IED), human-borne IEDs, and shoulder-fired rockets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geo-Enabled Mission Command Enterprise (Previously titled - Advanced Geospatial Tools and Architectures)"
                                    },
                                    "Description": {
                                        "val": "This effort matures methods and demonstrates data, information, and software tools and architectures to bring physical and human terrain and effects data into decision frameworks for consistent and accurate implementation in the Army Geospatial Enterprise (AGE).  This provides ready-access of low-overhead, light-weight, analytic tools to other Services and DoD and increases situational awareness of the operational environment in support of mission planning and operations.  In FY14 this effort supports Technology Enabled Capability Demonstrations 3a, Surprise\/Tactical Intelligence Mission Command, and 3b, Surprise\/Tactical Intelligence Actionable Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.147"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed multi-platform, cross community applications and software services supporting the integration and synchronization of Intelligence (Intel), Operations (Ops) and Geospatial (Geo) functions; transitioned several Tactical Spatial Objects (TSOs) and web-services to the Combined Joint Mapping ToolKit (CJMTK); transitioned several TSOs to Distributed Common Ground System - Army; completed the interoperability and documentation of an integrated set of services that will support an improved, joint collaborative planning processes to work seamlessly regardless of physical location and automatedcompletion of digital operations orders."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.782"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature and evaluate software algorithms and architectures for humanitarian assistance and disaster response, allowing military support to and incorporation of other nations and organizations into Army and DoD information computing environments; demonstrate appplications of algorithms and architectures with 100% open software and standards; mature and deliver a wiki-like software environment to obtain, authenticate, and share socio-cultural data, information and concepts; develop tools for terrain and cultural feature extraction and begin the data enterprise framework integration; develop a unified sensor coverage framework and adaptive sensor performance assessment for active and passive counter-insurgency defeat tool; mature an optimized, operational pattern analysis tool focusing on physical, social, cultural, adversarial, and friendly datasets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.141"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate software tools for mission command systems to include digital operation order generation and collaborative Course of Action planning; demonstrate use and application of map-based narratives for military applications on the Secure Internet Protocol Router Network and Joint Worldwide Intelligence Communications System with advanced spatial and temporal visualization and collaboration engines.  Will demonstrate geospatially enabled persistent surveillance and analytic capabilities based on mission, threat, terrain and weather to provide synchronization of unattended ground sensors and small unit unattended aerial systems for increased situational awareness of threats at small outposts, convoy operations and key urban locations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deployable Force Protection Technology Integration Demonstrations and Red Teaming"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates rapidly deployable threat detection, situation assessment, passive protection and active defensive technology-enabled capabilities to meet critical capability gaps for troops operating remotely at smaller bases or integrated with local communities. The needs at these smaller bases (less than 300 persons, not all U.S. troops) are unique based on constraints in transportability, manpower, organic resources, lack of hardening of structures, resupply, and training for example. Moreover, lack of interoperability and scaleability consume manpower and take away from time needed to perform missions. Threats include bases being overrun by hostiles; direct fire; rockets, artillery and mortars; and improvised explosive devices. Force protection challenges at these remote, smaller bases include providing increased standoff detection, blast and ballistic protection, and kinetic technologies subject to the constraints mentioned above.  This effort begins to fill a significant gap in force protection capabilities. This work is fully coordinated with PE0602784A\/T40, Deployable Force Protection; PE 0602786A; PE0603313A\/G03; and PE 0603125A.  Work is performed by Army, Navy, and Air Force labs and centers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.184"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Identified critical force protection gaps and down selected most promising technology enabled solutions to advance active and passive protection, detection and assessment; improved designs to reduce key factors such as size and\/or weight, power and energy, manpower, and support requirements and to enhance performance of systems; integrated capabilities based on stakeholder priorities; continued to conduct full-scale demonstrations and user assessments and conduct red and blue team missions in asymmetric and other relevant environments to identify further areas for improving robustness of design and implementation and to increase systems effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.716"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete development of low-logistics, rapidly deployable, overhead cover system for select critical asset protection; demonstrate perimeter standoff enforcement capabilities and entry control point technologies; demonstrate reinforcement of existing structures typical of conditions in operating environments; conduct evaluation of deployable radio frequency direction finding system to locate hostile activity; demonstrate integrated architecture for sensor components\/systems; demonstrate enhanced detection capabilities for identifying hostiles; continue to conduct full-scale demonstrations and user assessments and conduct red and blue team missions in asymmetric and other relevant environments to identify further areas for improving robustness of design and implementation and to increase systems effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.096"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.096"
                                            },
                                            "Text": {
                                                "val": "Will complete development of first-generation, low-logistic reinforcement technologies for indigenous structures typical of conditions in operating environments; demonstrate lightweight vehicle ramming protection kits for base perimeter protection; will complete development of integrated sensor architecture including web and tactical services, with data exchange standards, protocols, and compliance tools for interoperability; demonstrate integrated pre-shot sniper detection and non-line-of-site threat detection capabilities with improved designs for deployed forces; demonstrate light-weight threat assessment tools for predictive capabilities; conduct full-scale demonstrations and user assessments and conduct red and blue team missions in asymmetric and relevant environments to identify further areas for improving robustness of design and implementation and to increase systems effectiveness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Occupant-Centric Survivability"
                                    },
                                    "Description": {
                                        "val": "This effort develops a comprehensive model of improvised explosive device (IED) detonations in soils that accurately predicts the blast pressure and fragmentation of IEDs on ground vehicle systems in a wide range of operational environments.  This work supports PEs 0633005\/221 and 0622601\/C05 in collaboration with the Tank and Automotive Research, Development and Engineering Center (TARDEC).  In FY13-14 this effort supports Technology Enabled Capability Demonstration 1c, Occupant Centric Platform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated for Tank and Automotive Research, Development and Engineering Center (TARDEC) the numerical modeling capability of ground vehicle protective schemes against surface and buried threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.694"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate advanced numerical methods for coupling occupant response to shock resulting from improvised explosive device (IED) detonations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.724"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.724"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a comprehensive model of vehicle response to mines\/IEDs during Army Occupant Protection Suite Concept Demonstration.  This model represents the next generation of Lagrangian Meshfree methods for airblast\/fragmenting buried weapons of various sizes in different soils at a large range of burial depths.  This model will provide the Army with accurate predictions of the effect of IEDs on vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Austere Entry and Maneuver Support Demonstrations (Previously titled - Rapid Operational Access and Maneuver Support)"
                                    },
                                    "Description": {
                                        "val": "This effort develops improved means for achieving Force Projection in coastal, estuary and riverine environments and an integrated sensing and simulation system for predicting physical conditions in these operational environments.  In FY14 this effort supports Technology Enabled Capability Demonstration 2a, Overburdened Physical Burden."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.266"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate modular, extensible computational toolkit to rapidly assess throughput and mobility of vehicles at austere and remote sites, including along coasts, estuaries, and rivers via reliable simulation of waves, currents, sediment, and other material transport mechanisms affecting movement\/throughput; demonstrate sensor utilization and characterization of operational conditions at austere ports and offload sites for determining infrastructure load carrying capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.256"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.256"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a high performance computing computational testbed that allows for evaluation of sensor and platform tradeoff studies of potential off-loading platforms as well as soldiers in the 9-man squad."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Base Protection"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates integrated protective technologies to plan and expediently construct Combat Outposts (COPs) and Patrol Bases (PBs).  In FY14 this effort supports Technology Enabled Capability Demonstrations 1a, Force Protection - Basing."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate the first version of decision support tools for planning of overall basing architecture that integrates and optimizes force protection architectures and basing functions; incorporate user feedback into second version of modeling software; demonstrate, using troops in the field, an initial perimeter barrier for perimeter security of a COP\/PB constructed of advanced, reusable materials; evaluate troop constructability, protection, and retrograde value to optimize life-cycle cost and effectiveness of systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Map-based Adaptive Planning Course of Action Tool (MAPCAT)"
                                    },
                                    "Description": {
                                        "val": "Map-based Adaptive Planning Course of Action Tool (MAPCAT) is a joint, web-enabled, collaborative, map-based, Course of Action (COA) analysis tool to assist the Combatant Commands and their Service components\/supporting commands to conduct Adaptive Planning (AP). This effort will technically and operationally assess MAPCAT functionality, Common Operating Environment compliance, and usability by Combatant Command and Service Component Command Planners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiated MAPCAT prototype assessment efforts to quantify real-time geospatial data for real-time update to interactive map displays, and other transportation feasibility and planning tools for continuous monitoring and effective response to dynamic situations; conducted preparation for assessment of planning and feasibility analyses capabilties that assure rapid and efficient resource allocation methods are incorporated into custom-made plans to include transportation, logistics, personnel and deployment planning."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}