{
    "id": "20ad2fb33f6a68c1ef1738c6948cc92844e9e680",
    "meta": {
        "filename": "dod-2014_RDTE_2014_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2014.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605126J"
        },
        "ProgramElementTitle": {
            "val": "Joint Integrated Air & Missle Defense Organization (JIAMDO)"
        },
        "R1LineItemNumber": {
            "val": "144"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "71.424"
            },
            "PriorYear": {
                "val": "79.514"
            },
            "CurrentYear": {
                "val": "55.508"
            },
            "BudgetYearOne": {
                "val": "47.462"
            },
            "BudgetYearOneBase": {
                "val": "47.462"
            },
            "BudgetYearTwo": {
                "val": "48.176"
            },
            "BudgetYearThree": {
                "val": "45.908"
            },
            "BudgetYearFour": {
                "val": "46.202"
            },
            "BudgetYearFive": {
                "val": "46.791"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "79.514"
                },
                "CurrentYear": {
                    "val": "55.508"
                },
                "BudgetYearOne": {
                    "val": "47.607"
                },
                "BudgetYearOneBase": {
                    "val": "47.607"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "79.514"
                },
                "CurrentYear": {
                    "val": "55.508"
                },
                "BudgetYearOne": {
                    "val": "47.462"
                },
                "BudgetYearOneBase": {
                    "val": "47.462"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.145"
                },
                "BudgetYearOneBase": {
                    "val": "-0.145"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.145"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.145"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "JIAMDO-Homeland:  Programs will be near development completion and conducting Military Utility Assessment, which requires live assets and integration development.  \n\nJIAMDO-Core:  The Joint Staff plans to reduce dependence upon contracted advisory and assistance service efforts, and increase leverage upon organic (military and federal civilian) labor.\n\nFY2014 reduction is due to a both a decreasing resource environment and decreased reliance on contract support."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Core"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "24.751"
                        },
                        "PriorYear": {
                            "val": "9.030"
                        },
                        "CurrentYear": {
                            "val": "22.508"
                        },
                        "BudgetYearOne": {
                            "val": "21.767"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.767"
                        },
                        "BudgetYearTwo": {
                            "val": "22.481"
                        },
                        "BudgetYearThree": {
                            "val": "19.967"
                        },
                        "BudgetYearFour": {
                            "val": "20.627"
                        },
                        "BudgetYearFive": {
                            "val": "20.916"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team. JIAMDO also provides direct support to U.S. Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Core"
                                    },
                                    "Description": {
                                        "val": "Provides overall staff support for JIAMDO operations in the area of ballistic missile defense, air and cruise missile defense and homeland defense. This includes performing analyses, demonstrations, and programmatic assessments of technology, operations, requirements, and weapons systems. In coordination with Services and COCOMs, JIAMDO Core also leads the definition, assessment, development, and approval of Joint AMD Operational Concepts, Operational Architectures, and capability requirements to guide the Department's joint\/interagency\/combined fully integrated and net-centric capable air defense (including defense against cruise missiles, unmanned aerial vehicles, and ballistic missiles). JIAMDO Core also:\n• Develops and integrates joint exercises, simulations, war-games, force resource allocations, and interoperability initiatives\n• Manages relevant Congressional interaction and COCOM interface through a cadre of liaisons collocated with major headquarters\nDirectly supports and sponsors homeland air surveillance related demonstration and analysis activities\n• Runs the AMD Working Group focusing COCOM, Joint Staff, and Service collaboration efforts in the generation of joint concepts and development of the integrated AMD architecture and roadmap\n• Develops US positions for, and serves as the US representative to, the NATO Air Defense Committee\n\nJIAMDO Core also enables strategic planning development, infrastructure, security, travel, administrative and other support activities. Funding pays for: Contractor Systems Engineering and Technical Assistance (SETA) support for Air & Cruise Missile Defense (ACMD), Ballistic Missile Defense (BMD), Homeland Air Security (HAS) strategic planning, senior level briefings, and JIAMDO white papers; leased office space, including all upkeep services; all travel costs for government and contractor support personnel, including support for Combatant Commander liaison personnel travel; multiple levels of security including lease support for a Joint Worldwide Intelligence Communications System (JWICS) communications line and Special Compartmented Information (SCI) terminals (due to the classified nature and the diverse content of work in the JIAMDO portfolio); 24-hour physical security force and alarm monitoring and maintenance; daily on-site security personnel to meet DOD, National Industrial Security Program Operating Manual (NISPOM), and other security regulations; for all administrative and support functions; all associated Information Technology (IT) support, copier purchase and maintenance, as well as basic office supplies and furniture; all telephones, telephone lines, classified telephones, and classified\/unclassified data connections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.030"
                                            },
                                            "Text": {
                                                "val": "Performed Ballistic Missile Defense directed studies and program support activities including: contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.508"
                                            },
                                            "Text": {
                                                "val": "Perform Ballistic Missile Defense directed studies and program support activities including:  contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply.  Program will reduced dependence on contracted advisory and assistance services, and intends to leverage organic (military and federal civilian) labor to achieve planned mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.767"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.767"
                                            },
                                            "Text": {
                                                "val": "Perform Ballistic Missile Defense directed studies and program support activities including:  contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply.  Program will reduce dependence on contracted advisory and assistance services, and intends to leverage organic (military and federal civilian) labor to achieve planned mission."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "- Conduct two Protection Functional Capability Boards per month\n- Conduct two Air and Missile Defense Working Groups per month\n- Conduct quarterly Change Control Boards\n- Support U.S. Representative to NATO Air Defense Council (NADC) to include 2 overseas NADC meetings per year\n- Develop and maintain electronic library of current Joint and Service AMD Publications\n- Develop and maintain operational architecture compliance with DoD architectural framework (DODAF) standards\n- Ensure 100% of all government employee travel is in accordance with the JFTR\/JTR\n- Maintain all unclassified\/classified LANs on a daily basis in accordance with TJS Office of the Chief Information Officer guidance\/policy\n- Ensure all computers, NIPRNET\/SIPRNET, are refreshed according to OCIO policy\/guidance"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P002"
                    },
                    "ProjectTitle": {
                        "val": "Homeland"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.347"
                        },
                        "PriorYear": {
                            "val": "25.000"
                        },
                        "CurrentYear": {
                            "val": "6.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Homeland"
                                    },
                                    "Description": {
                                        "val": "Develop Homeland Surveillance technologies to enable Joint Integrated Air and Missile Defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "Perform technology development efforts.  Specific details of this project are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Perform technology development efforts.  Specific details of this project are classified."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "Details of this project are classified."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "Black Dart"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.833"
                        },
                        "PriorYear": {
                            "val": "5.000"
                        },
                        "CurrentYear": {
                            "val": "4.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.454"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.454"
                        },
                        "BudgetYearTwo": {
                            "val": "3.458"
                        },
                        "BudgetYearThree": {
                            "val": "3.492"
                        },
                        "BudgetYearFour": {
                            "val": "3.492"
                        },
                        "BudgetYearFive": {
                            "val": "3.485"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO), is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JIAMDO Black Dart"
                                    },
                                    "Description": {
                                        "val": "Provides funding to support administration and execution of Black Dart demonstrations.  Black Dart is a joint, inter- agency demonstration which focuses on rapid development and implementation of Counter – Unmanned Aircraft Systems (C-UAS) technology from readily-available commercial and governmental products."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Black Dart 2012 live-fly, live-fire C-UAS event 30 JUL 2012.  Event included interagency and classified events within the Black Dart C-UAS framework, with specific emphasis on non-kinetic capabilities as well an assessment on combat identification abilities of participating systems.  Intent was to assess C-UAS across IAMD kill chain in littoral\/ maritime environment, provide a threat representative environment, refine C-UAS aspects of IAMD architecture, and establish operational \/ technical performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Continue development of kinetic and non-kinetic solutions to C-UAS threat set.  Continue coordination with the OSD JT&E Couter-UAS activity within Black Dart 2013, refine existing inter-agency activities related to Black Dart participation, as well as develop Defense Advanced Research Projects Agency (DARPA) participation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.454"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.454"
                                            },
                                            "Text": {
                                                "val": "Increase fidelity of threat representations’ size & performance.  Expand US DoD and Inter-agency system portfolio participation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "- Complete events within schedule and budget.   Events provide useful data to improve C-UAS capability  \n- Document gaps, develop & substantiate hardware, software and employment concepts \n- Field C-UAS capability"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P004"
                    },
                    "ProjectTitle": {
                        "val": "Joint Distributed Engineering Plant"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.785"
                        },
                        "PriorYear": {
                            "val": "8.927"
                        },
                        "CurrentYear": {
                            "val": "3.250"
                        },
                        "BudgetYearOne": {
                            "val": "2.983"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.983"
                        },
                        "BudgetYearTwo": {
                            "val": "2.978"
                        },
                        "BudgetYearThree": {
                            "val": "3.097"
                        },
                        "BudgetYearFour": {
                            "val": "2.718"
                        },
                        "BudgetYearFive": {
                            "val": "2.755"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DOD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures. JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (COCOM) and maintains liaison offices at all major COCOM locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS). JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues and for capabilities development and validation in support of the Unified Command Plan (UCP) assigned missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Distributed Engineering Plant (JDEP)"
                                    },
                                    "Description": {
                                        "val": "Evaluates and improves interoperability by establishing and using a distributed, nationwide, hardware and software in-the-loop simulation capability that allows proposed combat capabilities and field combat weapon systems to operate in operationally representative, synthetic joint air and missile defense environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.927"
                                            },
                                            "Text": {
                                                "val": "Execute the Joint Tactical Air Picture (JTAP) Proof of Concept Demonstration to successfully test the following top level objectives.  \n1. Demonstrate a capability approaching SIAP standards for track reporting , timeliness and Joint interoperable data sharing of both friendly & threat air and missile defense (AMD) tracks using existing 6016 and 3011C mil standards over IP-enabled networks with Enhanced Data Rates (EDR) within a Bi-Directional Protocol Independent Multi-cast (Bi-Dir PIM) environment.\n2.  Provide access to beyond line of sight (BLOS) surveillance data from 5th Gen aircraft in the contested and anti-access regions to support Strike (Offensive Counterair – Attacks Ops) and cueing of AMD weapons systems.\n3.  Demonstrate measurable track reporting & timeliness that approach SIAP standards and would support multiple Fire Control Quality requirements for cueing, early engagement, and\/or engage-on-remote.\n4.  Support development of a Joint Urgent Operational Need Statement (JUONS) to address legacy system(s) interface issues and support the Services current IAMD systems as they transition to the objective JIAMD capabilities.\n5.  Provide a Simulation\/Stimulation capability that could support future system testing, evaluation, TTP development, and training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.250"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint distributed test event to assess the interoperability of joint, integrated air and missile defense weapons systems.  Provide users the means to create family of system (FoS) environments by linking existing capabilities using hardware, software, and operator-in-the-loop.  Link existing Service and Joint combat system engineering and test sites via distributed communications.   Reduce developmental cycle times by leveraging existing facilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.983"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.983"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint distributed test event to assess the interoperability of joint, integrated air and missile defense weapons systems.  Provide users the means to create FoS environments by linking existing capabilities using hardware, software, and operator-in-the-loop.  Link existing Service and Joint combat system engineering and test sites via distributed communications.   Reduce developmental cycle times by leveraging existing facilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "- Each JDEP event develops measures of effectiveness (MOE) & measures of performance (MOP) based on a eighteen month test planning and event process\n- Complete events within schedule and budget \n- Events provide useful data to improve AMD interoperability, with implemented corrective changes"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P005"
                    },
                    "ProjectTitle": {
                        "val": "Nimble Fire"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.692"
                        },
                        "PriorYear": {
                            "val": "13.340"
                        },
                        "CurrentYear": {
                            "val": "10.500"
                        },
                        "BudgetYearOne": {
                            "val": "10.732"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.732"
                        },
                        "BudgetYearTwo": {
                            "val": "10.733"
                        },
                        "BudgetYearThree": {
                            "val": "10.794"
                        },
                        "BudgetYearFour": {
                            "val": "10.797"
                        },
                        "BudgetYearFive": {
                            "val": "10.947"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JIAMDO Nimble Fire"
                                    },
                                    "Description": {
                                        "val": "The Department's only joint integrated air and missile defense operator-in-the-loop simulation that is comprised of current and future land, sea, and air weapon systems representing each of the Services AMD capabilities.  Operational personnel execute full mission scenarios in a realistic joint environment.  Distributed simulation in CONUS and overseas.  Enhances air and missile defense capability through the integration of robust representations of current and emerging weapons platform models that support operator-in-the-loop exercises."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.340"
                                            },
                                            "Text": {
                                                "val": "Integrate F-15E Strike Eagle simulators. Upgrade Army PATRIOT and Joint Land Attack Cruise Missile Defense Elevated Netted Sensor System (JLENS) simulators.  Enhanced Electronic Attack capabilities and composite tracking on JLENS.  Added Cooperative Engagement Capability on USMC TPS-59v3 and TPS-80 radars. Added four F-35 Joint Strike Fighter and 4 EA-18G Growler cockpits for joint forces.  Added IR-only kill chains. Support impacts of Electronic Attack in PACOM AOR from Asymmetric Missile Attack.  Executing three operator in the loop events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "Continue to upgrade Army simulators.  Enhance Electronic Attack capabilities, data links and composite tracking on all systems.  Integrate four F-35 Joint Strike Fighter cockpits for joint forces.  Support impacts of Electronic Attack, emerging CONOPS\/TTP’s, limited offensive operations and Integrated Fire Control in PACOM and CENTCOM AORs.  Execute three operator in the loop events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.732"
                                            },
                                            "Text": {
                                                "val": "Continue to upgrade Army simulators.  Enhance Electronic Attack capabilities, data links and composite tracking on all systems.  Integrate four F-35 Joint Strike Fighter cockpits for joint forces.  Support impacts of Electronic Attack, emerging CONOPS\/TTP’s, limited offensive operations and Integrated Fire Control in PACOM and CENTCOM AORs.  Execute three operator in the loop events."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "- Complete events within schedule and budget\n- Specific details are classified"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P006"
                    },
                    "ProjectTitle": {
                        "val": "Cruise Missle Combat Identification (CID)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "12.016"
                        },
                        "PriorYear": {
                            "val": "18.217"
                        },
                        "CurrentYear": {
                            "val": "9.250"
                        },
                        "BudgetYearOne": {
                            "val": "8.526"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.526"
                        },
                        "BudgetYearTwo": {
                            "val": "8.526"
                        },
                        "BudgetYearThree": {
                            "val": "8.558"
                        },
                        "BudgetYearFour": {
                            "val": "8.568"
                        },
                        "BudgetYearFive": {
                            "val": "8.688"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures. JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team and provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cruise Missile Combat Identification (CID)"
                                    },
                                    "Description": {
                                        "val": "Develops joint Counterair Combat Identification (CID) technology, and positions it for fielding on front-line weapon systems.  Monitors, assesses, and enhances joint AMD Combat ID programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.217"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.250"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.526"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.526"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "Details of this program are classified."
                        }
                    }
                }
            ]
        }
    }
}