{
    "id": "237876f7a0b49fde3111422b23ba7c44ebfd08b9",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DARPA_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601101E"
        },
        "ProgramElementTitle": {
            "val": "DEFENSE RESEARCH SCIENCES"
        },
        "R1LineItemNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "283.318"
            },
            "CurrentYear": {
                "val": "309.051"
            },
            "BudgetYearOne": {
                "val": "315.033"
            },
            "BudgetYearOneBase": {
                "val": "315.033"
            },
            "BudgetYearTwo": {
                "val": "310.494"
            },
            "BudgetYearThree": {
                "val": "314.123"
            },
            "BudgetYearFour": {
                "val": "330.807"
            },
            "BudgetYearFive": {
                "val": "337.544"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Research Sciences Program Element is budgeted in the Basic Research Budget Activity because it provides the technical foundation for long-term National Security enhancement through the discovery of new phenomena and the exploration of the potential of such phenomena for Defense applications.  It supports the scientific study and experimentation that is the basis for more advanced knowledge and understanding in information, electronic, mathematical, computer, biological and materials sciences.\n\n     The Bio\/Info\/Micro Sciences project will explore and develop potential technological breakthroughs that exist at the intersection of biology, information technology and micro\/physical systems to exploit advances and leverage fundamental discoveries for the development of new technologies, techniques and systems of interest to the DoD.  Programs in this project will draw upon information and physical sciences to discover properties of biological systems that cross multiple biological architectures and functions, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels. \n\n     The Math and Computer Sciences project supports long term national security requirements through scientific research and experimentation in new computational models and mechanisms for reasoning and communication in complex, interconnected systems.  The project is exploring novel means to exploit computer capabilities; enhance human-to-computer and computer-to-computer interaction technologies; advance innovative computer architectures; and discover new learning mechanisms and innovations in software composition.  It is also fostering the computer science academic community to address the DoD's need for innovative computer and information science technologies.  Additionally, this project explores the science of mathematics for potential defense applications.\n\n      The Cyber Sciences project supports long term national security requirements through scientific research and experimentation in cyber-security.  Networked computing systems control virtually everything, from power plants and energy distribution, transportation systems, food and water distribution, financial systems, to defense systems.  Protecting the infrastructure on which these systems rely is a national security issue.   The Cyber Sciences project will ensure DoD cyber-capabilities survive adversary attempts to degrade, disrupt, or deny military computing, communications, and networking systems.  Basic research in cyber security is required to provide a basis for continuing progress in this area. Promising research results will transition to both technology development and system-level projects.\n\n     The Electronic Sciences project explores and demonstrates electronic and optoelectronic devices, circuits and processing concepts that will provide: 1) new technical options for meeting the information gathering, transmission and processing required to maintain near-real time knowledge of the enemy and the ability to communicate decisions based on that knowledge to all forces in near-real time; and 2) provide new means for achieving substantial increases in performance and cost reduction of military systems providing these capabilities.\n\n     The Materials Sciences project is concerned with the development of: high power density\/high energy density mobile and portable power sources; processing and design approaches for nanoscale and\/or bimolecular materials, interfaces and microsystems; and materials and measurements for molecular-scale electronics.\n\n     The Transformative Sciences project supports scientific research and analysis that leverages converging technological forces and transformational trends in the areas of computing and the computing-reliant subareas of social sciences, life sciences, manufacturing, and commerce as a means of improving military adaptation to sudden changes in requirements, threats, and emerging converging trends."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "290.773"
                },
                "CurrentYear": {
                    "val": "309.051"
                },
                "BudgetYearOne": {
                    "val": "315.567"
                },
                "BudgetYearOneBase": {
                    "val": "315.567"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "283.318"
                },
                "CurrentYear": {
                    "val": "309.051"
                },
                "BudgetYearOne": {
                    "val": "315.033"
                },
                "BudgetYearOneBase": {
                    "val": "315.033"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-7.455"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.534"
                },
                "BudgetYearOneBase": {
                    "val": "-0.534"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.503"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-7.958"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.534"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.534"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012:  Decrease reflects reductions for the SBIR\/STTR transfer offset by a minor reprogramming.\nFY 2014:  Decrease reflects minor program repricing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BLS-01"
                    },
                    "ProjectTitle": {
                        "val": "BIO\/INFO\/MICRO SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.463"
                        },
                        "CurrentYear": {
                            "val": "39.678"
                        },
                        "BudgetYearOne": {
                            "val": "29.771"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.771"
                        },
                        "BudgetYearTwo": {
                            "val": "29.248"
                        },
                        "BudgetYearThree": {
                            "val": "33.250"
                        },
                        "BudgetYearFour": {
                            "val": "40.925"
                        },
                        "BudgetYearFive": {
                            "val": "41.625"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project is investigating and developing the intersections of biology, information technology and micro\/physical systems to exploit important technological advances and leverage fundamental discoveries for the development of new technologies, techniques, and systems of interest to the DoD.  This research is critical to the development of rapid responses to engineered biological warfare agents, radically new biomolecular computers, and novel materials for the DoD.  Programs in this project will draw upon the information and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  This project will develop the basic research tools in biology that are unique to the application of biological-based solutions to critical Defense problems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Bio Interfaces"
                                    },
                                    "Description": {
                                        "val": "The Bio Interfaces program supports scientific study and experimentation, emphasizing the interfaces between biology and the physical and mathematical\/computer sciences.  This unique interaction will develop new mathematical and experimental tools for understanding biology in a way that will allow its application to a myriad of DoD problems.  These tools will help exploit the advances in the complex modeling of physical and biological phenomena.  It is also expected that understanding the fundamentals of biology will aid in developing tools to understand complex, non-linear networks and force structures.  This program will also explore the fundamental nature of time in biology and medicine.  This will include mapping basic clock circuitry in biological systems from the molecular level up through unique species level activities with a special emphasis on the applicability to human biology.  Operational relevance of this research activity includes improving our understanding of sleep-wake cycles, increasing the scientific understanding of deployment cycle lengths, and enhancing our ability to model the dynamics of disease outbreaks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.750"
                                            },
                                            "Text": {
                                                "val": "-  Identified genomic and epigenomic  signatures that dictate spatio-temporal regulation of temporal processes such as cell cycle progression, metabolic cycles, and lifespan using bioinformatic or data mining techniques as a stepping stone to understanding the nature of time in biology and medicine. \n-  Developed in vitro or in vivo cellular systems in which clock components can be altered by environmental pressures, molecular biological techniques or perturbation with various stressors.\n-  Synthesized the minimal set of genomic, proteomic, transcriptomic, or epigenomic input data required for the creation of a predictive algorithm."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Define spatio-temporal components and signatures by creating experimental test platforms and assays that will stress and perturb the system to confirm contributions of temporal regulators. \n-  Initiate the development of algorithms designed to predict pertinent time processes active in biological systems (e.g., sleep cycles, metabolic cycles, and disease outbreak cycles).\n-  Refine temporal signature networks and libraries that dictate temporal process regulation for determination of minimal datasets necessary for validated models. \n-  Develop and validate algorithms of temporal processes associated with developmental processes in prokaryotic and eukaryotic systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.832"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.832"
                                            },
                                            "Text": {
                                                "val": "-  Experimentally validate canonical spatio-temporal episequences, and develop a minimal dataset for accurate predictions of temporal processes such as cell cycle progression, metabolic cycles, and lifespan. \n-  Refine predictive algorithms of the progression of biological time. \n-  Develop and test the predictive model or algorithm against a blind panel to predict doubling time, cell cycle progression, metabolism and lifespan metrics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biological Adaptation, Assembly and Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Biological Adaptation, Assembly and Manufacturing program is examining the structure, function, and informational basis underlying biological system adaptation, and the factors employed by the organism to assemble and manufacture complex biological subsystems.  The unique stability afforded biological systems in their ability to adapt to wide extremes of physical and endurance (e.g., heat, cold, and sleeplessness) parameters will be examined and exploited in order to engineer stability into biological systems required for the military (such as blood, bioengineered tissues or other therapeutics).  A key new antibody technology will develop the ideal antibody master molecule for use in unattended sensors that maintains high temperature stability and controllable affinity for threat agents.  Applications to Defense systems include the development of chemical and biological sensors; tools for strategic military decision-makers involved in information operations, and improved warfighter battlefield survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.893"
                                            },
                                            "Text": {
                                                "val": "-  Combined stability and affinity enhancements to produce \"master antibodies\" for testing in an existing biosensor platform to demonstrate advanced capability in terms of robustness and potential for multiplexing. \n-  Explored and refined foundational assumptions on the utility of the Freytag and other structures for narrative analysis, including determining relationships between decomposed narratives and neuropsychological mechanisms, and between narratives and behavior. \n-  Developed decomposition frameworks and initial cluster of neurobiological mechanisms to better understand their relationship. \n-  Developed tools to link analytic frameworks, neural mechanisms, and environmental variables to particular narratives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop sensor suite technologies based on neurobiological mechanisms to measure narrative effect on individuals\/groups in real-time. \n-  Study generalized findings in relation to distinct sub-groups to elucidate potential differences across varying cultures. \n-  Incorporate findings about the neurobiology of culture-dependent and culture-independent variables into models and simulations of narrative influence.\n-  Refine sensor suite technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantitative Models of the Brain*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Mathematics of the Brain\n\nThe Quantitative Models of the Brain program will develop a new mathematical paradigm for understanding how to model reasoning processes for application to a variety of emerging DoD challenges.  Critical to this endeavor will be determining how information is stored and recalled in the brain and developing predictive, quantitative models of learning and memory.  Using this understanding, the program will develop powerful new symbolic computational capabilities for the DoD in a mathematical system that provides the ability to understand complex and evolving tasks without exponentially increasing software and hardware requirements.  This includes a comprehensive mathematical theory to extract and leverage information in signals at multiple acquisition levels, which would fundamentally generalize compressive sensing for multi-dimensional sources beyond domains typically used.  New insights related to signal priors, task priors, and adaptation will enable these advances.  This program will establish a functional mathematical basis on which to build future advances in cognitive neuroscience, computing capability, and signal processing across the DoD.  The quantitative models of learning and memory will also lead to improvements in the training of individuals and teams as well as advances in cognitive rehabilitation (e.g. PTSD)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.370"
                                            },
                                            "Text": {
                                                "val": "-  Developed detailed mathematical prior-knowledge representations and associated models for imaging and radar applications.\n-  Exploited the new theoretical measurement framework together with novel forms of prior knowledge in order to minimize resource requirements and maximize information gathering, from sparse sampling.\n-  Demonstrated the utility of new compressive measurement theory via improvements in imaging and radar applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Identify fundamental bounds on performance and cost associated with linear and nonlinear signal priors.\n-  Demonstrate novel reconstruction algorithms that incorporate both signal and task priors to enable improved reconstruction quality and\/or reduced measurement resources.\n-  Demonstrate visible imaging using 10x fewer measurements than reconstructed pixels.\n-  Demonstrate RADAR imaging using 10x less bandwidth than a conventional non-compressive system.\n-  Exploit the benefit of adaptation in order to achieve additional reductions in performance and\/or measurement resources.\n-  Exploit the benefit of information-optimal measurements within a signals intelligence application."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.439"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.439"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate hyperspectral imaging using 100x fewer measurements than reconstructed voxels.\n-  Explore application of compressive sensing concepts to alternate sensing modalities such as X-ray imaging.\n-  Investigate the potential gains available from compressive sensing within a video application.\n-  Leverage advances in neuroscience and neurological measurements to develop predictive, quantitative models of memory, learning, and neuro-physiologic recovery."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physics in Biology"
                                    },
                                    "Description": {
                                        "val": "Understanding the fundamental physical phenomena that underlie biological processes and functions will provide new insight and unique opportunities for understanding biological properties and exploiting such phenomena.  Physics in biology will explore the role and impact of quantum effects in biological processes and systems.  This includes exploiting manifestly quantum mechanical effects that exist in biological systems at room temperature to develop a revolutionary new class of robust, compact, high sensitivity and high selectivity sensors.  Finally, the quantum phenomena uncovered will be exploited to control the attraction of insects to humans with the potential to completely eliminate insect bites and thus the transmission of parasitic, bacterial or viral pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.450"
                                            },
                                            "Text": {
                                                "val": "-  Developed theory and performed simulations for the transduction of the magnetoreception signal on the visual field.  \n-  Developed concepts and initial designs for sensors inspired by biological quantum effects. \n-  Developed a general theory for photosynthetic transport, governed by a single parameter, that shows that it is an example of a quantum 'Goldilocks effect', i.e., the degree of quantum complexity and coherence is 'just right' for attaining maximum efficiency. \n-  Formulated a new concept of \"excitonic circuits\" (that concentrate and direct excitons as in photosynthesis) and designed generic circuit elements.\n-  Verified that molecular vibrations, and thus quantum effects, are essential to describing olfaction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.678"
                                            },
                                            "Text": {
                                                "val": "-  Develop prototype synthetic sensors that utilize biologically inspired quantum effects and model their performance.\n-  Demonstrate the ability to control quantum effects in biological systems by reorienting magnetoreception through the radical pair mechanism using radio frequency fields.\n-  Demonstrate the biological and evolutionary advantage of quantum effects in photosynthetic systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate prototype quantum biological sensors against their equivalent state-of-the-art sensor and quantify the increase in sensitivity, selectivity and other performance metrics.\n-  Explore quantum physics-based mechanisms of mosquito bio-sensing related to mosquito attraction to humans for novel, vector-born disease protection against diseases such as malaria or dengue fever."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCS-02"
                    },
                    "ProjectTitle": {
                        "val": "MATH AND COMPUTER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "58.153"
                        },
                        "CurrentYear": {
                            "val": "72.480"
                        },
                        "BudgetYearOne": {
                            "val": "72.073"
                        },
                        "BudgetYearOneBase": {
                            "val": "72.073"
                        },
                        "BudgetYearTwo": {
                            "val": "72.290"
                        },
                        "BudgetYearThree": {
                            "val": "75.812"
                        },
                        "BudgetYearFour": {
                            "val": "86.729"
                        },
                        "BudgetYearFive": {
                            "val": "87.451"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports scientific study and experimentation on new computational models and mechanisms for reasoning and communication in complex, interconnected systems in support of long-term national security requirements.  The project is exploring novel means of exploiting computer capabilities; practical, logical and heuristic reasoning by machines; development of enhanced human-to-computer and computer-to-computer interaction technologies; innovative approaches to the composition of software; innovative computer architectures; and new learning mechanisms for systematically upgrading and improving these capabilities.  Additionally, this project explores mathematical programs and their potential for defense applications.  Promising techniques will transition to both technology development and system-level projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Computer Science Study Group (CSSG)"
                                    },
                                    "Description": {
                                        "val": "The Computer Science Study Group (CSSG) program supports emerging ideas from the computer science academic community to address the DoD's need for innovative computer and information science technologies; introduces a generation of junior researchers to the needs and priorities of the DoD; and enables the transition of those ideas and applications by promoting joint university, industry, and government projects.  The CSSG project formalizes and focuses this research for efficiency and greater effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.169"
                                            },
                                            "Text": {
                                                "val": "-  Transitioned successful research outcomes from Classes 2008-2011.\n-  Awarded grants to ten  Principal Investigators (PIs) from the Class of 2011 in support of research with high payoff potential to DoD.\n-  Awarded grants to five PIs for transition of their research to the DoD and intelligence community, in partnerships with other sources of funding from government or industry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "-  Transition successful research outcomes from Classes 2009-2011.\n-  Award grants to at least three PIs from Class of 2010 who successfully transition their research into partnerships with other sources of funding from government or industry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.050"
                                            },
                                            "Text": {
                                                "val": "-  Transition successful research outcomes from Classes 2010-2011."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Young Faculty Award (YFA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Young Faculty Award (YFA) program is to encourage junior faculty at universities and their equivalent at non-profit science and technology research institutions to participate in sponsored research programs that will augment capabilities for future defense systems.  This program focuses on speculative technologies for greatly enhancing microsystems technologies and defense sciences.  The long-term goal for this program is to develop the next generation of scientists, engineers, and mathematicians in key disciplines who will focus a significant portion of their careers on DoD and National Security issues.  Beginning in 2013, YFA technical topic areas are more closely tied to programs currently underway at DARPA and to recently identified DoD and National Security needs.  The aim is for YFA recipients to receive deep interactions with DARPA program managers, programs, performers, and the user community.  Current activities include research in thirteen topic areas spanning from Quantum Science and Technology to Robotics and Supervised Autonomy, Mathematics, Computing, and the interface of Engineering and Biology.  A key aspect of the YFA program is DARPA-sponsored military visits; all YFA Principal Investigators are expected to participate in one or more military site visits to help them better understand DoD needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Exercised second year options for selected FY2011 participants to continue research focused on new concepts for microsystem technologies, innovative information technologies, and defense sciences.\n-  Awarded FY2012 grants for new two-year research efforts across the topic areas.\n-  Established approaches to bring appropriate technologies developed through YFA to bear on relevant DoD problems.\n-  Continued mentorship by program managers and engagement with DARPA to encourage future work focused on DoD needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.450"
                                            },
                                            "Text": {
                                                "val": "-  Exercise second year options for FY2012 participants to continue research focused on new concepts for microsystem technologies, innovative information technologies, and defense sciences.\n-  Award FY2013 grants for new two-year research efforts across the topic areas.\n-  Establish and improve approaches to bring appropriate technologies developed through YFA to bear on relevant DoD problems.\n-  Continue and improve mentorship by program managers and engagement with DARPA to encourage future work that focuses on DoD needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.500"
                                            },
                                            "Text": {
                                                "val": "-  Exercise second year options for FY2013 participants to continue research focused on new concepts for microsystem technologies and defense sciences.\n-  Award FY2014 grants for new two-year research efforts across the topic areas.\n-  Establish approaches to bring appropriate technologies developed through YFA to bear on relevant DoD problems.\n-  Continue mentorship by program managers and engagement with DARPA to encourage future work that focuses on DoD needs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Social Interaction Modules (SSIM)"
                                    },
                                    "Description": {
                                        "val": "The Strategic Social Interaction Modules (SSIM) program will improve military training to include the social interaction skills and abilities warfighters need for successful engagement with local populations.  In the current operational environment, it is imperative to develop rapport with local leaders and civilians as their cooperation and consent will be necessary for successful operations.  SSIM will emphasize the foundational social skills necessary to achieve cultural understanding in any social setting and the skills necessary for successful interactions across different social groups.  These core skills do not require soldiers to have knowledge of a specific culture prior to contact but emphasizes skills for orienting toward and discovering patterns of meaningful social behavior.  SSIM will develop the requisite training technology including advanced gaming\/simulation techniques that incorporate new methods for practicing social agility in social encounters, as well as how to discover and adapt to unfamiliar culturally-specific conduct, manners, and practices.  SSIM will enhance military effectiveness by enabling close collaborative relationships with local peoples and leaders."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.700"
                                            },
                                            "Text": {
                                                "val": "-  Initiated the development of robust simulator technologies that generate realistic SSIM-oriented training scenarios and user challenges, automate the evaluation of user responses, and support semi-automated expert authoring\/editing of scenarios.\n-  Conceptualized processes for deploying the SSIM-based training simulator to the U.S. Marine Corps and the Washington State Criminal Justice Training Commission (transition partners) and the U.S. Army and SOCOM (possible transition partners).\n-  Extended the social complexity of the training scenarios to include engagements that transition to and from kinetic actions.\n-  Developed initial techniques for assessing a trainee's learning during simulation.\n-  Created basic curricula for SSIM-based training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.600"
                                            },
                                            "Text": {
                                                "val": "-  Test accuracy of non-player-character reactions to trainee's actions and behaviors.\n-  Develop methods to evaluate the effectiveness of SSIM-trained warfighters during interpersonal interactions with local populations.\n-  Enhance the video-capture and analysis of trainees' interactions during tasks that require cross cultural interactions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.870"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.870"
                                            },
                                            "Text": {
                                                "val": "-  Refine the curriculum for SSIM-oriented training based on findings regarding effective social interaction.\n-  Extend the assessment of the effectiveness of SSIM-training to determine direct and indirect effects. \n-  Deploy the SSIM-based training and training simulator to transition partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engage"
                                    },
                                    "Description": {
                                        "val": "The Engage program develops on-line approaches for complex problem solving in real-world settings by analyzing and adapting performance across large numbers of users.  Using unconventional mechanisms and incentives, Engage will create an on-line environment for data-driven, interactive, multidisciplinary collaboration between experts and non-experts to address heretofore insolvable DoD challenge problems. This big-data analysis approach will identify optimum training strategies and result in the development of software that is highly individualized to the user.  Engage will also address the difficult problem of assessing performance in the virtual domain to predict performance in the real world and drive the creation of more effective on-line training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed software infrastructure for a training environment that allows the methods of instruction to be varied in order to determine the best approaches.\n-  Analyzed methodologies using statistics based on data drawn from a large interactive training environment.\n-  Developed and released Engage-based software for training a variety of technical topics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.150"
                                            },
                                            "Text": {
                                                "val": "-  Improve the problem-solving training platform based on the initial research results.\n-  Re-implement the various application domain software components using the improved platform.\n-  Continue analysis of methodologies using statistics based on data drawn from a large interactive environment.\n-  Analyze and assess changes to existing Engage-based software when applied to different student age groups.\n-  Transition the first phase of Engage-based software to relevant DoD training activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.800"
                                            },
                                            "Text": {
                                                "val": "-  Develop and release Engage-based software for training additional topics.\n-  Continue transition efforts to include dissemination of Engage-based software based on lessons learned from relevant DoD training activities.\n-  Establish a collaborative, on-line, problem-solving environment that allows experts and non-experts to address complex DoD challenge problems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mathematics of Sensing, Exploitation and Evaluation (MSEE)"
                                    },
                                    "Description": {
                                        "val": "The Mathematics of Sensing, Exploitation and Evaluation (MSEE) program seeks to create a comprehensive mathematical theory of information processing, strategy formulation and decision determination.  Such a theory would incorporate techniques from diverse mathematical disciplines such as Stochastic Process Theory, Harmonic Analysis, Formal Languages and Theoretical Computer Science to construct a common framework wherein the quantitative value of data acquisition may be assessed relative to dynamically-varying context.  In addition, the structure will accommodate the notion that data acquisition and information processing are coupled, requiring some degree of feedback and control, while simultaneously admitting the possibility of different logics, such as those that allow for incomplete and time-varying states of knowledge.  The result of this effort will produce advances in fundamental domains of mathematics with the potential to reshape current DoD approaches to managing the battlespace."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Incorporated stochastic models and statistical reasoning to understand the nature of computations in human minds.\n-  Explored open system concepts capable of demonstrating the ability to process information and determine best available responses, subject to time-varying context.\n-  Quantified notion of effective utility, which measures the relative value of a sensor or sensor system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Refine representation objects to incorporate additional capabilities, such as variable exploitation or execution tasks.\n-  Expand mathematical framework to allow incorporation of multiple sensing modalities, in particular, video.\n-  Perform initial testing and validation of a prototype automated surveillance system that will be tuned to respond to events of military relevance; formulate and calculate performance metrics that quantify expected performance gains.\n-  Design and prototype an algorithmic system architecture that ensures flexibility and extensibility; begin creation of modular open system.\n-  Implement single-modality solution that will demonstrate effectiveness of unified approach to sensing and will incorporate prior work on representations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.853"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.853"
                                            },
                                            "Text": {
                                                "val": "-  Implement multiple-modality solutions that will demonstrate effectiveness of a unified approach to sensing.\n-  Create an advanced evaluation test-bed that will enable probative, quantitative assessment of a system's ability to understand scene semantics.\n-  Demonstrate enhanced anomaly detection under varying operating conditions, including production of a single (unified) semantic representation of a scene in the presence of coincident sensor data coming from multiple modalities, only some of which may comprise electro-optical\/IR ."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unconventional Processing of Signals for Intelligent Data Exploitation (UPSIDE)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Unconventional Computation\n\nThe Unconventional Processing of Signals for Intelligent Data Exploitation (UPSIDE) program will address the open problems facing real-time ISR systems and other power-constrained data-intensive applications.  The objective of the UPSIDE program is to create a high-level, non-Boolean computational model and map it directly to the unique functional properties of new emerging devices to achieve significant increases in power efficiency and performance.  The UPSIDE program will create a new generation of computing structures that will, in turn, enable revolutionary advances in ISR processing, particularly for DoD applications of embedded, real-time sensor data analysis.  Because Boolean data representations are inherently power-inefficient for many datasets, particularly those produced by noisy analog real-time sensors, the UPSIDE program will establish an unconventional, non-Boolean, computing paradigm to enable new and needed capabilities in the area of sensor data analysis. \n\nUPSIDE intends to implement this new computing paradigm in the form of a specialized hardware component termed the inference module (IM).  The inference module will be first developed through simulation, and then implemented using mixed-signal complementary metal-oxide semiconductor (CMOS), as well as using state of the art emerging (non-CMOS) devices.  Throughout the program, the inference module will be benchmarked using a DoD relevant image processing pipeline, to verify gains in both computing throughput and power efficiency.  The result will be a computing infrastructure and functional implementations that demonstrate three orders of magnitude improvement in processing speed and four orders of magnitude improvement in power efficiency.  These gains will constitute a disruptive new level of embedded computational efficiency for future real-time sensor systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Define unconventional (non-Boolean) computing methodology and inference module abstraction.\n-  Identify target recognition and tracking application.\n-  Create conventional image processing pipeline simulation for baseline comparison of UPSIDE image processing metrics.\n-  Initiate design of a mixed-signal complementary metal-oxide semiconductor (CMOS) chip-based inference module architecture.\n-  Develop the emerging device simulations and specifications necessary to begin work on an emerging device based inference module."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Simulate the selected image processing pipeline utilizing the previously developed inference methodology.\n-  Develop mixed-signal CMOS based image processing pipeline simulation and validate the simulation using real-time, high-definition video streams.\n-  Design and fabricate mixed-signal CMOS chip implementation of inference module.\n-  Fabricate and demonstrate simple circuits based on emerging devices for future inference module development.\n-  Begin development of CMOS support chip for emerging devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Graph-theoretical Research in Algorithm Performance & Hardware for Social networks (GRAPHS)"
                                    },
                                    "Description": {
                                        "val": "While the DoD has been extremely effective in deploying rigorous analytical and predictive methods for problems involving continuously valued variables (tracking, signals processing), analytical methods for discrete data such as graphs and networks have not kept pace.  Recent evidence has shown that social network analysis can provide critical insight when used in DoD-relevant scenarios.  In this paradigm, nodes represent people of interest and their relationships or interactions are edges; the result forms a network or graph.  Current analysis of social networks, however, is just in its infancy:  the composition of real-world networks is understood only at the most coarse and basic details (diameter, degree distribution).  In order to implement social network techniques efficiently and usefully, a better understanding of the finer mathematical structure of social networks is needed.  This includes the development of a comprehensive and minimal mathematical set that characterizes social networks of DoD interest, and includes a description of how these quantities vary in both space and time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.284"
                                            },
                                            "Text": {
                                                "val": "-  Created an enhanced network modeling theory that incorporates ability to perform spatiotemporal analysis.\n-  Investigated impact of replacing generic network nodes with human agents whose behavior can be modeled statistically.\n-  Performed small-scale analyses of dynamic networks and demonstrate ability to recognize event precursors.\n-  Identified relevant graph classes for DoD applications and characterize complexity classes of networks that are amenable to approximate algorithm development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.180"
                                            },
                                            "Text": {
                                                "val": "-  Derive analytic models for commonly occurring social network configurations such as call graphs.\n-  Characterize normalcy and anomaly in structural signal constituents and formulate a detection methodology that incorporates novel noise models.\n-  Develop Efficient Polynomial Time Approximation Schemes (EPTAS) for relevant graph algorithms.\n-  Test modeling and detection methods against existing corpi and evaluate effectiveness.\n-  Develop prototype of a multi-node, customized system leveraging existing hardware that realizes 10x performance time improvement in the current state of the art."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CYS-01"
                    },
                    "ProjectTitle": {
                        "val": "CYBER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.200"
                        },
                        "CurrentYear": {
                            "val": "25.000"
                        },
                        "BudgetYearOne": {
                            "val": "33.333"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.333"
                        },
                        "BudgetYearTwo": {
                            "val": "32.667"
                        },
                        "BudgetYearThree": {
                            "val": "40.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cyber Sciences project supports long term national security requirements through scientific research and experimentation in cyber-security.  Networked computing systems control significant elements of critical national infrastructure, from power plants and energy distribution grids, transportation systems, food and water distribution systems, and financial networks to defense systems.  During the past decade information technologies have driven the productivity gains essential to U.S. economic competitiveness.  Unfortunately, during the same period, cyber-adversaries, which include nation-states, criminal\/terrorist groups, transnational actors, and lone miscreants, have grown rapidly in sophistication and number.  The Cyber Sciences project will ensure DoD resilience in the face of adversary attempts to degrade, disrupt, or deny military computing, communications, and networking systems.  Basic research in cyber security is required to provide a basis for continuing progress in this area.  Promising research results will transition to both technology development and system-level projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Active Authentication"
                                    },
                                    "Description": {
                                        "val": "The Active Authentication program will develop more effective user identification and authentication technologies.  Current authentication approaches are typically based on long, complex passwords and incorporate no mechanism to verify the user originally authenticated is the user still in control of the session.  The Active Authentication program will address these issues by focusing on the unique aspects of the individual (i.e., the cognitive fingerprint) through the use of software-based biometrics that continuously validate the identity of the user.  Active Authentication will integrate multiple biometric modalities to create a system that is accurate, robust, and transparent to the user."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.033"
                                            },
                                            "Text": {
                                                "val": "-  Analyzed methods for determining user identity from behavioral cues.\n-  Prototyped software biometric approaches that integrate cognitive features associated with the use of input\/output devices and the use of written language in e-mails or other documents.\n-  Validated the viability of biometric approaches through testing.\n-  Formulated new access control mechanisms that incorporate a probabilistic measure of user identity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.200"
                                            },
                                            "Text": {
                                                "val": "-  Develop open application programming interfaces (APIs) to allow the ready integration of third-party software and hardware biometrics.\n-  Initiate development of a new authentication platform suitable for deployment on DoD hardware.\n-  Implement multiple advanced authentication mechanisms in one or more prototype systems suitable for use on DoD networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate enhanced authentication using multiple biometrics representing complementary aspects of the individual.\n-  Evaluate the level of confidence that is achievable using multiple advanced authentication mechanisms and quantify the resulting level of security using red teaming and other techniques.\n-  Prototype a new authentication platform suitable for use on major DoD platforms in collaboration with potential transition sponsors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automated Program Analysis for Cybersecurity (APAC)"
                                    },
                                    "Description": {
                                        "val": "Automated Program Analysis for Cybersecurity (APAC) is developing automated program analysis techniques for mathematically validating the security properties of mobile applications.  This will involve creating new and improved type-based analysis, abstract interpretation, and flow-based analysis methods with a far greater ability to accurately demonstrate security properties without false alarms than is possible today.  APAC technologies will enable developers and analysts to identify mobile applications that contain hidden malicious functionality and bar those applications from DoD mobile application marketplaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.167"
                                            },
                                            "Text": {
                                                "val": "-  Developed a collection of specific security properties that demonstrated a mobile application is not malicious.\n-  Developed automated program analysis techniques for determining whether or not mobile applications had specific security properties and implemented these techniques in prototype tools. \n-  Extracted relevant classes of malicious techniques from publicly available malware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.800"
                                            },
                                            "Text": {
                                                "val": "-  Conduct competitions to stress the capabilities incorporated in prototype tools.\n-  Create increasingly effective prototype tools and specific properties from the results of the competitions.  \n-  Measure the effectiveness of the prototype tools and specific properties against the program metrics: false alarm rate, missed detection rate, and amount of manual effort required to certify a typical mobile application."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.833"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.833"
                                            },
                                            "Text": {
                                                "val": "-  Improve the effectiveness of prototype tools and specific properties through further competitions.\n-  Use measurements against the program metrics to identify prototype tools that are likely candidates for technology transition.\n-  Refine tools in response to transition partner challenges."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ES-01"
                    },
                    "ProjectTitle": {
                        "val": "ELECTRONIC SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.528"
                        },
                        "CurrentYear": {
                            "val": "50.103"
                        },
                        "BudgetYearOne": {
                            "val": "46.876"
                        },
                        "BudgetYearOneBase": {
                            "val": "46.876"
                        },
                        "BudgetYearTwo": {
                            "val": "45.876"
                        },
                        "BudgetYearThree": {
                            "val": "36.876"
                        },
                        "BudgetYearFour": {
                            "val": "49.376"
                        },
                        "BudgetYearFive": {
                            "val": "51.752"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project seeks to continue the phenomenal progress in microelectronics innovation that has characterized the last decades by exploring and demonstrating electronic and optoelectronic devices, circuits and processing concepts that will: 1) provide new technical options for meeting the information gathering, transmission and processing required to maintain near real-time knowledge of the enemy and the ability to communicate decisions based on that knowledge to all forces in near real-time; and 2) provide new means for achieving substantial increases in performance and cost reduction of military systems providing these capabilities.  Research areas include new electronic and optoelectronic device and circuit concepts, operation of devices at higher frequency and lower power, extension of diode laser operation to new wavelength ranges relevant to military missions, development of uncooled and novel infrared detector materials for night vision and other sensor applications, development of innovative optical and electronic technologies for interconnecting modules in high performance systems, research to realize field portable electronics with reduced power requirements, and system and component level improvements to provide greater affordability and reliability.  Additionally, electronically controlled microinstruments offer the possibility of nanometer-scale probing, sensing and manipulation for ultra-high density information storage \"on-a-chip,\" for nanometer-scale patterning, and for molecular level analysis and synthesis.  These microinstruments may also offer new approaches to integration, testing, controlling, manipulating and manufacturing nanometer-scale structures, molecules and devices."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced X-Ray Integrated Sources (AXIS)"
                                    },
                                    "Description": {
                                        "val": "The objective of the Advanced X-Ray Integrated Sources (AXIS) program is to develop tunable, mono-energetic, spatially coherent X-ray sources with greatly reduced size, weight and power while dramatically increasing their electrical efficiency through application of micro-scale engineering technologies such as MEMS and NEMS.  Such X-ray sources will enable new versatile imaging modalities based on phase contrast techniques which are 1000X more sensitive than the conventional absorption contrast imaging.  Such imaging modalities should enable reverse engineering of integrated circuits to validate trustworthiness as well as battlefield imaging of soft tissues and blood vessel injuries from blunt trauma without the injection of a contrast enhancing agent.  The radiation dose required for imaging will also be reduced.\n\nThe Basic Research component of this effort will focus on defining the fundamental science necessary for the creation of compact and highly efficient synchrotron X-ray sources.  These sources may lead to future developments in the  imaging field based on tunable x-ray wavelengths.  This program also has related applied research efforts funded under PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "-  Established physical and design limitations for compact energy-efficient X-ray sources.\n-  Demonstrated the feasibility of key enabling components (cathodes, accelerators, radiators & lasers) for compact energy-efficient x-ray sources.\n-  Investigated fundamental issues pertinent to the generation of coherent X-rays through emittance exchange & Inverse Compton Scattering (ICS), and optically driven acceleration & free electron lasing.\n-  Developed a Laser Wakefield Plasma electron accelerator and demonstrated the ability to produce X-rays from Betatron oscillations and explored phase contrast imaging of small objects with the x-ray source.\n-  Developed and demonstrated novel approaches, including plasmonic enhancement, to high-performance cathode design and fabrication.\n-  Developed and demonstrated the viability of pyroelectric-based next-generation electron emitters.\n-  Demonstrated the feasibility of generating X-rays by means of channeling radiation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.800"
                                            },
                                            "Text": {
                                                "val": "-  Fabricate and demonstrate arrays of closely spaced electron sources with short pulse durations and low emittance for generating small charge bunches.\n-  Fabricate and demonstrate dielectric structures (dielectric loaded waveguides) for accelerating electron bunch to relativistic energies.\n-  Develop ultra-compact short pulse (<1 picosecond), high repetition rate and high power lasers employing saturable gain media.\n-  Demonstrate microfabrication of permanent-magnet-based undulators for x-ray generation.\n-  Demonstrate the utility of coded apertures for generation of phase contrast imaging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a compact, high-brilliance and low-power x-ray source by integrating low-emittance electron sources, laser dielectric accelerators and laser dielectric undulators.\n-  Demonstrate a compact, high-brilliance and low-power x-ray source using high finesse optical cavities, dielectric loaded waveguides and dielectric structures.\n-  Fabricate devices that generate X-rays through channeling radiation.\n-  Successfully demonstrate a compact, low-power device capable of generating phase contrast images."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Microscale Plasma Devices (MPD)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Microscale Plasma Devices (MPD) program is to design, develop, and characterize MPD technologies, circuits, and substrates.  The MPD program will focus on development of fast, small, reliable, carrier dense, microplasma switches capable of operating in extreme conditions, such as high-radiation and high-temperature environments.  Specific focus will be given to methods that produce efficient generation of ions, radio frequency energy, and light sources over a range of gas pressures.  Applications for such devices are far reaching, including the construction of complete high-frequency plasma-based logic circuits, and integrated circuits with superior resistance to radiation and extreme temperature environments.  It is envisaged that both two and multi-terminal devices consisting of various architectures will be developed and optimized under the scope of this program.  MPDs will be developed in various circuits and substrates to demonstrate the efficacy of different approaches.\n\nThe Basic Research part of this effort is focused on fundamental MPD research and will advance scientific knowledge based on the study of several key MPD design parameters.  These parameters include ultra-high pressure and carrier densities regimes.  MPD will focus on expanding the design space for plasma devices enabling revolutionary advances in microplasma device performance.  It is expected that MPD will develop innovative concepts and technologies that are clearly disruptive with respect to the current state of the art.  Fundamental scientific knowledge derived from MPD is also expected to drive developments in commercialization of MPD technology developed and funded in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Defined initial microscale plasma device (MPD) design parameters and signal processing architectures.\n-  Generated plasma at ultra-high (1-20 atmosphere) pressures with emphasis on robust electronic switching.\n-  Achieved plasma carrier density exceeding one times ten to the twentieth power (1E20)\/cubic centimeters, exceeding the program goals (1E18) by two orders of magnitude.\n-  Achieved MPD switching speed of less than 250 picoseconds, and determined plasma gas pressures necessary to reach the program goal of less than 100 picosecond speeds, needed for robust survivability in high power electromagnetic fields.\n-  Began characterization of high-temperature (600 degrees Celsius) effects on microscale plasma device materials and substrates.\n-  Designed and began optimization of microscale plasma devices (1-20 micrometer scale microcavities) for implementation in substrate systems.\n-  Began characterization of fundamental MPD device reliability in extreme radiation environments, consistent with nuclear reactors. \n-  Demonstrated microscale plasma device operation exceeding 2 hours in environments that destroy complementary metal-oxide semiconductor (CMOS) devices within minutes.\n-  Achieved greater than 2000 hour microscale plasma device lifetime with no visible damage to microplasma cavity system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "-  Optimize plasma cavity environment for plasma generation at ultra-high (1-20 atm) pressures with emphasis on robust electronic switching.\n-  Improve robustness of microscale plasma devices with carrier density exceeding ten to the eighteenth power\/cubic centimeter.\n-  Continue to investigate effects of high temperature environments on plasma generation and microscale devices at temperatures up to 600 degrees Celsius.\n-  Determine optimal parameters including gas pressure and mixture necessary for < 100 picosecond MPD switching speeds needed for robust survivability in high power electromagnetic fields.\n-  Improve robustness of MPD devices operating in extreme radiation environments to improve average lifetime orders of magnitude beyond state of art radiation hardened CMOS.\n-  Generate high-power microwave through Terahertz (Thz) frequency signals utilizing plasma as a non-linear up-conversion medium."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete optimized microcavity designs achieving parameters and uniformity necessary for < 100 picosecond device switching speeds needed for robust survivability in high power electromagnetic fields.\n-  Finalize and exploit studies of plasma in extreme environments (radiation and temperature) to demonstrate robust electronics capable of surviving in harsh environments orders of magnitude longer than current  state of art silicon CMOS.\n-  Complete device modeling based on characterization of fabricated microscale plasma devices and provide results to circuit and microsystem integrators for use in DoD system designs.\n-  Transition of fundamental research findings into improved modeling simulation and design tool capabilities, enabling DoD relevant applications that require survivability in extreme radiation and temperature environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Semiconductor Technology Advanced Research Network (STARNet)*"
                                    },
                                    "Description": {
                                        "val": "* Formerly titled the Microsystems Research Consortium\n\nThe Semiconductor Technology Advanced Research Network (STARNet) program is a new government-industry partnership focused on removing the roadblocks to achieving performance needed for future sensing, communication, computing, and memory applications.  It combines the expertise and resources from select defense, semiconductor, and information companies with those of DARPA to sponsor an academic base focused on specific technology requirements set by experts in industry and DARPA.  The program will involve close collaboration between these experts and the academic base with industry providing 60% of program funding matched by 40% from DARPA.  For industry, leveraging funding and expertise with both other companies and DARPA to solve common technical hurdles in a pre-competitive research model is highly attractive.  From the government perspective this kind of model also provides unique insight into the directions future commercial off-the-shelf (COTS) technologies will be taking.  This perspective assists DARPA in defining the technology gaps where the DoD can make the most out of its limited resources by investing in those areas where the largest technology discrimination can be achieved.  This discrimination is key to expanding technological superiority of the United States DoD.\n\nResearch in STARNet is divided into a discovery thrust (ACCEL) and an integration thrust (NEXT) focused on combining current or emerging technologies to provide new capabilities.  ACCEL includes projects governed by virtual academic centers discovering new material systems, devices, and novel computing\/sensing architectures.  NEXT involves projects on advanced analog and mixed signal, complex system design tools, and alternative computing architectures.  As the projects in ACCEL mature it is expected that they will replace the complementary metal-oxide semiconductor (CMOS) based efforts currently in NEXT.  \n\nThe STARNet program is unique. It creates a community where industry and government participate as co-sponsors to guide and learn from a large academic research base, with DoD shaping the goals to have direct impact on important long-range DoD problems.  STARNet has a 5-year duration.  It is expected that industry and DARPA will continuously evaluate STARNet and their respective challenges to determine if another collaborative program is warranted at the conclusion of the 5-year term."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.740"
                                            },
                                            "Text": {
                                                "val": "-  Initiate the following university-based Centers:\n\nACCEL Thrust Function Accelerated nano-Material Engineering (FAME) focusing on nonconventional material systems and devices incorporating nanostructures with quantum-level properties to enable analog, logic, and memory devices beyond binary computation. \nACCEL Thrust Center for Low Energy Systems Technology (LEAST) will focus on achieving low power electronics through combining nonconventional material systems and quantum-engineered devices into novel integrated circuits and computing architectures incorporating the developed capabilities.\nACCEL Thrust Center for Spintronic Material, Interfaces, and Novel Architectures (C-SPIN) will focus on electron spin-based memory and computation to overcome the power, performance, and architectural constraints of conventional devices.  C-SPIN will focus on magnetic materials, spin transport, novel spin-transport materials, spintronic devices, circuits, and associated architectures.\nNEXT Thrust Systems On Nanoscale Information fabriCs Center (SONIC) focuses on shifting the model of computation from a deterministic digital foundation to a statistical one.  The center will produce new strategies and designs optimized for applications where statistically accurate computations are sufficient, or even more adequate, thereby increasing energy efficiency.\nNEXT Thrust The Center for Future Architectures Research (C-FAR) will investigate highly parallel computing implemented in nonconventional computing systems. \nNEXT Thrust The TerraSwarm Research Center addresses the challenge of providing city-scale capabilities via the deployment of geographically distributed applications on a swarm of shared platforms.  Two scenarios are of interest: a city during normal operation and a city during natural or man-made disasters (e.g., hurricanes, earthquakes, or terrorist attacks)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "Continue joint government-industry support of the Centers established under the two thrusts (NEXT and ACCEL) and oversee efforts to allow for re-direction as needed.\nMonitor and assess progress towards technical goals proposed by Centers. Goals include:\nFAME: ( 1) Reduce power consumption of current spintronic devices by 100x to outperform scaled CMOS, (2) produce SRAM devices with 25x higher density and 100x lower off-state leakage, (3) demonstrate logic switches operating at 0.1 V with 100x-10,000x reduction in energy.\nLEAST: The primary metric of the various proposed innovative devices is improved subthreshold slope, the abruptness with which the device turns on.  The challenge is to reduce it as far as possible below the theoretical CMOS limit of 60 millivolts\/decade. Circuit power levels then scale down proportionally.\nC-SPIN:  (1) Demonstrate 100x improvement in energy dissipation compared to CMOS, (2) show scalability to sub-10 nanometer dimensions, 3) investigate new capabilities such as nonvolatility and non-Boolean computing architectures.\nSONIC: (1) Investigate potential for 100x energy efficiency and 10,000x error robustness improvements by utilizing stochastic nature of novel nanoscale computing technologies, 2) seek 10x improvement in energy efficiency from innovative scaled digital-analog mixed signal circuits, 3) demonstrate 100x energy efficiency enhancement from neuro-inspired cognitive information processing systems.\nC-FAR:  Investigate potential for 10-100x computational energy efficiency improvement utilizing innovative parallel architecture designs and memory bandwidth reduction with built-in fault tolerant mechanisms.\nTerraSwarm: Develop (1) smart city \"cloud backbone\" for global data analytics, access, and archiving, (2) mobile battery-powered personal devices, and (3) swarm devices to sense and actuate in the physical world."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Arrays at Commercial Timescales (ACT)"
                                    },
                                    "Description": {
                                        "val": "There is a critical shortage of digitally savvy Radio Frequency (RF) engineers who are capable of exploiting the latest in digital electronics technology and applying it to traditionally RF and analog applications such as phased arrays.  This program will develop arrays that are heavily digitally influenced and that can be connected together as if they represented nodes on a traditional computing network.  New advances in digital circuits at every element array panel will allow for ubiquitous phased array technology with heretofore unrealized coverage and capabilities.  This program will take a fundamental look at the role of digital arrays and how commonality and aggregation can be affected by emerging capabilities.  Simultaneously, this effort will focus on the development of arrays which can quickly create different unique RF personalities\/capabilities on top of common digital hardware.  The project will demonstrate levels of diversity in the use of the electromagnetic spectrum which is severely limited by the current approach of hand designing the array with heavily specialized RF beamformers that are unique to each system.  This program also has related applied research efforts funded under PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.876"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.876"
                                            },
                                            "Text": {
                                                "val": "-  Develop array components that can demonstrate interoperability over a wired or wireless network such that the realized performance is an integrated sum of each individual array's performance.\n-  Develop design techniques suited to common digital hardware components for phased array elements that can be seamlessly integrated into a wide range of platforms.\n-  Develop electromagnetic interface elements capable of reconfiguring for various array use cases and operational specifications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Micro-coolers for FPAs (MC-FPA)"
                                    },
                                    "Description": {
                                        "val": "The Micro-coolers for FPAs program will develop low size, weight, power, and cost (SWaP-C) cryogenic coolers for application in high performance infrared (IR) cameras.  It is well known that the sensitivity of an IR focal-plane array (FPA) is improved by cooling its detectors to cryogenic temperatures.  The disadvantages of state-of-the-art cryo-coolers are their large size, high power and high cost.  Thermoelectric (TE) coolers are relatively small, but are very power hungry.\n \nTo reduce IR camera SWaP-C, innovations in cooler technology are needed.  This program will exploit the Joule-Thompson (J-T) cooling principle, in a silicon-based MEMS technology, for making IR FPA coolers with very low SWaP-C. MEMS microfluidics, piezoelectric MEMS, and complementary metal-oxide semiconductor (CMOS) electronics will be used to demonstrate an integrated cold head and compressor, all in a semiconductor chip.  This program has related applied research efforts funded under PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "-  Design and demonstrate a chip-scale cold-head for 640 x 480 IRFPA chip with 4-6 um unit cell size for extended shortwave infrared (e-SWIR, 1-2.4um cutoff).\n-  Design and test a five stage micro-cooler with an integrated piezoelectric compressor and cold-head with following metric: 30mm x 20mm x 10mm; 50 g.\n-  Finalize design for operation down to 150K with 350mW heat lift."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Radiation Cooling and Heating in Integrated Devices (ORCHID)"
                                    },
                                    "Description": {
                                        "val": "Many Department of Defense (DoD) systems use micro- and nano-electromechanical systems (MEMS and NEMS).  Such devices are used in compact accelerometers and gyroscopes for stability control in inertial navigation and in switches for optical communication and data routing.  However, they operate many orders of magnitude away from their ultimate limits.  Techniques to reduce or overcome thermal noise in MEMS\/NEMS devices are critical for realizing their full potential.\n\nThe ORCHID program will leverage recent successes within the field of cavity-opto-mechanics to broadly explore the application space while driving technological development toward smaller and more robust devices capable of deployment in the field.  It is envisioned that such devices, once demonstrated, will find broad application across DoD, particularly in the areas of force sensing and optical communication."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.300"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated an on-chip opto-mechanical oscillator with frequency greater than 5 gigahertz (GHz); and a phase noise of less than -111 decibels relative to the carrier per hertz (dBc)\/Hz at 10 kilohertz (kHz), a performance compatible with modern communication and radar systems.\n-  Demonstrated an integrated fiber-based Fabry-Perot resonator with a finesse of 100,000.  This cavity was coupled to a silicon nitride membrane with a high mechanical quality factor and had a second order coupling strength of up to 20 GHz\/nanometer (GHz\/nm)^2.  Such devices are ideal for squeezed light production in a small integrated device.\n-  Demonstrated laser-cooling of a micro-mechanical system into its quantum mechanical ground state and measured quantum signatures of the mechanical motion.  Such devices are useful for low-noise and high sensitivity force, mass and acceleration sensors.\n-  Demonstrated a low phase noise stimulated-brillouin-scattering microwave oscillator in a high Q silica micro-disk resonator with a carrier frequency of 21.7 GHz."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.950"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate broadband integrated optomechanical 10 GHz acousto-optic modulator\/shifter with an efficiency >10% (room temperature, electronic drive, telecom wavelengths).\n-  Demonstrate a fully micro-chip packaged (laser, detector, and transducer) optomechanical continuous position sensor with back-action-imprecision product within a factor of 2 of the Heisenberg limit.\n-  Demonstrate quantum state transfer via optomechanical dark modes which are immune to thermal noise and thus, such devices would operate at room temperature.\n-  Develop a hybrid optomechanical system consisting of a Silicon Nitride-nanobeam and a silica micro-sphere with an optomechanical coupling rate > 1 Megahertz ( MHz).  Such devices will be used for quantum state transfer at room temperature and wavelength conversion with a fidelity > 0.7. \n- Develop a fully packaged, amplifier-free, Aluminum Nitride (ALN) optomechanical microwave oscillator with a phase noise less than -120 dBc\/Hz at 10 kHz offset with a 10 GHz carrier frequency. The final packaged device will include ALN optomechanical resonator, on-chip optical coupling and on-chip Germanium (Ge) photo-detectors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diverse & Accessible Heterogeneous Integration (DAHI)"
                                    },
                                    "Description": {
                                        "val": "Prior DARPA efforts have demonstrated the ability to monolithically integrate inherently different semiconductor types to achieve near-ideal \"mix-and-match\" capability for DoD circuit designers.  Specifically, one such program was the Compound Semiconductor Materials On Silicon (COSMOS) program, in which transistors of Indium Phosphide (InP) could be freely mixed with silicon complementary metal-oxide semiconductor (CMOS) circuits to obtain the benefits of both technologies (very high speed and very high circuit complexity\/density, respectively).  The Diverse & Accessible Heterogeneous Integration (DAHI) effort will take this capability to the next level, ultimately offering the seamless co-integration of a variety of semiconductor devices (e.g., GaN, InP, GaAs, ABCS), microelectromechanical (MEMS) sensors and actuators, photonic devices (e.g., lasers, photo-detectors) and thermal management structures.  This capability will revolutionize our ability to build true \"systems on a chip\" (SoCs) and allow dramatic size, weight and volume reductions for a wide array of system applications.\n\nThe Basic Research part of this program is focusing on the development of new hetero-integration processes and capabilities that, if successful, will ultimately be demonstrated in application-specific circuits and transferred into the manufacturing flow.  This program has applied research efforts funded in PE 0602716E, Project ELT-01, and advanced technology development efforts funded in PE 0603739E, Project  MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "-  Initiated development of new CMOS-compatible processes to achieve heterogeneous integration with diverse types of compound semiconductor transistors, MEMS, and non-silicon photonic devices, in particular the demonstration of novel electronic-photonic integrated components and circuits.\n-  Investigated theoretically, and via bench-top experiments, novel electronic-photonic heterogeneously integrated architectures for applications such as low-noise lasers, RF signal sources, and laser radar on a chip.\n-  Initiated development of noise measurement methodology with sensitivity beyond state-of-the-art for advanced lasers and optoelectronic signal sources being developed within DAHI."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.113"
                                            },
                                            "Text": {
                                                "val": "-  Continue to develop new CMOS-compatible processes to achieve heterogeneous integration with diverse types of compound semiconductor transistors, MEMS, and non-silicon photonic devices, and initiate transition of these processes to foundry fabrication flows under development in the applied research effort under DAHI.\n-  Initiate fabrication and test of heterogeneously integrated ultra-low-noise laser sources and on-chip laser radar systems.\n-  Continue development of noise measurement methodology with sensitivity beyond state-of-the-art for advanced lasers and optoelectronic signal sources being developed within DAHI."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Focus Center Research Program (FCRP)"
                                    },
                                    "Description": {
                                        "val": "The Focus Center Research Program (FCRP) was a collaborative effort between the Defense Advanced Research Projects Agency (DARPA) and the semiconductor industry to concentrate research attention and resources to provide radical innovation in semiconductor technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.578"
                                            },
                                            "Text": {
                                                "val": "-  Achieved record high enhancement of thermal conductivity of thermal interface \"grease\" by 23 times using an advanced graphene polymer.  Integrated circuit processor chip cooling capacity increased from 1-5 to 14 watts per milli-Kelvin (W\/mK) to date, approaching the industry goal of 25-30 W\/mK to cool future processors.\n-  Achieved record 50% higher current in gallium nitride-based power transistor (AlGaN\/GaN HEMT) for high electrical power required in applications from powering integrated circuits to automobiles to radar.\n-  Demonstrated major achievement in improving practical carbon nanotube transistors by increasing their packing density by factor of seven, to 100 nanotubes per square micrometer.  This produces one-half of  the ultimately required current, a huge step toward practical implementation.\n-  Demonstrated first silicon-compatible germanium quantum well waveguide modulator with 7 Gigabit (Gb)\/s transfer data rate for photonic IC interconnects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantum Entanglement Science and Technology (QuEST)"
                                    },
                                    "Description": {
                                        "val": "The Quantum Entanglement Science and Technology (QuEST) program has explored the research necessary to create new technologies based on quantum information science.  Technical challenges include loss of information due to quantum decoherence, limited communication distance due to signal attenuation, protocols, and larger numbers of quantum bits (qubits) and their entanglement.  A key challenge has been to integrate improved single and entangled photon and electron sources and detectors into quantum computation and communication networks.  Error correction codes, fault tolerant schemes, and longer decoherence times were addressed.  Expected impacts include highly secure communications, algorithms for optimization in logistics, highly precise measurements of time and position on the earth and in space, and new image and signal processing methods for target tracking."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.650"
                                            },
                                            "Text": {
                                                "val": "-  Continued fundamental research in the area of quantum information.\n-  Characterized and manipulated entangled quantum systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MS-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "100.165"
                        },
                        "CurrentYear": {
                            "val": "86.540"
                        },
                        "BudgetYearOne": {
                            "val": "82.819"
                        },
                        "BudgetYearOneBase": {
                            "val": "82.819"
                        },
                        "BudgetYearTwo": {
                            "val": "75.186"
                        },
                        "BudgetYearThree": {
                            "val": "73.824"
                        },
                        "BudgetYearFour": {
                            "val": "84.877"
                        },
                        "BudgetYearFive": {
                            "val": "90.263"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides the fundamental research that underpins the development of advanced nanoscale and bio-molecular materials, devices, and electronics for DoD applications that greatly enhance soldier awareness, capability, security, and survivability, such as materials with increased strength-to-weight ratio and ultra-low size, devices with ultra-low energy dissipation and power, and electronics with persistent intelligence and improved surveillance capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Nanoscale\/Bio-inspired and MetaMaterials"
                                    },
                                    "Description": {
                                        "val": "The research in this thrust area exploits advances in nanoscale and bio-inspired materials, including computationally based materials science, in order to develop unique microstructures and material properties.  This area also includes efforts to develop the underlying physics for the behavior of materials whose properties have been engineered at the nanoscale level, including metamaterials, and materials exhibiting a permanent electric charge (charged matter)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.439"
                                            },
                                            "Text": {
                                                "val": "-  Applied selected fabrication techniques and produced materials with architectural features designed to exhibit predicted material properties, such as high strength at low density. \n-  Initiated experimental characterization of effects of varying architectural features on targeted material properties.\n-  Initiated sensitivity analyses to develop and validate optimization algorithms for material properties.\n-  Initiated multidimensional architecture-to-property design space analysis for fabrication of materials with architectural features necessary to exhibit predicted properties."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.380"
                                            },
                                            "Text": {
                                                "val": "-  Optimize fabrication methods of materials with architectural features necessary to exhibit predicted properties. \n-  Initiate experimental optimization of architectural features to demonstrate improvement of selected material properties based on sensitivity analyses and experimental characterization. \n-  Continue development of multi-dimensional architecture-to-property design space fabrication of materials with architectural features necessary to exhibit predicted properties. \n-  Initiate research to determine extent to which properties normally coupled, can be decoupled using architecture-to-properties design methodology. \n-  Initiate scalability research to determine degree to which fabrication methods are amenable to scaling and degree to which architectural control can be maintained."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.205"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.205"
                                            },
                                            "Text": {
                                                "val": "-  Design materials with decoupled property combinations (e.g., strength\/density, stiffness\/thermal expansion) using architecture-to-property trade space capability. \n-  Demonstrate fabrication methods amenable to scaling and that permit architectural control capable of maintaining decoupled properties.\n-  Demonstrate targeted enhancement to material properties (e.g., strength of steel and density of water). \n-  Establish manufacturability and amenability to scaleup.  Provide fabrication and characterization data package."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fundamentals of Nanoscale and Emergent Effects and Engineered Devices"
                                    },
                                    "Description": {
                                        "val": "The Fundamentals of Nanoscale and Emergent Effects and Engineered Devices program seeks to understand and exploit physical phenomena for developing more efficient and powerful devices.  This includes developing devices and structures to enable controllable photonic devices at multiple wavelengths, engineering palladium microstructures with large deuterium loadings to study absorption thermodynamics and effects, and enabling real-time detection as well as analysis of signals and molecules and origin of emergent behavior in correlated electron devices.  Arrays of engineered nanoscale devices will result in an order of magnitude (10 to 100 times) reduction in the time required for analysis and identification of known and unknown (engineered) molecules.  This program will develop novel nanomaterials for exquisitely precise purification of materials, enabling such diverse applications as oxygen generation and desalination, ultra-high sensitivity magnetic sensors, and correlated electron effects such as superconductivity.  Additionally, this program will compare the phenomenology of various biological, physical and social systems and abstract the common features that are responsible for their properties of self-organization, emergent behavior, and physical intelligence.  Finally, this program will develop stabilization and scale-up methods to fabricate high pressure crystal structures within domains not previously possible.  This offers the promise to exploit the incredible properties of high pressure phases (e.g, hardness for armor) using economically viable manufacturing approaches."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.650"
                                            },
                                            "Text": {
                                                "val": "-  Verified the initial unified physical intelligence theory and justified its underlying assumptions in the context of model systems that support the emergence and evolution of novel structure.\n-  Expanded the physical intelligence theoretical effort to include neuropercolation models and address correlated effects such as self-organized criticality, renormalization, scaling, and out-of-equilibrium physics.\n-  Demonstrated the spontaneous, abiotic evolution and complex spatial and temporal organization in electro-physical systems in response to structure and resources from the environment.\n-  Quantified the emergent hierarchical structures that evolve from the demonstrated electro-physical systems.\n-  Demonstrated the ability to design an evolving electro- physical system and direct its evolution toward specified objectives in the form of a challenge problem or application.\n-  Initiated development of computational tools to formulate processing pathways to stabilize and scale up high pressure crystal phases.\n-  Established scalability and scaling parameters in excess heat generation processes in collaboration with the Italian Department of Energy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.159"
                                            },
                                            "Text": {
                                                "val": "-  Initiate efforts to identify and characterize metastable, high pressure phases of gaseous materials (extended solids) that have superior mechanical\/functional properties.\n-  Initiate development of synthesis techniques for producing extended solids at temperature and pressures amenable to scale up."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "-  Validate computational tools against known high pressure materials and apply to develop multistep pathways to selected extended solids. \n-  Apply synthesis techniques to, and initiate synthesis of, intermediates projected to lead to selected extended solids. \n-  Develop and demonstrate methods to stabilize extended solids at ambient temperatures and pressures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atomic Scale Materials and Devices"
                                    },
                                    "Description": {
                                        "val": "This thrust examines the fundamental physics of materials at the atomic scale in order to develop new devices and capabilities.  A major emphasis of this thrust is to provide the theoretical and experimental underpinnings of a new class of semiconductor electronics based on spin degree of freedom of the electron, in addition to (or in place of) the charge.  A new all optical switch capability will also be investigated.  It includes a new, non-invasive method to directly hyperpolarize biological tissues, leading to novel quantitative neurodiagnostics.  New materials and prototype devices will be developed to demonstrate a new class of optoelectronics that operate with ultra-low energy dissipation (~100 atom-Joules (aJ)\/operation).  Novel material properties and device functionality obtained by designing and making atomically thin (i.e., two-dimensional) materials will also be pursued."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.563"
                                            },
                                            "Text": {
                                                "val": "-  Generated polar molecules and studied long-range character and ordering inside an optical trap. \n-  Made detailed measurements of the thermodynamical and dynamical properties of systems near a quantum phase transition. \n-  Realized synthetic spin-orbit coupling in atoms and measured its effects on band structure and transport (spin Hall effect). \n-  Implemented an all-optical switch design based on optically-induced absorption compatible with a 50 nanometer range in input wavelength.\n-  Demonstrated total energy dissipation for an optical switch of less than 100 attojoules per operation with a simultaneous signal loss of less than 0.02 decibels.  \n-  Demonstrated Zeno-based switching at both cryogenic and room temperatures. \n-  Initiated the design and fabrication of high efficiency X-ray optics appropriate for broadband, bench top X-ray sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate switch fabric of at least 2 concatenated all-optical switches, each with less than 100 attojoules total energy dissipation (not counting waveguide losses)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Photon Science"
                                    },
                                    "Description": {
                                        "val": "Initiated under the Fundamentals of Nanoscale Devices effort, the Basic Photon Science thrust is examining the fundamental science of photons, from their inherent information carrying capability (both quantum mechanically and classically), to novel modulation techniques using not only amplitude and phase, but also orbital angular momentum.  The new capabilities driven by this science will impact DoD through novel approaches to communications and imaging applications, in addition to better understanding the physical limits of such advancement.  For example, fully exploiting the computational imaging paradigm and associated emerging technologies to yield ultra-low size, weight, and power persistent\/multi-functional intelligence, surveillance, and reconnaissance systems that greatly enhance soldier awareness, capability, security, and survivability.  Finally, the program will develop approaches for optical frequency division and harmonic generation that will allow accurate optical clocks and table-top sources of coherent X-rays for medical and non-medical applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.500"
                                            },
                                            "Text": {
                                                "val": "-  Investigated the practical limits to the information content of a single photon via inclusion of various real-world imperfections. \n-  Demonstrated the utility of information theoretic approach via highly photon-efficient communications.\n-  Demonstrated the utility of information theoretic approach via improved low-light level imaging. \n-  Demonstrated the benefit of orbital angular momentum for communications applications.\n-  Evaluated the information capacity of candidate ghost imaging and laser radar systems.\n-  Characterized surfaces of constant performance in the space of camera cost factors including optics, focal planes, and computation. \n-  Developed a new method of optical metrology based on rotating point spread functions and computational imaging. \n-  Studied the use of nanostructured optical surfaces for polarization control and spectral filtering. \n-  Developed a collection of candidate computational camera designs that yield high performance and low size, weight and power."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.250"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate classical optical communications with an information rate of 10 bits per photon.\n-  Demonstrate quantum mechanically secure communications at a secure key information rate of 10 bits per photon.\n-  Demonstrate novel technologies for encoding and decoding orbital angular momentum.\n-  Demonstrate low-light level imaging at an information rate of 5 bits per photon.\n-  Construct a low phase noise microwave oscillator based on optical frequency division from a fiber based optical frequency comb.  \n-  Build a 4 micron, 1-10 Kilohertz (kHz) laser system with a pulse energy of 10 Megajoules (mJ)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.889"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.889"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a 10 Gigahertz (GHz) oscillator using optical frequency division with a micro-frequency comb.\n-  Demonstrate free space time transfer over 10 km with timing error 1000 times better than GPS (< 10^-12 seconds timing error over 1 second).  \n-  Demonstrate laser pulses < 50 attaseconds for stroboscopic imaging of material dynamics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Quantum Technologies"
                                    },
                                    "Description": {
                                        "val": "This thrust emphasizes a quantum focus on technology capabilities including significantly improved single photon sources, detectors, and associated devices useful for quantum metrology, communications, and imaging applications.  It will also exploit novel optical nonlinearities that can be used to combine quantum systems with classical coherent pulses to enable secure quantum communications over conventional fiber at rates compatible with commercial telecommunications.  In addition, this thrust will examine other novel classes of materials and phenomena such as plasmons or Bose-Einstein Condensates (BEC) that have the potential to provide novel capabilities in the quantum regime, such as GPS-independent navigation via atom interferometry and communications, and ultrafast laser technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.674"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated an optomechanical accelerometer with sensitivity of (>10^-7 of the acceleration due to gravity [micro-g] per root hertz) and bandwidth (>10 kilohertz [kHZ]) compatible with inertial navigation of unmanned aerial vehicles.\n-  Demonstrated a diamond magnetometer with < 5 microtesla\/hertz^1\/2 and < 10 nanometer (nm) resolution. \n-  Demonstrated a compact cold alkaline beam source and optical reference cavity for an optical clock. \n-  Investigated the feasibility of high average power, ultrafast laser architectures suitable for efficient high harmonic generation and high throughput industrial micromachining."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.591"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate an optomechanical accelerometer with sensitivity of 1 micro-g\/Hz^1\/2 sensitivity and 1 kHz bandwidth.\n-  Demonstrate an integrated optomechanical device for coupling optical and microwave photons.\n-  Use diamond-atomic force microscopy magnetometer to sense one electron spin on a surface with spatial resolution <5 nm.\n-  Demonstrate a compact optical clock.\n-  Demonstrate on-chip, octave-spanning frequency comb with < 200 Gigahertz (GHz) line spacing.\n-  Demonstrate proof-of-principle of novel technology capable of decoupling transmission loss from secure-bit-rates in quantum communications systems. \n-  Design prototype macroscopic quantum communications system that has the potential to scale to 1 - 10 gigabit per second secure communications rates and 1,000 - 10,000 kilometer secure communications distances.\n-  Determine requirements for large-scale testbed of macroscopic quantum communications technologies capable of simulating realistic conditions for 10 gigabit per second secure communications over 1,000 - 10,000 kilometers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.352"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.352"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate an optomechanical accelerometer with sensitivity ( >100 10^-9 acceleration due to gravity\/Hz^1\/2)  and bandwidth (>10 kHz) compatible with inertial navigation of unmanned aerial vehicles. \n-  Demonstrate a single diamond nitrogen vacancy magnetometer with < 10 nm resolution that is compatible with imaging biological systems. \n-  Validate the performance of a compact (< 10 liters) portable optical clock with a timing accuracy 10 times better than satellite GPS clocks.  \n-  Demonstrate prototype macroscopic quantum communications systems at secure long haul communications distances.\n-  Demonstrate improved decoupling between secure bit rate and loss in long-haul quantum communications. \n-  Implement macroscopic quantum communications testbed capable of simulating realistic conditions (loss, noise, and decoherence) through the modern fiber-optic telecommunications grid."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fundamentals of Physical Phenomena"
                                    },
                                    "Description": {
                                        "val": "This thrust will obtain insights into physical aspects of natural phenomena such as magnetospheric sub-storms, fire, lightning, and geo-physical phenomena.  New fundamental understandings of these phenomena will enable the ability to predict and exploit these physical processes.  A major emphasis of this thrust is to provide predictive models for the interactions between plasmas and electromagnetic waves across a range of energy and length scales, and into new regimes.  Specific efforts that fall under this heading are foundational studies on the initiation, propagation, and attachment of lightning, and their associated emissions; the critical factors affecting magnetospheric sub-storms; the generation and amplification of extremely low frequency (ELF)\/ultra low frequency (ULF)\/very low frequency (VLF) radiation in the ionosphere utilizing the High Frequency Active Aural Research Program (HAARP) transmitter; and understanding and quantifying the interaction of electromagnetic and acoustic waves with the plasma in flames."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.517"
                                            },
                                            "Text": {
                                                "val": "-  Characterized conditions surrounding artificial duct creation and conducted experiments to determine mechanisms by which VLF waves can be injected into these ionospheric ducts.\n-  Conducted a series of experiments to quantify ionospheric D-region absorption, F-region irregularities, spatial distribution of ELF\/VLF source currents, and Electrojet electric fields.\n-  Conducted a series of experiments to optimize the efficiency of ULF generation and potentially gain active control of their lateral propagation paths and injection into the magnetosphere. \n-  Conducted comprehensive research campaigns using both triggered and natural lightning during the fall\/winter storm seasons to measure all atmospheric, electromagnetic and ionospheric phenomena associated with positively-charged-winter-time lightning. \n-  Conducted comprehensive fall\/winter research campaigns to study the initiation of transient luminous events, early VLF events, and lightning-induced electron precipitation events by providing the known event timing, location, and properties inherent to rocket-triggered lightning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.991"
                                            },
                                            "Text": {
                                                "val": "-  Conduct numerical studies of ion dynamics caused by ULF, and of VLF wave propagation through the ionosphere inside density ducts created by artificial heating. \n-  Experimentally attempt 3-D observations of HF-induced plasma structures and potentially determine relative HF power absorption for different altitudes, frequencies and geophysical conditions.\n-  Experimentally quantify the impact of triggered lightning on properties of natural lightning (including the emission of gamma rays, X-rays, UV, visible and near-infrared (IR)\/short wave IR, RF, VLF\/ULF) and on the properties of ionospheric phenomena (elves, sprites, whistlers, etc.).\n-  Experimentally quantify the impact of tropospheric lightning (both triggered and natural) and its ionospheric components on the conductivity of the ionosphere and the resultant scattering of sub-ionospherically-propagating VLF signals.\n-  Experimentally quantify the impact of compact intracloud discharges on lightning propagation as well as their potential contribution to the production of very large blue jets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.873"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.873"
                                            },
                                            "Text": {
                                                "val": "-  Experimentally define and quantify the causative mechanisms behind lightning initiation, propagation and attachment. \n-  Experimentally (in-situ) measure dosage of radiation emitted during the lightning process and its potential impact on aircraft and humans.\n-  Experimentally define and quantify all ionospheric effects associated with terrestrial lightning.\n-  Test active control of ionospheric geomagnetic substorm evolution process. \n-  Test innovative techniques to suppress auroral clutter, which inhibits the effective use of over-the-horizon radar. \n-  Induce triggered emissions (VLF amplification) to precipitate electrons by injecting artificial VLF waves (radiation belt remediation)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MesoDynamical Architectures (Meso)"
                                    },
                                    "Description": {
                                        "val": "The Mesodynamic Architectures (Meso) program is exploiting recently discovered physics present at small scales to demonstrate transformative technologies and redefine the building blocks of modern communication, sensing, and computing technologies.  The program is divided into four thrusts; dynamics of nonlinearity and noise; coherent collective dynamics; information transduction; and coherent feedback control.  In each of these thrusts performers are focused on demonstrating specific technologies that will have significant impact on DoD capabilities.  Technologies include transistors operating at 100x lower power than the commercial semiconductors that will provide the DoD with unique computing capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.822"
                                            },
                                            "Text": {
                                                "val": "Nonlinearity and Noise Thrust:\n-  Produced the first ever Micro-Electro-Mechanical Systems (MEMS) device capable of navigation by using Meso program prototypes to acquire and track GPS.\n-  Demonstrated the core concept of using nonlinearity to improve oscillator fidelity in 3 different architectures.\n-  Achieved lower phase noise, a key performance metric associated with carrier frequency, which is desired to be increased into the range of 1 Gigahertz (GHz) where there is lack of options for communication applications.\n-  Demonstrated the Phase 1 temperature stability metric of 30 parts-per-million over -40 to 85 degrees C, a temperature range common to military electronics and included in several military specification documents (MilSpecs).\n-  Exceeded the acceleration stability metric of 10-5 g-1 by a factor of nearly 100,000 by demonstrating stabilities of 3x10-10 g-1.  This result opens the door to navigation of a number of military applications where high vibrations are the limitation.\n-  Performed a second demonstration of oscillator performance in communications radios that increased their range by more than 200 kilometers (km).\n\nCoherent Collective Dynamics (Topological Insulator) Thrust:\n-  Demonstrated increased understanding of the topological insulator properties, a new state of matter.\n-  Reduced bulk impurities by more than 100x, resulting in a >10x improvement of the surface to bulk carrier ratio.\n-  Achieved a key step in realizing both a new transistor concept and a novel programmable interconnect by using a magnetic field to open a gap in topologically insulating surface states.\n-  Demonstrated the first topological insulator Field Effect Transistor and the first topological insulator transistor operated by magnetic switching.\n-  Demonstrated utilizing Topological Insulators for a Thermoelectric device.  The device will potentially provide 10 to 1,000 times better effective cooling of electronics than state-of-art.\n\nInformation Transduction Thrust:\n-  Discovered new mechanism to differentiate and sense biomolecules; developed efficient new method of filtering biomolecules from fluids in a single step; and built reference database for the first biomolecules.  These discoveries are key enablers for realizing a portable biomolecule detector by allowing electronic discrimination of biomolecules efficiently, with low noise for high accuracy, and high throughput required in DoD application.\n-  Demonstrated radically enhanced and broadband light-matter interactions (3,000 times stronger coupling between light and mW optical power) and engineered material dispersion for tailorable phonon emission.  This physics will be developed into the first practical solid-state phonon laser, which will enable the realization of a low phase noise, chip-scale oscillator.  Notable qualities of the oscillator include its potential stability in extreme environments, on-chips nature and complementary metal oxide semiconductor (CMOS) compatibility.\n-  Built and tested prototype for the first widely tunable delay line oscillator for broadband signal processing.\n\nCoherent Feedback Control Thrust:\n-  Established the building blocks for the construction of a phonon laser to enable the development of tunable on-chip filters, data encoding and novel oscillators with improved performance and\/or new capabilities.\n-  Developed quantum hardware description language to be used in the creation of a computational simulation engine for nanophotonic circuits stabilized via coherent quantum feedback.\n-  Demonstrated physics effects in atomic systems to be used in the design of nanophotonic circuits with multiple components, attojoules switching energy and nanoseconds switching time."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.169"
                                            },
                                            "Text": {
                                                "val": "Nonlinearity and Noise Thrust:\n-  Achieve key Phase 2 metrics of phase noise better than -110 decibels referenced to the carrier (dBc)\/Hz @ 1 Kilohertz (KHz) offset with a carrier frequency of 800 Megaherz (MHz) and temperature stability of 10 ppm from -40 to 85 degrees C.\n-  Determine boundaries to continued improvement of acceleration stability.\n-  Experimental investigation of vibration stability.  Demonstrate new radar capabilities in a high vibration environment (e.g., track slow moving objects from helicopters, maintain GPS lock in a projectile as it is fired).\n\nCoherent Collective Dynamics (Topological Insulators) Thrust:\n-  Optimize and integrate materials at large scale to achieve a magnetically gated, ultra-low power, ultra-high switching speed topological insulator transistor; and ultra-low dissipation, programmable interconnects for electronic components.\n\nInformation Transduction Thrust:\n-  Produce prototype structures using information transduction to demonstrate advanced communication, computing and sensing technologies with new functionalities, higher bandwidth, and reduced noise and operating power, amenable to environments with limited resources.\n-  Demonstrate prototype for the electronic biomolecular sensor, reducing noise and current required for operation, and increasing its detection capacity and resolution.  Detect first model macro-molecule and its mutations.\n\nCoherent Feedback Control Thrust:\n-  Increase the number of devices per optimization handled by the computational simulation engine.\n-  Fabricate nanophotonic circuits with multiple components, 10 femtojoule switching energy, 10 nanoseconds (ns) switching time, and 2x error suppression via coherent feedback control."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "Nonlinearity and Noise Thrust:\n-  Build on the achievements of Phase 1 and Phase 2 by combining improvements into one device exceeding all the Phase 3 metrics: phase noise below -120 dB\/Hz @ 1 kHz offset with a 1 GHz carrier.\n-  Reduce device size to less than 1 mm^3, demonstrate temperature stability to better than 3 parts per million (ppm) over -45 to 80 degrees C, and  show acceleration stability to better than 10^-8 g^-1.\n-  Transition to applications such as radar for slow moving targets, munitions tracking, hiding and detecting signals in noise, and increasing communications range.\n\nCoherent Collective Dynamics (Topological Insulators) Thrust:\n-  Demonstrate magnetically gated, ultra-low power (0.1V), ultra-high switching speed (1 ns) topological insulator transistor.\n-  Demonstrate ultra-low dissipation (4 times less than copper at 10 micrometers [µm]), programmable interconnects for electronic components.  The interconnect resistance will be independent of its length, decreasing dissipation over long distances.\n-  Demonstrate thermal interconnects with more than 10 to 1,000 times improvement in performance over state of the art.\n\nInformation Transduction Thrust:\n-  Improve designs to produce the next generation of energy-efficient prototype structures with enhanced performance and functionality for advanced communications, computing and sensing technologies.\n-  Optimize the biomolecular sensor prototype by further reducing noise, power dissipation and operation current, increasing packaging density, and improving filtration throughput and detection capability.  Detect various analytes together.\n\nCoherence Feedback Control Thrust:\n-  Refine computational simulation engine, maximize number of devices per optimization and circuit error suppression via coherent feedback, in preparation for release of software for public distribution.\n-  Increase number of components in nanophotonic circuits, reduce switching energy and time, improve circuit robustness and error suppression via coherent feedback."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TRS-01"
                    },
                    "ProjectTitle": {
                        "val": "TRANSFORMATIVE SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.809"
                        },
                        "CurrentYear": {
                            "val": "35.250"
                        },
                        "BudgetYearOne": {
                            "val": "50.161"
                        },
                        "BudgetYearOneBase": {
                            "val": "50.161"
                        },
                        "BudgetYearTwo": {
                            "val": "55.227"
                        },
                        "BudgetYearThree": {
                            "val": "54.361"
                        },
                        "BudgetYearFour": {
                            "val": "68.900"
                        },
                        "BudgetYearFive": {
                            "val": "66.453"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Transformative Sciences project supports research and analysis that leverages converging technological forces and transformational trends in computing and the computing-reliant subareas of the social sciences, life sciences, manufacturing, and commerce.  The project integrates these diverse disciplines to improve military adaptation to sudden changes in requirements, threats, and emerging\/converging trends, especially trends that have the potential to disrupt military operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Social Media in Strategic Communication (SMISC)"
                                    },
                                    "Description": {
                                        "val": "The Social Media in Strategic Communication (SMISC) program will develop techniques to detect, classify, measure, and track the formation, development, and spread of ideas and concepts (memes) in social media.  This will provide warfighters and intelligence analysts with indications and warnings of adversary efforts to propagate purposefully deceptive messaging and misinformation.  Social media creates vulnerabilities that can be exploited to threaten national security and has become a key operating environment for a broad range of extremists.  SMISC will develop technology and a new supporting foundational science of social networks that will enable warfighters to defend against malevolent use of social media and to counter extremist influence operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.702"
                                            },
                                            "Text": {
                                                "val": "-  Developed formal representations of microblog content by modifying topic modeling techniques such as latent semantic indexing and latent dirichlet allocation to work on streaming data. \n-  Applied and adapted leading-edge natural language processing techniques to social media where highly contracted forms of communication are common.\n-  Developed big graph models and advanced analytics for social dynamics in social media.\n-  Developed algorithms for detecting, classifying, measuring, and tracking the formation, development, and spread of ideas and concepts (memes) in social media."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.720"
                                            },
                                            "Text": {
                                                "val": "-  Refine topic modeling techniques to accurately represent tactically significant content.\n-  Refine specialized algorithms to recognize purposeful or deceptive messaging and misinformation, persuasion campaigns, and influence operations across social media.\n-  Demonstrate models of influence operations using techniques of semi-automated narrative creation based on predictive social dynamics models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.161"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.161"
                                            },
                                            "Text": {
                                                "val": "-  Integrate algorithms for meme detection and tracking with algorithms for detecting deception, persuasion, and influence operations.\n-  Develop high fidelity diffusion models for messages, narratives, and information across social media.\n-  Combine integrated algorithms with diffusion models to create predictive simulations for the spread of given messages, narratives, and information."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of Living Foundries is to create a revolutionary, biologically-based manufacturing platform to provide new materials, capabilities, and manufacturing paradigms for the DoD and the Nation.  With its ability to perform complex chemistries, be flexibly programmed through DNA code, scale, adapt to changing environments and self-repair, biology represents one of the most powerful manufacturing platforms known.  However, the DoD's ability to harness this platform is rudimentary.  Living Foundries seeks to develop the tools, technologies, and methodologies to transform biology into an engineering practice, speeding the biological design-build-test cycle and expanding the complexity of systems that can be engineered.  The program will enable the rapid and scalable development of previously unattainable technologies and products (i.e. those that cannot be accessed using known, synthetic mechanisms) leveraging biology to solve challenges associated with production of new materials (e.g. flouropolymers, enzymes, lubricants, coatings and materials for harsh environments), novel functions (e.g. self-repairing and self-regenerating systems), biological reporting systems, and therapeutics to facilitate new solutions and enhancements to military needs and capabilities.  Ultimately, Living Foundries aims to provide game-changing manufacturing paradigms for the DoD, enabling distributed, adaptable, on-demand production of critical and high-value materials, devices and capabilities in the field or on base.  Such a capability will decrease the DoD's dependence on tenuous material supply chains that are vulnerable to political change, targeted attack, or environmental accident.\n\nIf successful, Living Foundries will do for biology what very-large-scale integration (VLSI) did for the semiconductor device industry: enable the design and engineering of increasingly complex systems to address and enhance military needs and capabilities.  Living Foundries will develop and apply an engineering framework to biology that decouples biological design from fabrication, develops and yields design rules and tools, and manages biological complexity through simplification, abstraction, and standardization of both processes and components.  The result will be rapid design, construction, implementation and testing of complex, higher-order genetic networks with programmable functionality and DoD applicability.  Research thrusts include developing the fundamental tools, capabilities and methodologies to accelerate the biological design-build-test cycle, thereby reducing the extensive cost and time it takes to engineer new systems and expanding the complexity and accuracy of designs that can be built.  Specific tools and capabilities include: interoperable tools for design and modeling; automated, modular and standardized fabrication and genome-scale engineering processes; modular regulatory elements, devices and circuits for hierarchical and scalable engineering; standardized test platforms and chassis; and novel approaches to process measurement, validation, and debugging.  Applied research for this program begins in FY 2013 in PE 0602715E, project MBT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.453"
                                            },
                                            "Text": {
                                                "val": "-  Initiated development of high-level design, automation and construction tools to increase the efficiency, sophistication, and scale of possible designs.\n-  Initiated design and development of modular regulatory elements, parts, and devices necessary to build hierarchical, complex genetic networks and enable rapid production of materials.\n-  Initiated development of orthogonal parts, devices circuits and systems (including successful demonstration of a recoded, orthogonal system) in order to mitigate system cross-talk.\n-  Initiated investigation, design, and development of standard test platforms and chassis for predictable design and testing of bioproduction pathways.\n-  Initiated and successfully demonstrated design and development of new quantitative, high-throughput measurement and debugging tools to test and validate the operation of synthetic regulatory networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.530"
                                            },
                                            "Text": {
                                                "val": "-  Continue development of standardized test platforms and chassis and begin quantitative modeling studies to predict platform behavior.\n-  Continue development of increasingly sophisticated automation of design, construction, and quality control (QC) tools to improve the efficiency, sophistication, and scale of possible designs and production pathways.\n-  Continue development of device and circuit designs and topologies that are orthogonal to and portable across multiple host chassis and whose behavior can be predicted a priori while producing minimal cross-talk.\n-  Begin designing, constructing, modeling, and testing large scale, hierarchical genetic networks to demonstrate ability to forward engineer bioproduction pathways and functions.\n-  Begin to research and develop real-time feedback and control mechanisms and tools for more complex and robust experimental design and control of engineered circuits and networks.\n-  Continue research, development, and testing of new characterization and debugging tools for synthetic regulatory networks.\n-  Begin initial experiments to design and test new production pathways for novel materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "-  Begin research and development on incorporation of new, non-natural components into bio-manufactured materials (including non-natural amino acids and an expanded set of atomic elements) to broaden the set of new materials and functions.\n-  Begin initial demonstration of automated, software-controlled, genome-scale cellular engineering process platforms that simultaneously increase the scale and complexity of experimentation and decrease the cost and time to engineer a new production system.\n-  Continue research and development of tools and methodologies to program, reprogram, and enable spatio-temporal control and feedback for engineered systems.\n-  Continue to design and test production pathways for novel materials. \n-  Develop novel algorithms and software that links the design of genetic systems to their assembly and characterization data to begin integrating the design of systems with their construction and ultimate testing\/debugging.\n-  Begin development and demonstration of tools to enable engineering of currently intractable chassis for novel and enhanced functionalities and materials production."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Open Manufacturing program will reduce barriers to manufacturing innovation, speed, and affordability of materials, components, and structures.  This will be achieved by investing in technologies to enable affordable, rapid, adaptable, and energy-efficient manufacturing and to promote comprehensive design, simulation and performance-prediction tools, and exposure to best practices.  The applied research component of this program is funded in Program Element 0602715E, Project MBT-01 under Materials Processing and Manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Identified experiments and targeted tests that rapidly optimize part qualification processes.\n-  Developed simulation tools that allow rapid predictions of guaranteed performance in actual manufactured products.  \n-  Developed new manufacturing\/fabrication capabilities that allow for low-volume production runs with the same economies as high-volume ones.\n-  Initiated process and process models that enable rapid setup and processing thereby reducing entry costs and timelines.\n-  Established manufacturing demonstration centers of expertise that increase access and expand the base of manufacturing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Establish tools that capture the impact of manufacturing practice and non-linear interactions between components and subsystems and that incorporate parametric and declarative attributes.\n-  Establish models that incorporate uncertainty, and develop ways to chain models together, with uncertainty embedded in each stage, to predict and guarantee that the range of performance lies within required boundaries.\n-  Develop new testing methodologies and protocols that support rapid qualification of products.\n-  Demonstrate methods for testing and qualification of new manufacturing technologies using impartial manufacturing centers of expertise.\n-  Perform virtual manufacturing system exercises that pass design, manufacture, and verification of a specific part through the entire chain."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop a fundamental understanding of the impact on quality features and parameters to establish process windows for new rapid process technologies.\n-  Develop methods to enable design of tests and inspections that incorporate material condition, design vulnerabilities, process variability, as well as incorporating test variability and statistical treatments.\n-  Develop basic architecture and statistical environment to enable rapid qualification and certification approaches through the interaction and use of probabilistic models for process, design, and materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Approaches to Intractability"
                                    },
                                    "Description": {
                                        "val": "The Networked Approaches to Intractability program will tackle complex problems such as corruption, human trafficking, and genocide that appear intractable.  The U.S. military is increasingly involved with societies plagued by such seemingly self-perpetuating evils.  Problems in this class often include social, cultural, ideological, political, and economic constraints, and consequently stakeholders with radically differing world views and frames of reference.  Limited U.S. patience for long-term engagements and interconnectedness with other similarly complex problems further characterize the challenge.  Social networking has shown initial promise for problems of this nature, such as bribery, though on a smaller scale.  The Networked Approaches to Intractability program will develop social networking-based applications that incorporate recent breakthroughs in game theory and multi-party negotiation to break vicious social cycles and create virtuous social cycles.  The program seeks approaches to modeling and reasoning about problems of this nature, incentive mechanisms to elicit relevant information from stakeholders, and the creation of tools for combatant commanders and stakeholders collaboratively addressing such challenges."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Research the design of social networking-based applications to address seemingly intractable \"super wicked\" problems such as corruption, human trafficking, and genocide.\n-  Develop plans for demonstrating these applications in military stability, security, transition, and reconstruction operations.\n-  Coordinate with PACOM to apply techniques relevant to their theater of operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vanishing Programmable Resources (VAPR)"
                                    },
                                    "Description": {
                                        "val": "The Vanishing Programmable Resources (VAPR) program will create electronic systems capable of physically disappearing (either in whole or in part) in a controlled, triggerable manner.  VAPR will enable a host of previously unrealizable technologies that can be programmed to disappear, are biocompatible, and\/or are physically reconfigurable. Applications include sensors for conventional indoor\/outdoor environments (buildings, transportation, and materiel), environmental monitoring over large areas, and simplified diagnosis, treatment, and health monitoring in the field. The program will develop and establish an initial set of materials and components along with integration and manufacturing capabilities to undergird a fundamentally new class of electronics defined by their performance and transience. These transient electronics ideally should perform in a manner comparable to Commercial Off-The-Shelf (COTS) systems, but with limited device persistence that can be programmed, adjusted in real-time, triggered, and\/or sensitive to the environment.  VAPR will build an initial capability to make transient electronics a deployable technology for the DoD and Nation.  Applied research for the VAPR program is being performed in PE 0602716E, Project ELT-01.\n\nA basis set of transient materials and electronic components with sufficient electronic and transience performance is needed to realize transient electronic systems for environmental sensing and biomedical applications. Research and development of novel materials for implementing basic transient electronic components (i.e. actives and passives), power supply strategies, substrates and encapsulates as well as development of modes and triggers for transience will form the core of fundamental research activities.  Transient components and devices developed in this technical area will form the basis for advanced functional circuit blocks and test systems to be developed in PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "- Begin development of electronic materials that exhibit a useful combination of transience and the necessary physical characteristics required for sufficient electronic performance.\n- Begin development of materials and mechanisms for control of transience effects.\n- Begin development of device modeling tools that incorporate transience effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Cloud"
                                    },
                                    "Description": {
                                        "val": "The Cognitive Cloud program used crowd-sourcing (large-scale, human-centered networks of web-enabled individuals working towards a unified goal) to create solutions for highly complex military problems.  Examples of such problems include intelligence, surveillance and reconnaissance of denied areas; modeling foreign societies, governments, and militaries; debugging large, complex software systems; and real-time understanding of activity patterns indicative of imminent cyber-attack.  A social compiler which views people, computer, and network ensembles as elements of a single architecture and enables crowd sourced developers to write social programs in a high-level language would automatically decompose the task and organize, incentivize, and outsource appropriate aspects to peer production.  The resulting social computing systems could be applied both within the military and across larger communities to achieve capabilities ranging from highly responsive development of tactics, techniques, and procedures to open-source intelligence and strategic communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.654"
                                            },
                                            "Text": {
                                                "val": "-  Developed techniques for generating realistic synthetic social network data using cognitive models of crowd behavior and performed initial data analysis and validation studies.\n-  Held the Shredder Challenge to demonstrate the potential inherent to crowd-sourced approaches to military software development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}