{
    "id": "24c6bb99180d566c1fc4d49ddecb3450f7ae9401",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604709D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Robotics EMD"
        },
        "R1LineItemNumber": {
            "val": "121"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "2.705"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "(U) This Program Element (PE) was established in response to Congressional guidance to consolidate DOD robotic programs on unmanned ground systems and related robotic technologies in order to increase focus of the Services' robotic programs on operational requirements.  Technologies in the PE support the continued development of technologies in Budget Activity 3 and 4 (PEs 0603711D8Z and 0603709D8Z) for technology transitions and transformations and closing war fighter requirement capability gaps. By exercising its oversight role through a technology advisory board, O-6 Council and Senior Steering Group (Flag level), Joint Ground Robotics applies this PE to enable coordination between the Services and places emphasis on interoperability and commonality among unmanned ground systems. This PE supports the effort to overcome technology barriers in thrust areas of unmanned ground system technologies to include Autonomous & Tactical Behaviors, Manipulation Technologies, Collaborative Operations, Interoperability, Man-portable Unmanned Ground System Technologies, and Technology Transition\/Transformation.  The purpose is to further the development and fielding of affordable and effective mobile ground robotic systems, develop and transition technologies necessary to meet evolving user requirements, and serve as a catalyst for insertion of robotic systems and technologies into the force structure.  Through application of funds against the thrust areas of unmanned ground system technologies, this PE supports the integration of technologies into representative models or prototype systems in a high fidelity and realistic operating environment and expedites technology transition from the laboratory to operational use. Emphasis is on proving component and subsystem maturity prior to integration in major and complex systems and may involve risk reduction initiatives. Within this PE, funded efforts will continue the delivery of advanced technology needs directed at enhancing the war fighters' capabilities identified during concept development, operational assessments and field feedback of current unmanned systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.715"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.705"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.010"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.010"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "609"
                    },
                    "ProjectTitle": {
                        "val": "Joint Robotics EMD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.705"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) was established in response to Congressional guidance to consolidate DoD unmanned ground systems and related robotic technologies in order to increase focus of the Services' robotic programs on operational requirements. Technologies in this PE supported the continued development of technologies in Budget Activity 3 and 4 (PEs 0603711D8Z and 0603709D8Z) to fulfill Warfighter requirement capability gaps. By exercising its oversight role through a Technology Advisory Board, O-6 Council and Senior Steering Group (Flag level), the Joint Ground Robotics Enterprise applied this PE to enable coordination between the Services and places emphasis on interoperability and commonality among unmanned ground systems. This PE supported the effort to overcome technology barriers in thrust areas of unmanned ground system technologies to include:  Navigation; Perception; Vision\/Sensors; Manipulation; Command, Communication & Control; Mission\/Platform Specific; Interoperability; and Outreach & Harmonization. The purpose is to further the development and fielding of affordable and effective mobile ground robotic systems, develop and transition technologies necessary to meet evolving user requirements, and serve as a catalyst for insertion of robotic systems and technologies into the force structure. Through application of funds against the thrust areas of unmanned ground system technologies, this PE supported the integration of technologies into representative models or prototype systems in a high fidelity and realistic operating environment and expedites technology transition from the laboratory to operational use. Emphasis is on proving component and subsystem maturity prior to integration in major and complex systems and may involve risk reduction initiatives. Within this PE, funded efforts continue the delivery of advanced technology needs directed at enhancing the Warfighters' capabilities identified during concept development, operational assessments and theater feedback of current unmanned systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Manipulation"
                                    },
                                    "Description": {
                                        "val": "Incorporation of new or existing technologies to enable a greater range of robotic manipulation, support the development of mobile manipulation, and improve manipulator performance. Development of these technologies will enable unmanned systems to conduct highly dexterous tasks that today are accomplished manually, but currently place war fighters in extremely vulnerable and dangerous situations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.315"
                                            },
                                            "Text": {
                                                "val": "1)  Highly Dexterous Manipulators for Explosive Ordnance Disposal Robots\n      -  Development and completed integration of Haptic feedback\n      -  System integration (arm, end effector interface and end effector) and system testing\n      -  Dexterous hardware support\n      -  Make improvements to autonomous system and the OCU based on lessons learned during LTA 1 and LOE 1\n      -  Conduct LTA 2.\n      -  Perform a four week LOE for Marines to assess the net military utility and determine the poetential for deploying for an Extended Evaluation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission\/Platform Specific"
                                    },
                                    "Description": {
                                        "val": "Development of a technology to address the requirements of a particular mission or to be integrated with a specific platform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "1)  Cargo Unmanned Ground Vehicle\n      -  Finalized system build for second MTVR as UGV\n      -  Conducted second Limited User Assessment \n      -  Conducted Limited Objective Experiment for Logistics Mission"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navigation"
                                    },
                                    "Description": {
                                        "val": "Development of reliable motion planning, path planning, obstacle detection\/obstacle avoidance, characterization, and decision analysis capabilities based on the perceived environment and specific missions outlined for the robot."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.407"
                                            },
                                            "Text": {
                                                "val": "1)  Collision Prediction Utilizing Traversability\n      -  Advanced module development and hardware upgraded\n      -  Phase 2 validation and tests concluded\n      -  Technology demonstration and End User Support"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Perception"
                                    },
                                    "Description": {
                                        "val": "Development of post-processing software technologies (proprioceptive and\/or exetroceptive) enhanced unmanned ground vehicle perception capabilities for navigation, manipulation, and general unmanned ground vehicle situational awareness in a wide range of environments and conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.983"
                                            },
                                            "Text": {
                                                "val": "1)  Long Range Obstacle Detection\n      -  Finalized sensor processing algorithm development\n      -  Finalized prototype system development\n      -  Completed system integration onto UGV platform\n      -  Conducted performance verification testing\n      -  Conducted final demonstration \n      -  Compiled\/delivered final report"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603709D8Z"
                                    },
                                    "Title": {
                                        "val": "Joint Robotics Program"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.932"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603711D8Z"
                                    },
                                    "Title": {
                                        "val": "Joint Robotics Program\/Autonomous Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.481"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "1.  Technologies were funded & developed were reviewed by Joint Capability Area focused working groups and the Joint Staff Functional Capabilities Boards to determine progress, transition plans, and relevance of each project. \n2.  Project plans were submitted, evaluated and analyzed by the Joint Robotics Ground Enterprise (JGRE) management and technical staff for risk and progress.\n3.  Project progress toward goals and milestones were assessed during mid-year and end-of-year reviews.\n4.  Technologies developed by the JGRE were tracked and documented using the DOD Technical Readiness Level (TRL) scale for developing TRL 3 or 4 technologies to TRL 6 and adhering to the integrated baselines with regard to cost and schedule."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Joint Robotics Programs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.705"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "3D Visualization for EOD Robots"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Advanced Hydraulic Actuator"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Remote Checkpoint"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Autonomous Navigation for Small UGVs"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Human Presence and Detection"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Cargo UGV"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Man-Portable ISR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Collision Prediction Utilizing Transversability Models for Dynamic Environments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Highly Dexterous Manipulator for EOD Operators"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Long Range Vision for Obstacle Detection"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}