{
    "id": "24fa9f638aeaf643a7294c9d1a5ebc5374a66014",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602308A"
        },
        "ProgramElementTitle": {
            "val": "Advanced Concepts and Simulation"
        },
        "R1LineItemNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.356"
            },
            "CurrentYear": {
                "val": "23.507"
            },
            "BudgetYearOne": {
                "val": "24.063"
            },
            "BudgetYearOneBase": {
                "val": "24.063"
            },
            "BudgetYearTwo": {
                "val": "24.237"
            },
            "BudgetYearThree": {
                "val": "25.956"
            },
            "BudgetYearFour": {
                "val": "25.862"
            },
            "BudgetYearFive": {
                "val": "25.524"
            }
        },
        "ProgramElementNote": {
            "val": "Not applicable for this item."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates and designs enabling technologies to create effective training capabilities for the Warfighter and  supports the underpinning technologies and understanding to establish architecture standards and interfaces necessary for realizing the Army vision of creating a realistic synthetic \"electronic battlefield\" environment for use across the spectrum of doctrine, organization, training, leader development, materiel, personnel, and facilities (DOTLM-PF).  Project C90 focuses on advancing component technologies required for real time interactive linking within and among constructive, virtual, and live simulation and training by refining technologies for advanced distributed interactive simulation.  Project D02  further develops concepts for immersive training and learning environments with the Institute for Creative Technologies (ICT) at the University of Southern California, Los Angeles, California. \n\nWork in this PE complements and is fully coordinated with PE 0601104A (University and Industry Research Centers), PE 0602785A (Manpower\/Personnel\/Training Technology), PE 0602787A (Medical Technology), PE 0603007A (Manpower, Personnel and Training Advance Technology), and PE 0603015A (Next Generation Training & Simulation Systems).   \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n \nWork in this PE is performed by the Army Research Laboratory, Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, FL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.900"
                },
                "CurrentYear": {
                    "val": "23.507"
                },
                "BudgetYearOne": {
                    "val": "24.063"
                },
                "BudgetYearOneBase": {
                    "val": "24.063"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.356"
                },
                "CurrentYear": {
                    "val": "23.507"
                },
                "BudgetYearOne": {
                    "val": "24.063"
                },
                "BudgetYearOneBase": {
                    "val": "24.063"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.544"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.544"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "C90"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Distributed Simulation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.358"
                        },
                        "CurrentYear": {
                            "val": "17.125"
                        },
                        "BudgetYearOne": {
                            "val": "17.566"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.566"
                        },
                        "BudgetYearTwo": {
                            "val": "17.632"
                        },
                        "BudgetYearThree": {
                            "val": "19.239"
                        },
                        "BudgetYearFour": {
                            "val": "19.031"
                        },
                        "BudgetYearFive": {
                            "val": "18.570"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and designs enabling technologies for advancing distributed simulation and training (live, virtual and constructive) environments. This includes networking of models representing complex human behavior, complex data interchange between simulations, synthetic natural environments, medical training simulations, ground platform training, adaptive tutoring for individuals and teams, and collaborative training.  The project researches the ability to create a virtual representation of combined arms environments, with the Warfighter-in-the-loop that constructive (event driven) simulations cannot simulate.  \n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nWork in this PE complements and is fully coordinated with PE 0602785A (Manpower\/Personnel\/Training Technology), PE 0602787A (Medical Technology), PE 0603007A (Manpower, Personnel and Training Advance Technology) and PE 0603015A (Next Generation Training & Simulation Systems).   \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Army Research Laboratory, Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, FL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Live, Virtual, Constructive (LVC) Simulations"
                                    },
                                    "Description": {
                                        "val": "This effort investigates Live, Virtual and Constructive (LVC) training technologies (tools and methods) to inform an interactive, seamless training environment.  Live training refers to personnel and systems performing an exercise mission on real terrain; virtual training refers to personnel using simulators; and constructive training refers to computer based models representing real world behaviors that introduce a wider control of virtual forces. Developed methods and technologies are transitioned to PE 0603015A\/project S29.  In FY13 to FY15, this effort supports Technology Enabled Capability Demonstration 3b, Surprise\/Tactical Iintelligence-Actionable Intelligence.  In FY14, this effort supports Technology Enabled Capability Demonstration 7b, Individual Training for Tactical Tasks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated technologies to create visual and aural battlefield effects; produced a more holistic sensory experience for a live training audience; and completed laboratory experiments of dynamic terrain\/environment shared architecture, physics based algorithms in virtual and constructive simulations, as well as applied high performance computing in preparation for future advance technology demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.533"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate component level technologies to support advanced dynamic synthetic natural environments to include: advanced handheld environments, underground structures and cross domain interactions; matures and demonstrates rapid generation, scaling of appearance and behaviors for realistic, culturally-specific virtual humans able to interact with other virtual humans and trainees within local\/distributed simulations and performs testing and user evaluations of the next generation collaborative training environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.708"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.708"
                                            },
                                            "Text": {
                                                "val": "Will explore technologies and methods to provide Soldiers with an adaptive learning environment, tailored to the individual Soldier. Will conduct assessments of a prototype training development environment that will deliver training content to various software environments on different hardware platforms, including mobile. Will conduct assessments on common processes and technologies for Live, Virtual, and Constructive (LVC) distributed simulation for Joint and Coalition Warfare training to ease the difficulty and expense of using LVC distributed simulation for Joint and Coalition Warfare training. Will design components in laboratory for for real-time, physics- based terrain (Combat Operational Environment-COE) that replicates the operational environment and is distributed to support collective training for use in mobile devices and embedded systems. Will design hybrid pos-nav sensor to simulate electronic bullet to replace laser based system to replicate live fire training that replicates operational environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation Training Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates the effectiveness of military medical simulation training technologies and ground platform training technologies.  The effort also conducts applied research to develop training technologies and techniques for Soldiers operating with unmanned systems.  In FY14, this effort supports TECD 3b, Surprise\/Tactical Intelligence-Actionable Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted human agent teaming research studies to improve collaboration with focus on improving team performance, confidence, multi-tasking and workload with unmanned systems in support of the ARL-Robotics Collaborative Technology Alliance(PE 0601104A, project H09); and investigated game engine and virtual world in terms of improving the human interfaces as well as developed new innovative training environments in accordance with the United States Army Learning Concept for 2015 document."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.165"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess weapon orientation measurement software and hardware for use in future unmanned system demonstrations; conduct applied research and assess realism of live tissue replacement technologies, as well as 3D visualization and enhanced representations of virtual humans to include more robust physiological and anatomical representations for future medical training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.512"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.512"
                                            },
                                            "Text": {
                                                "val": "Will research enabling technologies for medical training combining appropriate fidelity, physiology, movement, and tissue (silicon vs. simulated biological structures), integrated and dissipating smells, sensors, varying pathologies, and fluids using an open source, platform agnostic methodology. Will design hybrid position-navigation sensor to simulate electronic bullet to replace laser based system for live fire training."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative and Immersive Environment Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates adaptive tutoring and immersive learning environments with social simulations to conduct kinetic and non-kinetic training for individuals and teams.  In FY14, this effort supports TECD 7b, Individual Training for Tactical Tasks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.640"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development of infantry immersive simulation and learning environments to include representing multi-party interpersonal interactions and the development of tools, so these simulation and learning environments could be readily created by others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.427"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct assessments to support trainee modeling, classification of trainee state and machine-based selection of instructional strategies; investigate methods for a computer-based intelligent tutor capable of assessing the cognitive state of trainees & adapting instruction to optimize individual and team performance across a variety of Dismounted Soldier training tasks; develop wrap-around immersive environment leveraging commercial technology; conduct world-wide challenge on emerging virtual environment technologies and evaluate critical elements necessary for specific types of virtual training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.346"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.346"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to develop best practices for authoring computer-based tutors (CBTS), managing instruction provided by CBTS, and assessing learning gains (e.g., knowledge and skill acquisition, retention and accelerated learning) provided by CBTS components, tools, and methods. Research will focuses on learner modeling and instructional strategy\/tactics selection by autonomous CBTS to reduce the cost to develop, deliver, and assess self-regulated training\/tutoring for individuals and teams required under the Army Learning Model (ALM) for 2015.  Results of this research will be captured in the Generalized Intelligent Framework for Tutoring (GIFT) to promote standards and reuse. \nWill conduct efficacy studies on virtual world and game based learning techniques for a blended learning approach to kinetic and non-kinetic training as well as human-unmanned systems teaming. Studies will be Institutional. Review Board IRB lead evaluations in the use of science of games and mobile learning in a distributed environment to replicate the complexities of the operational environment for training. Lessons learned insertions will be from the 12-month prototype evaluation to be conducted in FY13 at the Maneuver Center of Excellence, Fort Benning. Experimentation will continue on the difficulties and advantages associated with the human-robotic teaming of unmanned ground systems and Soldiers in collaboration with TARDEC and the ARL Robotics Collaborative Technology Alliance.  Demonstrations and briefings will be provided at the Materials Centers of Excellence Interservice\/Industry Training, Simulation and Education Conference, GameTech, and Human-Robot Interaction Experimentation at Camp Lejuene.  Will conduct the Federal Virtual World Challenge."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D02"
                    },
                    "ProjectTitle": {
                        "val": "Modeling & Simulation For Training And Design"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.998"
                        },
                        "CurrentYear": {
                            "val": "6.382"
                        },
                        "BudgetYearOne": {
                            "val": "6.497"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.497"
                        },
                        "BudgetYearTwo": {
                            "val": "6.605"
                        },
                        "BudgetYearThree": {
                            "val": "6.717"
                        },
                        "BudgetYearFour": {
                            "val": "6.831"
                        },
                        "BudgetYearFive": {
                            "val": "6.954"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This effort transitions basic research into applied research.  This project investigates and designs training applications to enable the Army to train any time and any place.  Efforts include designing virtual humans that embody natural language, speech recognition in noisy environments, gesture, gaze, and conversational speech.  Techniques and methods are assessed for integrating different sensory cues into virtual environments that result in enhanced training and leader development. The project leverages the capabilities of industry and the research and development community through the synthesis of creativity and technology, including work at the Army Research Institute and the Army Research Laboratory. \n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nWork in this PE complements and is fully coordinated with PE 0601104A (University and Industry Research Centers), PE 0602785A (Manpower\/Personnel\/Training Technology), PE 0602787A (Medical Technology), PE 0603007A (Manpower, Personnel and Training Advance Technology), and PE 0603015A (Next Generation Training & Simulation Systems).  Developed technologies and techniques are transitioned for maturation and demonstration to PE 0603015A\/project S28.     \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n \nWork in this project is performed by the Army Research Laboratory, Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, FL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immersive Technology Environments"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research that enables responsive and reconfigurable environments that immerse human senses such as sight, sound, and touch in mixed reality environments to include  physical elements providing touch and feel to simulate objects such as obstacles and walls.  In FY13 to FY15, this effort supports TECD 7b, Individual Training for Tactical Tasks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.935"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed tools that allow others to easily create immersive environments; developed and integrated improved natural language capabilities into the multi-party conversational agent simulation to investigate improved contextual knowledge and understanding of events within the simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.185"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Collaborate with the Army Medical Department (AMEDD) Center and School at Ft. Sam Houston to investigate and evaluate potential application of developed virtual worlds to support the therapy of veterans and active duty Soldiers for (i.e. PTSD).  Examine effectiveness of immersive training on hand-held devices and tablets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.242"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.242"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies to better understand how humans both perceive and interact with virtual environments.  Will develop technologies for: improved low-cost immersive displays to reduce cost of training equipment; enhanced physical locomotion to reduce the physical footprint needed for training facilities; small team training; and improved small unit leadership and capabilities using virtual environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Immersive Technology Techniques"
                                    },
                                    "Description": {
                                        "val": "This effort develops tools, techniques and technologies for improving the immersion of human senses within simulation environments and therefore creating enhanced realism."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.063"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated tools for semi-automatically creating training materials based on rapid assimilation of actual experiences; and conducted analysis of pilot data from a complex negotiation\/bargaining task to develop implementation of emotional behaviors in virtual humans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.197"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Create training toolkits based on assimilation of actual experiences available for Army use; improve data structures and methods (algorithms and software) for integration of scanned facial data into the Virtual Human Architecture for more human like representations and design tools for annotating transcripts with semantic information and speech acts to assist future social cultural training technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.255"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.255"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate computer agents that can track a Soldier's career life long learning experiences to provide both individual training feedback and career guidance.  Will finalize the development of a  tool that automatically detects poorly synthesized segments of speech for the purpose of improving synthesized speech and dialogue for virtual humans. Will finalize and implement model that automatically adapts the dialogue intent recognition to each user."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}