{
    "id": "2a1ef20c85554f452b0c721edee7a595ce74b426",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DTRA_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2014.zzz_unzipped_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601000BR"
        },
        "ProgramElementTitle": {
            "val": "DTRA Basic Research Initiative"
        },
        "R1LineItemNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "46.107"
            },
            "PriorYear": {
                "val": "47.712"
            },
            "CurrentYear": {
                "val": "45.071"
            },
            "BudgetYearOne": {
                "val": "45.837"
            },
            "BudgetYearOneBase": {
                "val": "45.837"
            },
            "BudgetYearTwo": {
                "val": "46.662"
            },
            "BudgetYearThree": {
                "val": "47.502"
            },
            "BudgetYearFour": {
                "val": "48.357"
            },
            "BudgetYearFive": {
                "val": "49.228"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Threat Reduction Agency (DTRA) safeguards America and its allies from Weapons of Mass Destruction (chemical, biological, radiological, nuclear, and high-yield explosives) by providing capabilities to reduce, eliminate, counter the threat, and mitigate its effects.  The Basic Research Initiative program provides for the discovery and development of fundamental knowledge and understanding by research performers drawn primarily from academia and world-class research institutions in government and industry.  This leverages Department of Defense’s $2 billion annual investment in basic research by ensuring a motivation within the scientific community to conduct research benefiting Weapons of Mass Destruction-related defense missions and by improving Agency knowledge of other research efforts of potential benefit to DTRA nonproliferation, counter proliferation and consequence management efforts.  \n\nThese efforts are closely coordinated with the Chem-Bio Technology portfolio, which executes a basic research program under the joint Chem-Bio Defense Program.  Agency research interests are coordinated with those of Defense Advanced Research Projects Agency and Service basic research programs through the Defense Basic Research Advisory Group.  DTRA reviews research interests annually to focus on technology areas not clearly addressed by other basic research efforts.\n\nThe DTRA’s Basic Research Initiative program element supports several National and Department initiatives directly related to countering WMD.  The 2010 QDR directs capability enhancements, including: accelerate the development of standoff radiological\/nuclear detection capabilities; and prevent proliferation and counter weapons of mass destruction with specific initiatives to: 1) Research countermeasures and defenses to non-traditional agents, 2) Enhance nuclear forensics, 3) Secure vulnerable materials, 4) Develop new verification technologies, and 5) Develop an in-depth understanding of the capabilities, values, intent, and decision making of potential adversaries, whether they are individuals, networks, or states.  Basic research supporting all of these needs is included in this program element under projects RU-Fundamental Research for Combating WMD.   Additionally, it supports the National Strategy for Countering Biological Threats priorities.  This strategy spells out four focus areas:  1) Promote global health security efforts through building and improving international capacity to prevent, detect, and respond to infectious disease threats, whether caused by natural, accidental, or deliberate events, 2) Establish and reinforce norms against the misuse of the life sciences, 3) Expand of our capability to prevent, attribute, and apprehend those engaged in biological weapons proliferation or terrorism, with a focus on facilitating data sharing and knowledge discovery to improve integrated capabilities (capability expansion), and 4) Leveraging science, technology, and innovation through domestic and international partnerships and agreements to improve global capacity to respond to and recover from biological incidents (Leveraging Science).   Again all four focus areas are supported in this program element under Project RU-Fundamental Research for Combating WMD.  In the general sense, these efforts are relevant for biologically-based and inspired materials for DoD applications, including passive and\/or remote sensing; and expand- our capability to apprehend those engaged in bio-weapons proliferation and terrorism by supporting basic research on bio-agent neutralization and bio-agent defeat employing combustion or deflagration.  Details are provided in the R-2a exhibits."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "47.737"
                },
                "CurrentYear": {
                    "val": "45.071"
                },
                "BudgetYearOne": {
                    "val": "45.493"
                },
                "BudgetYearOneBase": {
                    "val": "45.493"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "47.712"
                },
                "CurrentYear": {
                    "val": "45.071"
                },
                "BudgetYearOne": {
                    "val": "45.837"
                },
                "BudgetYearOneBase": {
                    "val": "45.837"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.025"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.344"
                },
                "BudgetYearOneBase": {
                    "val": "0.344"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.025"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.344"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.344"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease in FY 2012 from the previous President’s Budget submission in FY 2012 is due to the internal SBIR transfer.   \n\nThe increase in FY 2014 is due to increased investment in Program Element 0601000BR to maintain zero real growth in funding for Basic Research activities per the Defense Planning Guidance."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RU"
                    },
                    "ProjectTitle": {
                        "val": "Fundamental Research for Combating WMD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "46.107"
                        },
                        "PriorYear": {
                            "val": "47.712"
                        },
                        "CurrentYear": {
                            "val": "45.071"
                        },
                        "BudgetYearOne": {
                            "val": "45.837"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.837"
                        },
                        "BudgetYearTwo": {
                            "val": "46.662"
                        },
                        "BudgetYearThree": {
                            "val": "47.502"
                        },
                        "BudgetYearFour": {
                            "val": "48.357"
                        },
                        "BudgetYearFive": {
                            "val": "49.228"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the discovery and development of fundamental knowledge and understanding by research performers drawn primarily from academia and world-class research institutions in government and industry.  This leverages the Department of Defense’s (DoD) $2 billion annual investment in basic research by ensuring a motivation within the scientific community to conduct research benefiting Weapons of Mass Destruction-related defense missions and by improving Agency knowledge of other research efforts of potential benefit to Defense Threat Reduction Agency (DTRA) nonproliferation, counter proliferation and consequence management efforts. \n\nThese efforts are closely coordinated with the Chem-Bio Technology Portfolio, which executes a basic research program under the joint Chem-Bio Defense Program.  Agency research interests are coordinated with those of Defense Advanced Research Projects Agency and Service basic research programs through the Defense Basic Research Advisory Group.  DTRA reviews research interests annually to focus on technology areas not clearly addressed by other basic research efforts.\n\nProject RU (Fundamental Research for Combating WWD) supports several National and Department initiatives directly related to countering WMD.  The 2010 QDR directs capability enhancements, including: accelerate the development of standoff radiological\/nuclear detection capabilities; and prevent proliferation and counter weapons of mass destruction with specific initiatives to: 1) Research countermeasures and defenses to non-traditional agents, 2) Enhance nuclear forensics, 3) Secure vulnerable materials, 4) Develop new verification technologies, and 5) Develop an in-depth understanding of the capabilities, values, intent, and decision making of potential adversaries, whether they are individuals, networks, or states.  Basic research supporting all of these needs is included in this program element under projects RU-Fundamental Research for Combating WMD.   Additionally, this Project supports the National Strategy for Countering Biological Threat priority\/focus area 1) Global Health Security, 2) Life Sciences, 3) Capability Expansion, and 4) Leveraging Science.  The DTRA Basic Research program accomplishes research in the life sciences, which has cross-cutting applicability and thus is relevant to a variety of DoD mission spaces, within and outside of those related to countering biological threats.  In the general sense, these efforts are relevant for biologically-based and inspired materials for DoD applications, including passive and\/or remote sensing; and they expand our capability to apprehend those engaged in bio-weapons proliferation and terrorism by supporting basic research on bio-agent neutralization and bio-agent defeat employing combustion or deflagration.  Finally, this project supports and administers the Cooperative Biological Engagement Program \"Cooperative C-WMD research with global partners program\", for which the core goals are to secure dangerous pathogens, promote open and active disease reporting and response, and advance transparent research to understand pathogens and develop potential countermeasures.\n\nThe decrease from FY 2012 to FY 2013 is predominately due to a reduction in the number of grants awarded and the elimination of dedicated support to transition discoveries to DTRA applied research.\n\nThe increase in FY 2014 is due to increased investment in Fundamental Research to maintain zero real growth in funding per the Defense Planning Guidance for activities related to the discovery and development of fundamental knowledge for the benefit of Counter WMD related defense missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Project RU: Fundamental Research for Combating WMD"
                                    },
                                    "Description": {
                                        "val": "This project provides for the discovery and development of fundamental knowledge and understanding by research performers drawn primarily from academia and world-class research institutions in government and industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.712"
                                            },
                                            "Text": {
                                                "val": "- Managed over 200 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio continued the CWMD grand challenge for the DoD, and was capitalized at approximately 9% of the DTRA research and development investment.\n- Conducted a technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives and to foster collaboration and build relationships within the scientific community.\n- Conducted an external panel review of the basic research program, open to DoD research stakeholders, to assess the focus and scope of the program with respect to the CWMD challenges, and to assess the coordination of CWMD basic research across DoD mission space and across the broader basic research community to avoid unintended duplication and ensure successful partnerships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.071"
                                            },
                                            "Text": {
                                                "val": "- Manage over 160 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio is expected to continue the CWMD grand challenge for the DoD and to be capitalized at approximately 8-10% of the DTRA S&T investment.\n- Support the development of the future Science, Technology, Engineering and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conduct an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives and to foster collaboration and build relationships within the scientific community.\n- Conduct an annual external panel review of the basic research program, which will be open to DoD research stakeholders, to assess the focus and scope of the program with respect to the CWMD challenges, and to assess the coordination of CWMD basic research across DoD mission space and across the broader basic research community to avoid unintended duplication and ensure successful partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "45.837"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "45.837"
                                            },
                                            "Text": {
                                                "val": "- Manage over 200 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio is expected to continue the CWMD grand challenge for the DoD.\n- Support the development of the future Science, Technology, Engineering and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conduct an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives and to foster collaboration and build relationships within the scientific community.\n- Conduct an annual external panel review of the basic research program, which will be open to DoD research stakeholders, to assess the focus and scope of the program with respect to the CWMD challenges, and to assess the coordination of CWMD basic research across DoD mission space and across the broader basic research community to avoid unintended duplication and ensure successful partnerships."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "25\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Technologies"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.931"
                                        },
                                        "CurrentYear": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.516"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.516"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.567"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.549"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.549"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.559"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Procurement methods include in-scope awards through competitive selection through the Defense Threat Reduction Agency Broad Agency Announcement and collaborative funding through other organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance is measured via a combination of statistics including the number of publications generated, number of students trained in sciences and engineering supporting Department of Defense educational goals, number of research organizations participating, and percentage of participating universities on the US News & World Report “Best Colleges” list."
                        }
                    }
                }
            ]
        }
    }
}