{
    "id": "2b6b9b1697e77f1961dddc8df7ab1a62c1c7a206",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603670D8Z"
        },
        "ProgramElementTitle": {
            "val": "Human Social Culture Behavior (HSCB) Modeling Advanced Development"
        },
        "R1LineItemNumber": {
            "val": "46"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "12.153"
            },
            "CurrentYear": {
                "val": "8.235"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Change from FY 2013 to FY 2014 reflects a reallocation of funds from the Office of the Secretary of Defense (OSD) Human Social Culture Behavior (HSCB) Modeling program to higher priority DoD requirements."
        },
        "ProgramElementMissionDescription": {
            "val": "The OSD HSCB Modeling Program is a vertically integrated effort to research, develop, and transition technologies, tools, and systems to programs of record and users in need.  The Program exists to optimize U.S. forces’ ability to perform population-centric sensing, understand behaviors driven by social and cultural variables, and select effective courses of action in the full range of military operations.  Program research will enhance population-centric intelligence, surveillance, and reconnaissance (ISR) capabilities for understanding the increasingly complex global environment to address national strategic challenges such as instability, aggression, proliferation of weapons of mass destruction, and violent extremism.  In three integrated program elements (PEs), the Program will conduct applied research, mature and demonstrate advanced technology, and develop transitionable methods, technology, tools and prototypes.  Work under PE 0603670D8Z is focused on developing and demonstrating general-use, cross-domain tools in two areas: computational modeling; and sociocultural behavior data collection, management, and dissemination.  Research will result in more effective cultural understanding in existing intelligence, influence operations, and operations planning systems; modeling capabilities for forecasting reactions to U.S.\/coalition actions; demonstration of strategic decision making tools that highlight political, religious, cultural, and related factors; tools and technologies enabling more widespread and effective use of sociocultural behavior models in operations and mission rehearsal; and toolsets that can be used as strategic decision making tools to account for sociocultural factors."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.724"
                },
                "CurrentYear": {
                    "val": "8.235"
                },
                "BudgetYearOne": {
                    "val": "8.398"
                },
                "BudgetYearOneBase": {
                    "val": "8.398"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.153"
                },
                "CurrentYear": {
                    "val": "8.235"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.571"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-8.398"
                },
                "BudgetYearOneBase": {
                    "val": "-8.398"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.567"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-8.398"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.398"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.004"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P370"
                    },
                    "ProjectTitle": {
                        "val": "Human Social Culture Behavior (HSCB) Modeling Advanced Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.153"
                        },
                        "CurrentYear": {
                            "val": "8.235"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Change from FY 2013 to FY 2014 reflects a reallocation of funds from the Office of the Secretary of Defense (OSD) Human Social Culture Behavior (HSCB) Modeling program to higher priority DoD requirements."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program is focused on developing and demonstrating general-use, cross-domain tools in two areas: computational modeling; and sociocultural behavior data collection, management, and dissemination.  Research will result in cultural understanding technologies and overlays to support intelligence, influence operations, and operations planning systems; modeling capabilities for forecasting reactions to U.S.\/coalition actions; demonstration of strategic monitoring and decision making tools that account for political, religious, cultural, and related factors; tools and technologies enabling more widespread and effective use of sociocultural behavior models in operations.  The Program will ensure that supported research is clearly tied to warfighters and their needs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modeling Capabilities"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate computational models to support sensing and forecasting of non-US populations, including their reactions to U.S.\/coalition informational, military, economic, or political actions.  The Program has emphasized development of tools to support forecasting of instability.  In addition to refining and extending those tools, the Program is researching and developing comparable models and tools for analysis and forecasting of other events of interest.  Work in this area also includes modeling to support analysis of alternative courses of action (COA).  This is a challenging objective that requires research, development and integration of constituent technologies. Integrate and demonstrate decision making support tools useful within programs of record and operational user analysis, planning and execution systems for political, religious, cultural and other factors.  Support specific operational planning tasks for selected government partners via limited technical demonstration in user settings.  In addition, working with operational partners HSCB Program models will be tested in realistic environments by representative users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.851"
                                            },
                                            "Text": {
                                                "val": "Developed and validated software to detect national-level changes in sociocultural characteristics that have been linked to an environment hospitable to violent extremism.  Expanded number of countries covered for medium-range, one to six months, modeling of instability and extended capabilities of Integrated Crisis Early Warning System (ICEWS) Trend Recognition and Assessment of Current Events (ITRACE), and Integrated Crisis Early Warning System (ICEWS) Forecasting (ICAST), components of Worldwide Integrated Crisis Early Warning System (W-ICEWS). Developed forecast models for five events of interest covering 167 countries and all Combatant Command areas of responsibility.  Incorporated Office of the Director, National Intelligence (ODNI) Open Source Center data.  Transitioned information and analysis capability to acquisition category 1 (ACAT 1) program of record."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.435"
                                            },
                                            "Text": {
                                                "val": "Complete development of and extend and assess system for providing advance sensing of national and sub-national scale crisis, by testing the added forecast value of social media events.  Refine the granularity of Spectrum software to detect national-level changes in sociocultural characteristics that have been linked to an environment hospitable to violent extremism; test and extend capability to additional countries\/regions.  Complete development of tools for exploring impacts of alternative COA on leading national security challenges, including violent extremism, instability, and use of weapons of mass destruction.  Complete development of methods, techniques, standards and tools that support model selection and verification and validation. Validate forecasting models for providing support to “what if” analyses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Visualization Software Toolsets"
                                    },
                                    "Description": {
                                        "val": "Demonstrate first generation decision-making tools that include sociocultural behavior factors.  These tools are required to account for political, religious, cultural, and other factors as well as to vertically integrate cultural information into a military operational environment.  Common, generalized, strategic to tactical, tools for visualization of Diplomatic, Information, Military and Economic (DIME) COA, and Political Military Economic Social Information Infrastructure (PMESII) effects on the battlefield, or during Security, Stability, Transition and Reconstruction phases do not exist. This Program will focus on providing visualization capabilities that support a richer understanding of sociocultural data in concert with other warfighter data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.570"
                                            },
                                            "Text": {
                                                "val": "As part of W-ICEWS, developed methods for visualizing national-level data bearing on instability as well as middle-term, one to six months, forecasts of instability across 167 countries. Improved methods and tools for managing the most challenging visualization issues, including sparse data sets, highly volatile underlying data, and inherent complexity of sociocultural behavior dynamics.  Demonstrated techniques for visualizing patterns of community formation and evolution of both friendly and adversarial groups.  Marine Corps Civil Information Management (MARCIM) project provided visualization of CIM data in context with base maps and overlays of relevant imagery and internet data feeds."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training\/Mission Rehearsal Systems"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate methods and procedures for integrating cultural information into military operations.  Focus on methods and resources that will increase flexibility to rapidly deliver just-in-time training for new regions of interest and emerging mission areas, e.g., transition and reconstruction.  Develop resources and tools to support integration of sociocultural behavior models with existing training systems, and to train personnel at tactical, operational, and strategic levels in the appropriate and effective use of those models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Completed cognitive task analysis and framework for computer-based training application that promotes mission-centric, cross-cultural competence through development of a Marine’s cognitive skills and ensure acceptance of the application by the user community.  When complete, system will provide 100 percent improvement in trainees’ abilities to identify and apply sociocultural factors to the Military Decision Making Process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sociocultural Data Collection and Management"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate tools for improved collection of sociocultural behavior data for multiple operational echelons.  Develop and demonstrate tools to support ingest of unstructured data and structuring of data for use in computational modeling for intelligence analysis, operations analysis, and decision support.  Specifically address emerging media and other open source data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.532"
                                            },
                                            "Text": {
                                                "val": "MARCIM project provided Civil Military Operations teams with actionable knowledge of the operational environment through mobile computing technologies, semantic information and knowledge management, and geospatial decision support capabilities.  Developed new techniques for collecting and structuring data necessary for detection and tracking of violent extremism and instability.  Researched techniques and technologies for reliable exploitation of crowd-sourced information."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "Complete development of and extend and assess system for providing advance sensing of national and sub-national scale crisis, by incorporating classified data and non-English language sources.  Complete development of and test software for reliable exploitation of crowd-sourced information.  Complete development of and demonstrate methods for collecting and analyzing HSCB-relevant data in denied areas, using readily available commercial imagery.  Complete development of and demonstrate improved performance of tools and methods for harvesting data at scale from open source media."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0602670D8Z BA 2"
                                    },
                                    "Title": {
                                        "val": "HSCB Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.602"
                                        },
                                        "CurrentYear": {
                                            "val": "6.771"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0604670D8Z BA 4"
                                    },
                                    "Title": {
                                        "val": "HSCB Research & Engineering"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.252"
                                        },
                                        "CurrentYear": {
                                            "val": "5.131"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}