{
    "id": "2c979af793efefc778e94373aa6c98df46e35e94",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602716A"
        },
        "ProgramElementTitle": {
            "val": "HUMAN FACTORS ENGINEERING TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.540"
            },
            "CurrentYear": {
                "val": "19.872"
            },
            "BudgetYearOne": {
                "val": "21.339"
            },
            "BudgetYearOneBase": {
                "val": "21.339"
            },
            "BudgetYearTwo": {
                "val": "20.988"
            },
            "BudgetYearThree": {
                "val": "20.912"
            },
            "BudgetYearFour": {
                "val": "21.081"
            },
            "BudgetYearFive": {
                "val": "21.460"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) conducts applied research on aspects of human factors engineering that impact the capabilities of individual and teams of Soldiers operating in complex, dynamic environments.  The results of the research will enable maximizing the effectiveness of Soldiers and their equipment for mission success.  The aspects of human factors that will be studied include sensing, perceptual and cognitive processes, ergonomics, biomechanics and the tools and methodologies required to manage interaction within these areas and within the Soldiers' combat environment.  Project H70 research is focused on decision-making; human robotic interaction; crew station design; improving Soldier performance under stressful conditions such as time pressure, information overload, information uncertainty, fatigue, on-the-move and geographic dispersion; and enhancing human performance modeling tools.   \n\nWork in this project complements and is fully coordinated with PE 0602601A (Combat Vehicle and Automotive Advanced Technology), PE 0602786A (Warfighter Technology), PE 0602120A (Sensors and Electronic Survivability), PE 0602784A (Military Engineering Technology), PE 0602783A (Computer and Software Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0602785 (Manpower\/Personnel\/Training Technology), PE 0603005A (Combat Vehicle and Automotive Technology), PE 0603710A (Night Vision Advanced Technology), PE 0603015A (Next Generation Training and Simulation), and PE 0603007A (Manpower, Personnel, and Training Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy..\n\nWork in this project is performed by the Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.767"
                },
                "CurrentYear": {
                    "val": "19.872"
                },
                "BudgetYearOne": {
                    "val": "21.339"
                },
                "BudgetYearOneBase": {
                    "val": "21.339"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.540"
                },
                "CurrentYear": {
                    "val": "19.872"
                },
                "BudgetYearOne": {
                    "val": "21.339"
                },
                "BudgetYearOneBase": {
                    "val": "21.339"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.227"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.227"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H70"
                    },
                    "ProjectTitle": {
                        "val": "HUMAN FACT ENG SYS DEV"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.540"
                        },
                        "CurrentYear": {
                            "val": "19.872"
                        },
                        "BudgetYearOne": {
                            "val": "21.339"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.339"
                        },
                        "BudgetYearTwo": {
                            "val": "20.988"
                        },
                        "BudgetYearThree": {
                            "val": "20.912"
                        },
                        "BudgetYearFour": {
                            "val": "21.081"
                        },
                        "BudgetYearFive": {
                            "val": "21.460"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on human factors to maximize the effectiveness of Soldiers in concert with their equipment.  The resulting data are the basis for weapon systems and equipment design standards, guidelines, handbooks, and Soldier training as well as manpower requirements to improve equipment operation and maintenance.  Application of this research will yield reduced workload, fewer errors, enhanced Soldier protection, user acceptance, and allows the Soldier to extract the maximum performance from the equipment.  \n\nMajor efforts research sources of stress, potential stress moderators, intervention methods and identifies and quantifies human performance measures and methods to address current and future warrior performance issues.  Individual efforts exploit adaptive learning methods and strategies, enhance and validate human performance modeling tools; investigate integration of advanced concepts in crew stations designs, optimizes interfaces for information systems and improves human robot interaction (HRI) in a full mission context.\n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nWork in this project complements and is fully coordinated with PE 0602601A (Combat Vehicle and Automotive Advanced Technology), PE 0602786A (Warfighter Technology), PE 0602120A (Sensors and Electronic Survivability), PE 0602784A (Military Engineering Technology), PE 0602783A (Computer and Software Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0602785 (Manpower\/Personnel\/Training Technology), PE 0603005A (Combat Vehicle and Automotive Technology), PE 0603710A (Night Vision Advanced Technology), PE 0603015A (Next Generation Training and Simulation), and PE 0603007A (Manpower, Personnel, and Training Advanced Technology).  Results of these efforts are transitioned to the Research, Development, and Engineering Centers, the Program Executive Offices (PEO) & Program Managers, U.S. Army Training and Doctrine Command (TRADOC), U.S. Army Medical Command (MEDCOM), Manpower and Personnel Integration (MANPRINT) G1, U.S. Army Test and Evaluation Command (ATEC), etc.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research Laboratory (ARL), Aberdeen, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interfaces for Collaboration and Decision Making (previously titled Adaptive Learning Methods and Strategies)"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY14, the title of this effort is renamed from Adaptive Learning Methods and Strategies to Interfaces for Collaboration and Decision Making to more accurately reflect the nature of the project.  This effort identifies areas where innovative training methods can be used to reduce mismatches between Soldier performance and technological capabilities as well as identifies adaptive learning tools and assessment measures which have the potential to improve decision quality for leaders and teams."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated Soldier-organization-information modeling in laboratory and field research; further matured and validated tools and methods developed to train, improve, assess information sharing, decision making as well as collaboration in network-enabled operations that support decision making."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.308"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to focus efforts on the data rich environment of C2 planning and execution; enhance FY12 methods\/tools by investigating mission context data aggregation and alert capabilities; investigate and design user personalization alternatives and techniques for decision-specific queries, summarization, and extraction; refine human-in-the-loop evaluation methods and establish initial evaluation criteria for human decision making and collaboration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.359"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.359"
                                            },
                                            "Text": {
                                                "val": "Will concentrate on influencing network-enabled operations at the Company\nlevel; assess mission command work\/information flow, network knowledge requirements, cognitive workload, situation awareness, and unit performance; develop and validate a cognitive work analysis\/computational model of the Company Intelligence Support Team and its relationship to Company planning, execution and Commander's decision-making; assess networked handheld decision support tools; continue development and validation of key models (Social Network Analysis, C3TRACE, and Chemical Warfare Agents) of the evolving mission command work domain; support Mission Command Battle Lab network simulation exercises."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Performance Modeling"
                                    },
                                    "Description": {
                                        "val": "Enhance human performance modeling tools to reduce workload and human errors and increase user acceptance of developing technologies allowing the Soldier to extract the maximum performance from the equipment.  Collect and analyze empirical data on human perception (vision and hearing) to support human and system performance models used for equipment design and training.  Efforts are coordinated with PE 0602786\/Project H98."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.473"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated empirical data on the effects of Soldier load on physical and cognitive performance to enhance models; created and distributed a protected web-based repository of human performance models used in Manpower and Personnel Integration (MANPRINT) analyses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.490"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess a theory-based decision quality metric for the Command, Control, and Communications module for future evaluations of decision effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.531"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.531"
                                            },
                                            "Text": {
                                                "val": "Will collect and analyze empirical data on human perception (vision and hearing) to support human and system performance models used for equipment design and training; continue to investigate the effects of physical and cognitive stress on Soldier performance, and transition results to Soldier performance MODELS; will investigate Soldier load physical and cognitive algorithms developed in FY13 and their application to the human performance models;examine human performance as a function of cognitive stress, weapon system dynamics, load distribution, etc."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Interfaces for Vehicle and Mobility Systems (previously titled Vehicle Mobility Systems)"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY14, this effort is renamed from Vehicle Mobility Systems to Interfaces for Vehicle and Mobility Systems to more accurately reflect the nature of the project.  Investigate intelligent, indirect-vision-based vehicle mobility; advanced crew stations; 360\/90 degree situational awareness systems; crew and dismount scalable interfaces; and neurophysiologically as well as behavior-based technologies. Implement guidelines for: sensor and data handling; algorithms for characterizing Soldier brain activity in operational contexts; real-time techniques to integrate neurally-based information into systems designs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed and extended cognitive state modeling and simulation efforts to enhance operational relevance of experimental scenarios and real-time, state-based technologies for improving Soldier-system performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.808"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Utilize cognitive state modeling and simulation efforts to enhance Soldier-system performance by investigating cognitive state and performance levels using emerging brain-computer neuro-technologies for future applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.669"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.669"
                                            },
                                            "Text": {
                                                "val": "Will develop mitigation techniques for enhancing Soldier-system performance that can be triggered by on-line brain-computer neuro-technologies that predict deficits in Soldier cognitive state and performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Soldier Performance (previously title Improved Man-Machine Interfaces)"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY14, this effort is renamed from Improved Man Machine Interfaces to Dismounted Soldier Performance  (The new title more accurately reflects the nature of the project.)  Investigate equipment design standards and human performance measures and create guidelines for maneuver team information systems solutions that improve situational understanding and decision cycle time; identify, mature, and quantify human performance limitationsto address future warrior performance issues.  In FY13-14, this effort supports Technology Enabled Capability Demonstration 1.b, Force Protection – Soldier\/Small Unit [Human Factors for Dismounted Operations]."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Examined effects and impact of rifle and optic remedies for shooting performance decrements associated with full facial protection; conducted research and analysis on the effects of Soldier Load on Soldier physical and cognitive performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.889"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Examine measures and methods to assess the effects and impact of recoil and recoil mitigation devices on Soldier shooting performance; conduct applied research and analysis on the effects of physical and cognitive loads on Soldier performance for step-wise improvements in equipment design that will contribute incementally to lightening the Soldier load."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.360"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.360"
                                            },
                                            "Text": {
                                                "val": "Will conduct applied research and analysis on the effects of physical and cognitive loads on Soldier performance for step-wise improvements in equipment design that will contribute incrementally to lightening the Soldier load. Will continue to characterize effects of weapon recoil on shooting performance by refining multivariate techniques\/analyses regarding marksmanship performance. Transition results to Army Marksmanship Unit."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human-Robot Interaction (HRI)"
                                    },
                                    "Description": {
                                        "val": "Design requirements and technologies for supervision and Soldier intervention for multiple semi-autonomous unmanned vehicles (UVs) in urban and unstructured environments.  In FY13-14, this effort will support Technology Enabled Capability Demonstration 2.a., Overburdened – Physical Burden (Distributed Soldier Load Through Robotics)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported evaluation of soldier monitoring crew station design as well as developed experimental designs and supported final capstone field experiments to evaluate local situational awareness, operator aids and interfaces, assisted mobility, and soldier monitoring technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support FY13 capstone field assessments by designing experiments to measure and assess local situational awareness for assisted mobility and Soldier monitoring technologies; conduct modeling and simulation studies to examine manned-unmanned teaming concepts to create measures and methods for assessing current and future technology capabilities needed to provide manned-unmanned teaming capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.188"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.188"
                                            },
                                            "Text": {
                                                "val": "Will continue to focus on human-robot interaction by examining such issues as Soldier-robot interaction modes, communication, situation awareness, trust and transparency in coordination with the ARL Autonomous Systems Enterprise partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding Socio-cultural Influence"
                                    },
                                    "Description": {
                                        "val": "Investigate and model cognitive aspects of socio-cultural influences on Soldier\/Commander decision making and communication to enhance Soldier performance with systems, within teams and in the mission context. This work is complementary to and coordinated with PE 62784\/T41 Socio-Cultural Modeling and PE 62785\/790 Leader Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.817"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to develop cognitive framework and models depicting influence of socio-cultural factors on Soldier\/Commander decision making and communication."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess the potential impact to Soldier\/Commander decision making and communication by using the FY12 developed cognitive framework and begin validation and verification of models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.232"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.232"
                                            },
                                            "Text": {
                                                "val": "Will develop proof of concept decision support tools that effectively present relevant socio-cultural information to the Soldier\/Commander to enhance Soldier\/Commander decision making in diverse environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Incorporating MANPRINT Considerations Early in the Acquisition Process"
                                    },
                                    "Description": {
                                        "val": "Develop system-relevant human performance and human-system interaction requirements for inclusion early in acquisition to ensure that human-system capabilities and limitations are properly reflected and that their associated cost, benefits, and risks are considered during analysis of alternatives when making trade-offs among effectiveness, suitability, and life-cycle costs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop methodologies (e.g., predictive, modeling-based methods and methods to harvest human system integration lessons learned from current system acquisition programs) to incorporate MANPRINT considerations in the system acquisition process pre-Milestone A and B.  Apply promising methodologies to test case scenarios for selected acquisition programs.  Develop measures to assess the return on investment (ROI) for applying chosen methodologies earlier in the acquisition process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will apply promising methodologies to test case scenarios for selected acquisition programs; calculate the return on investment (ROI) realized by incorporating MANPRINT considerations early in the acquisition process."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}