{
    "id": "2fc9d7dbf06c4df6397f91119cb7166cbba6eb6d",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604165D8Z"
        },
        "ProgramElementTitle": {
            "val": "Prompt Global Strike Capability Development"
        },
        "R1LineItemNumber": {
            "val": "119"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "475.070"
            },
            "PriorYear": {
                "val": "174.077"
            },
            "CurrentYear": {
                "val": "110.383"
            },
            "BudgetYearOne": {
                "val": "65.440"
            },
            "BudgetYearOneBase": {
                "val": "65.440"
            },
            "BudgetYearTwo": {
                "val": "82.590"
            },
            "BudgetYearThree": {
                "val": "92.004"
            },
            "BudgetYearFour": {
                "val": "209.846"
            },
            "BudgetYearFive": {
                "val": "225.248"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The level of resourcing for the Prompt Global Strike Capability Development program reflects iterative reductions from efficiencies and budget reductions, which reduces the Department's ability to develop flexible responsive solutions to emerging war fighter needs.  This Program Element (PE) was established to develop and demonstrate technologies and applications that advance conventional prompt global strike (CPGS) warfighting capabilities. The program uses a national team with coordination between the Services, Agencies and national research laboratories to pursue integrated portfolio objectives leading to the acquisition and operation of a CPGS system.  This program funds the design, development, and experimentation of boosters, payload delivery vehicles (PDVs), non-nuclear warheads, guidance systems, and mission planning and enabling capabilities. Program timing will be driven by the outcome of flight test events and DoD budgets.  To support these development activities, the program procures modeling and simulation capabilities, command and control interfaces, test range support, and launch system infrastructure.  Additionally, expert resources address strategic policy and treaty issues. Program emphasis is on demonstrating component and subsystem technology maturity with risk reduction initiatives.  In FY 2013 and FY 2014, funding for the individual service initiatives has and will be contingent upon their abilities to execute and achieve satisfactory progress towards project goals as determined by the CPGS portfolio manager."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "174.830"
                },
                "CurrentYear": {
                    "val": "110.383"
                },
                "BudgetYearOne": {
                    "val": "138.701"
                },
                "BudgetYearOneBase": {
                    "val": "138.701"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "174.077"
                },
                "CurrentYear": {
                    "val": "110.383"
                },
                "BudgetYearOne": {
                    "val": "65.440"
                },
                "BudgetYearOneBase": {
                    "val": "65.440"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.753"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-73.261"
                },
                "BudgetYearOneBase": {
                    "val": "-73.261"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.753"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.261"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.261"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Realignment due to defense priorities"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-66.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-66.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rephased to out-years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-5.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Other Adjustments- Reduction of -$2.261 is part of the Department of Defense reform agenda, a zero-based review of the organization, to align resources to the most critical priorities and eliminate lower priority functions.\n\nRealignment of -$66.000 is due to Defense Priorities - Reduction per Department of Defense priorities to focus on Research and Development of intermediate range concepts.\n\nRephased To Out Years - Funding was reduced in FY14 based on other program requirements and rephased to FY15 and FY16."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P164"
                    },
                    "ProjectTitle": {
                        "val": "Hypersonic Glide Experiment and Concepts Demonstration Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "280.140"
                        },
                        "PriorYear": {
                            "val": "61.830"
                        },
                        "CurrentYear": {
                            "val": "10.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.000"
                        },
                        "BudgetYearThree": {
                            "val": "2.000"
                        },
                        "BudgetYearFour": {
                            "val": "2.000"
                        },
                        "BudgetYearFive": {
                            "val": "2.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) was established to develop and demonstrate technologies and applications that advance conventional prompt global strike (CPGS) warfighting capabilities. The program uses a national team with coordination between the Services, Agencies and national research laboratories to pursue integrated portfolio objectives leading to the acquisition and operation of a CPGS system.  This program funds the design, development, and experimentation of boosters, payload delivery vehicles (PDVs), non-nuclear warheads, guidance systems, and mission planning and enabling capabilities. Program timing will be driven by the outcome of flight test events and DoD budgets.  To support these development activities, the program procures modeling and simulation capabilities, command and control interfaces, test range support, and launch system infrastructure.  Additionally, expert resources address strategic policy and treaty issues. Program emphasis is on demonstrating component and subsystem technology maturity with risk reduction initiatives.  In FY 2013 and FY 2014, funding for the individual service initiatives has and will be contingent upon their abilities to execute and achieve satisfactory progress towards project goals as determined by the CPGS portfolio manager."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hypersonic Glide Experiments and Concept Demonstration Development\/Support"
                                    },
                                    "Description": {
                                        "val": "This sub-project develops technologies and applications that could lead to a system with the following characteristics: effects on targets in a very short-period of time from execution order; non-ballistic flight over the majority of the flight path; positive control from launch to impact; adequate cross-range\/ maneuverability to avoid overflight issues; controlled stage drop over Broad Ocean Area (BOA), and  provides for in-flight target updates.  The technologies developed will have cross-service and cross-concept applicability and will be developed through close coordination among DoD components. This activity will support both ground and flight tests, and provide all national data to the competitive acquisition program.\n\nThe objectives of this sub-project are to: \n- Assess boost-glide technologies in light of ground and flight test events and associated modeling and simulation.\n-Analyze the military utility of multiple, 3-axis stabilized vehicles performance with respect to thermal protection materials, aerodynamics and control surfaces, navigation, guidance, control (NG&C), boosters and weapons performance.\n-Assess the feasibility of producing an affordable solution to fill the CPGS capability gap.\n-Continue systems definition\/engineering\/development of integrated weaponized payload delivery vehicles and subsystems in order to identify and reduce risks and mature technologies for a global range competitive acquisition program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "61.830"
                                            },
                                            "Text": {
                                                "val": "- Prepared Air Force service inputs and support OSD lead CPGS Materiel Development Decision (MDD) milestone\n- Restructured program from a weaponized PDV demonstration to a risk reduction\/technology maturation\/test campaign program\n- Completed the manufacturing and accept delivery of PDV aeroshells for KEP arena and sled tests, complete planning, build and conduct KEP arena and sled tests to characterize weapon performance\n- Conducted KEP arena and sled pre and post tests analysis \n- Collaborated with national CPGS team to plan, develop and perform subsystems ground and subscale flight tests for evaluation and analysis of military utility\n- Conducted system engineering studies to characterize effectiveness of updated weapons concepts, vehicles survivability against foreign systems and flight paths to optimized vehicles and boosters performance \n- Continued to lead national team in risk reduction and technology maturation efforts for CPGS non-nuclear KEP, Penetrator and other warhead concepts \n- Continued modification of launch test pad for future flight tests\n- Conducted post flight test reviews and data analysis, and validate if significant risk reduction was achieved utilizing updated aerodynamic, guidance, and control modeling\n- Prepared and conducted the segment and System delta PDR to the AF CSM demonstration.\n- Disseminated post flights and ground tests data\/analysis to CPGS national community, including the Army AHW program office, DARPA HTV program office, Navy SSP, and OSD\/SW DWA Manager.\n- Completed the manufacture and accept delivery of aeroshells for KEP sled tests, complete build and conduct KEP sled tests\n- Supported aero and thermal ground facility tests and future Flight Demo designs.\n- Completed Engineering Review Board (ERB) HTV-2 flight 2 anomaly investigation and developed approaches for remediation.  The remediation efforts will culminate in the Integrated Hypersonics (IH) baseline flight test, which will provide critical data that is only available from full-scale flight testing to refine models and data sets gained from ground tests needed for the design of next-generation hypersonic vehicles.\n- Completed planning for IH program.  The goal of the IH program is to develop, mature, and test next- generation technologies needed for global-range, maneuverable, hypersonic flight at Mach 20 and above for missions ranging from space access to survivable, time-critical transport to conventional prompt global strike."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "- Conduct trade studies to evaluate system alternatives, affordability, end-to-end system concepts that will study a weaponized integrated system complete with system architecture and industrial manufacturing readiness.  \n- Continue risk reduction and technology maturation efforts through ground tests to improve modeling and simulation capabilities and technology readiness to subsystems.\n- Develop Technology Development Strategy and System Engineering documentation incorporating CPGS community data, trade studies and on-going risk reduction\/technology development efforts.\n- Complete KEP sled test analysis and disseminate test data\/analysis to CPGS community.\n-   Conduct KEP sled test, including fabrication of warhead, surrogate aeroshell, knife blade assembly, and sled assembly.  Conduct post-test analysis and model validation.\n- Implement improvements in highly coupled hypersonic toolsets incorporating assessed uncertainties of key technologies from recent CPGS testing activities.\n- Refine hypersonic boost glide knowledge base and designs through enhanced developmental testing in the areas of aerodynamics, aerothermodynamics, guidance, navigation, and control, instrumentation, vehicle recovery, and propulsion.\n- Improve high temperature materials base for hypersonic flight and re-entry vehicles applications through improved manufacturing, modeling, and ground based testing.\n-  Improve flight test range asset coordination including options for large scale space based telemetry collection.\n-  Analyze alternative launch systems for enhanced long range hypersonic flight.\n-  Refine flight test regime for next generation long range hypersonic boost glide technology demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "- Complete enhanced developmental testing in the areas of aerodynamics, aerothermodynamics, guidance, navigation, and control, instrumentation, vehicle recovery, and propulsion. \n- Conduct planning of flight tests in coordination with other Services to validate knowledge base garnered from enhanced developmental testing.\n- Complete trade studies to evaluate system alternatives, affordability, end-to-end system concepts and industrial manufacturing readiness.\n- Continue risk reduction and technology maturation efforts through ground tests to improve modeling and simulation capabilities and technology readiness to subsystems.\n- Complete Technology Development Strategy and System Engineering documentations incorporating CPGS community data, trade studies and on-going risk reduction\/technology development efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Hypersonic Glide Experiments and Concept Demonstration Development\/Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPACE AND MISSILE CENTER"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "LOS ANGELES, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "280.140"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "61.830"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "USAF Kep Sled Test 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "USAF Kep Sled Test 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "All Services Ground Tests"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P166"
                    },
                    "ProjectTitle": {
                        "val": "Alternate Re-Entry System\/Warhead Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "122.486"
                        },
                        "PriorYear": {
                            "val": "91.000"
                        },
                        "CurrentYear": {
                            "val": "92.000"
                        },
                        "BudgetYearOne": {
                            "val": "55.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "55.000"
                        },
                        "BudgetYearTwo": {
                            "val": "70.000"
                        },
                        "BudgetYearThree": {
                            "val": "84.000"
                        },
                        "BudgetYearFour": {
                            "val": "201.000"
                        },
                        "BudgetYearFive": {
                            "val": "217.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) was established to develop and demonstrate technologies and applications that advance conventional prompt global strike (CPGS) warfighting capabilities. The program uses a national team with coordination between the Services, Agencies and national research laboratories to pursue integrated portfolio objectives leading to the acquisition and operation of a CPGS system.  This program funds the design, development, and experimentation of boosters, payload delivery vehicles (PDVs), non-nuclear warheads, guidance systems, and mission planning and enabling capabilities. Program timing will be driven by the outcome of flight test events and DoD budgets.  To support these development activities, the program procures modeling and simulation capabilities, command and control interfaces, test range support, and launch system infrastructure.  Additionally, expert resources address strategic policy and treaty issues. Program emphasis is on demonstrating component and subsystem technology maturity with risk reduction initiatives.  In FY 2013 and FY 2014, funding for the individual service initiatives has and will be contingent upon their abilities to execute and achieve satisfactory progress towards project goals as determined by the CPGS portfolio manager."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Alternative Re-Entry System\/Warhead Engineering and Delivery Vehicle Options\/Development"
                                    },
                                    "Description": {
                                        "val": "This sub-project will test and evaluate alternative booster and delivery vehicle options and will assess the feasibility of producing an affordable alternate solution to fill the CPGS capability gap.  It will mature technologies that could lead to advanced systems with the following characteristics: effects on targets in a very short-period of time from execution order; non-ballistic flight over the majority of the flight path; positive control from launch to impact; adequate cross-range\/maneuverability to avoid over flight issues; and controlled stage drop over BOA.  The technologies developed will have cross-service and cross-concept applicability and will be developed through close coordination among DoD components.  This activity will support both ground and flight tests, and provide all national data to the competitive acquisition program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "91.000"
                                            },
                                            "Text": {
                                                "val": "- Completed Flight Test 1A meeting all Flight Test objectives including first time demonstration of a boost glide hypersonic system at a CPGS relevant range; first successful use of an advanced carbon-carbon thermal protection system for an intermediate range hypersonic flight.\n- Completed mission data reporting and analysis from Advanced Hypersonic Weapon (AHW) Flight Test 1A; documented predicted boost and glide performance, actual performance, range and collection activities, remaining uncertainties, and application of data to modeling for full range of design capabilities\/missions.  Hosted a post-test Engineering workshop to brief and disseminate post Flight Test 1A test data\/analysis to CPGS national community and Defense-Wide Account Manager. \n- Performed ground testing of possible Thermal Protection System (TPS) materials and glide vehicle configurations; assessed TPS materials and Material Manufacturing Demonstrations to support selected materials.\n- Developed and implemented improvements to Flight Test 1A dynamic inversion autopilot.\n- Developed an alternate Hypersonic Glide Body configuration with direct applicability to the intermediate and\/or long range mission. \n- Developed and coordinated major milestones for the next flight test, Flight Test 2.\n- Supported initial range planning activities for Flight Test 2."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "92.000"
                                            },
                                            "Text": {
                                                "val": "- Conduct System Requirements Review for Flight Test 2 and relevance for all CPGS concepts. \n- Conduct Integrated Baseline Review and Integrated Master Schedule development for Flight Test 2.\n- Conduct Preliminary and Critical Design Reviews in preparation for Flight Test 2.\n- Complete design, manufacturing, and testing of components; conduct preliminary bench top integration.\n- Participate in the analysis of FY 2012 ground tests and their application to CPGS modeling advancements.\n- Initiate work associated with PDV items at risk, in accordance with previous tests.\n- Mature Flight Control Systems and electronics to be made available to all acquisition program competitors.\n- Expand systems engineering parameters for performance and cost assessments for all concepts.\n- Exercise Command, Control, and Communications processes with proven NG&C components to perform hardware-in-the-loop parallel simulation of Navy CPGS system using AHW Flight 2 as surrogate."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "55.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "55.000"
                                            },
                                            "Text": {
                                                "val": "- Complete manufacturing and testing of Hypersonic Glide Body and Booster to be used in Flight Test 2.\n- Conduct pre-shipment and pre-launch reviews.\n- Deploy to range, conduct pre-launch testing and training, and execute Flight Test 2.\n- Begin Flight Test Data analysis and distribution to the CPGS community for use across projects.\n- Continue ground testing and development of advanced thermal protection materials and concepts.\n- Expand systems engineering."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Alternative Reentry System\/Warhead Engineering and Delivery Vehicle Options\/Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPACE AND MISSILE DEFENSE CENTER\/ NAVY STRATEGIC SYSTEMS PROGRAM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "HUNTSVILLE, AL\/ WASHINGTON DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "122.486"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "91.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "92.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "55.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "55.000"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Army AHW Flight Test 1A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "All Services Ground Tests"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Army AHW Flight Test 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Navy SSP CPS Variant Flight Test 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P167"
                    },
                    "ProjectTitle": {
                        "val": "Test Range Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "50.446"
                        },
                        "PriorYear": {
                            "val": "12.000"
                        },
                        "CurrentYear": {
                            "val": "5.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.000"
                        },
                        "BudgetYearThree": {
                            "val": "3.000"
                        },
                        "BudgetYearFour": {
                            "val": "3.000"
                        },
                        "BudgetYearFive": {
                            "val": "3.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) was established to develop and demonstrate technologies and applications that advance conventional prompt global strike (CPGS) warfighting capabilities. The program uses a national team with coordination between the Services, Agencies and national research laboratories to pursue integrated portfolio objectives leading to the acquisition and operation of a CPGS system.  This program funds the design, development, and experimentation of boosters, payload delivery vehicles (PDVs), non-nuclear warheads, guidance systems, and mission planning and enabling capabilities. Program timing will be driven by the outcome of flight test events and DoD budgets.  To support these development activities, the program procures modeling and simulation capabilities, command and control interfaces, test range support, and launch system infrastructure.  Additionally, expert resources address strategic policy and treaty issues. Program emphasis is on demonstrating component and subsystem technology maturity with risk reduction initiatives.  In FY 2013 and FY 2014, funding for the individual service initiatives has and will be contingent upon their abilities to execute and achieve satisfactory progress towards project goals as determined by the CPGS portfolio manager."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Test Range Development"
                                    },
                                    "Description": {
                                        "val": "This sub-project will complete design, assembly and delivery of power\/telemetry subsystems; assemble and integrate components to check command\/control and verify range safety functions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "- Completed design, assembly and delivery of selected sensors, power\/telemetry subsystems; assemble and integrate components to check command\/control and verify range safety functions in support of Flight Test 1-A. \n- Performed range assets to support technology demonstrations, including ships and aircraft to receive in-flight telemetry data transmitted by the PDV."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "- Improve telemetry collection and infrastructure in prep for DOTE\/IOTE testing of contractor developed system concepts.\n- Assist test range infrastructure for long term use"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "- Improve telemetry collection and infrastructure in prep for DOTE\/IOTE testing of contractor developed system concepts.\n- Assist test range infrastructure for long term use,\n-Collaboration with Missile Defense, Ballistic Missile, and Space programs for test range capability modernization."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Range Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPACE AND MISSILE CENTER"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "LOS ANGELES, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "50.446"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "12.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P168"
                    },
                    "ProjectTitle": {
                        "val": "OSD CPGS Studies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "21.998"
                        },
                        "PriorYear": {
                            "val": "9.247"
                        },
                        "CurrentYear": {
                            "val": "3.383"
                        },
                        "BudgetYearOne": {
                            "val": "3.440"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.440"
                        },
                        "BudgetYearTwo": {
                            "val": "3.590"
                        },
                        "BudgetYearThree": {
                            "val": "3.004"
                        },
                        "BudgetYearFour": {
                            "val": "3.846"
                        },
                        "BudgetYearFive": {
                            "val": "3.248"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) was established to develop and demonstrate technologies and applications that advance conventional prompt global strike (CPGS) warfighting capabilities. The program uses a national team with coordination between the Services, Agencies and national research laboratories to pursue integrated portfolio objectives leading to the acquisition and operation of a CPGS system.  This program funds the design, development, and experimentation of boosters, payload delivery vehicles (PDVs), non-nuclear warheads, guidance systems, and mission planning and enabling capabilities. Program timing will be driven by the outcome of flight test events and DoD budgets.  To support these development activities, the program procures modeling and simulation capabilities, command and control interfaces, test range support, and launch system infrastructure.  Additionally, expert resources address strategic policy and treaty issues. Program emphasis is on demonstrating component and subsystem technology maturity with risk reduction initiatives.  In FY 2013 and FY 2014, funding for the individual service initiatives has and will be contingent upon their abilities to execute and achieve satisfactory progress towards project goals as determined by the CPGS portfolio manager."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "OSD CPGS Studies"
                                    },
                                    "Description": {
                                        "val": "This sub-project supports emergent CPGS study efforts.  In addition, it also supports application of the Prompt Global Strike Analysis of Alternatives results, requirements development, CPGS basing alternatives, analysis and defining of mission enabling technologies, and measures to avoid conventional missile launch ambiguity.  Finally, it supports administrative activities associated with the management and execution of this PE."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.247"
                                            },
                                            "Text": {
                                                "val": "- Performed end-to-end modeling & simulation of CPGS concepts (including alternate CONUS and Sea-Based options) and design of acquisition program strategy (and post acquisition activities). \n- Completed the study of strategic policy compliance to include CPGS basing alternatives and measures to avoid misinterpretation of intent; policy compliance, and operational requirements validation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.383"
                                            },
                                            "Text": {
                                                "val": "- Command and control overlay study in parallel with AHW Flight-2 \n- Conduct CPGS concept assessment of alternative technologies and associated costs\n- Booster system integration studies\n- Warhead fusing studies\n- Continue thermal modeling"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.440"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.440"
                                            },
                                            "Text": {
                                                "val": "- Booster system integration studies\n- Warhead fusing studies\n- Continue thermal modeling"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "OSD CPGS Studies"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OFFICE OF THE SECRETARY OF DEFENSE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "WASHINGTON, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "21.998"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.247"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.383"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.440"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.440"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}