{
    "id": "302b28ab68fb58ec367f877f74a6fd300ef2db72",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604940D8Z"
        },
        "ProgramElementTitle": {
            "val": "Central Test and Evaluation Investment Program (CTEIP)"
        },
        "R1LineItemNumber": {
            "val": "137"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "156.249"
            },
            "CurrentYear": {
                "val": "144.109"
            },
            "BudgetYearOne": {
                "val": "240.213"
            },
            "BudgetYearOneBase": {
                "val": "240.213"
            },
            "BudgetYearTwo": {
                "val": "256.141"
            },
            "BudgetYearThree": {
                "val": "241.813"
            },
            "BudgetYearFour": {
                "val": "209.550"
            },
            "BudgetYearFive": {
                "val": "180.311"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Since its inception in FY 1990, this program element has been used to fund the development of critically needed, high priority Test and Evaluation (T&E) capabilities for joint\/multi-Service requirements.  The Central Test and Evaluation Investment Program (CTEIP) uses a corporate investment approach to combine Service, Defense, and other government agencies T&E needs, maximize opportunities for joint efforts, and avoid unwarranted duplication of test capabilities.  CTEIP focuses investments on projects that will have high productivity returns on investment.  Projects under the CTEIP Program Element (PE) support two basic tasks: investments to improve the test capabilities base (Joint Improvement and Modernization (JIM) projects) and development of near-term solutions to test capability shortfalls in support of ongoing operational test programs (Resource Enhancement Project (REP)).\nJIM projects address critically needed T&E investments in the major functional areas of: air combat; armament and munitions; Command, Control Communication, Computer and Intelligence (C4I) and networks; common range instrumentation; electronic combat; land combat; sea combat; space combat; threat simulators; and test environments.  Examples of project subject matter include: highly accurate time-space-position information, network enhanced telemetry, miniaturized flight safety systems, realistic urban test environments, ground testing for manned and unmanned aerial platforms and satellites, and end-to-end testing of infrared countermeasure and electronic warfare systems.  CTEIP continues as the focal point for fostering common architectures throughout the test and training communities to enhance the sharing of resources and links between test and training ranges.\nCTEIP has provided special focus to institutionalize the use of modeling and simulation (M&S) as a practical test tool; to link ranges through internetting to enhance inter-range and inter-Service cooperation and resource sharing; and, to ensure development and acquisition of common instrumentation necessary for a more efficient test infrastructure.\nAnalyses of alternative solutions are conducted for each investment project to validate T&E requirements, to define integrated support systems, and to determine overall cost effectiveness of the proposed test investments.  The use of Department of Defense (DoD)-wide processes for requirement validation, prioritization, and risk assessment ensures an effective test resource investment program.\n\nThe REP funds development of near-term solutions for critical ongoing operational tests supporting decisions on major, high priority defense acquisition programs.  These unanticipated operational test (OT) capability requirements arise from several sources such as a new threat system identified during OT planning, acquisition of foreign military assets that are critical in determining weapon system operational effectiveness, short timelines between system design maturity and scheduled OT, and emerging technologies and test requirements resulting from operational concept changes mandated by Congress or Director, Operational Test & Evaluation (DOT&E), or system-of-systems testing.  Funding these activities under the CTEIP provides the opportunity to coordinate and integrate these near-term test requirements with the total DoD test and evaluation investment planning, and ensures their availability and legacy for other programs that may have similar testing requirements.\nThis Research Category 6.4 PE includes special studies, analyses, and strategic planning related to test capabilities and infrastructure, and supports the development and application of proven technologies to provide major test and evaluation capabilities required to meet DoD component weapon system test requirements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "156.297"
                },
                "CurrentYear": {
                    "val": "144.109"
                },
                "BudgetYearOne": {
                    "val": "140.097"
                },
                "BudgetYearOneBase": {
                    "val": "140.097"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "156.249"
                },
                "CurrentYear": {
                    "val": "144.109"
                },
                "BudgetYearOne": {
                    "val": "240.213"
                },
                "BudgetYearOneBase": {
                    "val": "240.213"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.048"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "100.116"
                },
                "BudgetYearOneBase": {
                    "val": "100.116"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.048"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Efficiency Savings: Realignment of Test Capability Development with Requirements"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.284"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.284"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Program Adj: Electronic Warfare Test Capability"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "102.400"
                                },
                                "BudgetYearOneBase": {
                                    "val": "102.400"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "•  Efficiency Savings:  Fiscal Guidance of baseline program adjusted to realign funds for higher priorities within DOD.\n•  Electronic Warfare Test Capability:  Test infrastructure upgrades required for testing next generations of Electronic Warfare Systems."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "940"
                    },
                    "ProjectTitle": {
                        "val": "Central Test and Evaluation Investment Program (CTEIP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "156.249"
                        },
                        "CurrentYear": {
                            "val": "144.109"
                        },
                        "BudgetYearOne": {
                            "val": "240.213"
                        },
                        "BudgetYearOneBase": {
                            "val": "240.213"
                        },
                        "BudgetYearTwo": {
                            "val": "256.141"
                        },
                        "BudgetYearThree": {
                            "val": "241.813"
                        },
                        "BudgetYearFour": {
                            "val": "209.550"
                        },
                        "BudgetYearFive": {
                            "val": "180.311"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Since its inception in FY 1990, this program element has been used to fund the development of critically needed, high priority Test and Evaluation (T&E) capabilities for joint\/multi-Service requirements.  The Central Test and Evaluation Investment Program (CTEIP) uses a corporate investment approach to combine Service, Defense, and other government agencies T&E needs, maximize opportunities for joint efforts, and avoid unwarranted duplication of test capabilities.  CTEIP focuses investments on projects that will have high productivity returns on investment.  Projects under the CTEIP Program Element (PE) support two basic tasks: investments to improve the test capabilities base (Joint Improvement and Modernization (JIM) projects) and development of near-term solutions to test capability shortfalls in support of ongoing operational test programs (Resource Enhancement Project (REP)).\n\n    The JIM funds critically needed T&E investments in the major functional areas of: air combat; armament and munitions; Command, Control Communication, Computer and Intelligence (C4I) and networks; common range instrumentation; electronic combat; land combat; sea combat; space combat; target systems; and test environments.  Examples of project subject matter include: highly accurate time-space-position information, network enhanced telemetry, miniaturized flight safety systems, realistic urban test environments, ground testing for hypersonic systems and satellites, and end-to-end testing of infrared countermeasure systems.  CTEIP continues as the focal point for fostering common architectures throughout the test and training communities to enhance the sharing of resources and links between test and training ranges.\n\n   CTEIP has provided special focus to institutionalize the use of modeling and simulation (M&S) as a practical test tool; to link ranges through internetting to enhance inter-range and inter-Service cooperation and resource sharing; and, to ensure development and acquisition of common instrumentation necessary for a more efficient test infrastructure.\n\n   Analyses of alternative solutions are conducted for each investment project to validate T&E requirements, to define integrated support systems, and to determine overall cost effectiveness of the proposed test investments.  The use of Department of Defense (DoD)-wide criteria for requirement validation, prioritization, and risk assessment ensures an effective test resource investment program.\nThe REP funds development of near-term solutions for critical ongoing operational tests supporting decisions on major, high priority defense acquisition programs.  These unanticipated operational test (OT) capability requirements arise from several sources such as a new threat system identified during OT planning, acquisition of foreign military assets that are critical in determining weapon system operational effectiveness, short timelines between system design maturity and scheduled OT, and emerging technologies and test requirements resulting from operational concept changes mandated by Congress or Director, Operational Test & Evaluation (DOT&E), or system-of-systems testing.  Funding these activities under the CTEIP provides the opportunity to coordinate and integrate these near-term test requirements with the total DoD test and evaluation investment planning, and ensures their availability and legacy for other programs that may have similar testing requirements.\n\n   This Research Category 6.4 PE includes special studies, analyses, and strategic planning related to test capabilities and infrastructure, and supports the development and application of proven technologies to provide major test and evaluation capabilities required to meet DoD component weapon system test requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Central Test and Evaluation Investment Program"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "156.249"
                                            },
                                            "Text": {
                                                "val": "JIM Projects:\n-  Completed requirements development and planning, and initiated concept development and preliminary design of a Joint Urban Test Capability to provide urban environment test capabilities.\n-  Completed requirements development and planning, and concept development and preliminary design, and initiated system development of the Joint Unmanned Aerial Systems (UAS) Mission Environment project to develop a capability for testing UAS in simulated system of systems environments.\n-  Completed requirements development and planning, and concept development and preliminary design, and initiated system development for the Next Generation Electronic Warfare Environment Generator Build A project to provide a multiple jammer characterization system for dynamic stimulation and measurement of multiple jamming and radar signals.\n-  Completed requirements development and planning and initiated concept development and preliminary design for the Next Generation Electronic Warfare Environment Generator Build B project to provide electronic warfare simulation capabilities for testing future Electronic Attack and Electronic Support Measures systems.\n-  Completed an analysis of the benefits of developing test capabilities for Autonomous Systems.\n-  Completed an analysis of tri-service signals library needs to support development of a controlled density open air environment for testing of C4ISR systems.\n-  Continued requirements, development, and planning for the Multi-Level Secure (MLS) Joint\/Coalition Network Environment project to develop a standardized, DoD multi-level secure and cross-domain data management T&E network architecture.\n-  Continued systems development of the Advanced Radar Environment Simulator, under the Joint Installed Systems Test Facility Product Improvements project, to provide improved installed systems capabilities needed to support next generation aircraft testing.\n-  Continued concept development and preliminary design of the Subminiature Flight Safety System project to provide a subminiature, low-cost flight termination system with time-space-position information and data link capabilities.\n-  Continued concept development and preliminary design for the Integrated Network Enhanced Telemetry project Block I capability to develop a network-enhanced aeronautical telemetry capability for T&E ranges and facilities. \n-  Continued system development for the Missile Warning System and Flares segment of the Joint Distributed Infrared Countermeasures (IRCM) Ground Test System project to provide an end-to-end ground test system enabling complete testing of IRCM systems. \n-  Continued systems development of the Joint C4ISR Interoperability Test and Evaluation Capability project to develop a capability to test increasingly complex multi-discipline data fusion concepts. Continued development of Spiral 3 capability by integrating the principal protocols of the Joint Intelligence Networks and the Net Ready Key Performance Parameter (KPP).\n-  Continued system development for the Objective Helicopter Icing Spray System project to provide an enhanced capability to perform in-flight icing and rain testing for low-speed air vehicles.\n-  Continued system development for the Space Threat Assessment Testbed project to provide a capability to conduct subsystem and system level combined natural and man-made space environmental effects ground testing of critical space assets.\n-  Continued systems development for the Common Range Integrated Instrumentation System project to develop a common range instrumentation system to address next generation range data requirements.\n-  Continued threat system simulator development efforts to improve integration, reduce potential duplication, and ensure that accurate, cost-effective representations of threat systems were available to support testing.\n-  Continued requirements development and planning for the Advanced Range Tracking and Imaging System project to provide an integrated next generation suite of optical tracking mounts needed to increase performance, reduce costs, and effectively deliver secure reliable optical throughput.\n-  Initiated the Next Generation Range Control and Data Distribution project to enhance and modernize range control and data distribution systems at the Pacific Missile Range Facility (PMRF).\n\nResource Enhancement Project:\n-  Completed design and development, and began Defense Threat Reduction Activity certification testing, of the MILSATCOM Atmospheric Scintillation Simulator project.\n-  Completed the delivery of the Lightweight Alternative Power Source project.\n-  Completed the delivery of the Distributed Timing Instrumentation Environment project.\n-  Continued system fabrication and began testing of the Multi-Spectral Sea and Land Target Simulator project. \n-  Continued the development of the Threat Model Assessment Program of Operational Test and Evaluation project.\n-  Continued optical component design of the J-31 Radar Missile Gun System project. \n-  Continued development of the Ground Mounted Seeker Simulator project to provide additional missile seekers to the Missile on the Mountain facility. \n-  Continued development of Force on Force Real Time Casualty Assessment Test Instrumentation II (FOF-TI II) to provide force-on-force evaluations of the Lightweight Armored Vehicle Anti-Tank Modernization program.\n-  Continued development of Precision Target Signatures-Reflective Performance Mover (PTS-RPM) to develop low cost, radar cross section representative, movable targets.\n-  Continued development of Hostile Fire Indicator Site (HFIS) to enhance existing Hostile Fire Indicator test site with key upgrades to fully facilitate HFI testing of warning systems.\n-  Initiated development of Mobile Flight Mission Simulator (mFMS) Advanced Electronic Attack (AEA) to provide realistic electronic attack capabilities into PATRIOT Flight Mission Simulators.\n-  Initiated development of C2 and Urban Background Environment Simulator (CUBES) to incorporate modern signal processer advances for Installed System Test Facility communications jamming purposes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "144.109"
                                            },
                                            "Text": {
                                                "val": "JIM Projects:\n-  Complete systems development of the Joint C4ISR Interoperability Test and Evaluation Capability project to develop a capability to test increasingly complex multi-discipline data fusion concepts. Complete development of Spiral 3 capability by integrating the principal protocols of the Joint Intelligence Networks and the Net Ready Key Performance Parameter (KPP).\n-  Complete systems development of the Advanced Radar Environment Simulator, under the Joint Installed Systems Test Facility Product Improvements project, to provide improved installed systems capabilities needed to support next generation aircraft testing.\n-  Complete system development for the Space Threat Assessment Testbed project to provide a capability to conduct subsystem and system level combined natural and man-made space environmental effects ground testing of critical space assets.\n-  Complete concept development and preliminary design and initiate systems development for the Multi-Level Secure (MLS) Joint\/Coalition Network Environment project to develop a standardized, DoD multi-level secure and cross-domain data management T&E network architecture.\n-  Complete concept development and preliminary design and initiate systems development for the Next Generation Electronic Warfare Environment Generator Build B project to provide electronic warfare simulation capabilities for testing future Electronic Attack and Electronic Support Measures systems.\n-  Complete concept development and preliminary design and initiate system development for the Integrated Network Enhanced Telemetry project Block I capability to develop a network-enhanced aeronautical telemetry capability for T&E ranges and facilities.\n-  Complete requirements development and planning and initiate concept development and preliminary design for the Advanced Range Tracking and Imaging System project to provide an integrated next generation suite of optical tracking mounts needed to increase performance, reduce costs, and effectively deliver secure reliable optical throughput.\n-  Continue concept development and preliminary design of a Joint Urban Test Capability to provide urban environment test capabilities.\n-  Continue systems development of the Joint Unmanned Aerial Systems (UAS) Mission Environment project to develop a capability for testing UAS in simulated system of systems environments.\n-  Continue system development for the Next Generation Electronic Warfare Environment Generator Build A project to provide a multiple jammer characterization system for dynamic stimulation and measurement of multiple jamming and radar signals.\n-  Continue system development for the Objective Helicopter Icing Spray System project to provide an enhanced capability to perform in-flight icing and rain testing for low-speed air vehicles.\n-  Continue systems development for the Common Range Integrated Instrumentation System project to develop a common range instrumentation system to address next generation range data requirements.\n-  Continue threat system simulator development efforts to improve integration, reduce potential duplication, and ensure that accurate, cost-effective representations of threat systems are available to support testing.\n-  Continue system development for the Missile Warning System and Flares segment of the Joint Distributed Infrared Countermeasures (IRCM) Ground Test System project to provide an end-to-end ground test system enabling complete testing of IRCM systems.\n-  Continue the Next Generation Range Control and Data Distribution project to enhance and modernize range control and data distribution systems at the Pacific Missile Range Facility (PMRF).\n-  Initiate systems development of the Subminiature Flight Safety System project to provide a subminiature, low-cost flight termination system with time-space-position information and data link capabilities.\n-  Initiate the Synthetic Battlefield Emitter Systems project to provide a controlled density open air environment for testing of C4ISR systems.\n-  Initiate the C-130 Based Telemetry Instrumentation System project to provide expanded capability and capacity telemetry support for aircraft and missile defense testing in inter-range and broad ocean area test scenarios.\n\n\nResource Enhancement Project:\n-  Complete development of the Multispectral Sea and Land Target Simulator (MSALTS) project.\n-  Complete development of Precision Target Signatures-Reflective Performance Mover (PTS-RPM) to develop low cost, radar cross section representative, movable targets.\n-  Complete development of Force on Force Real Time Casualty Assessment Test Instrumentation II (FOF-TI II) to provide force-on-force evaluations of the Lightweight Armored Vehicle Anti-Tank Modernization program.\n-  Complete delivery of the MILSATCOM Atmospheric Scintillation Simulator project.\n-  Complete delivery of the Threat Model Assessment Program of Operational Test and Evaluation project.\n-  Complete optical component design of the J-31 Radar Missile Gun System project. \n-  Complete development of the Ground Mounted Seeker Simulator project to provide additional missile seekers to the Missile on the Mountain facility. \n-  Continue development of Hostile Fire Indicator Site (HFIS) to enhance existing Hostile Fire Indicator test site with key upgrades to fully facilitate HFI testing of warning systems.\n-  Continue development of C2 and Urban Background Environment Simulator (CUBES) to incorporate modern signal processer advances for Installed System Test Facility communications jamming purposes.\n-  Continue development of Mobile Flight Mission Simulator (mFMS) Advanced Electronic Attack (AEA) to provide realistic electronic attack capabilities into PATRIOT Flight Mission Simulators.\n-  Initiate and complete development of Direct Injection Plate System (DIPS) to provide Installed System Test Facility with direct RF injection plates for F-35 variants.  \n-  Initiate development of DIADS Weapons Control (DWC) to develop new Integrated Air Defense (IADS)weapons control algorithms in the Digital IADS (DIADS) used in the F-35 Virtual Simulator (VSIM).\n-  Initiate development of Torpedo Operational Testing Using Modeling and Simulation (TOTUMS) to enhance torpedo OT&E by upgrading an HWIL simulator and environment simulator for high-fidelity, OT-ready realism.\n-  Initiate development of Boosted Zombie Target (BZT) to develop multi-stage, economical targets for PAC-3 by integrating a GFE booster to blue \"Zombie\" maneuvering target."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "240.213"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "240.213"
                                            },
                                            "Text": {
                                                "val": "JIM Projects:\n-  Complete system development for the Next Generation Electronic Warfare Environment Generator Build a project to provide a multiple jammer characterization system for dynamic stimulation and measurement of multiple jamming and radar signals.\n-  Complete concept development and preliminary design and initiate systems development for the Advanced Range Tracking and Imaging System project to provide an integrated next generation suite of optical tracking mounts needed to increase performance, reduce costs, and effectively deliver secure reliable optical throughput.\n-  Complete system development for the Missile Warning System and Flares segment of the Joint Distributed Infrared Countermeasures (IRCM) Ground Test System project to provide an end-to-end ground test system enabling complete testing of IRCM systems.\n-  Continue concept development and preliminary design of a Joint Urban Test Capability to provide urban environment test capabilities.\n-  Continue systems development for the Multi-Level Secure (MLS) Joint\/Coalition Network Environment project to develop a standardized, DoD multi-level secure and cross-domain data management T&E network architecture.\n-  Continue systems development of the Joint Unmanned Aerial Systems (UAS) Mission Environment project to develop a capability for testing UAS in simulated system of systems environments.\n-  Continue systems development for the Next Generation Electronic Warfare Environment Generator Build B project to provide electronic warfare simulation capabilities for testing future Electronic Attack and Electronic Support Measures systems.\n-  Continue systems development of the Subminiature Flight Safety System project to provide a subminiature, low-cost flight termination system with time-space-position information and data link capabilities.\n-  Continue system development for the Objective Helicopter Icing Spray System project to provide an enhanced capability to perform in-flight icing and rain testing for low-speed air vehicles.\n-  Continue systems development for the Common Range Integrated Instrumentation System project to develop a common range instrumentation system to address next generation range data requirements.\n-  Continue systems development for the Integrated Network Enhanced Telemetry project Block I capability to develop a network-enhanced aeronautical telemetry capability for T&E ranges and facilities. \n-  Continue threat system simulator development efforts to improve integration, reduce potential duplication, and ensure that accurate, cost-effective representations of threat systems are available to support testing.\n-  Continue the C-130 Based Telemetry Instrumentation System project to provide expanded capability and capacity telemetry support for aircraft and missile defense testing in inter-range and broad ocean area test scenarios.\n-  Continue the Synthetic Battlefield Emitter Systems project to provide a controlled density open air environment for testing of C4ISR systems.\n-  Continue the Vertical Electromagnetic Pulse (EMP) and High Power Microwave (HPM) Test Sources project to provide vertical high-altitude EMP and HPM external electromagnetic environments for testing in accordance with applicable Military Standards.\n-  Continue the Next Generation Range Control and Data Distribution project to enhance and modernize range control and data distribution systems at the Pacific Missile Range Facility (PMRF).\n-  Initiate the Vertical Electromagnetic Pulse (EMP) and High Power Microwave (HPM) Test Sources project to provide vertical high-altitude EMP and HPM external electromagnetic environments for testing in accordance with applicable Military Standards.\n-  Initiate the Network Centric Weapon (NCW) T&E Environment project to provide an enhanced capability to test and evaluate NCW in a distributed simulation environment.\n-  Initiate the Cyber Test Analysis and Simulation Environment project to enhance current Information Assurance \/ Cyber testing and analysis capabilities and modeling and simulations tools for testing against increasingly robust Cyber threats.\n-  Initiate development of improved electronic warfare test capabilities for fielding at Installed Systems Test Facilities, threat simulation facilities, and open air test ranges to address critical shortfalls in developmental and operational testing of F-35 and other high performance aircraft against advanced threats.\n\nResource Enhancement Project:\n-  Complete development of Hostile Fire Indicator Site (HFIS) to enhance existing Hostile Fire Indicator test site with key upgrades to fully facilitate HFI testing of warning systems.\n-  Complete development of Mobile Flight Mission Simulator (mFMS) Advanced Electronic Attack (AEA) to provide realistic electronic attack capabilities into PATRIOT Flight Mission Simulators.\n-  Complete development of DIADS Weapons Control (DWC) to develop new Integrated Air Defense (IADS) weapons control algorithms in the Digital IADS (DIADS) used in the F-35 Virtual Simulator (VSIM).\n-  Continue development of C2 and Urban Background Environment Simulator (CUBES) to incorporate modern signal processer advances for Installed System Test Facility communications jamming purposes.\n-  Complete development of Torpedo Operational Testing Using Modeling and Simulation (TOTUMS) to enhance torpedo OT&E by upgrading an HWIL simulator and environment simulator for high-fidelity, OT-ready realism.\n-  Continue development of Boosted Zombie Target (BZT) to develop multi-stage, economical targets for PAC-3 by integrating a GFE booster to blue \"Zombie\" maneuvering target.\n-  Initiate development of instrumented facilities to evaluate our next generation of sensors, weapons, platforms, and C4ISR systems in a realistic urban environment.\n-  Initiate development of hardware simulators to test missile warning systems of new generation electronic warfare (EW) suites in a dynamic environment.\n-  Initiate the development of non-intrusive instrumentation to address near term OT capability shortfalls to evaluate advanced sensor system performance in harsh environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "A portion of CTEIP projects that were developed and delivered to the DoD test community over the past five years."
                        }
                    }
                }
            ]
        }
    }
}