{
    "id": "333078319e36b33a03de849fd847417adbe36a63",
    "meta": {
        "filename": "dod-2014_RDTE_2014_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2014.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604828J"
        },
        "ProgramElementTitle": {
            "val": "Joint FIRES Integration and Interoperability Team"
        },
        "R1LineItemNumber": {
            "val": "110"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "7.364"
            },
            "BudgetYearOne": {
                "val": "7.506"
            },
            "BudgetYearOneBase": {
                "val": "7.506"
            },
            "BudgetYearTwo": {
                "val": "7.661"
            },
            "BudgetYearThree": {
                "val": "7.799"
            },
            "BudgetYearFour": {
                "val": "7.944"
            },
            "BudgetYearFive": {
                "val": "8.055"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Deployable Analysis Team (JDAT) mission is to conduct field analysis in an operationally relevant environment of current and emergent Command and Control (C2) information systems and associated procedures to measure capabilities and limitations and to identify shortfalls and root causes producing decision-quality data and cogent solutions to customers and stakeholders to improve Joint C2 integration and interoperability.\n\nThe JDAT is a compact cell of unique Subject Matter Experts and analysts adding value to much larger Service investments in force elements delivering kinetic and non kinetic effects. Services, Joint, and Combatant Commanders and their Staffs proactively seek JDAT advice and assistance to improve the execution of combat fires applied in complex coalition and joint environments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "7.364"
                },
                "BudgetYearOne": {
                    "val": "7.506"
                },
                "BudgetYearOneBase": {
                    "val": "7.506"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "7.364"
                },
                "BudgetYearOne": {
                    "val": "7.506"
                },
                "BudgetYearOneBase": {
                    "val": "7.506"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "SummaryExplanation": {
                "val": "."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P857"
                    },
                    "ProjectTitle": {
                        "val": "Joint Deployable Analysis Team"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "7.364"
                        },
                        "BudgetYearOne": {
                            "val": "7.506"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.506"
                        },
                        "BudgetYearTwo": {
                            "val": "7.661"
                        },
                        "BudgetYearThree": {
                            "val": "7.799"
                        },
                        "BudgetYearFour": {
                            "val": "7.944"
                        },
                        "BudgetYearFive": {
                            "val": "8.055"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Deployable Analysis Team (JDAT) mission is to employ scientific methods to research, investigate, test, assess, and evaluate current and emergent Joint command and control (C2) information systems and associated procedures.  These activities measure capabilities and limitations, identify shortfalls and root cause, recommend and verify solutions, and validate joint capabilities.  The resulting empirical outcomes influence Joint Capability development in areas such as Policy; Joint Doctrine; Tactics, Techniques and Procedures; integration of capabilities; and digital interoperability.  JDAT provides decision-quality data and cogent solutions to customers and stakeholders responsible for improving Joint C2 information systems integration and interoperability to inform acquisition decisions and ensure that Services and Agencies field interdependent and interoperable systems.\n\nThe emphasis of JDAT assessment efforts is the evaluation of C2 Information Systems and Procedures to provide Services and Agencies findings and recommendations based on quantifiable data in order to improve Joint C2 integration and interoperability. JDAT collects and analyzes data and provides observations, findings, conclusions, and recommendations to identify policy, Joint doctrine, tactics, techniques, and procedures (TTP); and material solutions and products that promote capability improvement.  Evaluations range from small, single-focus events to large, multi-event\/venue exercises."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Deployable Analysis Team (JDAT) - Command and Control (C2) Information Systems and Procedures Capability Assessments"
                                    },
                                    "Description": {
                                        "val": "JDAT conducts assessments in conjunction with Service and Combatant Command (CCMD) exercises, experiments, and test and evaluation events. \n\nThe primary outputs and efficiencies include:\n- Improvement in the Services’ ability to employ Joint C2 information systems\n- Recommendations for C2 system integration and interoperability\n- Ability to define appropriate Joint context during system acquisition or development\n- Updates\/revisions to C2 related Chairman Joint Chief Staff (CJCS) Instructions and Manuals\n- Development of related Universal Joint Tasks (UJT) and Additional Task Detail (ATD)\n- Updates and revisions to doctrine, TTP, and Joint publications\n- Development\/refinement of analytical tools (i.e. Data Collection Architecture for Analytical Feedback (DCAAF), Track Event Reconstruction Application (TERA), Joint Windows-based Warfare Assessment Model (JWinWAM))\n- Recommended solutions integrated within the Joint Requirements Oversight Council (JROC) Joint Capabilities Integration and Development System (JCIDS) \n- Identification of specific Key Performance Parameters (KPPs) and Key System Attributes (KSAs) for new systems that meet Joint warfighter operational requirements to ensure Services and Agencies field interdependent and interoperable systems\n- Increased effectiveness\/confidence in combat identification processes and a reduction in fratricide\n- Increased effectiveness and confidence in C2 information systems and associated procedures"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.364"
                                            },
                                            "Text": {
                                                "val": "- Provide analytical support to a Military Utility Assessment of coalition and U.S. C2 information systems and procedures at Bold Quest 13.  Provide instrumentation, data collection, data capture, real-time mission monitoring, and feedback to participants via daily debriefings.  Benefits will include improved ability to assess various participating coalition and U.S. systems, improved joint task execution, and an effective Military Utility Assessment of U.S. C2 information systems while greatly reducing the timeline required to provide fact-based recommendations.\n\n- Assist Commander, Operational Test and Evaluation Force (COMOPTEVFOR) with Identification Friend or Foe (IFF) Mode 5 Level 1 Joint Operational Test Approach (JOTA) analysis to validate integration and interoperability of fielded systems.  Develop data collection and analysis methodologies, design and implement data collection architectures and conduct analysis requisite to meet JOTA objectives.  Determine any gaps or shortfalls in integration and interoperability of Mode 5 systems. Provide Service Operational Test Agencies and Program Managers with fact-based findings.\n\n- Provide analytical support to assess technology integration and interoperability during JIAMDO Joint Tactical Air Picture assessment event.  Provide data collection, analysis and display using JDAT developed tools.  Benefits will include improvements in a Joint Common Operational Picture to battlespace managers.\n\n- Team with U.S. Army Test and Evaluation Command to conduct a Director, Operational Test and Evaluation (DOT&E) interoperability assessment for EUCOM during Austere Challenge 2013.  Provide data collection, analysis and display using JDAT developed tools.  Benefits will include improvements in a Joint Common Operational Picture to COCOM Air Operations Center.\n\n- Provide C2 data collection and analytical support to the Joint Fires Support Executive Steering Committee.  Lead Engineering Change Implementation Group. Conduct Digitally Aided Close Air Support (DACAS) Coordinated Implementation risk reduction assessments to validate service compliance with requisite Engineering Change Proposals.  Benefits will include recommendations for Tactics, Techniques, and Procedures in the areas of standardization and digital interoperability and development of associated Universal Joint Tasks.\n\n- Chair the Joint Close Air Support Executive Steering Committee (JCAS ESC) chartered Digitally Aided Close Air Support (DACAS) Engineering Change Implementation Group. Plan and execute testing and validation of DACAS engineering change proposals and coordinate implementation across the Department of Defense and partner nations.\n\n- Update Joint Windows-based Warfare Assessment Model (JWinWAM), Data Collection Architecture for Analytical Feedback (DCAAF) and Multi-Interface Gateway (MIG) software development to support JDAT assessment activities and the efforts of other government agencies as directed.\n\n- Define Universal Joint Task (UJT) Additional Task Detail (ATD) for tactical task TA 3.3.2 Control Tactical Airspace and refine ATD for TA 3.2.2 Conduct Close Air Support (CAS) and TA 3.2.1 Conduct Joint Fires.\n\n- Provide subject matter expertise and tier 2 architecture products on development of the Joint Close Air Support (CAS) Joint Mission Thread (JMT) and Joint Fires JMT."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.506"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.506"
                                            },
                                            "Text": {
                                                "val": "- Continue providing analytical support to a demonstration of U.S.\/Coalition C2 information systems and procedures at JS J6 Bold Quest 14.  Provide instrumentation, data collection, data management, real-time mission monitoring, and feedback to participants via daily debriefings. Benefits will include improved ability to assess various participating coalition and U.S. systems, improved joint task execution, and an effective demonstration of U.S.\/Coalition C2 information systems.\n\n-Analytical support to assess DoD, Inter-Agency, and Industry’s counter-unmanned aircraft systems (C-UAS) capabilities across the IAMD joint engagement sequence during JS J8 Joint Integrated Air and Missile Defense Organization (JIAMDO) Black Dart 2014 demonstration. Provide data collection, analysis, display, and feedback using JDAT developed tools. Benefits will include improvements to surveillance, detection, tracking, identification, and engagement of counter-unmanned aircraft systems.\n\n-Team with U.S. Army Test and Evaluation Command to conduct DOT&E interoperability and information assurance (cyberspace) assessments for USNORTHCOM during Exercise Vigilant Shield 2014. Provide C2 information system data collection and analysis using JDAT developed tools and correlate with red team network penetrations and actions using USA Threat Systems Management Office developed tools. Benefits will include improvements in combatant command’s Joint cyber center defensive cyberspace operations through improved situational awareness and understanding the impact on procedures supporting the commander’s decision cycle.\n\n- Continue teaming with DOT&E for FY 2014 combatant commands’ interoperability assessments. Provide data collection, analysis and display using JDAT developed tools. Benefits will include improvements in U.S. and Coalition C2 information systems interoperability, processes and procedures in support of the commander’s decision cycle.\n- Continue providing analytical support to the Joint Personnel Recovery Agency by assessing selected engineering change proposals, identifying interoperability shortfalls, and recommending solutions.  Benefits include an end-to-end digitized Joint personnel recovery process.\n\n- Continue providing C2 data collection and analytical support to the Joint Fires Support ESC.  Chair the Engineering Change Implementation Group.  Conduct Digitally Aided Fires (DACAS and Fires) Coordinated Implementation risk reduction assessments to validate service compliance with requisite ECPs. Plan and execute testing and validation of ECPs and coordinate implementation across the DoD and partner nations.  Benefits will include recommendations in the areas of interoperability, standardization, and development of associated Universal Joint Tasks and TTP.\n\n- Continue to update JWinWAM, DCAAF, MIG, and TERA analysis software to support DOD-wide test and evaluation through the JMETC program.\n\n- Continue to define UJT ATD for tactical task (TA) 3.3.2 Control Tactical Airspace and refine ATD for TA 3.2.2 Conduct CAS and TA 3.2.1 Conduct Joint Fires.\n\n- Continue to provide subject matter expertise and architecture products on development of the Joint CAS JMT and Joint Fires JMT.\n\n-Partner with JS J8 JIAMDO, JS J7 Joint Center for Operational Analysis, and other agencies to address persistent integrated air and missile defense interoperability issues."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "JDAT delivers Joint solutions for operational and tactical forces deployed to Combatant Commands (CCMDs) and Joint and Service Program managers. Deliverables may include: discrete improvements to training processes; doctrine; Tactics, Techniques, & Procedures (TTPs); and\/or technical system performance specifications and standards; validated Doctrine, Organization, Training, Material, Leadership, Personnel, Facilities, and Policy (DOTMLPF-P) recommendations; timely delivery of quality feedback to exercise participants and developers for systems under test; or improvements to Joint context of testing and training venues.  JDAT works with Joint Staff, CCMDs, and Services to approve the annual agenda of work and validate results."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Evaluation Other Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JDAT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.725"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Operational Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC, Miratek, NDGI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.639"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.776"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.776"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various DoD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}