{
    "id": "333d4309ec70a33981137a5752a6736ddc768ab4",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0605100D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Mission Environment Test Capability (JMETC)"
        },
        "R1LineItemNumber": {
            "val": "140"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "10.215"
            },
            "CurrentYear": {
                "val": "19.380"
            },
            "BudgetYearOne": {
                "val": "31.000"
            },
            "BudgetYearOneBase": {
                "val": "31.000"
            },
            "BudgetYearTwo": {
                "val": "31.557"
            },
            "BudgetYearThree": {
                "val": "31.809"
            },
            "BudgetYearFour": {
                "val": "32.279"
            },
            "BudgetYearFive": {
                "val": "32.969"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Mission Environment Test Capability (JMETC) program was established for the purpose of implementing the Department’s strategy to move to an enterprise-centric, distributed test capability that results in acquisition systems fielded with enhanced joint capabilities, reduced program costs, and improved acquisition timelines.  The JMETC program implements the infrastructure capabilities defined in the DoD’s “Testing in a Joint Environment Roadmap” to provide acquisition program managers a robust nation-wide capability to “test like we fight.”  JMETC provides a persistent, distributed test and evaluation (T&E) capability that otherwise would not be readily available to Service\/Component acquisition programs.  This program is funded within the RDT&E Management Support Budget Activity because it is intended to provide test capability in support of RDT&E programs. \n \n       JMETC creates a common corporate capability to link live systems with virtual and constructive representations in order to generate a realistic joint mission test environment for the system(s) being tested.  To support the DoD guidance on cyber defense and attack operations, the JMETC environment includes a distributed cyberspace interoperability testing capability for systems under test.  JMETC is a widely applicable, persistent, service provider for the Department’s acquisition and net-centric programs.  Key JMETC products include readily available connectivity over existing networks, standardized data transport solutions, tools and utilities for planning and conducting distributed integrations, DoD corporate distributed testing expertise, and a reuse repository.  This common integration capability, through the use of the Test and Training Enabling Architecture (TENA), provides compatibility between JMETC and the Joint National Training Capability (JNTC), streamlining reuse of technical resources across the test and training communities.  In turn, this integration capability enables combined test and training exercises.\n \n       By linking distributed facilities, JMETC allows acquisition programs to efficiently evaluate their warfighting capability in a realistic joint mission environment.  This enables a customer-defined joint mission test environment for systems engineering and testing, extensible to training and experimentation, in a timely and cost effective manner.\n \n       JMETC’s institutional funding builds, maintains, and operates the JMETC infrastructure and pays for persistent availability of national connectivity for testing; data communications middleware; identification and development of interface standards; common software tools and components; and a reuse repository.  It also funds JMETC program management, facilities, equipment, operating costs, and special studies and analysis related to distributed test capabilities and infrastructure.  Key attributes of the JMETC include:  persistency; interoperability; reuse; various combinations of distributed capabilities (reconfigurable infrastructure to meet customer requirements to include distributed cyber testing); modeling and simulation (M&S) linkage; Live-Virtual-Constructive (LVC) test resource integration; and distributed test support to satisfy both Service and Joint needs.  System engineering, training, and experimentation all benefit from a corporate JMETC developed for T&E.\n       \nThe Test Resource Management Center (TRMC) is the Department’s lead for the JMETC program and oversees both its development and its operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.218"
                },
                "CurrentYear": {
                    "val": "19.380"
                },
                "BudgetYearOne": {
                    "val": "19.060"
                },
                "BudgetYearOneBase": {
                    "val": "19.060"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.215"
                },
                "CurrentYear": {
                    "val": "19.380"
                },
                "BudgetYearOne": {
                    "val": "31.000"
                },
                "BudgetYearOneBase": {
                    "val": "31.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.003"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "11.940"
                },
                "BudgetYearOneBase": {
                    "val": "11.940"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.003"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Efficiency Savings in Travel and Administrative Requirements"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.310"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.310"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Program Adj: National Cyber Range"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "12.250"
                                },
                                "BudgetYearOneBase": {
                                    "val": "12.250"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "•  Efficiency Savings:  Fiscal Guidance of baseline program adjusted to realign funds for higher priorities within DOD.\n•  National Cyber Range:  Funding provided to operate and operationalize the National Cyber Range (NCR) since Test Research Management Center assumed responsibility for the NCR effective FY13."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "100"
                    },
                    "ProjectTitle": {
                        "val": "Joint Mission Environment Test Capability (JMETC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.215"
                        },
                        "CurrentYear": {
                            "val": "19.380"
                        },
                        "BudgetYearOne": {
                            "val": "31.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.000"
                        },
                        "BudgetYearTwo": {
                            "val": "31.557"
                        },
                        "BudgetYearThree": {
                            "val": "31.809"
                        },
                        "BudgetYearFour": {
                            "val": "32.279"
                        },
                        "BudgetYearFive": {
                            "val": "32.969"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Mission Environment Test Capability (JMETC) program was established for the purpose of implementing the Department’s strategy to move to an enterprise-centric, distributed test capability that results in acquisition systems fielded with enhanced joint capabilities, reduced program costs, and improved acquisition timelines.  The JMETC program implements the infrastructure capabilities defined in the DoD’s “Testing in a Joint Environment Roadmap” to provide acquisition program managers a robust nation-wide capability to “test like we fight.”  JMETC provides a persistent, distributed test and evaluation (T&E) capability that otherwise would not be readily available to Service\/Component acquisition programs.  This program is funded within the RDT&E Management Support Budget Activity because it is intended to provide test capability in support of RDT&E programs. \n\n\tJMETC creates a common corporate capability to link live systems with virtual and constructive representations in order to generate a realistic joint mission test environment for the system(s) being tested.  JMETC is a widely applicable, persistent, service provider for the Department’s acquisition and net-centric programs.  Key JMETC products include readily available connectivity over existing networks, standardized data transport solutions, tools and utilities for planning and conducting distributed integrations, DoD corporate distributed testing expertise, and a reuse repository.  This common integration capability, through the use of the Test and Training Enabling Architecture (TENA), provides compatibility between JMETC and the Joint National Training Capability (JNTC), streamlining reuse of technical resources across the test and training communities.  In turn, this integration capability enables combined test and training exercises.\n\n\tBy linking distributed facilities, JMETC allows acquisition programs to efficiently evaluate their warfighting capability in a realistic joint mission environment.  This enables a customer-defined joint mission test environment for systems engineering and testing, extensible to training and experimentation, in a timely and cost effective manner.\n\n       JMETC’s institutional funding builds, maintains, and operates the JMETC infrastructure and pays for persistent availability of national connectivity for testing; data communications middleware; identification and development of interface standards; common software tools and components; and a reuse repository.  It also funds JMETC program management, facilities, equipment, operating costs, and special studies and analysis related to distributed test capabilities and infrastructure.  Key attributes of the JMETC include:  persistency; interoperability; reuse; various combinations of distributed capabilities (reconfigurable infrastructure to meet customer requirements); modeling and simulation (M&S) linkage; Live-Virtual-Constructive (LVC) test resource integration; and distributed test support to satisfy both Service and Joint needs.  System engineering, training, and experimentation all benefit from a corporate JMETC developed for T&E.\n\t\nThe Test Resource Management Center (TRMC) is the Department’s lead for the JMETC program, and oversees both its development and its operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Mission Environment Test Capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.215"
                                            },
                                            "Text": {
                                                "val": "-  Completed a Data Management Study to define joint requirements for data      management in the distributed test capability and continued to work with other DoD and Service programs to identify solutions for these requirements.\n-  Supported 444 test days (defined as JMETC support of one customer test event for one day) in the execution of 131 distinct customer distributed live-virtual-constructive (LVC) test activities to DoD acquisition programs and events as follows:  MQ-4C Triton (formerly referred to as Broad Area Maritime Surveillance (BAMS)) Environment Integration; Air Force Systems Interoperability Tests (AFSIT), Aegis Accelerated Mid-Term Interoperability Improvement Program (AMIIP), Joint Integrated Air and Missile Defense Organization’s (JIAMDO) Correlation\/De-correlation Interoperability Test (C\/DIT)  and JIAMDO Joint Tactical Air Picture Mission Environment - 12A (JTAP – ME); Joint Interoperability Test Command (JITC)(five actual tests); B1-B Fully Integrated Data Link (FIDL); Air Ground Integrated Layer Exploration (AGILE) Fire V and VI; B-52 Combat Network Communications Technology  (B-52 CONECT); Joint Track Manager Capability \/Composite Track Management (JTMC-D\/CTM); Distributed Common Ground System – Army (DCGS-A); Joint Distributed IRCM Groundtest System(JDIGS), Naval Air Systems Command (NAVAIR) Integrated Warfare Capability (IWC); Joint Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (JC4ISR) Interoperability Test and Evaluation Capability (InterTEC) System Integration Test, Aegis Performance Assessment Verification (PAV), InterTEC Cyber Event (ICE), and VENGENACE.\n-  Supported JIAMDO in the successful renegotiation of the International Agreement between the US and UK for Correlation\/De-correlation Interoperability Testing.\n-  Supported the development of a Marine Corps Mobile Van for data collection and analysis to enable the Marine Corps to support future G\/ATOR and CAC2S testing at the Marine Air Control Station (MACS-24), VA, Wallops Island, VA, and Yuma Proving Ground, AZ. \n-  Supported the JTRS program in the development of a Radio Frequency (RF) over Fiber capability to digitize and extend an RF signal over the JMETC network, enabling remote radio play in geographically separated networks.\n- Supported HPCMPO contracting activities for the award of the new DREN III contract.-  Verified the reliability of the JMETC infrastructure to support the Test-Analyze-Fix Test of AEGIS baseline software during multiple iterations of the Navy Accelerated Mid-Term Interoperability Improvement Project (AMIIP) testing as risk reduction for at-sea testing during Trident Warrior FY 12.-  Assisted and supported customers with distributed test tools and expertise for planning their distributed events.\n-  Continued to expand the JMETC persistent infrastructure from 68 to 72 (an additional 10 are planned); increased our network connectivity to industry and academia with the addition of peering points to MITRE Corporation, Georgia Tech Research Institute (GTRI) and Lockheed Martin Corporation\n-  Continued the integration of SDREN and JTEN in support of Combat system interoperability testing.\n-  Continued the installation of a networked cross domain solution (CDS) capability in preparation for the live fire activities at the AEGIS and Potomac River Gun Range at Dahlgren, VA. \n- Continued support of coalition distributed testing requirements in support of JIAMDO.\n-  Continued to provide distributed test and integration support for major customer events such as Joint Interoperability Test Command's Joint Interoperability Tests (5 tests),JIAMDO JTAP-ME and C\/DIT(JTAP–ME), Aegis PAV and AMIIP, and AGILE Fire (2 events),. \n-  Continued to provide general distributed test support for customers such as  MQ-4C Triton , Joint Tactical Radio System (JTRS), JTMC-D\/CTM, Aegis PAV and AMIIP, AFSIT,  NAVAIR IWC events, InterTEC development and fielding, and for numerous other smaller test activities.\n-  Continued planning support to new and on-going acquisition program customers, particularly Apache Blk III, CVN-78, F-35, F-22, Army Network Integration Event\/Brigade Modernization (NIE), JTRS Joint Reference Implementation Laboratory (JRIL), Ground\/Air Task Oriented Radar (G\/ATOR), Common Aviation Command and Control System (CAC2S), Joint Operational Test Approach (JOTA-2) Mode V IFF, Dismounted Detection Radar (DDR), and InterTEC Cyber Event (ICE).\n-  Continued outreach efforts to new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter requirements.\n-  Continued to expand and sustain the JMETC persistent connectivity infrastructure to meet customer requirements in full consideration of maximizing their potential for reuse.  \n-  Enhanced the User Interface and content of the web-based JMETC Reuse Repository to store software interfaces, tools, utilities, and test metadata making all available to the DoD test community for reuse.\n-  Continued coordination with the High Performance Computing Modernization Program Office (HPCMPO) to develop plans to improve network services focused on the Secure Defense Research and Engineering Network (SDREN) as well as implementation of computer network defense (CND) capability.  \n-  Continued coordination efforts to rationalize and integrate Service distributed T&E infrastructure to the JMETC infrastructure.  Integrated the Army Test Integration Network (ATIN) within the JMETC enterprise management responsibility.   \n-  Continued to improve our capability to leverage the kinetic assets native on JMETC with the threat capabilities of the Joint Information Operation Range in support of emerging Cyberspace T&E requirements.  Initiated planning efforts to build and sustain the infrastructure to support cyberspace T&E to include cyber test and assessment tools, cyber data collection, and distributed cyber testing.  \n- Coordinated with Deputy Assistant Secretary Defense (DASD)(Developmental Test & Evaluation (DT&E)), and supported the ICE pilot events to further identify requirements and deficiencies in cyber space T&E processes, methodology, workforce and infrastructure.\n-  Implemented a revamped distributed test tools assessment process to assist the distributed testing community in selection of the proper tools for planning and execution of distributed tests as well as analysis of test data.  In coordination with the JMETC Users Group, completed plans and resource requirements determination to sustain selected tools with consideration of JMETC Advisory Group inputs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.380"
                                            },
                                            "Text": {
                                                "val": "-  Continue to provide distributed test support for 15-20 major customer events such as Apache Blk III Link-16 Interoperability test, Army (NIE)\/Brigade Modernization (2 events), JTRS JRIL, F-35, MQ-4C Triton , G\/ATOR, CAC2S, Army Integrated Air and Missile Defense (IAMD), JIAMDO projects, Joint Interoperability Tests, AGILE Fire, NAVAIR Integrated Warfare Capability (IWC), InterTEC Cyber Event (ICE), JOTA-2 Mode V IFF, and numerous smaller test activities, as well as, continuous interconnectivity between distributed test resources for day-to-day exchange of test operations data.  \n-  Continue planning support to on-going acquisition programs, particularly Apache Blk III, G\/ATOR, CAC2S, JTRS JRIL, F-35, F-22, BAMS, CVN-78, and P-8 Multi-Mission Maritime Aircraft.  \n-  Continue to provide distributed test planning support to the Joint Staff J7 Joint Coalition Warfare (JCW), the Joint Staff J6 Command, Control, and Interoperability (C2I), and to other customers for their distributed test events.  \n-  Continue outreach efforts to new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter requirements.  \n-  Continue coordination efforts to rationalize and integrate Service distributed T&E infrastructure to the JMETC infrastructure.\n-  Continue to support and enhance the JMETC Reuse Repository to store software interfaces, tools, utilities, and test metadata making all available to the DoD test community for reuse.  \n-  Continue to sustain the JMETC persistent connectivity infrastructure and expand as necessary to meet customer requirements in full consideration of maximizing the potential for reuse.\n-  Continue the distributed test tools assessment process in coordination with the distributed test community and complete plans and resource requirements determinations to sustain selected tools with consideration given to inputs from the JMETC Advisory Group.\n- Continue to work with Industry, DoD, and Service programs to identify solutions for distributed data management and analysis requirements.\n- Continue the plans and coordination to establish and improve the test infrastructure for cyber tests and assessments by leveraging investments and existing infrastructure, i.e. Joint Information Operations Range and National Cyber Range (NCR). \n- Assist customers with the use of distributed test tools and troubleshooting of local network infrastructures.  Providing on-line and on-site support for the execution of distributed events.\n-  Operationalize the NCR and support Cyber test, training, experimentation and mission rehearsal requirements from acquisition programs, DT&E, Operational Test & Evaluation (OT&E), and Combatant Commands (COCOMS). Evaluate existing NCR tools and capabilities for potential to expand to use by other facilities and environments.\n- Lead the Cyber Range Interoperability Standards (CRIS) working group to identify keys areas in which establishment and adoption of standards across cyber ranges will result in efficiencies and improved scalability. \n- Initiate the incorporation of additional data management and analysis requirements and solutions for cyberspace T&E to include the necessary cyber analysis and assessment tools, instrumentation, and network expansion.\n- Initiate deployment of the Regional Service Delivery Point (RSDP) on the Joint Information Operations Range (JIOR) providing enhanced capabilities, performance and scalability to address the significant increase in demand for cyber test and training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue to provide distributed test support for 20-25 major customer events such as Apache Blk III Link-16 Interoperability tests (2 events), Army NIE\/Brigade Modernization (2 events), JTRS JRIL, F-35, MQ-4C Triton, CVN-78, G\/ATOR, CAC2S, Apache Blk III, Army IAMD, JTMC-D\/CTM, JIAMDO projects, Joint Interoperability Tests (5 events), AGILE Fire (2 events), Integrated Warfare Capability (IWC), InterTEC Cyber Event (ICE), and numerous smaller test activities, as well as, continuous interconnectivity between distributed test resources for day-to-day exchange of test operations data.  \n- Continue to assist customers with the use of distributed test tools and troubleshooting of local network infrastructures.  Continue providing on-line and on-site support for the execution of distributed events.\n- Continue outreach efforts to new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter requirements.  \n-  Continue planning support to on-going acquisition programs, particularly Army NIE\/Brigade Modernization, Apache Blk III, G\/ATOR, CAC2S, JTRS JRIL, F-35, F-22, MQ-4C Triton, CVN-78, Army IAMD, DDR, and P-8 Multi-Mission Maritime Aircraft.  \n-  Continue to provide distributed test planning support to the Joint Staff J7 Joint Coalition Warfare (JCW), the Joint Staff J6 Command, Control, and Interoperability (C2I), and to other customers for their distributed test events.  \n-  Continue coordination efforts to rationalize and integrate Service distributed T&E infrastructure to the JMETC infrastructure.\n-  Continue to support and upgrade the JMETC Reuse Repository to store software interfaces, tools, utilities, and test metadata making all available to the DoD test community for reuse.  \n-  Continue to sustain the JMETC persistent connectivity infrastructure and expand as necessary to meet customer requirements in full consideration of maximizing the potential for reuse.\n-  Continue the distributed test tools assessment process to assist the distributed testing community in selection of the proper tools for planning and execution of distributed tests as well as analysis of test data.  Continue, in coordination with the JMETC Users Group, sustainment of selected tools with consideration of JMETC Advisory Group inputs.\n-  Continue to work with Industry, DoD, and Service programs to identify solutions for distributed data management and analysis requirements.  Continue to identify additional data management and analysis solutions for Cyberspace T&E.\n- Continue deployment of the Regional Service Delivery Point (RSDP) on the Joint Information Operations Range (JIOR) providing enhanced capabilities, performance and scalability to address the significant increase in demand for cyber test and training.\n- Continue to lead the Cyber Range Interoperability Standards (CRIS) working group to identify keys areas in which establishment and adoption of standards across cyber ranges will result in efficiencies and scalability.\n- Refine and expand the NCR capabilities and process to support increased Cyber test, training, experimentation and mission rehearsal requirements from acquisition programs, DT&E, OT&E, and COCOMS. Enhance selected NCR tools and capabilities for use by other facilities and environments.\n-  Initiate the plans and coordination to establish and improve the test infrastructure and tools for cyber training, tests, and assessments by leveraging investments and existing infrastructure (i.e. Joint Information Operations Range and National Cyber Range)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "- Expansion of initial capability to support acquisition program test requirements, providing distributed capability to test systems and demonstrating required joint capability.\n - Successful use of integration software compatible with the JNTC and Joint Training infrastructure.\n - Number of test sites\/locations that are reused to support distributed tests using the JMETC infrastructure."
                        }
                    }
                }
            ]
        }
    }
}