{
    "id": "386a12ea68970a905b22c7a717bdf7dd39c7c639",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA6_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605602A"
        },
        "ProgramElementTitle": {
            "val": "Army Technical Test Instrumentation and Targets"
        },
        "R1LineItemNumber": {
            "val": "140"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "68.968"
            },
            "CurrentYear": {
                "val": "69.183"
            },
            "BudgetYearOne": {
                "val": "66.061"
            },
            "BudgetYearOneBase": {
                "val": "66.061"
            },
            "BudgetYearTwo": {
                "val": "64.882"
            },
            "BudgetYearThree": {
                "val": "63.069"
            },
            "BudgetYearFour": {
                "val": "64.037"
            },
            "BudgetYearFive": {
                "val": "64.620"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element provides critical front-end investments for development of new test methodologies; test standards; advanced test technology concepts for long range requirements; future test capabilities; advanced development of M&S and instrumentation prototypes; and the full development of test instrumentation for the United States Army Test and Evaluation Command (ATEC), which includes the Operational Test Command (OTC) at Ft Hood, Texas; Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; Yuma Test Center (YTC) at Yuma Proving Grounds (YPG), Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska and the Tropics Regions Test Center (TRTC), at various locations); Redstone Test Center (RTC), Redstone Arsenal, Alabama; and West Desert Test Center (WDTC) at Dugway Proving Ground (DPG), Utah. OTC consists of four forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Integrated Test and Evaluation Directorate, Fort Bliss, Texas; Fires Test Directorate, Fort Sill, Oklahoma; and Intelligence Electronic Warfare Test Directorate, Fort Huachuca, Arizona) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas. These activities support the development and fielding cycle of all Army acquisition programs including rapid fielding initiatives in support of operations in Afghanistan. Sustainment funding maintains existing testing capabilities at all locations by replacing unreliable, uneconomical, and irreparable instrumentation, as well as incremental upgrades of hardware and software for M&S and instrumentation systems to assure adequate test data collection capabilities. This data supports acquisition milestone decisions for all commodity areas throughout the Army including programs such as the Joint Light Tactical Vehicle (JLTV), Ground Combat Vehicle (GCV), Network Integration Evaluation (NIE), Terminal High Altitude Area Defense (THAAD), Patriot Advance Capability Phase 3 (PAC-3), Armored Multipurpose Vehicle (AMPV), Warfighter Information Network - Tactical (WIN-T), Joint Tactical Radio System (JTRS), and the Army Battle Command System (ABCS) which includes Joint Battle Command - Platform. This Program Element develops and sustains developmental and operational test capabilities that provide key support to the Army's three roles: Prevent, Shape, and Win Decisively. In addition this Program Element supports Overseas Contingency Operations by providing instrumentation to support ATEC's 24\/7 mission at YTC, Arizona, WSMR, New Mexico and ATC, Maryland supporting the Joint Improvised Explosive Device Defeat Organization (JIEDDO), as well as efforts throughout ATEC in support of the Army's Rapid Equipping the Force (REF) initiative."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "70.116"
                },
                "CurrentYear": {
                    "val": "69.183"
                },
                "BudgetYearOne": {
                    "val": "64.432"
                },
                "BudgetYearOneBase": {
                    "val": "64.432"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "68.968"
                },
                "CurrentYear": {
                    "val": "69.183"
                },
                "BudgetYearOne": {
                    "val": "66.061"
                },
                "BudgetYearOneBase": {
                    "val": "66.061"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.148"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.629"
                },
                "BudgetYearOneBase": {
                    "val": "1.629"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.148"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.629"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.629"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "628"
                    },
                    "ProjectTitle": {
                        "val": "Developmental Test Technology & Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "45.829"
                        },
                        "CurrentYear": {
                            "val": "45.498"
                        },
                        "BudgetYearOne": {
                            "val": "46.814"
                        },
                        "BudgetYearOneBase": {
                            "val": "46.814"
                        },
                        "BudgetYearTwo": {
                            "val": "46.293"
                        },
                        "BudgetYearThree": {
                            "val": "45.614"
                        },
                        "BudgetYearFour": {
                            "val": "46.291"
                        },
                        "BudgetYearFive": {
                            "val": "39.571"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Army consolidated three Test and Evaluation Command Headquarters - Army Test and Evaluation Command (ATEC), Developmental Test Command (DTC), and Army Evaluation Center (AEC).  As a result of this consolidation, ATEC aligned all requirements for the program management and oversight of test technology and instrumentation investment accounts under one Program Element. Funds reprogrammed effective FY2014."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program provides critical front-end investments for development of new test methodologies, test standards, advanced test technology concepts for long range requirements, future test capabilities, and advanced instrumentation prototypes for subordinate commands of the Army Test and Evaluation Command (ATEC). These capabilities are required to support developmental testing requirements of high priority Army systems being rapidly fielded to Afghanistan, and those systems supporting Army modernization efforts. Where practical, efficiencies will be gained through the common use of developmental instrumentation in operational testing.  A key element is sustaining aging instrumentation which maintains existing capabilities at test facilities by replacing unreliable, uneconomical and irreparable instrumentation, as well as lifecycle replacement and incremental upgrades of instrumentation and software, reducing their average age to assure adequate testing capabilities. This project develops and sustains developmental test instrumentation and capabilities that provide the data necessary to support acquisition milestone decisions for all commodity areas throughout the Army. Significant examples include new instrumentation for the testing of body armor and other soldier protective equipment, advanced methods for testing the survivability of ground vehicles and aircraft, refurbishment of kineto-tracking mounts (precise optical instruments used in missile and aviation testing), and an expanded instrumentation suite in support of the growing mission to test Command, Control, Communication and Computer (C4) systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "Provides command-level oversight, management and technical support for the DT test technology and instrumentation investment accounts.  Provides support to ATEC Capstone efforts in coordinating development of common instrumentation and technology needs for developmental and operational testing.  Provides management and support costs for direct interface with the T&E Executive Agent, management of needs and solutions calls for T&E Reliance oversight, management of the Small Business Innovation Research (SBIR), and support of the Army principal of the Test Resource Advisory Group (TRAG)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.943"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funded the existing requirement for the development of common instrumentation and technology to support developmental and operational testing. Supported the Army principal of the Test Resource Advisory Group (TRAG)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.756"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuation of the existing requirement for the development of common instrumentation and technology to support developmental and operational testing. Support of the Army principal of the Test Resource Advisory Group (TRAG)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Developmental Test Technology Investment"
                                    },
                                    "Description": {
                                        "val": "Develops, acquires and sustains critical test technology and instrumentation: Provides the necessary test instrumentation, computer and communications systems, data collection, analysis and reporting equipment and other test capabilities to successfully develop and test the Army weapons and equipment. Provides the necessary live, virtual and constructive environment, hardware-in-the-loop capabilities and models and simulations needed for testing the Army materiel. Acquires instrumentation for reliability, availability and maintainability (RAM) data collection on tracked and wheeled vehicles; ballistic transducers for measuring chamber pressures during ammunition tests; supports development of common data collection instrumentation used in testing across all test commodity areas and test lifecycles; acquires instrumentation for electromagnetic environmental effects (E3) on ground and air systems; continues replacement and upgrade of range control instrumentation, radar, optics and telemetry equipment used in missile testing; acquires data recorders, signal conditioning equipment, data processing equipment and other instrumentation for various aircraft tests; upgrades natural environments test instrumentation used for testing weapon systems, vehicles, munitions and support equipment in extreme hot desert plus tropic environments as well as extreme cold conditions; continues upgrade of survivability\/vulnerability test capabilities in support of live fire, active protection systems, and homemade explosive characterization; upgrades and replaces mobile range communications equipment and digital end devices; and develops advanced test technologies and instrumentation for testing next generation materiel such as advanced armor protection, multi-spectral sensors, and advanced soldier systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "35.647"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided, acquired and upgraded instrumentation for RAM, ballistic, missile, aviation and environmental testing across all test commodity areas and supported the test capability of live fire survivability testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36.377"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide, acquire and upgrade instrumentation for RAM, ballistic, missile, aviation and environmental testing across all test commodity areas and support the test capability of live fire survivability testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.908"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.908"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide, acquire and upgrade instrumentation for RAM, ballistic, missile, aviation and environmental testing across all test commodity areas and support the test capability of live fire survivability testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Homemade Explosive Characterization Study"
                                    },
                                    "Description": {
                                        "val": "Homemade explosives are the prevalent underbody threat in Operation Enduring Freedom area of operation. Currently live fire testing cannot use Army G2-validated homemade explosive surrogate because its performance has varied greatly from test-to-test. This study will characterize subscale and full scale repeatability of Army G2-validated surrogate homemade explosive charge for use in live fire test events and compare the performance relative to TNT standard. Results from this homemade explosive characterization will inform efforts to improve combat vehicle survivability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.464"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.464"
                                            },
                                            "Text": {
                                                "val": "Will obtain data to quantify target responses of homemade explosive surrogates and additional standard TNT mine threats used in live fire testing and provide data set to support future verification, validation, and accreditation (VV&A) of underbody blast modeling and simulation tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automotive Technology Evaluation Facility"
                                    },
                                    "Description": {
                                        "val": "Automotive Technology Evaluation Facility (ATEF) Test Track Upgrades - An automated traffic control system will be installed to monitor vehicle positions on the course and control accesses to and from the facility.  Continuous vehicle monitoring is required for range safety and automatic collision avoidance while simultaneously conducting sustained speed endurance, vehicle dynamics and stability, robotic\/autonomous vehicle control and traction control testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.995"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintained automated traffic control system and continue monitoring range safety while conducting simultaneous vehicle testing. An instrumentation suite will be procured to collect and transmit real-time test data, consisting of on-board data acquisition equipment, telemetry receiving stations, wireless communications network, vehicle position systems, a fiber-optic network interface, and will be equipped with a driverless test vehicle guidance system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.901"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintain automated traffic control system and continue monitoring range safety while conducting simultaneous vehicle testing. An instrumentation suite will be procured to collect and transmit real-time test data, consisting of on-board data acquisition equipment, telemetry receiving stations, wireless communications network, vehicle position systems, a fiber-optic network interface, and will be equipped with a driverless test vehicle guidance system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Test and Evaluation Command (ATEC) Common Test Technology for Developmental Testing, Operational Testing, and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Army Test and Evaluation Command (ATEC) Common Test Technology for Developmental Testing, Operational Testing, and Evaluation. Provides support for development of a Test and Evaluation Enterprise Architecture to facilitate use of common tools and standards; support for critical Test Technology Domain Focus Areas of Instrumentation, Modeling and Simulation, Threats, Data Management, and Networks; and support,  implementation of ATEC Regulation 70-15"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.244"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided support for development of the VISION digital library, the development of test and evaluation enterprises to facilitate use of common tools and standards. Supported critical test technology domain focus areas of instrumentation, modeling and simulation, threats, data management and Networks. Implementation of ATEC Reg 70-15"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.464"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Due to the consolidation of headquarters functions within ATEC, most efforts funded by this project have been transferred to the appropriate headquarters account. This project will continue to support the sustainment of the Starship instrumentation monitoring and control software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.442"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.442"
                                            },
                                            "Text": {
                                                "val": "Due to the consolidation of headquarters functions within ATEC, most efforts funded by this project have been transferred to the appropriate headquarters account. This project will continue to support the sustainment of the Starship instrumentation monitoring and control software."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "62C"
                    },
                    "ProjectTitle": {
                        "val": "Modeling and Simulation Instrumentaion"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.139"
                        },
                        "CurrentYear": {
                            "val": "23.685"
                        },
                        "BudgetYearOne": {
                            "val": "19.247"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.247"
                        },
                        "BudgetYearTwo": {
                            "val": "18.589"
                        },
                        "BudgetYearThree": {
                            "val": "17.455"
                        },
                        "BudgetYearFour": {
                            "val": "17.746"
                        },
                        "BudgetYearFive": {
                            "val": "25.049"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The US Army Test and Evaluation Command (USATEC) plans, conducts and reports on operational tests, assessments and experiments in order to provide essential information for the acquisition and fielding of War Fighting Systems.  Operational Test (OT) Instrumentation collects required data from both the systems being tested and the surrounding activities.  OT simulation enhances the live forces conducting operational testing by simulating additional units, message traffic, effects, and terrain. The Army's OPTEMPO has reduced the number of tactical units and vehicles available to support OT, making augmentation through simulation needed at times to test in a realistic, operational environment. The Program Executive Office for Simulation, Training, and Instrumentation (PEO STRI) Project Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) provides development of major simulation and instrumentation systems while ATEC adapts systems from other organizations, purchases off-the-shelf systems, develops minor new systems, and sustains all ATEC simulation and instrumentation systems.  The OT Simulation and Instrumentation (S&I) (Sustainment and Minor Development) program funds the expertise and the adaptation, purchases, minor development and sustainment requirements that support systems undergoing OT. Costs unique to specific systems under test may require Program Manager (PM) funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modeling, Simulation and Instrumentation"
                                    },
                                    "Description": {
                                        "val": "Develop and enhance ATEC's simulation\/stimulation of Mission Command, Fire Support, Air Defense, Reconnaissance and Surveillance, and Network systems. Improve and sustain our Real-Time Casualty Assessment (RTCA) (including geo-pairing) capabilities. Plus develop, enhance, and sustain our Performance Instrumentation Systems, Time Space Positioning Information (TSPI) and Telemetry Systems, and Imaging Systems together with their associated data management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.139"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY12 Accomplished Programs - The individually accomplished technology projects within all the domains as described in ATEC Regulation 70-15, Table 1, 22 Mar 06, include but are not limited to:  DoD Information Assurance Certification and Accreditation Process (DIACAP) for all ATEC MS&I Systems, Sustainment and ATEC Technology Capabilities and associated data management, Test Technology Execution Capabilities – Operational Test Advanced Simulation and Instrumentation Systems (OASIS) and associated data management, Network Control Systems\/Battle Command Simulation and associated data management, Real-Time Casualty Assessment (RTCA) (including GEO Pairing) and associated data management, Fires Simulation and Instrumentation - ExCIS FSA and associated data management, Intelligence Surveillance and Reconnaissance (ISR) Simulation and Instrumentation - Intelligence Modeling ans Simulation for Evaluation (IMASE) and associated data management, Performance Instrumentation Systems and associated data management, Time Space Positioning Information (TSPI) and Telemetry Systems and associated data management, and Imaging Systems and associated data management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.685"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY13 Planned Programs - The individually accomplished technology projects within all the domains as described in ATEC Regulation 70-15, Table 1, 22 Mar 06, include but are not limited to:  DoD Information Assurance Certification and Accreditation Process (DIACAP) for all ATEC MS&I Systems, Sustainment and ATEC Technology Capabilities and associated data management, Test Technology Execution Capabilities – Operational Test Advanced Simulation and Instrumentation Systems (OASIS) and associated data management, Network Control Systems\/Battle Command Simulation and associated data management, Real-Time Casualty Assessment (RTCA) (including GEO Pairing) and associated data management, Fires Simulation and Instrumentation - ExCIS FSA and associated data management, Intelligence Surveillance and Reconnaissance (ISR) Simulation and Instrumentation - Intelligence Modeling and Simulation for Evaluation (IMASE) and associated data management, Performance Instrumentation Systems and associated data management, Time Space Positioning Information (TSPI) and Telemetry Systems and associated data management, and Imaging Systems and associated data management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.247"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.247"
                                            },
                                            "Text": {
                                                "val": "FY14 Planned Programs - Continue to develop and enhance ATEC's simulation\/stimulation of Mission Command, Fire Support, Air Defense, Reconnaissance and Surveillance, and Network systems. Begin an effort to improve our Real-Time Casualty Assessment (RTCA) (including geo-pairing) capabilities to support future GCV, AMPV, and the Bradley Performance Improvement Program (PIP), Stryker PIP, and Abrams PIP OTs. Plus develop and sustain our Performance Instrumentation Systems and associated data management, Time Space Positioning Information (TSPI) and Telemetry Systems and associated data management, and Imaging Systems and associated data management."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}