{
    "id": "3cc4ead2f3f22a8f44f686c54cbed803582e99a9",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DLA_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2014.zzz_unzipped_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605080S"
        },
        "ProgramElementTitle": {
            "val": "Defense Agency Initiatives (DAI) - Financial System"
        },
        "R1LineItemNumber": {
            "val": "131"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "51.689"
            },
            "BudgetYearOneBase": {
                "val": "51.689"
            },
            "BudgetYearTwo": {
                "val": "40.423"
            },
            "BudgetYearThree": {
                "val": "7.660"
            },
            "BudgetYearFour": {
                "val": "3.195"
            },
            "BudgetYearFive": {
                "val": "2.941"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This is a new program element established to support the Defense Agencies Initiative (DAI), an Acquisition Category I program. Previous funding for DAI was documented in the Defense Enterprise Business Systems program element 0605070S. \n\n \nThe Defense Agencies Initiative (DAI) mission is to deliver auditable Chief Financial Officer (CFO) Act compliant business environments for Defense Agencies providing accurate, timely, authoritative financial data supporting the DoD goal of standardizing financial management practices improving financial decision support, and supporting audit readiness. Currently, Defense Agencies use more than 10 different non-compliant financial management systems supporting diverse operational functions and the warfighter in decision making and financial reporting. These disparate, non-integrated systems do not meet statutory requirements to produce timely, auditable reports."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "51.689"
                },
                "BudgetYearOneBase": {
                    "val": "51.689"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "51.689"
                },
                "BudgetYearOneBase": {
                    "val": "51.689"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY2014 Departmental Fiscal Guidance"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "51.689"
                                },
                                "BudgetYearOneBase": {
                                    "val": "51.689"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 Secretary of Defense Initiatives: $51.689 million"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Defense Agency Initiatives (DAI) - Financial System)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "51.689"
                        },
                        "BudgetYearOneBase": {
                            "val": "51.689"
                        },
                        "BudgetYearTwo": {
                            "val": "40.423"
                        },
                        "BudgetYearThree": {
                            "val": "7.660"
                        },
                        "BudgetYearFour": {
                            "val": "3.195"
                        },
                        "BudgetYearFive": {
                            "val": "2.941"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This is a new program element established to support the Defense Agencies Initiative (DAI), an Acquisition Category I program.  Previous funding for DAI was documented in the Defense Enterprise Business Systems program element 0605070S.\n\n\nThe Defense Agencies Initiative (DAI) mission is to deliver auditable Chief Financial Officer (CFO) Act compliant business environments for Defense Agencies providing accurate, timely, authoritative financial data supporting the DoD goal of standardizing financial management practices improving financial decision support, and supporting audit readiness.  Currently, Defense Agencies use more than 10 different non-compliant financial management systems supporting diverse operational functions and the warfighter in decision making and financial reporting.  These disparate, non-integrated systems do not meet statutory requirements to produce timely, auditable reports.\n\n\nThe DAI program modernizes the Defense Agencies’ financial management processes by streamlining financial management capabilities, addressing financial reporting material weaknesses, and supporting financial statement auditability for the majority of  agencies and field activities across the DoD.  DAI will support a transformation of budget, finance, and accounting processes across participating defense agencies to help improve the quality of financial information, supporting financial auditability and decision making.   The DAI business solution, once implemented, will provide a near real-time, web-based system from a “.mil” environment of integrated business processes that will enable in excess of 84,000 Defense Agency financial managers, program managers, auditors, and Defense Finance and Accounting Service (DFAS) representatives to make sound financial business decisions.\n\n\nThe DAI implementation approach is to deploy a standardized system solution that is consistent with requirements in the Federal Financial Management Improvement Act (FFMIA) and the DoD Business Enterprise Architecture (BEA), while leveraging the out-of-the-box capabilities of the selected Commercial-Off-the-Shelf (COTS) product, Oracle e-Business Suite (EBS), version 11i (R11).  DAI implemented an Office of Management and Budget Financial Systems Integration Office (FSIO) qualified COTS financial management business solution with common business processes and data standards.   The Program Management Office (PMO) will not develop any objects that are included in core COTS software or services (i.e. vendor data from Federal authoritative source).  \n\n\nDAI supports the Quadrennial Defense Review (QDR) Strategy 5, “Reform the business and support functions of the Defense enterprise”.  DAI is also aligned to the FY 2012\/FY 2013 DOD Strategic Management Plan Business Goal 2: “Strengthen DoD financial management to respond to warfighter needs and sustain public confidence through auditable financial statements”. The objective of the Defense Agencies Initiative is to achieve auditable, CFO Act compliant business environments for the Defense Agencies with accurate, timely, authoritative financial data. \n\n\nThe primary goal is to deploy a standardized system solution to improve overall financial management and comply with BEA, Standard Financial Information Structure (SFIS), and Office of Federal Financial Management (OFFM) requirements. Common business functions within budget execution include  the Department’s BEA End to End (E2E) business processes: Cost Management; Budget to Report; Procure to Pay;  Acquire to Retire (real property lifecycle accounting only); Hire to Retire (Time and Labor reporting only); and Order to Cash.  Future capabilities will support Defense Working Capital Fund accounting, Budget Formulation, Grants Financial Management, and Re-Sale Accounting (for Defense Commissary Agency (DeCA)) as well as a Contract Writing capability.\n\n\nDAI is currently implemented at 11 Defense Agencies and the Office of the Under Secretary of Defense, Comptroller, OUSD(C) (Time and Labor only) and supporting over 9,200 users.  In addition, since Oracle is phasing out maintenance of Oracle EBS, Release 11i, the program is required to migrate to EBS Release 12 (R12). The program office is also responsible for operational sustainment of the system.  Funds are required for additional government and contractor support, licenses, maintenance, and hardware to accomplish the remaining capability developments and organizational deployments, complete the R12 upgrade, initiate the annual Statement on Standards for Attestation Engagements (SSAE 16) assertion packages, and sustain the system.  \n\n\nThe benefits of DAI are:\n- Common business processes and data standards;\n- Access to real-time financial data transactions;\n- Significantly reduced data reconciliation requirements;\n- Enhanced analysis and decision support capabilities; Standardized line of accounting with the use of SFIS; and\n- Use of United States Standard General Ledger (USSGL) Chart of Accounts to resolve DoD material weaknesses and deficiencies.\n\n\nThe DAI PMO will provide the R12 Upgrade system integration services that include: acquisition management, project management; blueprinting; design, build, and unit test; developing required Reports, Interfaces, Conversion, Extensions, and Workflows (RICEW) objects; testing (information assurance, integration, functional, performance, conversion, security, user acceptance, operational); end-user training (train the trainer\/change management preparing the users for the cross functional skills and awareness needed to perform well with an integrated ERP system); system deployment; conversion; information assurance; sustainment; data service; help desk support; as well as studies and analysis support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Agency Initiatives (DAI) - Financial System"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY 2012 ($54.450 million) activities were addressed in PE 0605070S effective through September 30, 2013.\n\n•Delivered Release 2.0 full financial capabilities to the Defense Threat Reduction Agency (DTRA), TRICARE Management Activity (TMA), Defense Technology Security Administration (DTSA), and Defense Prisoner of War Missing Personnel Office (DPMO). \n\n•Developed several capabilities maturing core functionality, BEA Gaps, and the RICEW to achieve capabilities required to:  1) deploy full financial capabilities to four Agencies in October 2012 (beginning of FY 2013) and 2) support deployed Agencies.  \n\n•Deployed time and labor to Defense Advanced Research Projects Agency (DARPA) and the Office of Economic Adjustment (OEA).\n  \n•Conducted business process re-engineering, test developmental products, and prepare DARPA, OEA, Defense Security Services (DSS), and Defense Media Activity (DMA) for implementation of DAI (site surveys, training, infrastructure and sustainment preparations, development and testing).\n \n•Developed two interfaces to support DARPA’s mission that included porting copies of support documents to the Agency’s document management system and sharing project information with DARPA’s Management Support System (MSS) that includes capabilities not found in DAI.  \n\n•Developed automated timecard generation to ensure Government workers continue to get paid in the event of disasters (i.e. hurricanes, tornadoes, earthquakes, etc.).\n\n•Leveraged the Federal Procurement Data System Next Generation (FPDS-NG) Atom feed service to accelerate Prompt Payment Act (PPA) payments to small businesses.\n\n•Transitioned the Central Contractor Registration interface to the System for Award Management (SAM).\n\n•Modified the Internal Revenue Service Form 1099 feeder report to improve contractor payment reporting.  \n\n•Began preliminary analyses necessary to prepare software and infrastructure for upgrade to Oracle EBS R12 to include performance and sizing requirements. \n \n•Completed an upgrade from Oracle Database 10G to 11G throughout the DAI enclave. \n \n•Completed a study on the possibility of changing the operating system\/hardware from Linux Red Hat to Sun Solaris.  \n\n•Began working with the DLA Audit Readiness Office to plan development of the service provider assertion packages supporting the first SSAE 16.\n\n•DLA awarded DAI a one year Authority to Operate.\n\n•Defense Information Systems Agency (DISA) awarded DAI an Authority to Connect to the Global Information Grid (GIG)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY 2013 ($63.460 million) activities were addressed in PE 0605070S effective through September 30, 2013.\n\nFY 2013 Accomplishments to Date: The PMO delivered Release 3.0 full financial capabilities developed during FY 2012 to existing user Agencies as well as DARPA, DSS, OEA, and DMA.  The PMO also delivered a Data Services utility to convey Agency financial data from DAI to an Agency repository or data warehouse.  This generic service was implemented to populate the DARPA MSS.  \n\nIn FY 2013 the PMO will: \n\n•Create current baseline versions of acquisition and other reviews as an ACAT IA program.\n•Develop an Oracle EBS R12 upgrade Analyses of Alternatives in concert with the DCMO to include performance and sizing requirements and develop a plan of action and milestones to conduct the upgrade.\n•Perform business process re-engineering in concert with the Agencies that will include improving the funds visibility processes, streamlining configuration management, and improving change management.  \n•Develop Department of Defense Architecture Framework (DODAF) architectural views to DODAF 2.0 in line with DLA Guidance and Business Process Modeling Notation (BPMN) 2.0 Analytic Conformance Class (primitives).   \n•Identify and track new Financial Improvement and Audit Readiness (FIAR) preparatory audit’s Notices of Findings in the Federal Information Security Management Act (FISMA), FFMIA and other compliance areas.  \n•Develop DAI configuration changes reflecting the revised BEA 9.0 SFIS in view of the Government-Wide Treasury Account Symbol Adjusted Trial Balance System Requirements.\n•Develop a DAI portion of the DLA component plan to update the Department of Defense Standard Line of Accounting (SLOA)\/Account Classification in accordance with the joint Under Secretary of Defense, Comptroller\/Deputy Chief Management Officer Memo of September 14, 2012.  The target date for SLOA implementation (with data stored as discrete data elements) is September 2014. This effort will affect the underlying COTS configuration of the system and several RICEW objects in the current environment.  \n•Incorporate additional changes to interfaces as Enterprise systems adopt the SLOA\/Account Classification changes as well; and SAM absorbs the functionality of other target Federal Integrated Acquisition Environment Systems.  \n\nConduct:\n•Monthly release testing that addresses break fixes including regression.\n•Business Process Reengineering events;\n•BEA version 9.0 compliance certification review.\n•An Operational Test Event in conjunction with Director, Operational Test and Evaluation (DOT&E) to close out Increment 1 at using Defense Agencies.\n•Periodic and automated DAI master data updates leveraging feeds from the authoritative data sources.\n•Monthly reviews of the DIACAP POA&M to ensure required actions and currency of documentation in Enterprise Mission Assurance Support Service (EMASS) and the Vulnerability Management System (VMS).   \n•Contract renewal competitions and exercise options on existing contracts.  \n\nOversee\/manage:\n•Resolution of critical software errors and critical statutory\/regulatory enhancements that impact operations and incorporate changes identified during BPR and the Audit generated corrective action plans. \n•Collection and definition of user requirements.\n•Contractor performance and billing; \n•Currency of operational and application software currency and security patches; \n•Currency of system requirements with statutory and regulatory policy with regard to function and data standards; \n•System configuration (leveraging the best of DLA’s Gold Standard for documentation) \n•Operate all of the databases: production; T&D\/training; and COOP at two DECC locations;\n•Interface communication with existing Federal, DFAS and target Enterprise systems.\n•Operation system including the internal processes and the operation of several interfaces with external systems leveraging DLA Transaction Services as well as established Federal Enterprise system web services; \n•User roles and responsibilities at the system level and guide using Agencies at the Component level.\n•Monitor the operations of the DISA DECCs at Ogden, UT (Production and Test and Development (T&D) including training) and Columbus, OH (COOP).  Between the centers, the DAI PMO operates 72 servers and consumes over 14.7 terabytes of data.  The PMO leverages the DECC for infrastructure support and host site related Information Assurance (IA) and internal controls.  DECC services are governed by an annually negotiated Service Level Agreement (SLA).  The DAI PMO will use the DECC Service Organization Controls Report (SOC 1) as the foundation for its input for the annual DLA SOC 1 report that Agencies will use in their audits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "51.689"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "51.689"
                                            },
                                            "Text": {
                                                "val": "In FY 2014, the PMO will do the following.\n\n•Upgrade DAI to the Oracle EBS Release 12 software in a new Test & Development (T&D) Environment at Defense Enterprise Computing Center (DECC) Mechanicsburg, PA.  No new Agencies will be deployed in FY 2014 and existing Agencies will migrate in FY 2015.  \n•Obtain the hardware, software and services necessary to establish a T&D environment at DISA DECC Mechanicsburg, PA for the R12 Upgrade on Sun Solaris.\n•Identify and track the SSAE 16 audit’s NOFs in the FISMA, FFMIA and other compliance areas.  \n•Configure DAI to incorporate changes to the BEA SFIS in view of the Government-Wide Treasury Account Symbol Adjusted Trial Balance System Requirements.\n•Develop a DAI portion of the DLA component plan to update the Department of Defense Standard Line of Accounting (SLOA)\/Account Classification in accordance with the joint Under Secretary of Defense, Comptroller\/Deputy Chief Management Officer Memo of September 14, 2012.  The target date for SLOA implementation (with data stored as discrete data elements) is September 2014. This effort will affect the underlying COTS configuration of the system and several RICEW objects in the current environment.  \n•Incorporate additional changes to interfaces as Enterprise systems adopt the SLOA\/Account Classification and SAM absorbs the functionality of other target Federal Integrated Acquisition Environment Systems.  \n•Develop any material and non-material resolutions to SSAE 16 NOFs and other compliance areas.  \n\nDevelop the following for Increment 2:\n\n•Project Management Process including Project Performance Plan and reporting; \n•R12 Initial Baseline Review; \n•PMO R12 Upgrade staffing plan; \n•R12 Concept of Operations; \n•Integrated Master Plan (IMP) update; \n•Integrated Master Schedule (IMS) update; \n•Program Milestone Briefs, Bi-Weekly Status Reports,  Quarterly Executive Project Status Briefing; \n•PMO Risk Management Plan including Issues & Risk Management Process; \n•Position Papers\/Whitepapers; \n•Monitor efforts by Contractors Quality Assurance Surveillance Plans (QASP); \n•DAI Internal Controls Guide; \n•DAI Data Management Plan; \n•R12 detailed templates – blueprinting & related deliverables with linkage to Business Enterprise Architecture (BEA) version 9.0\/10.0, Standard Line of Accounting (SLOA) and the Standard Financial Information Structure (SFIS); \n•R12 Scenarios, Test Scripts, Regression Testing tool updates, and final status of testing; \n•R12 Baseline Configuration including functional, technical, and configuration documentation matured, reviewed, and approved in the Configuration Management (CM) tool; \n•CM plan update; \n•DISA DECC Hosting Plan including an operating & tested Sandbox\/Test & Development Environment in the Hosting Environment; \n•Application, database and server configuration management process including the instance management process & plan; \n•Continuity of Operations (COOP) plan to address production in both an R11 production baseline and a new R12 production baseline (at DECC Mechanicsburg) for an extended period; \n•R12 baseline instance available for use as a demonstration and sandbox; \n•R12 Global Model Development Strategy and Plan; \n•R12 Quality Assurance Plan and Materials; \n•Information Assurance Plan; \n•DIACAP POA&M; \n•R12 Requirements Management & Traceability Plan (GOLD Requirements Traceability Matrix (RTM) with cross reference to BEA, SFIS, Federal Financial Management Improvement Act of 1996 (FFMIA) controls, Federal Information Security Management Act of 2002 (FISMA) controls; \n•Compliance Management Plan and process updates; \n•Change Management process, plan, & materials updates; \n•PMO Communications Plan & materials updates; \n•Workforce Preparation (training) Plan\/Strategy updates for the core team, current users and New Agency staff including schedules, materials and media; \n•DAI Lifecycle Support Plan and sustainment methodology update; \n•DAI R12 Global Workflows; \n•DAI R12 EBS Configuration Settings Documents; \n•DAI R12 Reports, Interfaces, Conversions, Extensions and Workflows (RICEW) Inventory identifying the existing current (R11) and R12 version of the identifying artifact and\/or that the DAI R11 RICEW object will be retired in the upgrade; \n•R12 Internal Controls\/Segregation of Duties testing; \n•Overarching test plan (formerly the Test & Evaluation Master Plan (TEMP)) update and other test plans for System Integration Testing (SIT), Information Assurance (IA) Testing, User Acceptance Testing (UAT) and System Acceptance Testing (SAT); \n•Develop Test Reports; \n•Develop any R12 Upgrade related documentation for certifications and compliances; \n•Develop a data conversion plan if the Oracle upgrade tool does not work sufficiently to certify the migrated data from DAI in R11 to DAI in R12; and\n•R12 Information Support Plan (ISP) update including signed copies of revised user Agency agreements and Interface support agreements; \n\nConduct:\n•A review or exercise an intrusion test in concert with the Office of the Secretary of Defense staff;\n•BEA Version 10.0 compliance review;\n•Section 508 Compliance review; \n•Production Readiness Review; \n•In-Service Review; \n•Preliminary Design Review;\n•Critical Design Review;\n•Test Readiness Reviews; and \n•System Verification Review.\n\nAcquire and integrate: \n•New Oracle EBS modules that are not currently included in DAI in R11; and\n•Any required third party tools to facilitate the upgrade from R11 to R12."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "DAI is being developed and implemented using an incremental strategy including major annual software releases to accommodate the delivery of new capabilities and additional Agency deployments (in future years).  In FY 2014, the DAI PMO will conduct the Oracle EBS Release 12 Upgrade based on the FY 2013 analysis of alternatives conducted with the DCMO.\n\nThe PMO is responsible for all aspects of program control and execution. The DAI PMO will use a combination of contract types as directed by the contractual environment to support the delivery and sustainment of required capabilities.  Since the DAI PMO serves as the system integrator using a collaborative team of support contractors that provide expertise in critical\/functional areas, the PMO will re-compete services as they expire.  The PMO does not intend to bundle services or obtain a system integrator."
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2014, the DAI PMO will configure the Global Model and supporting RICEW that will be compatible with the Oracle EBS R12 Upgrade that will deliver a Defense Working Fund capability and a COTS inherent expanded Purchase Request (PR) capability within DAI. The PMO will not deploy any new capability to new Defense Agencies in FY 2014.  The DAI PMO will be reporting on several of the Office of the Under Secretary of Defense, Acquisition, Technology and Logistics (OUSD (AT&L)) Defense Procurement and Acquisition Policy (DPAP) required monthly metrics within the Procure to Pay (P2P) BEA E2E business process flow.  These P2P metrics, also referred to as Electronic Commerce (EC) metrics, include several metrics associated with quality (invoices on hold, pre-validation errors, unmatched disbursements, unsupportable disbursements and frequency of unmatched disbursements; speed (timing of contract award posting to Electronic Document Access system, contract award to obligation and on time treasury reporting and overage invoices); and cost (reconciliation, payment processing fees and interest penalties).   \n\nMajor Performers\n\nDISA\nDECC Ogden, Utah\nProduction Support \n\nDISA\nDECC Columbus, OH\nTest and Development (FY 2012 and FY 2013), and COOP Hosting Support\n\nDISA\nDECC Mechanicsburg, PA\nTest and Development (FY 2014 and beyond) \n\nDISA, Joint Interoperability Test Command (JITC)\nIndian Head, MD and Fort Huachuca, AZ\nTest Management and ITT Lead Services, Test tool, Information Exchange\/Interfaces, DLA Transaction Services Instance and limited Operational Assessment Support.\n\nNorthrop Grumman\nMcLean, VA\nInterfaces using DLA Transaction Services (now includes the formerly GEX services)\n\nDLT Solutions\nHerndon, VA\nApplication and database Management Support (FY 2012- 2nd Quarter (Q2) FY 2013)\n\nIBM\nBethesda, MD\nGlobal Model Development-Procure to Pay; Budget to Report; and Order to Cash\n\nCACI Inc., Federal\nChantilly, VA\nGlobal Model Development-Cost Accounting; Time and Labor; Acquire to Retire; and Infrastructure Support (Application & Database Management Support (Q2 FY 2013 and beyond). \n\nComputer Sciences Corp\nFalls Church, VA\nGlobal Model Development-Reports, Interfaces, Conversions and Information Assurance"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DAI Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chantilly VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.341"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.341"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DAI Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TDB"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.677"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.677"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DAI Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Implement and Development Support"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.153"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.153"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DAI Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DISA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pensacola, FL"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.643"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.643"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DAI Support Costs"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "New Oracle Licenses for R12"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TDB"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.236"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.236"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DAI Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Joint Interoperability Test Command (JITC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Indian Head, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.639"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.639"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "N \/ A."
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Defense Agencies Initiative (DAI)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}