{
    "id": "40bfc1e5f706b3ccfcc10512819bd5ba40b896f5",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603648D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Capability Technology Demonstration (JCTD)"
        },
        "R1LineItemNumber": {
            "val": "41"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "192.297"
            },
            "CurrentYear": {
                "val": "158.263"
            },
            "BudgetYearOne": {
                "val": "174.428"
            },
            "BudgetYearOneBase": {
                "val": "174.428"
            },
            "BudgetYearTwo": {
                "val": "156.756"
            },
            "BudgetYearThree": {
                "val": "171.491"
            },
            "BudgetYearFour": {
                "val": "166.970"
            },
            "BudgetYearFive": {
                "val": "164.221"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2014, the \"Disruptive Demonstrations\" project was inserted to support development and demonstration of time-sensitive capabilities that address Secretary\/Department Strategic Vectors and Chairman’s Gap Assessment of capability shortfalls.  As a result, we anticipate less partner funding for those strategic investment areas and will have to rely on greater partner funding for other Joint Capability Technology Demonstration (JCTD) projects.  Overall, we envision fewer JCTD projects that will be longer in duration.\n\nToday's operations require faster delivery of new capabilities.  Therefore, the JCTD Program works to accelerate project selection, encourage capability demonstration of less than two years where possible, but supports longer term projects (three years or more) when technical challenges warrant it.  This revised process includes:  streamlined project approval and initiation; clear one-year deliverables and decision points for projects greater than a year in duration; and annual reviews of ongoing JCTDs to assess deliverables and continuation of the project."
        },
        "ProgramElementMissionDescription": {
            "val": "The JCTD Program directly addresses Joint, Coalition, and\/or Interagency capability needs expressed by Combatant Commands (COCOMs).  Due to significant successes since inception of the program (initially the Advanced Capability Technology Demonstration (ACTD) Program), the JCTD Program is often viewed by COCOMs as a primary means to rapidly develop, assess, and transition time-sensitive capability solutions into operations.  Through partnering with other solution providers and resource sponsors, the JCTD Program typically leverages two dollars in partner funding for every one dollar in the JCTD budget.  Thus, the value and impact of JCTDs to the COCOMs is significantly greater than a traditional Research and Development (R&D) program.\n\nKey values demonstrated by the JCTD program are:\n- The program has a long history of providing enduring capabilities:  to date, over 80 percent of completed JCTDs have successfully transitioned capabilities to warfighters.  70 percent of completed ACTD projects successfully transitioned their products.  See “Section D.  Acquisition Strategy” for transition discussion.\n- The program delivers capabilities rapidly; projects execute quicker than the Department of Defense (DoD) Planning, Programming, Budgeting, and Execution (PPBE) process.  The result is that 74 JCTD\/ACTD projects delivered capabilities used in Operation Iraqi Freedom, and 57 projects delivered capabilities to Operation Enduring Freedom.  Most of those capabilities would not have been delivered – or would have been significantly delayed – without the JCTD program.  Recent examples are:  sensor capabilities for finding and interdicting tunnels delivered to Afghanistan to address a Joint Urgent Operational Needs Statement (JUONS) requirement and to interdict tunnels on the US-Mexico border; autonomous technologies for unmanned aerial resupply of forward operating bases; a sensor capability to provide situational awareness in the riverine environment; and a deployable, integrated system to provide essential services in the immediate aftermath of a crisis event, to include renewable-powered water desalination deployed to all the COCOMs.  \n-The program enables Coalition cooperative development by leveraging partner nation expertise and resources; approximately one-third of JCTD projects involve some degree of coalition partner participation.  As a result of successful past collaborations, the program now enjoys routine interactions with the United Kingdom, Canada, Australia, the Republic of Korea, and the Republic of Singapore.\n- The program enables development and execution of interdepartmental cooperation projects, such as projects with the Department of Homeland Security (DHS), Department of State (DOS), and Department of Transportation (DOT).  Recent examples are interdepartmental collaborations for maritime awareness, air domain information sharing, tunnel detection and characterization, and Arctic awareness.\n- The program enables rapid response to new DoD priorities before Service PPBE cycles can respond.  For example, the DoD has recently established priorities for Anti-Access\/Area-Denial, Building Partner Capacity, understanding human terrain, and nuclear forensics.  The JCTD Program quickly responded to the new priorities and is providing initial capabilities that are transitioning to Service efforts.\n\nMEASURABLE OUTCOMES:  Metrics include all JCTDs will have deliverables within 15 months (analyses, designs, models, etc.) to enable assessment for project continuation; 50 percent of JCTDs will provide an operationally-relevant prototype within 18 months; and 75 percent will complete final demonstration within 24 months of receiving funding.  JCTDs will spiral products and deliverables during the demonstration to meet COCOM needs.  Capabilities delivered and technologies transitioned are additional key metrics.\n\nTransition Achievement:  The JCTD program has been achieving actual transition rates of over 80 percent, well in excess of the DoD Strategic Objective 3.5.2D, Performance Measure 3.5.1-2D, goal of 40 percent.  The JCTD Program defines transition as all or components of the demonstrated JCTD going to a new or existing Program of Record (POR), providing fieldable-prototypes (residual capabilities) sustained by non-JCTD funds in direct support of operations in theater, or commodity-type capabilities entered onto General Service Administration (GSA) schedule for procurement by DOD users.  13 of 16 completions in FY 2012 were successfully transitioned."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "171.807"
                },
                "CurrentYear": {
                    "val": "158.263"
                },
                "BudgetYearOne": {
                    "val": "155.198"
                },
                "BudgetYearOneBase": {
                    "val": "155.198"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "192.297"
                },
                "CurrentYear": {
                    "val": "158.263"
                },
                "BudgetYearOne": {
                    "val": "174.428"
                },
                "BudgetYearOneBase": {
                    "val": "174.428"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "20.490"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "19.230"
                },
                "BudgetYearOneBase": {
                    "val": "19.230"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "20.543"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "19.230"
                                },
                                "BudgetYearOneBase": {
                                    "val": "19.230"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.053"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012:  Net increase of $20.490 million due to a  remuneration of $21.300 million from the High Performance Computing Modernization program and net adjustments of -$0.810 million in reprogrammings and other adjustments to support OSD efforts.\n\nFY 2014:  Baseline adjustments reflective of DoD priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P648"
                    },
                    "ProjectTitle": {
                        "val": "Joint Capability Technology Demonstration (JCTD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "192.297"
                        },
                        "CurrentYear": {
                            "val": "158.263"
                        },
                        "BudgetYearOne": {
                            "val": "152.428"
                        },
                        "BudgetYearOneBase": {
                            "val": "152.428"
                        },
                        "BudgetYearTwo": {
                            "val": "135.756"
                        },
                        "BudgetYearThree": {
                            "val": "150.491"
                        },
                        "BudgetYearFour": {
                            "val": "146.970"
                        },
                        "BudgetYearFive": {
                            "val": "145.221"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Today's operations require faster delivery of new capabilities.  Therefore, the Joint Capability Technology Demonstration (JCTD) Program works to accelerate project selection, encourage capability demonstration of two years where possible, but supports longer term projects (three years or more) when technical challenges warrant it.  This revised process includes:  streamlined project approval and initiation; clear one-year deliverables and decision points for projects greater than a year in duration; and annual reviews of ongoing JCTDs to assess deliverables and continuation of the project."
                        },
                        "ProjectMissionDescription": {
                            "val": "The JCTD Program directly addresses Joint, Coalition, and\/or Interagency capability needs expressed by Combatant Commands (COCOMs).  Due to significant successes since inception of the program (initially the Advanced Capability Technology Demonstration (ACTD) Program), the JCTD Program is often viewed by COCOMs as a primary means to rapidly develop, assess, and transition time-sensitive capability solutions into operations.  Through partnering with other solution providers and resource sponsors, the JCTD Program typically leverages two dollars in partner funding for every dollar in the JCTD budget.  Thus, the value and impact of JCTDs to the COCOMs is significantly greater than a traditional Research and Development (R&D) program.\n\nKey values demonstrated by the JCTD program are:\n- The program has a long history of providing enduring capabilities:  to date, over 80 percent of completed JCTDs have successfully transitioned capabilities to warfighters. 70 percent of completed ACTD projects successfully transitioned their products.  See “Section D.  Acquisition Strategy” for transition discussion.\n- The program delivers capabilities rapidly; projects execute quicker than the traditional Department of Defense (DoD) Planning, Programming, Budgeting, and Execution (PPBE) process.  The result is that 74 JCTD\/ACTD projects delivered capabilities used in Operation Iraqi Freedom, and 57 projects delivered capabilities to Operation Enduring Freedom.  Most of those capabilities would not have been delivered – or would have been significantly delayed – without the JCTD program.  Recent examples are:  sensor capabilities for finding and interdicting tunnels delivered to Afghanistan to address a Joint Urgent Operational Needs Statement (JUONS) requirement and to interdict tunnels on the US-Mexico border; autonomous technologies for unmanned aerial resupply of forward operating bases; a sensor capability to provide situational awareness in the riverine environment; and a deployable, integrated system to provide essential services in the immediate aftermath of a crisis event, to include renewable-powered water desalination deployed to all the COCOMs.  \n- The program enables coalition cooperative development by leveraging partner nation expertise and resources; approximately one-third of JCTD projects involve some degree of coalition partner participation.  As a result of successful past collaborations, the program now enjoys routine interactions with the United Kingdom, Canada, Australia, the Republic of Korea, and the Republic of Singapore.\n- The program enables development and execution of interdepartmental cooperation projects, such as projects with the Department of Homeland Security (DHS), Department of State (DOS), and Department of Transportation (DOT).  Recent examples are interdepartmental collaborations for maritime awareness, air domain information sharing, tunnel detection and characterization, and Arctic awareness.\n- The program enables rapid response to new DoD priorities before Service PPBE cycles can respond.  For example, the Department has recently established priorities for Anti-Access\/Area-Denial, Building Partner Capacity, understanding human terrain, and nuclear forensics.  The JCTD Program quickly responded to the new priorities and is providing initial capabilities that are transitioning to Service efforts.\n\nMEASURABLE OUTCOMES:  Metrics include:  all JCTDs will have deliverables within 15 months (analyses, designs, models, etc.) to enable assessment for project continuation; 50 percent of JCTDs will provide an operationally-relevant prototype within 18 months; and 75 percent will complete final demonstration within 24 months of receiving funding.  JCTDs will spiral products and deliverables during the demonstration to meet COCOM needs.  Capabilities delivered and technologies transitioned are additional key metrics. \n\nTransition Achievement:  The JCTD program has been achieving actual transition rates of over 80 percent, well in excess of the DoD Strategic Objective 3.5.2D, Performance Measure 3.5.1-2D, goal of 40 percent.  The JCTD Program defines transition as all or components of the demonstrated JCTD going to a new or existing Program of Record (POR), providing fieldable-prototypes (residual capabilities) sustained by non-JCTD funds in direct support of operations in theater, or commodity-type capabilities entered onto GSA schedule for procurement by Department users.  13 of 16 completions in FY 2012 were successfully transitioned."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Assurance Decision Support System (MADSS)"
                                    },
                                    "Description": {
                                        "val": "MADSS provides an integrated Command, Control and Communications (C3) operational and critical infrastructure relationships understanding by correlating data from different data sources, using web-based services, and secure network and automated data transformation services.  MADSS provides improved responsiveness and predictive capability, rapid event analysis, and Warfighter analysis of alternatives development for network and critical infrastructure outages.  MADSS is in daily operational use at U.S. Strategic Command (STRATCOM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Maintained MADSS accreditation status, conducted monthly training sessions for operators, and activated three COCOM user communities of interest at STRATCOM, U.S. Cyber Command (CYBERCOM), and U.S. Northern Command (NORTHCOM)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cooperative Security Engagement (CSE)"
                                    },
                                    "Description": {
                                        "val": "CSE demonstrates operational concepts and tools for enabling joint, interagency, multi-national planning, coordination, and synchronization.  CSE provides a framework for interagency adaptive planning; regional and multinational\/event based information sharing; and integrated event assessment, operation, monitoring, and evaluation.  The JCTD sponsor is U.S. Southern Command (SOUTHCOM) and U.S. European Command (EUCOM).  The U.S. Agency for International Development (USAID) provides key technical and operational input.  Transition will incorporate CSE capabilities and operational concepts into COCOM stability operations.  Program Outputs and Efficiencies:  (1) interagency adaptive planning process and tool; (2) streamlined regional and interagency assessments; (3) regional and multi-national information sharing; (4) repeatable and reusable frameworks; (5) mutually visible situation\/event assessment and planning; and (6) collaborative implementation, monitoring, and evaluation tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.505"
                                            },
                                            "Text": {
                                                "val": "Operational Demonstration 1 (OD1) was successfully concluded.   Operational Demonstration 2 (Phase 1) was initiated in the SOUTHCOM Area of Responsibility and addressed functional requirements and Critical Operational Issues and Criteria, not demonstrated during OD1.  The Operational Utility Assessment was initiated.  USAID is a full partner in all of these events and Interagency Tactics, Techniques, and Procedures were developed.  Additionally, in an effort to reach out to our interagency and non-government organization partners, the Technical Management Office, in cooperation with the United States Institute of Peace (USIP), conducted a demonstration of the Unity platform.  In FY 2013, the program will transition to Defense Information Systems Agency (DISA)\/Unclassified Information Sharing Architecture; host the CSE JCTD\/Unity Platform on the SOUTHCOM server as an interim capability; and pursue opportunities to host Unity at both USAID and USIP."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter-Electronics High Powered Microwave System Advanced Missile Project (CHAMP)"
                                    },
                                    "Description": {
                                        "val": "CHAMP demonstrates and assesses a multi-shot and multi-target aerial High Power Microwave (HPM) platform that is capable of degrading, damaging, or destroying electronic systems.  A compact HPM payload will be integrated into an aerial vehicle to create the aerial HPM platform demonstrator.  CHAMP is a multi-year project under sponsorship of U.S. Pacific Command (PACOM) for transition to an Air Combat Command Program of Record.  The primary outputs and efficiencies to be demonstrated are:  (1) delivery of the HPM aerial system to the target; (2) minimum effectiveness HPM range; (3) stand-off distance from launch to target; (4) multiple geographically separated targets; and (5) navigation, orientation, and fuzing accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.300"
                                            },
                                            "Text": {
                                                "val": "Completed flight test, Military Utility Assessment, and documentation for transition to Program of Record.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Edge Data Solutions (TEDS)"
                                    },
                                    "Description": {
                                        "val": "TEDS is the implementation of Command and Control (C2) Core extensions for tactical information at the battalion level so that web-services data sharing frameworks based on Universal Core (UCore) can enable data sharing among disparate systems.  TEDS focuses on exchanging data from Army and Marine Corps C2 Authoritative Data Sources for the C2 and Battlespace Awareness domains.  The efficiencies gained will be the reduction of redundant software being developed across multiple programs and the ability to seamlessly exchange data within Military Services as well as North Atlantic Treaty Organization (NATO) and coalition partners who adopt UCore.  Transition of the C2 Core extensions and Web services for translation and semantic mediation is planned for Programs of Record in the Army and Marine Corps.  The output of TEDS will enable C2 systems to migrate to a Service Oriented Architecture environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Text": {
                                                "val": "Demonstrated net-enabled Coalition Data Sharing using C2 Core in Coalition Warrior Interoperability Exercise with seven coalition partners.  Transitioned these capabilities by uploading the information exchange specifications to the DoD Metadata Data Repository and the NATO Metadata Registry and Repository.  Transitioned Web services to Army and Marine Corps for use in tactical programs of record to enable mediation of data across tactical C2 systems for Position Reports, Significant Activity, and Enemy Situation reporting using U.S. message text formatting.  Provided the repeatable processes for extending C2 Core mediation to other communities of interest such as logistics, force support, and cyber.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Reaction Tunnel Detection (R2TD)"
                                    },
                                    "Description": {
                                        "val": "R2TD demonstrates a set of detection and mapping technologies, and establishes procedures to provide Joint Force Commanders with a capability to detect, characterize, and interdict tunnels on the battlefield and beneath the U.S. borders.  R2TD will accurately locate subsurface voids up to 100 feet deep; detect tunnel construction in real-time and report summaries every four hours; detect movement of contraband through tunnels in near-real time and report summaries every four hours; precisely locate tunnel axis, ingress and egress points; characterize physical dimensions of tunnels; and characterize internal features of tunnels including floor, shoring, lighting, ventilation, and water presence\/flow."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.203"
                                            },
                                            "Text": {
                                                "val": "Tested and integrated Passive and Active systems into one Common Operating Picture (COP).  Conducted the final Operational Demonstration with the fully integrated suite of systems.  Transitioned to Army Program of Record for long term sustainability.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command and Control Gap Filler (C2GF)"
                                    },
                                    "Description": {
                                        "val": "C2GF will provide an information systems architecture that can share all-source air surveillance data between government departments.  The C2GF solution will also provide data fusion services to users.  Additionally, the C2GF will refine the concept of operations and employment and Tactics, Techniques, and Procedures (TTP) necessary for air domain surveillance coordination."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "Completed work on air surveillance data fusion capability.  Validated and demonstrated the C2GF architecture by incorporating data from representative air surveillance sensors in Operation Vigilant Shield.  Provided stand-alone air picture in Air Operations Center (AOC).  Completed C2GF Enterprise Technical Demonstration 2 for sensor integration.  Provided enhanced C2 capabilities on DoD computer networks, Releasable Canadian (RELCAN), and DHS networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Conduct Operational Utility Assessment at an U.S. Northern Command exercise.  Provide expanded disparate sensor integration and integrated Air and Missile Defense sensor netting.  Provide sensor integration capability among DoD and Federal Aviation Administration (FAA) sensors in the AOC.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Unmanned Air Systems (UAS) Precision Targeting (JUPT)"
                                    },
                                    "Description": {
                                        "val": "JUPT rapidly provides precision coordinates from UAS generated imagery for use with coordinate seeking weapons.  JUPT provides the Joint Commander the ability to rapidly transition from observing to striking high value targets with coordinate seeking weapons in all terrain, while minimizing collateral damage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.446"
                                            },
                                            "Text": {
                                                "val": "Approved Management Transition Plan.  Conducted operation demonstrations and Joint Operational Utility Assessments.  Transitioned capability to Army Program Manager-Unmanned Air Systems and U. S. Special Operations Command.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fixed Wing Advanced Precision Kill Weapon System (FW-APKWS)"
                                    },
                                    "Description": {
                                        "val": "FW-APKWS provides the legacy AV-8B and A-10 (optionally F-18 and F16) aircraft with a precision air-to-ground low collateral damage weapon for use in close controlled strike applications.  FW-APKWS will demonstrate a weapon that increases the flexibility of current fixed-wing inventory and delivers 50 residuals (25 U.S. Air Force, 25 U.S. Navy) for limited use."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Conducted instrumented measurement vehicle testing on AV-8B and A-10 aircraft.  Conducted technical demonstrations. In FY 2013, the program will finalize the Technical Data Package, complete the Military Utility Assessment and Operational Assessment, and modify the Operational Requirements Document of APKWS to include fixed-wing production requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational Three-Dimension (Op3D)"
                                    },
                                    "Description": {
                                        "val": "Op3D is a joint interagency program sponsored by U.S. Special Operations Command (SOCOM).  Op3D will develop and transition capabilities to quickly discover, manage, generate, exploit, disseminate, and accurately update 3D Geographic Intelligence data from multiple collection systems to the warfighter.  The JCTD consists of three overlapping development and demonstration spirals.  Residuals from the effort include an enhanced 3D data processing pipeline, warfighter\/analyst exploitation tools, Tactics, Techniques and Procedures (TTPs), concepts of operations, user guides and training packages.  SOCOM is responsible for requirements validation and transition management for the Special Operations Forces community.  The National Geospatial-Intelligence Agency (NGA) will develop and transition successful Op3D technologies into Programs of Record.  Op3D will spiral capabilities into Agency and Service Production Centers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "Executed, evaluated, and transitioned Spiral Two and Three tasks.  Developed Concept of Operations, standard operating procedures, TTPs, user guides, and training packages for successful Spiral Three processes.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Satellite Communications - Global Information Grid (SATCOM-GIG) Operations and Management (ISOM)"
                                    },
                                    "Description": {
                                        "val": "ISOM will demonstrate real-time Internet Protocol (IP) satellite communications (SATCOM) situational awareness (SA) and a scalable and policy-based management system that enables dynamic allocation and provisioning of SATCOM resources.  ISOM will integrate certain existing terrestrial and IP SATCOM management tools which will greatly improve the ability to make the most of underutilized SATCOM resources or to resolve complex warfighter communications outages.  ISOM integrates real-time situational awareness of SATCOM resources to provide a single, over-arching view of current SATCOM allocations and the load on these links.  It then provides an automated ability to act on this information by dynamically re-allocating or re-provisioning the SATCOM resources given to IP SATCOM networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.723"
                                            },
                                            "Text": {
                                                "val": "Engineered architecture to align with Defense Information System Network (DISN) Operational Support System (OSS) sustainment requirements.  Conducted Operational Utility Assessment in operationally relevant network environment.  Integrated ISOM SA with the policy-based management capability that enables dynamic allocation and provisioning of SATCOM resources in an end-to-end architecture.  Completed second technical demonstration and operational evaluation.  In FY 2013, the program will finalize operational demonstrations and assessments on the prototypes and initiate transition to the DISN OSS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National Technical Nuclear Forensics (NTNF)"
                                    },
                                    "Description": {
                                        "val": "NTNF will strengthen strategic nuclear deterrence by enhancing nuclear forensics capabilities supporting attribution after release of nuclear materials (details are classified).  NTNF will integrate advanced air and ground debris sample collection technologies in both manned and unmanned platforms, and integrate DoD capabilities into the developing joint interagency Concept of Operations (CONOPS) for advanced air and ground sample collection with global applicability.  The project will also demonstrate enhanced integrated yield estimation methods for nuclear events.  The techniques to be employed will increase capabilities to determine initial yields and collect nuclear debris, while enhancing safety for NTNF Task Force personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.800"
                                            },
                                            "Text": {
                                                "val": "Detailed capability outputs are classified.  Continued technical development, training, and technical demonstrations.  Operationally demonstrated and exercised (ODX) ground sampling collection platforms and airborne debris collection capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Complete JCTD with culmination ODX of all three NTNF capabilities:  yield estimation, air sampling, and ground sampling.  Produce operational assessment.  Publish Joint\/Interagency Concept of Operations, Tactics, Techniques and Procedures, and doctrine change recommendations.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Site Exploitation (RSE)"
                                    },
                                    "Description": {
                                        "val": "RSE will employ innovative combat site collection and exploitation capabilities with a web portal to rapidly recognize, collect, analyze, share, track, and manage collected materials.  Site exploitation will include biometrics, document and media, and other combat forensic materials.  A web portal will link key information sources maintained by multiple U.S. Government organizations.  RSE will shorten site collection times from hours to minutes and speed forensic analysis from days to hours."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to complete integrated site exploitation kits and prototype web portal interface, interoperable with biometric, forensic, and document\/media exploitation enterprises.  Conducted final Utility Assessment and transitioned residuals to a program of record.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dark Fusion (DF)"
                                    },
                                    "Description": {
                                        "val": "DF is a capability to detect and track non-emitting maritime threats by integrating data from national collection capabilities which provides the ability to detect and track difficult maritime targets and increases maritime situational awareness (details are classified)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "Conducted technical demonstration and first operational demonstration.  Transitioned spiral capability to the Office of Naval Intelligence (ONI) program of record."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Conduct final operational demonstrations and utility assessments.  Transition remaining products to ONI.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Commercial Radar Operational Support to U.S. Southern Command (CROSS)"
                                    },
                                    "Description": {
                                        "val": "CROSS demonstrates the ability to task, on-demand, three commercial radar constellations and receive unclassified imagery to support operations and contingency planning activities.  This capability provides U.S. Southern Command (SOUTHCOM) the ability to fulfill un-met lower resolution imagery tasks (e.g., Haiti disaster relief, Gulf oil spill, and specific classified military applications) within their area of responsibility.  Upon successful demonstration at SOUTHCOM, CROSS will replicate a similar model at remaining Combatant Commands (COCOMs) and instantiate Non-Government Agencies' (NGA) contracts to provide direct and routine tasking and support for long-term COCOM radar imagery buys."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Text": {
                                                "val": "Conducted final utility assessment and delivered final Collection Management Tool.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Commander Direct Participation, Transition Enabling, and Special Programs"
                                    },
                                    "Description": {
                                        "val": "This effort is comprised of three programs that support the entire JCTD Program, separate from the specific JCTD projects.  The three programs are (1) Unified Combatant Commander (COCOM) Direct Support; (2) JCTD Pre-Transition; and (3) Program Integration Office for execution of select, classified projects.  (1) COCOM Direct Support:  The COCOMs are essential in specifying capability needs, project selection, validation, demonstration, assessment, and transition of JCTDs.  The JCTD Program provides direct support to COCOMs, enabling the COCOMs to provide an on-site JCTD manager, typically one to two full-time equivalents (FTEs).  (2) JCTD Pre-Transition:  In some cases, Service or Agency partner transition funding is not available for one to two years following the JCTD assessment phase due to the Service or Agency Program Objective Memorandum commitments.  In such cases, where there is a clear transition and the need to sustain the capability for a short time prior to availability of Service or Agency transition funds the JCTD Pre-Transition fund may be used to meet that need.  (3) Program Integration Office:  A limited number of classified projects that require enhanced security measures due to need-to-know and\/or mission partner sensitivities are managed within the Program Integration Office."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.291"
                                            },
                                            "Text": {
                                                "val": "COCOM direct participation funding enabled COCOM staff participation in developing and executing JCTD projects, ensuring direct warfighter input and proper focus of JCTD projects.  JCTD Transition Enabling funds targeted transition for projects that included Mission Assurance Decision Support System (MADSS), Daily Watch and One-Box-One-Wire (OB-1).  The Program Integration Office executed continuing projects, developed additional projects, and managed select projects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.014"
                                            },
                                            "Text": {
                                                "val": "COCOM direct participation will continue to enable COCOM staff participation in developing and executing JCTD projects, ensuring direct warfighter input, and proper focus of JCTD projects.  JCTD transition enabling funds will provide transition bridge funding for several projects, sustaining the efforts for a year until committed Program of Record (POR) funds are received.  The Program Integration Office will execute projects as approved and will develop new projects that address the most critical COCOM needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.000"
                                            },
                                            "Text": {
                                                "val": "Continue to provide COCOM direct participation to enable COCOM staff participation in developing and executing JCTD projects, ensuring direct warfighter input and proper focus of JCTD projects.  Sustain selected completed JCTD efforts until POR funds are received.  Develop and execute projects as proposed by COCOMs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Technologies (ET)"
                                    },
                                    "Description": {
                                        "val": "The ET fund is used to rapidly assess or mature emerging capabilities requested by COCOMs prior to determining whether a JCTD project should be initiated.  Emerging Technology investments are small, short (less than one year) efforts that may lead to JCTD proposals, depending on the COCOM assessment and determination of technical maturity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.931"
                                            },
                                            "Text": {
                                                "val": "Projects included increased availability of Ultra High Frequency Satellite Communications for disadvantaged users in support of Personnel Recovery; assessment of a tactical data fusion module that addresses cyber vulnerabilities; conduct proof-of-concept of a Resource Assurance framework with emphasis on community and regional stability; secured access to current and reliable geospatial data in U.S. African Command (AFRICOM) area of  responsibility; development of an internationally accepted assessment tool for disaster preparedness and risk reduction; maturation of a coherent situational awareness and effective command and control across government, non-government, and foreign partners during Humanitarian Assistance \/ Disaster Relief missions; delivery of cost effective energy to support the Warfighter; deployment of a maritime domain awareness capability in the South China Sea; development of a capability to conduct surveillance, detection, and geo-location of enemy artillery; maturation of a cost effective solution to Unmanned Ground Vehicle's reliability on Global Positioning System; assessment of co-registration technologies of 360 degrees Three Dimensional (3D) laser and camera data; an integration of an E-2 aircraft Stand-Off Combat Identification capability; and demonstration of a capability to send “call-for-help” message with a DoD Common Access Card (CAC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "39.000"
                                            },
                                            "Text": {
                                                "val": "Projects will be determined based on the rapid assessment or maturing of emerging capabilities requested by COCOMs, inter-agency partners, and\/or DoD leadership that are intended to mitigate technical risks prior to determining whether a JCTD project should be initiated.  Selected effort will be small, focused, and executable in less than one year and require a concrete deliverable (prototype hardware and\/or software, integrated subsystem, tech assessment report, etc.).  Desired ET attributes include technology maturation, leads to risk mitigation, partner contributions, and directly responds to COCOM needs.  Additionally, in FY 2013, ETs include \"Disruptive Demonstrations\" to support development\/demonstration of time-sensitive capabilities that address Secretary\/Department Strategic Vectors, and Chairman’s Gap Assessment of capability shortfalls."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "Projects will continue to be determined based on the rapid assessment or maturing of emerging capabilities requested by COCOMs, interagency partners, and\/or DoD leadership that are intended to mitigate technical risks prior to determining whether a JCTD project should be initiated.  Selected effort will be small, focused, and executable in less than one year and require a concrete deliverable (prototype hardware and\/or software, integrated subsystem, tech assessment report, etc.).  Desired ET attributes include technology maturation, leads to risk mitigation, partner contributions, and directly responds to COCOM needs. In FY 2014 a new project code (P264) was initiated for Disruptive Demonstrations.  ET funds allocated to that effort in FY 2013 are now reflected in project code P264."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Smart Power Infrastructure Demonstration for Energy Reliability and Security (SPIDERS)"
                                    },
                                    "Description": {
                                        "val": "SPIDERS will demonstrate cyber-secure “smart” micro-grids with demand side management and integration of renewable energy and storage on military installations, in partnership with Department of Homeland Security (DHS) and Department of Energy (DOE).  The expected output and efficiency to be demonstrated is a reduction in the “unacceptably high risk” of extended electric grid outages by developing the capability to “island” installations while maintaining operational surety and security."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "Completed micro-grid technical design for Joint Base Pearl Harbor-Hickam, HI and Fort Carson, CO.  Procured long lead items for demonstrations.  Installed micro-grid technologies.  Validated the energy management control system with the cyber security evaluation tool.  Received delivery of five Smith electric vehicles and two-way charging stations.  Started preparation for the demonstrations at Joint Base Pearl Harbor-Hickam, HI and Ft. Carson, CO.\n\nIn FY 2013, the program will perform circuit level micro-grid demonstration at Joint Base Pearl Harbor-Hickam, HI and a larger smart micro-grid demonstration with cyber defense and vehicle-to-grid storage at Ft. Carson, CO.  The program will develop conceptual design and complete technical micro-grid design for Camp Smith, HI and validate micro-grid technologies and systems for Camp Smith, HI.  Perform final operational demonstration of installation level cyber secure smart micro-grid and battery storage with island capability at Camp Smith, HI during the Makana Pahili hurricane exercise.  Determine the military utility of the technologies and procedures demonstrated.  Transition the technologies to DoD, and DOE and to other governmental and public energy agencies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed Container Delivery System (HSCDS)"
                                    },
                                    "Description": {
                                        "val": "HSCDS will integrate aerial delivery components to provide a cost effective, high speed ingress or egress, low-altitude, accurate Point of Need Delivery capability, which reduces exposure to threats for aircrew, aircraft, and ground receiving units.  HSCDS will provide parachute-extracted Container Delivery System with C-130J and C-17 aircraft at maximum ramp open airspeed from as low as 250 feet above ground level.  This provides warfighters the ability to conduct low altitude, fast and accurate resupply (up to 16,000 pounds of supplies via eight Containerized Delivery System bundles) to small combat units while maintaining aircraft maneuverability, thus reducing threat exposure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.466"
                                            },
                                            "Text": {
                                                "val": "Continued integration of aerial delivery components and testing of HSCDS threshold capabilities (low speed) and initial testing of objective capability (high speed).  Conducted developmental testing and executed operational demonstration #1.  In FY 2013, the program will field Low Speed capability to theater, execute operational demonstration #2 (C-17 high speed), finalize integration of components to meet objectives, test at objective capabilities, and plan for execution of final operational demonstrations.  The program will field High Speed capability (C-17) to theater, execute operational demonstration #3 (C-130J high speed), field High Speed capability (C-130J) to theater, conduct final testing at objective capabilities, and execute seamless transition of HSCDS capability to Program of Record with Army Product Manager Force Sustainment Systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Predator (MP)"
                                    },
                                    "Description": {
                                        "val": "MP will demonstrate the ability to conduct clandestine, intrusive unmanned maritime operations in high-threat restricted water areas of interest from a safe standoff.  MP will provide several platform payload combinations as a residual capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.100"
                                            },
                                            "Text": {
                                                "val": "Demonstrated two platforms and three payloads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Transition residuals for operational use (details are classified).  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Preferred Force Generator (PFG)"
                                    },
                                    "Description": {
                                        "val": "PFG provides planners the capability to rapidly and accurately generate and refine preferred force lists to help expedite the planning process and provide the critical data needed for course-of-action analysis, transportation feasibility, and assessments for rapid force availability.  Net-centric technologies will be employed to provide the service across the enterprise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.385"
                                            },
                                            "Text": {
                                                "val": "Developed PFG services that interface with the Joint Capabilities Resource Manager sourcing capability to rapidly populate a Time Phased Force Deployment List with preferred forces for a contingency plan.  Conducted Technical Demonstrations and a Limited Operational User Assessment.  Incorporated Attribute Based Access Control.\n\nDevelop the Concept of Operations (CONOPS) on application of preferred forces across the planning process.  Conduct operational demonstration #2.  Complete the JCTD.  Transition to Defense Enterprise Computing Center."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Global Decision Support (GDS)"
                                    },
                                    "Description": {
                                        "val": "GDS enables senior decision makers to use newer technologies that can deliver decision-quality information for quicker understanding of the situation and provides increased time for course of action (COA) development, risk assessment, and decision-making.  GDS technologies provide digital conferencing capabilities that augment the current analog capabilities in the national senior leader conferencing capabilities and leverage Defense Red Switch Network and secure Voice Over Secret Internet Protocol Router Network (SIPRNET) technologies.  GDS provides authoritative data, secure mobile devices and improved visualization tools to enable a decision focused COA development and analysis for senior leaders in support of space and air events.  Program outputs and efficiencies are improved collaboration capabilities supporting emergent time-critical events to provide senior leaders with rapid situational awareness to effectively respond or develop appropriate courses of actions for missile and space events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.450"
                                            },
                                            "Text": {
                                                "val": "Integrated the Global Sensor Integrated Network display with secret level secure mobile devices to support worldwide voice and data conferences.  Transitioned GDS services to the Integrated Strategic Planning and Analysis Network Program of Record.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Computer Adaptive Network Defense-in-Depth (CANDID)"
                                    },
                                    "Description": {
                                        "val": "CANDID will demonstrate the integration of Virtual Secure Enclaves (VSEs) inside existing tactical networks to enable network defense-in-depth and ensure Command and Control (C2) capabilities despite hostile attempts to hack, disrupt, and deny computer networks.  CANDID will increase security of vital C2 capabilities in a cyber-contested environment; prevent infiltration from external threats, ex-filtration of protected information, and C2 denial of service; and deliver cyber surveillance and situational awareness through fusion of heterogeneous sensor data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.353"
                                            },
                                            "Text": {
                                                "val": "Installed CANDID equipment on U.S.S. George Washington.  Demonstrated and assessed prototype VSE SIPRNET C2 capability at U.S. Pacific Command, U.S. Pacific Fleet\/Joint Task Force 519, and functional components.  Demonstrated CANDID in CLOUDBREAK."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.315"
                                            },
                                            "Text": {
                                                "val": "Harden leave behind\/transition ready VSE SIPRNET C2 capability at U.S. Pacific Command, U.S. Pacific Fleet\/Joint Task Force 519, and functional components.  Transition capability to U.S. Navy and Defense Information Systems Agency.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative Coalition Collection Environment (C3E)"
                                    },
                                    "Description": {
                                        "val": "C3E is a language independent intelligence data collection interface usable by U.S. and Coalition forces with initial fielding to support the Operational Control (OPCON) transformation on the Korean Peninsula.  C3E reduces data collection errors by guiding the user to choose a variety of options using cascading drop-down menus.  C3E will enable U.S.\/Korean personnel to describe their requirements in general military terms, symbols, and graphics within their native language.  C3E reduces reliance on specialized skills, language, and process that are beyond the shared experience of coalition operators.  It improves the ability to gather, manage, and understand collection requirements and tasks in real time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.600"
                                            },
                                            "Text": {
                                                "val": "Obtained authority to operate on Combined Enterprise Regional Information Exchange System–Korea (CENTRIX–K) and Department of Defense Intelligence Information System (DoDIIS) Collection Framework with Mission Manager & Requirements (MM&R) II User Interface.  Conduct Technical and Operational Demonstrations during Key Resolve and Ulchi Focus Guardian Exercises.  Demonstrate services for automated target analysis and transition C3E to the Joint Deployable Intelligence Support System Program of Record."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.662"
                                            },
                                            "Text": {
                                                "val": "Secure interim authority to operate on CENTRIX-K and DoD Intelligence Information System (DoDIIS) Collection Framework with Mission Manager & Requirements (MM&R) User Interface.  Conduct final Operational Utility Assessment in conjunction with the Ulchi-Freedom Guardian 2013 Command Post exercise in Korea.  Defense Intelligence Agency (DIA) will fund transition into Collection Mission Management Application (CMMA) portfolio.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gorgon Stare Smart Link (GS-SL)"
                                    },
                                    "Description": {
                                        "val": "GS-SL will demonstrate the ability to dynamically allocate motion video operational sub-views to available bandwidth at optimum resolution and Quality of Service (QoS), considering variables such as users’ priorities and near-real time (NRT) multi-source intelligence and command and control cues.  This will result in enhanced monitoring and response to the environment (identify sub-views in accordance with dynamic user priorities, mission priorities, events, and multi-source intelligence cues); dynamically prioritized, encoded, and delivered views to optimize QoS; and decision support in accordance with available bandwidth and intelligence requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.900"
                                            },
                                            "Text": {
                                                "val": "Completed QoS management supporting intelligence requirements; conducted assessment based upon a capabilities technical demonstration.  Transitioned initial capability for current estimated potential (CEP) association of near real-time data with operational sub-views and chip-out prioritization to Multi-Source Display (MSD) capability within Gorgon Stare Program of Record (POR), Increment two aircraft.  Delivered full smart information management and allocation capability with MSD system upgrades to GS POR.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Warfighting Integrated Network Operations (NetOps) (JWIN)"
                                    },
                                    "Description": {
                                        "val": "JWIN will consolidate independent Service network management information into a single integrated network management view that uses a JWIN gateway to translate service specific network information into a common format.  This common format allows for the integration of policy controls to enhance the Joint Force Commander’s decision making process over network resources.  Key benefits include enhanced situational awareness of network events on critical operations and end-to-end network distributed policy collaboration and management capabilities used to communicate authoritative direction over critical network resources.  Joint Tactics, Techniques, and Procedures (JTTPs) will be identified to ensure a joint procedural construct is established.  JWIN provides the Joint Task Force Commander a consolidated network view which affords him\/her the ability to monitor and influence tactical NetOps supporting associated missions to implement the Commander’s intent."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Text": {
                                                "val": "Continued integration and testing of network management technologies.  Conducted two Technical Demonstration events and two Operational Demonstration events.  Developed an acquisition strategy to implement Joint Warfighting Integrated NetOps components.  Developed JTTPs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.263"
                                            },
                                            "Text": {
                                                "val": "Conduct final Technical Demonstration and Operational Demonstration.  Provide Joint\/Military Utility Assessment.  Finalize Concept of Operations and proposed JTTPs.  Provide U.S. Pacific Command with a leave behind capability.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Technologies for Unmanned Aerial Systems (ATUAS)"
                                    },
                                    "Description": {
                                        "val": "ATUAS will integrate a series of technologies and demonstrate autonomous precision delivery and retrograde to and from a forward point of need in operationally relevant conditions.  It will demonstrate increased mission level autonomy through onboard enhanced autonomous navigation and contingency management software for single operator\/multi-vehicle control of two Unmanned Aerial Systems (UAS) reducing the risks to the Warfighter and enabling improved operational readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "Conducted technical demonstration #1.  Demonstrated, certified, and transitioned the beacon system for the Marine Corps Cargo Unmanned Aerial System (UAS) deployment.  Initiated integration of autonomous delivery beyond line of sight, autonomous enroute re-programming, in-stride multiple drop locations, and control of two vehicles for a single ground control station."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Continue integration and demonstration of autonomous en route re-programming, in-stride multiple drop locations, and autonomous retrograde.  Conduct technical demonstration #2.  In FY 2014, the program will conduct an operational Utility Assessment focusing on autonomous delivery of multiple loads to multiple locations and the conduct of retrograde operations, and transition the technologies to existing UAS Programs of Record (POR) and an anticipated new Service or Joint Cargo UAS POR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Countermeasure Expendable with Replaceable Block Elements for Reactive Unmanned Systems Multi-Mission Jammer (CERBERUS)"
                                    },
                                    "Description": {
                                        "val": "CERBERUS delivers a net-enabled modular expendable jamming system based on the Air Force Miniature Air-Launched Decoy (MALD) that employs replaceable nosecone payloads to counter emerging threats in the PACOM area of responsibility.  CERBERUS reduces overall mission costs by providing reconfigurable & flexible mission weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.431"
                                            },
                                            "Text": {
                                                "val": "Finalized Implementation Directive.  Technical demonstration of non-coherent electronic attack module."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.369"
                                            },
                                            "Text": {
                                                "val": "Complete advanced radar jamming payload assembly and data link electronic attack payload assembly.  Conduct technical and operational demonstration of nose cone assemblies.  Complete Operational Utility Assessment.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Arctic Collaborative Environment (ACE)"
                                    },
                                    "Description": {
                                        "val": "ACE will transition an open-access, web-based, Arctic regional and national decision-support system that integrates data from existing remote sensing assets to provide a monitoring, analysis, and visualization decision-support system based on earth observation data and modeling analysis.  The primary outputs and efficiencies are:  (1) increased Arctic maritime domain awareness to protect maritime commerce, critical infrastructure, and key resources; (2) obtain, analyze, and disseminate accurate data from the entire Arctic region, including both paleo-climatic data and observational data to enable accurate prediction of future environmental and climate; (3) serve as the foundation for an effective Arctic circumpolar observing network with broad partnership from other relevant nations; and (4) engage Russia as a full partner in the development and deployment of an Arctic awareness tool."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.304"
                                            },
                                            "Text": {
                                                "val": "Delivered the ACE Development Server, which will function as the ACE Operational Server during the transition to the National Oceanic and Atmospheric Administration (NOAA) cloud service and the National Ice Center (NIC).  Briefed key US and international organizations about the ACE capability and its value proposition for the Arctic Region and the missions of their organizations.  Conducted several beta testing sessions within the Arctic user community and incorporated feedback into the operational system.  Completed the Technical Demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.424"
                                            },
                                            "Text": {
                                                "val": "Conduct operational testing, deploy the ACE Developmental Server in an operational environment, transition operations to the National Ice Center (NIC), and complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "VIVID POINTER (VP)"
                                    },
                                    "Description": {
                                        "val": "VP will demonstrate the ability to gather, correlate, and fuse low-latency National, Theater and Tactical data while removing sources and collection methods.  This data will be distributed via Link-16 and Global Command and Control System - Joint (GCCS-J) at the SECRET releasable level in order to support counter-Integrated Air Defense and counter-Long Range Aviation missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Conducted Milestone #1 and Milestone #2 demonstrations. In FY 2013, the program will conduct Milestone #3 demonstration; transition residual capability and complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hardened Installation Protection for Persistent Operations (HIPPO)"
                                    },
                                    "Description": {
                                        "val": "HIPPO will develop and validate scalable, resilient-structured solutions to enhance continuity of operations in the face of major disruptions from war.  Emphasis will be on capabilities required to enable\/conduct persistent sortie generation including the ability to recover, refuel\/re-arm\/unload-load, and launch aircraft and the systems that enable these activities.  Solutions analysis will extend to port operations and critical Joint operations normally conducted in garrison to generate and deploy combat power.  HIPPO will demonstrate a range of proven (weapons effect tested) sheltering methods and improved survivability capabilities for critical systems and a companion strategy for phased implementation with schedule and expected costs considering threat, location, mission, and cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.600"
                                            },
                                            "Text": {
                                                "val": "Continued modeling and simulation, and technical demonstrations in testing scaled and\/or full scale section(s) of various hardening constructs against potential threat projectiles with appropriate explosive weights.  Conducted a technical demonstration focusing on expedient, repair and restoration technologies.  Completed Interim Reports #2 and #3.  In FY 2013, the program will conduct an operational Utility Assessment focusing on expedient, repair and recovery technologies, transition the hardening, repair and recovery capabilities to the Guam Strike and other appropriate Programs of Record, determine the military utility of the technologies and procedures demonstrated, and complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Extended Range Illumination Projectile (JERIP)"
                                    },
                                    "Description": {
                                        "val": "JERIP demonstrates an improved Infrared and Visible Light Illumination capability for maneuver commanders.  JERIP extends Joint Day and Night Vision range by an additional five kilometers, provides 75 percent increase in engagement area footprint coverage, reduces the taxpayer burden and costs by re-using M483 155mm projectile shell bodies in the demilitarized stockpile, and creates a procurement avoidance estimated benefit of $10.000 million."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Successfully completed Technical Demonstrations.  Initiated Operational Demonstrations of the 155mm XM1123 Infrared Illuminating Projectiles and the 155mm XM1124 Visible Light Illuminating Projectiles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Text": {
                                                "val": "Complete Operational Demonstrations and conduct JERIP Joint Utility Assessments.  Transition to Program Executive Office Ammo.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Regional Domain Awareness (RDA)"
                                    },
                                    "Description": {
                                        "val": "RDA demonstrates a standards-based unclassified framework for information sharing between U.S. government agencies and international partners.  RDA will install government off the shelf software to integrate air, land, and sea sensor data to create a multi-domain unclassified information sharing framework between U.S. interagency and local, tribal, and international partners.  RDA will demonstrate (1) assured integration from air, maritime, and land sensors and networks; (2) user defined monitoring and alerting; (3) selective sharing of situational awareness and alerts to multiple defined users; (4) Concept of operations and Tactics, Techniques & Procedures supporting the sharing of unclassified information to non-PKI (Public Key Infrastructure) users; and (5) access to unclassified data and services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Conducted the Information Exchange Package Documentation (IEPD) for defined data sets.  Implemented the initial demonstration software framework.  Integrated and disseminated capabilities for initial defined data sets.  Conducted Technical Demonstration #1 as part of the Trident-Warrior 2012 Fleet Experimentation exercise which demonstrated data sharing between U.S. Southern Command, the United Kingdom, and France (via Net-Centric Enterprise Services); and transition planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.900"
                                            },
                                            "Text": {
                                                "val": "Develop Concept of Operations and Tactics, Techniques, and Procedures.  Conduct transition planning, Technical Demonstration #2, demonstrate partner nation data and services, federated services between multiple sites, and data mediation services.  Conduct Operational Demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "Conduct Limited Operational Utility Assessment (LOUA); transition to Defense Information Systems Agency and U.S. Southern Command.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Three Dimensional Landing Zone (3D-LZ)"
                                    },
                                    "Description": {
                                        "val": "3D-LZ will deliver an integrated sensor suite capable of providing rotorcraft pilots with situational awareness during degraded visual environments encountered on takeoff and landings, cable warning and obstacle avoidance cues, and general terrain awareness for safety of flight.  The program will deliver an integrated turret to the Global Reach Program Office."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.401"
                                            },
                                            "Text": {
                                                "val": "Finalized Implementation Directive.  Conducted kickoff meeting.  Conducted ground based technical demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.050"
                                            },
                                            "Text": {
                                                "val": "Conduct technical and operational demonstrations of sensor package in flight tests.  Complete Operational Utility Assessment.  Complete the JCTD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Complete Operational Utility Assessment.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Jam Precision Guided Munitions (AJPGM)"
                                    },
                                    "Description": {
                                        "val": "AJPGM will deliver precision navigation capability to severely Global Positioning System (GPS)-jammed environments.  AJPGM will also deliver home-on-jam capability.  Specifics related to technologies, current capability, and threats are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.826"
                                            },
                                            "Text": {
                                                "val": "Finalized Implementation Directive.  Completed fabrication and testing of home-on-jam sensor.  Conducted technical demonstration using hardware in the loop facility."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Complete anti-jam sensor assembly.  Complete system integration.  Conduct technical\/operational demonstration integrated assemblies.  Complete Operational Utility Assessment.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Strike Fighter (JSF) Enterprise Terminal (JETpack fifth to fourth)"
                                    },
                                    "Description": {
                                        "val": "JETpack fifth to fourth supports the airborne gateway needs to distribute fifth Generation (Gen) data to fourth Gen fighters by translating their tactical data link into Link-16 messages that can be viewed by the fourth Gen aircraft.  JETpack will demonstrate:  (1) four flyable prototype dual-band, multi-beam antennas, (2) two JET terminals, and (3) two dual-band remote electronics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.848"
                                            },
                                            "Text": {
                                                "val": "Conducted technical demonstrations to include the JET terminal with Intra-Flight Data Link (IFDL), and a dual-band, multi-beam antenna lab test."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.352"
                                            },
                                            "Text": {
                                                "val": "Finalize operational demonstrations and assessments on the flyable prototypes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Finalize integration of JETpack flyable prototype into test aircraft, receive safety of flight certification, conduct pre-flight tests, conduct the operational utility assessment and initiate transition to the F-15C community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Mobility Appliqué System (AMAS)"
                                    },
                                    "Description": {
                                        "val": "AMAS will equip existing military ground vehicles with scalable modes of robotic technology through the integration of modular kits, common interfaces, and a common architecture.  AMAS will be comprised of a By-Wire kit that will provide active safety functionality and a standard control approach that will allow for current and future robotics to be implemented relatively seamlessly onto military tactical vehicles, and an Autonomy kit that will contain the primary sensing and intelligence for scalable modes of autonomy and leader\/follower behaviors for convoy operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.725"
                                            },
                                            "Text": {
                                                "val": "Conducted a detailed requirements analysis.  Initiated development of By-Wire and Autonomy kits.  Received initial delivery of 16 military vehicles.  Procured long lead items for demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Complete development and integration of By-Wire and Autonomy kits.  Install technologies on military vehicles.  Conduct a Technical Demonstration on the first eight tactical Army and Marine Corps vehicles and transition those residuals to the Army and Marine Corps."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.450"
                                            },
                                            "Text": {
                                                "val": "Complete development on additional levels of autonomy on the AMAS kits.  Conduct two Technical Demonstrations and final Operational Demonstration culminating with a Military User Assessment.  Residuals from the Operational Demonstration will transition to Army and Marine Corps.  AMAS JCTD results will transition-to and inform the Army AMAS Program of Record.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CELESTIAL REACH"
                                    },
                                    "Description": {
                                        "val": "CELESTIAL REACH addresses the limitations placed on high-priority and senior leader communications existing as a result of current Communications Satellite (COMSAT) capability and data throughput.  Presently limited to a maximum data rate of 256 kilo bites per second (kbps) to\/from the aircraft, capacity to maintain global communications is further impacted by peak-period COMSAT user saturation.  This JCTD provides USSOCOM the capability and capacity to communicate effectively using a robust (up to three Mbps forward link; 512 Kbps return link) C-17 portable hatch mounted satellite antenna (HMSA) during crisis in response to Chairman of the Joint Chiefs of Staff Concept of Operations Plan and other contingency requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.140"
                                            },
                                            "Text": {
                                                "val": "Completed hatch assembly prototype (form and fit only; not fully functional); Critical Design Reviews (hatch assembly and antenna, separate events)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.370"
                                            },
                                            "Text": {
                                                "val": "Conduct Technical Demonstration Readiness Review and Technical Demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.380"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.380"
                                            },
                                            "Text": {
                                                "val": "Complete HMSA aircraft fit check\/verification; Operational Demonstrations; Joint Utility Assessment; Limited Operational User Assessment; JCTD Final Report; and one HMSA flight certified prototype.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deep Seaweb (DSW)"
                                    },
                                    "Description": {
                                        "val": "DSW provides a capability to persistently detect and monitor high traffic maritime areas of interest to find\/fix\/track illicit traffickers in source and transit zones.  DSW will deliver an undersea-network of fixed bottom sensor nodes, mobile unmanned communication gateways, and an operations center server that will provide autonomous 24\/7 tripwire surveillance that cue coalition forces of trafficking threats including fully submersible vessels.  This information will be available to the tactical decision makers for near real-time action by U.S. or partner nation detection and monitoring assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "Procured and fabricated two sensor-node-systems, one mobile gateway, and an operations center server.  Conducted bench-top testing and evaluation of components.  Updated concepts of employment and operations.  Developed Technical Demonstration one plan."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.250"
                                            },
                                            "Text": {
                                                "val": "Conduct technical demonstration in deep water to validate undersea communication ranges and data-throughput.  Develop and evaluate procedures for deep water sensor node deployment, sensor node localization, and recovery.  Conduct end-to-end system tests to demonstrate connectivity to operational center.  Conduct technical demonstrations (two-node, one-gateway).  Procure and manufacture seven sensor-node-systems and two mobile gateways."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.350"
                                            },
                                            "Text": {
                                                "val": "Conduct technical demonstration in operationally representative environment to evaluate integration with operations center workflow.  Conduct operational demonstration.  Transition operations to Joint Inter-Agency Task Force, South.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Installation Access Control (DIAC)"
                                    },
                                    "Description": {
                                        "val": "DIAC will develop an identity management enterprise service's architecture that will provide timely, accurate, and actionable information to support the installation access control decision-making process based on authoritative data sources such as the National Crime Information Center and Terrorist Screening Database in order to initially and continuously vet all personnel prior to entry to DoD installations worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.975"
                                            },
                                            "Text": {
                                                "val": "Identified and coordinated resolution of relevant policy and privacy issues.  Completed analysis of user requirements and identified performance metrics.  Completed analysis of alternative architectural designs and information management modules."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Text": {
                                                "val": "Integrate installation access control systems with the Defense Enrollment Eligibility Reporting System, DoD local population database, Interoperability Layer Service and Continuous Information Management Engine.  Demonstrate the full architecture integrating National Crime Information Center, Terrorist Screening Database, Service Criminal Justice System databases, and non-DoD credential revocation lists."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.205"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.205"
                                            },
                                            "Text": {
                                                "val": "Conduct final operational demonstration at selected military installations and complete independent assessor report.  U.S. Northern Command sponsor will issue final operational utility determination.  Transition DIAC capabilities into Programs of Record.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Foliage Penetrating Airborne Light Detection and Ranging (LIDAR) for Reconnaissance Imaging (FALCON-I)"
                                    },
                                    "Description": {
                                        "val": "FALCON-I will provide a unified foliage penetrating (FOPEN) sensing system that collects, processes, and fuses LIDAR and Ultra High Frequency (UHF) Synthetic Aperture Radar (SAR) to produce a comprehensive three dimensional (3D) view of human activity, terrain, and lines of communication obscured by foliage.  The ultimate goal of the FALCON-I is to provide analysts and Warfighters a simple to understand 3D image of foliage obscured target areas of interest."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.850"
                                            },
                                            "Text": {
                                                "val": "Conducted FALCON-I system development, integration, and demonstration of exploitation and fused data systems.  Integrated FOPEN SAR and LIDAR on a common platform, and automated LIDAR data processing and exploitation algorithms.  Developed deployable ground processing hardware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.175"
                                            },
                                            "Text": {
                                                "val": "Perform FOPEN\/Polarimetric LIDAR testing and demonstration to include new algorithms for data fusion and exploitation, enhancement of existing hardware for dissemination, storage, visualization, and recovery of data.  Develop Concept of Operations and Tactics, Techniques and Procedures, and an initial polarimetric LIDAR assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "Complete the Operational Demonstration, Fuse SAR\/LIDAR Exploitation System Assessment, and Joint Military Utility Assessment.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Volume & Velocity (IV2)"
                                    },
                                    "Description": {
                                        "val": "IV2 will provide a data discovery and processing capability that enables users to identify and visualize patterns, trends and changes in publicly available information over time and space to enhance decision-making purposes.  It will leverage technologies and processes from successful commercial applications to deliver accurate and actionable information to support: the strategic decision-making process; real-time situational awareness; and long-term proactive analytics for strategic planning.  The capability will be a cloud-based system that gathers data from personal and mainstream media, including audio, video, and geo-location, and will sort, analyze, and display that data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "Developed a relevant set of operational requirements with input from a range of potential operational users, including guidance from General Counsel.  Derived a set of technical specifications to satisfy the operational requirements.  Developed prototype modules for data gathering and display, and tested those modules."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "Expand the set of modules and develop a prototype user interface.  Test individual modules for acceptance of languages and multiple data types.  Integrate proven modules into a complete IV2 application.  Test the system in the lab and in multiple operational scenarios, and refine the system based on operator feedback.  Test for scalability and begin the Certification and Accreditation process.  Begin transition of the IV2 capability to intended Programs of Record at the Defense Information Systems Agency and U.S. Army Special Operations Command.  Complete the Certification and Accreditation process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Kestrel Eye"
                                    },
                                    "Description": {
                                        "val": "Kestrel Eye is a very small, 25 kilogram class satellite that provides “good enough” 1.5 meter resolution visible imagery.  Imagery tasking and delivery is controlled directly by the Combatant Commander to ensure sufficient timelines for near real-time situation awareness and decision-making in the field.  The cost of less than $1.500 million for a Kestrel Eye enables an affordable constellation for persistence, near continuous converge between 45 degrees North\/South.   The primary outputs and efficiencies are:  (1) Finish one Block 1 “proof of concept” design, launch Block 1 Kestrel Eye and conduct on-orbit evaluation and upgrade Block 2 design with propulsion system and improved telescope pointing using a star tracker.  The JCTD will build and launch three Block 2 design Kestrel Eye satellites."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.265"
                                            },
                                            "Text": {
                                                "val": "Completed assembly of one Block 1 design “proof of concept” Kestrel Eye."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.317"
                                            },
                                            "Text": {
                                                "val": "Launch one Block 1 design.  Complete construction of three Block #2 design Kestrel Eyes, adding propulsion for station-keeping and a star tracker for increasing pointing accuracy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.158"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.158"
                                            },
                                            "Text": {
                                                "val": "Depending on launch opportunities, launch three Block 2 design Kestrel Eyes and conduct operational demonstrations and assessments.  Initiate transition to the U.S. Army Program Executive Office, Missiles & Space.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Kinetic\/Non-kinetic Integrated Force Effects (KNIFE)"
                                    },
                                    "Description": {
                                        "val": "KNIFE will provide Combatant Commanders with four dimensional (4D) views of composite effects that dynamically updates to inform strategic and operation decision-making in a compressed timeframe.  KNIFE provides an integrated, enterprise capability that models multiple effects for planner collaboration and Commander decision.  The integrated disciplines are comprised of cyber, electronic warfare, kinetic and space effects.  The primary metric is more robust, accurate and timely targeting management during planning and execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.250"
                                            },
                                            "Text": {
                                                "val": "Defined information flow and data environment for effects and assessment.  Integrated and visualized physical and functional effects and collateral damage."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.800"
                                            },
                                            "Text": {
                                                "val": "Dynamically update and share 4D views of effects.  Provide machine to machine consumption of cyber, electronic warfare, space, and kinetic data.  Produce composite effects and collection objectives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Text": {
                                                "val": "Publish sequenced tasks for in-line approval by decision makers.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Wireless Communications (NGWC)"
                                    },
                                    "Description": {
                                        "val": "NGWC will develop and demonstrate the utility of NGWC mesh protocol which provides continuous visibility of material and equipment with less work and lower cost than other tracking technologies.  The same mesh network will support asset tracking in-transit visibility (ITV) and collection of sensor data from tags monitoring equipment condition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.808"
                                            },
                                            "Text": {
                                                "val": "Initiated development, software upgrades, and conducted a detailed requirements analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.770"
                                            },
                                            "Text": {
                                                "val": "Complete development of the mesh network protocol to include security and sensor integration.  Conduct developmental tests focusing on ability to track both NGWC mesh tags and Radio Frequency Identification (RFID) tags, improving asset tracking and ITV and the capability to write NGWC mesh tags over the mesh using legacy information systems.  Finalize integration and conduct technical and operational demonstrations of a ready-to-use system, interoperable with active RFID."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.445"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.445"
                                            },
                                            "Text": {
                                                "val": "Execute technical and operational demonstrations to test, demonstrate, and deliver interface to Common Logistics Operating Environment and Condition Based Maintenance Plus sensors and devices.  Determine the military utility of the technologies and procedures demonstrated.  Transition the NGWC protocol and software, and DoD-compliant architecture to Army Program Executive Office Enterprise Information Systems.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Open Geospatial User Environment (ROGUE)"
                                    },
                                    "Description": {
                                        "val": "ROGUE will deliver operational open geospatial analytic and Volunteered Geospatial Information (VGI) services, Concept of Operations, Tactics, Techniques, and Procedures (TTPs), and work flows\/processes.  ROGUE will provide Web-based geospatial capability linking Joint Task Force Headquarters components to the tactical edge of mixed U.S., partner nation, interagency components, and private sector Nongovernment Organizations.  ROGUE will facilitate accessibility from multiple user platforms (Web-portal, Desktops, Smart Phones, etc.) to enable partnering with agencies and countries conducting Humanitarian Assistance\/Disaster Relief support missions in support of Theater Security Cooperation and Humanitarian Assistance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.935"
                                            },
                                            "Text": {
                                                "val": "Identified user requirements and initiated analysis of open geo-spatial standards integration.  Established architecture for Virtual Machine Templates and web processing services for hand held mobile data generation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Text": {
                                                "val": "Develop and implement:  five applications addressing differing classes of functionality; and, software services to support the end user environments (Pacific Disaster Center, State Department Human Information Unit, DoD, Non-Governmental Organization) providing analytic Open Layers capability.  Integrate software solutions to the Geospatial software platform.  Develop open back-end services to include the incorporation and managing of geospatial updates from various sources.  Develop four location based applications that will have a direct connection to data storage and Support Service Oriented Software and Cloud implementation with scalability based upon the virtual Machine Template.  Develop “end to end” Geographical Information System service.  Perform developmental testing and operational assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.715"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.715"
                                            },
                                            "Text": {
                                                "val": "Perform final operational utility demonstration and complete independent assessor report.  United States Southern Command sponsor will issue final user utility determination.  Transition ROGUE tools and standards across the community of interest.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space & Missile Defense Command (SMDC) Nanosatellite Program (SNaP-3)"
                                    },
                                    "Description": {
                                        "val": "SNaP-3 provides low orbit tactically integrated beyond-line-of-sight communications nanosatellites for the U.S. as well as for partner nation radios and unattended ground sensors.  It provides user service on demand with minimal training requirements.  The JCTD will have three nanosatellites built and tested.  It will launch and conduct the operational demonstration and Utility Assessment and provides a residual operational capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.275"
                                            },
                                            "Text": {
                                                "val": "Initiated the JCTD.  Conducted Government kickoff and released final Implementation Directive (ID) draft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.575"
                                            },
                                            "Text": {
                                                "val": "Complete the build and testing of three nanosatellites and associated ground hardware and launch three nanosatellites.  Conduct operational demo and utility assessment.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier-Warfighter Operationally Responsive Deployer for Space (SWORDS)"
                                    },
                                    "Description": {
                                        "val": "SWORDS provides a dedicated, low cost, rapid and predictable launch of small satellites to precise, optimum orbits.  Enables capability to satisfy Combatant Command’s urgent needs for augmentation of persistent imagery or communications in their Area of Responsibility.  When in production, SWORDS is targeted to cost $1.000 million per launch of 25 kilogram payloads up to a 750 kilometers circular orbit from a wide variety of ranges, including austere locations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.370"
                                            },
                                            "Text": {
                                                "val": "Prime contractor incorporated design results of analyses provided by National Aeronautics and Space Administration.  Procurement of materials by subcontractors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.060"
                                            },
                                            "Text": {
                                                "val": "Construct and test fire first stage engine in ground test stand."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.530"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.530"
                                            },
                                            "Text": {
                                                "val": "Conduct suborbital flight test.  Conduct orbital flight test.  Initiate transition to the U.S. Army PEO Missiles & Space.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unified Command and Control (UC2)"
                                    },
                                    "Description": {
                                        "val": "The UC2 JCTD provides the capability that will support discretionary information sharing on a common network with compartmented network protection.  UC2 will provide network enclaves to allow operational commanders to manage cyber risk to their own mission without introducing risk to the Global Information Grid.  UC2 will provide key lessons learned for assured terrestrial transport to protect core Command and Control (C2) in anti-access\/area denial environments and will allow greater access to assured C2 with Component Commanders, Joint Task Forces, and functional component headquarters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "Initiated requirements and implementation activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "UC2 will install and test the Common Mission Network Transport (CMNT) and Agile Virtual Enclave (AVE) at four U.S. Pacific Component Commanders for data exchange with Defense Information Systems Agency and Services on DoD networks.  The technical demonstration will be conducted."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "UC2 will install and test CMNT and AVE at three additional sites.  The Operational Demonstration and Joint Utility Assessment will be conducted.  Transition to Defense Information Systems Agency and U.S. Navy for sustainment.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vector"
                                    },
                                    "Description": {
                                        "val": "Vector will launch two cube satellites for an on-orbit technical demonstration and operational utility assessment.  The system will continue to be used for operations until reaching their respective end-of-life.  Additional details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.705"
                                            },
                                            "Text": {
                                                "val": "Completed ground segment development and began to develop Joint Capabilities Integration and Development System (JCIDS) documentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.675"
                                            },
                                            "Text": {
                                                "val": "Launch two Cube Satellites, complete on-orbit checkout and conduct demonstration tests resulting in an operational on-orbit prototype.  Continue to develop JCIDS documentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.670"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.670"
                                            },
                                            "Text": {
                                                "val": "Conduct operational test and continue operational availability of the capability.  Complete JCIDS documentation for transition capability.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minor Resource Projects"
                                    },
                                    "Description": {
                                        "val": "The JCTD program completed the following minor projects in FY 2012:  Joint Multi-Effects Warhead System (JMEWS), Sea Tracker, Prepositioned Expeditionary Assistance Kit (PEAK), SENSORWEB 2, Daily Watch and Non-Persistent Desktop Browsing (NPDB).  Combined End-to-End EMIO (Expanded Maritime Interdiction\/Interception Operations) Performance Optimization (C3PO) and Humanitarian Expeditionary Logistics Program (HELP) were started in FY 2012 and will continue into FY 2013."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.836"
                                            },
                                            "Text": {
                                                "val": "Completed Joint Multi-Effects Warhead System (JMEWS), Sea Tracker, Prepositioned Expeditionary Assistance Kit (PEAK), SENSORWEB 2, Daily Watch, and Non-Persistent Desktop Browsing (NPDB).  Began C3PO and HELP."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "Complete and transition C3PO and HELP."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ACE 202 (CLASSIFIED)"
                                    },
                                    "Description": {
                                        "val": "Details are Classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.600"
                                            },
                                            "Text": {
                                                "val": "Details are Classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Details are Classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2013 Combatant Commands' (COCOM) Priorities"
                                    },
                                    "Description": {
                                        "val": "The first group of FY 2013 JCTD projects was identified at a Candidate Nomination Board in May 2012 followed by a Candidate Decision Board in August 2012.  This allowed the Department to rapidly execute the JCTDs needed in FY 2013 to meet the COCOMs most pressing needs as soon as FY 2013 funds became available.  COCOMs proposed projects addressing a range of capability gaps including:  project power despite anti-access\/area denial challenges; defending the Homeland and providing support to civil authorities; conducting humanitarian, disaster relief, and other operations; counter terrorism; and irregular warfare.  Additional COCOM proposals were acted on throughout the year to address emerging needs as funds were identified."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.572"
                                            },
                                            "Text": {
                                                "val": "Fund the first year of FY 2013 projects selected for approval at the August 2012 Candidate Decision Board or identified by Senior Department Leadership or COCOM Commanders to solve COCOM priority shortfalls.  In addition, in FY 2013 a portion of the funds were allocated to enabling technologies to resource \"Disruptive Demonstrations\" in support of development\/demonstration of time-sensitive capabilities that address Secretary\/Department Strategic Vectors and Chairman’s Gap Assessment of capability shortfalls."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.450"
                                            },
                                            "Text": {
                                                "val": "Fund the second year of the FY 2013 projects that are scheduled to proceed to a second year."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2014 Combatant Commands (COCOM) Priorities"
                                    },
                                    "Description": {
                                        "val": "JCTD projects that support COCOM priorities are linked directly to COCOM integrated priority lists and validated joint operational needs statements.  FY 2014 JCTD projects will be identified under the JCTD selection process beginning with a Candidate Nomination Board in the spring of FY 2013, followed by a Candidate Decision Board (CDB) in the Summer of 2013.  This allows the Department to rapidly execute the JCTDs needed in FY 2014 to meet the COCOMs' most pressing needs as soon as FY 2014 funds become available.  Additional CDBs will be held throughout the year to address emerging COCOM needs.  JCTDs identified in these CDBs will be initiated as funds are identified."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "83.375"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "83.375"
                                            },
                                            "Text": {
                                                "val": "Fund the first year of the FY 2014 projects that are selected by the CDB or identified by Senior Leadership.  Complete JCTD projects started in FY 2011 and FY 2012.  Work closely with the Joint Staff and the various Combatant Commanders to develop technology to shape future engagements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Performance Computing Modernization (HPCM)"
                                    },
                                    "Description": {
                                        "val": "HPCM provides high performance computing hardware, parallel software, wide area networking services, and expertise that enable the Department of Defense (DoD) Research, Development, Test, and Evaluation (RDT&E) community to investigate and understand physical phenomena and behavior of systems through large scale computational simulation.  The JCTD program sub-allocated $21.300 million to Army for this effort and was subsequently remunerated.  During the FY 2012 Continuing Resolution (CR) period (September to December 2011), Office of the Secretary of Defense (OSD) funds from the JCTD program were used for critical operations of the HPCMP Army program.  The HPCMP was devolved from OSD to Army as part of the FY 2011 Secretary of Defense efficiencies initiative.  Under Continuing Resolution rules, Army could not fund the HPCMP new start initiative and did not have the prior year budget authority for HPCMP.  Thus, OSD JCTD program funds were used for HPCMP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.300"
                                            },
                                            "Text": {
                                                "val": "The accomplishments of this effort are reflected in the U.S. Army budget Program element 0603461A."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "JCTD capabilities that demonstrate operational utility transition to acquisition via one of several methods:\n- The capabilities address a documented capability gap in an existing Program of Record, so that the existing Program can acquire, further develop, sustain, and provide the capability under existing program documentation.\n- The capabilities address capability gaps that naturally fit with an existing Program of Record, but program documentation addressing the new capabilities does not exist.  In these cases, existing program documentation (such as the Capabilities Development Document or Capabilities Production Document) is revised to include the new capabilities from the JCTD, and the JCTD capabilities transition to the Program of Record.\n- The capabilities address a current operational need without requiring Program of Record changes.  In these cases, the JCTD capabilities may transition directly to operational use, with sustainment (operations and maintenance) funding arranged through the gaining command.  \n- The capabilities may be widely applicable commodity products, useful to many commands.  In these cases, the commodity products listed on General Services Administration schedule, and made available for purchase by any commands needing the capability, using procurement funds."
                        },
                        "PerformanceMetrics": {
                            "val": "Strategic Goals Supported in FY 2014:\n- Project Selection Focus\n- Spiral Technologies to Fielded Capabilities\n- Time to Final Demonstration\n- 70 Percent Transition Rate \n- Adequately Shared Funding and Visibility\n- Independent Assessment Capability\n- Successful Military Utility Assessment (MUA)\n\nThe majority of funding from this program element is forwarded to the Services\/Defense Agencies that execute the individual JCTD projects.  The Director, JCTD Program, maintains and provides overall programmatic oversight for the JCTD program, to include the individual JCTD projects.  The JCTD performance metrics center on how fast relevant joint and\/or transformational technologies can be demonstrated and provided to the joint warfighter.  These metrics are driven by the overall business process which includes six parts:  (1) selection focus; (2) ability to spin-off spiral technologies; (3) time necessary to complete a final demonstration; (4) adequately resourced projects with appropriate oversight; (5) capability to complete an independent assessment of the technology; and (6) the number of successful capabilities that are actually transitioned to the warfighter.  \n\nMEASURABLE OUTCOMES:  Metrics include:  all JCTDs will deliver products within 12 months to enable assessment for project continuation; 50 percent of JCTDs will provide an operationally-relevant prototype within 12 months and 75 percent will complete final demonstration within 24 months of Implementation Directive signature.  JCTDs will spiral products and deliverables during the demonstration.  At least 75 percent of JCTD projects will transition products to Programs of Record (POR), sustained residual operations, or availability for procurement from the General Services Administration Schedule.\n\nTransition Achievement:  The JCTD program has been achieving actual transition rates of over 80 percent, well in excess of the Assistant Secretary of Defense (Research and Engineering) stated goal of 40 percent.  The JCTD Program defines transition as all or components of the demonstrated JCTD going to a new or existing POR, providing fieldable-prototypes (residual capabilities) sustained by non-JCTD funds in direct support of operations, or commodity-type capabilities entered onto GSA schedule for procurement by Department users.  13 of 16 completions in FY 2012 successfully transitioned."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P264"
                    },
                    "ProjectTitle": {
                        "val": "Disruptive Demonstrations"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "22.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.000"
                        },
                        "BudgetYearTwo": {
                            "val": "21.000"
                        },
                        "BudgetYearThree": {
                            "val": "21.000"
                        },
                        "BudgetYearFour": {
                            "val": "20.000"
                        },
                        "BudgetYearFive": {
                            "val": "19.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2014, the \"Disruptive Demonstrations\" project was inserted  to support development\/demonstration of time-sensitive capabilities that address Secretary\/Department Strategic Vectors, and Chairman’s Gap Assessment of capability shortfalls.  As a result, we anticipate less partner funding for those strategic investment areas and will have to rely on greater partner funding for other JCTD projects.  Overall we envision fewer JCTD projects that will be longer in duration."
                        },
                        "ProjectMissionDescription": {
                            "val": "The JCTD program will allocate a portion of the JCTD Enabling Technology funding for Disruptive Demonstrations to solve priority shortfalls identified by Department Senior Leadership or the Chairman's Gap Assessment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Disruptive Demonstrations"
                                    },
                                    "Description": {
                                        "val": "In FY 2014, the department will allocate a portion of the Enabling Technology funding line to technology demonstrations specifically aligned to the Department's strategic vectors (Asian-Pacific, low cost, small footprint operations) and the Chairman's Gap Assessment for capability shortfalls."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.000"
                                            },
                                            "Text": {
                                                "val": "The JCTD program will allocate a portion of the JCTD Enabling Technology funding for Disruptive Demonstrations to solve priority shortfalls identified by Department Senior Leadership or the Chairman's Gap Assessment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The primary acquisition strategy for funding Disruptive Demonstrations will be through Military Inter-Departmental Purchase Requests (MIPRS).  The specifics of each MIPR will be dependent upon the development center, laboratory, contractor or agency requirements and needs.  If an Inter-Agency agreement is required, compliance and coordination of the agreement will be completed in coordination with the receiving activity and Federal Acquisition Regulation 17.5."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are specific to each Disruptive Demonstration effort and include measures identified in the management approach, Statement of Work (SOW) and Period of Performance (POP).  In addition, completions and successes are monitored against schedules and deliverables stated in the initiative's management approach.  Generic performance metrics applicable to the RDT&E initiatives includes attainment of DoD Strategic Objective 3.5.2D. The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology (S&T) program\" and the metrics for this objective is to transition 40 percent of completing demonstration programs per year."
                        }
                    }
                }
            ]
        }
    }
}