{
    "id": "4369473c512314aafcd84197ecc7f1dc719004ec",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602605F"
        },
        "ProgramElementTitle": {
            "val": "Directed Energy Technology"
        },
        "R1LineItemNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "139.769"
            },
            "CurrentYear": {
                "val": "106.196"
            },
            "BudgetYearOne": {
                "val": "112.845"
            },
            "BudgetYearOneBase": {
                "val": "112.845"
            },
            "BudgetYearTwo": {
                "val": "128.153"
            },
            "BudgetYearThree": {
                "val": "122.534"
            },
            "BudgetYearFour": {
                "val": "121.315"
            },
            "BudgetYearFive": {
                "val": "123.677"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program covers research in directed energy (DE) technologies, primarily high energy lasers, including devices, optical beam control, and integration; ground-based optical space situational awareness (SSA); and high power electromagnetics.  Laser research includes moderate to high power laser devices that are applicable to a wide range of applications, optical technologies to propagate lasers beams from a device, and integration of these technologies.  In SSA, this research uses the Starfire Optical Range and the Maui Space Surveillance System to develop and implement technologies to identify status, health, etc. of orbiting space objects.  In high power electromagnetics, this research examines technologies for applications such as counter-electronics and non-lethal weapons.  Research into other novel DE applications will be conducted.  DE vulnerability\/lethality assessments are conducted and protection technologies are developed.  Research into other advanced non-conventional\/innovative weapons will be conducted.  Tools are developed and used to compare solutions and to determine the most effective and efficient DE technologies to meet Air Force needs.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "141.078"
                },
                "CurrentYear": {
                    "val": "106.196"
                },
                "BudgetYearOne": {
                    "val": "115.779"
                },
                "BudgetYearOneBase": {
                    "val": "115.779"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "139.769"
                },
                "CurrentYear": {
                    "val": "106.196"
                },
                "BudgetYearOne": {
                    "val": "112.845"
                },
                "BudgetYearOneBase": {
                    "val": "112.845"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.309"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.934"
                },
                "BudgetYearOneBase": {
                    "val": "-2.934"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.536"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.845"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.934"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.934"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY14 is due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "624866"
                    },
                    "ProjectTitle": {
                        "val": "Lasers & Imaging Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "113.429"
                        },
                        "CurrentYear": {
                            "val": "78.211"
                        },
                        "BudgetYearOne": {
                            "val": "79.798"
                        },
                        "BudgetYearOneBase": {
                            "val": "79.798"
                        },
                        "BudgetYearTwo": {
                            "val": "83.247"
                        },
                        "BudgetYearThree": {
                            "val": "82.323"
                        },
                        "BudgetYearFour": {
                            "val": "83.499"
                        },
                        "BudgetYearFive": {
                            "val": "85.144"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores the technical feasibility of moderate to high power lasers, including beam control, for applications such as aircraft protection, force protection, and precision engagement.  This project investigates the effects of laser weapons on a wide range of systems and components as well as producing, modifying, validating and applying DE and non-DE concept development and assessment tools to determine which technology solutions to pursue.  Research supporting ground-based optical space situational awareness is conducted."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Space Situational Awareness."
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "30.000"
                                        },
                                        "Text": {
                                            "val": "Conducted research supporting space situational awareness."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technologies and Directed Energy Assessments"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate high energy laser device technologies for Air Force applications.  Develop and demonstrate optical laser beam control technologies including atmospheric compensation and pointing and tracking.  Perform laser system level modeling and simulation validated by laser effects and vulnerability testing.  Develop tools and perform assessments which allow comparisons among DE concepts and tradeoffs between DE and non-DE solutions.  Integrate optical beam control technologies with laser device technologies and demonstrate the combined technologies.  Develop and use technologies to better understand the vulnerability of weapon systems to lasers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "53.338"
                                            },
                                            "Text": {
                                                "val": "Conducted research supporting design and fabrication of weapons-class laser components, including hybrid and fiber lasers, for potential inclusion on an aircraft.  The Flowing Diode Pumped Alkali Laser (DPAL) reached the goal of 250 Watts (a new record) of output power.  Developed 500 Watt peak power optically-pumped semiconductor laser in the mid-infrared (eye-safer) wavelength.  Conducted laboratory testing of horizontal propagation compensation concepts and began planning for field testing.  Prepared technologies to support a demonstration of a high power solid state laser with a beam control system on the ground.  Successfully completed 30 high energy laser engagements against targets of interest under flight conditions, to include 11 Navy targets to measure laser damage thresholds and material properties of target components and to increase confidence in vulnerability predictions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.101"
                                            },
                                            "Text": {
                                                "val": "Develop new method of fabricating and producing quantum cascade lasers (mid-to long-wavelength infrared) to enable greater than five times improvement in brightness over commercially available sources.  Scale pulsed optically-pumped semiconductor laser in the mid-infrared (eye-safer) wavelength to kilowatt-class peak power.  The Flowing DPAL effort will complete design work on a new laser head that will protect the device windows from Rubidium (Rb) contamination, enabling higher laser performance.  Begin design, integration, and testing of selected components and subsystems for an electric laser system to operate in an airborne environment.  Reduce the linewidth of the monolithic fiber amplifier in the laboratory to five gigahertz with a power output of over 900 Watts with good beam quality.  This is approximately three times narrower than the linewidths of commercial amplifiers.  Demonstrate technologies to support pointing and tracking of targets for a ground based demonstration.  Evaluate and integrate horizontal propagation compensation concepts for field testing.  Conduct beam control research in support of a demonstration of a high power solid state laser with a beam control system on the ground.  Develop models incorporating aero-effects on laser beams projected from the beam control system.  Conduct effects testing to establish requirements for aircraft self-protection laser system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "52.244"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "52.244"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct research supporting a joint Air Force\/DARPA ground demonstration of a high power solid state laser with a beam control system.  Prepare for flight tests of beam control technologies.  Continue integration and begin testing of horizontal propagation compensation concepts.  Develop analysis tools including platform, optics, controls, atmospheric effects, and target predictions supporting future weapons analysis.  Conduct effects testing to establish system requirements and validate modeling efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Space Situational Awareness and Satellite Vulnerability"
                                    },
                                    "Description": {
                                        "val": "Develop advanced, long-range, electro-optical technologies that support ground-based optical space situational awareness.  Develop and use technologies to better understand the vulnerability of blue satellite systems to lasers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.091"
                                            },
                                            "Text": {
                                                "val": "Developed dim object detection and analysis capability to determine geosynchronous satellite characteristics.  Initiated transition of automated satellite characterization tools to AF customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.110"
                                            },
                                            "Text": {
                                                "val": "Improve satellite characterization tools, developing algorithms to determine attitude and shape of satellites in geosynchronous orbit.  Develop initial capabilities for extending existing imaging techniques into 24-hour operations.  Demonstrate the ability to image space objects during extended daylight hours using the 3.6-meter telescope, enabling the observation of objects in orbit that cannot be viewed at night for the first time."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.554"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.554"
                                            },
                                            "Text": {
                                                "val": "Demonstrate capability to determine orientation of geosynchronous satellites.  Demonstrate use of laser guidestar to enable detection of objects the size of a basketball in close proximity to geosynchronous satellites.  Develop data analysis techniques to understand and keep track of potential threat objects in space.  Demonstrate capabilities for extending existing techniques into 24-hour operations.  Develop and use technologies to quantify the vulnerability and protection needs of certain blue satellite components."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624867"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Weapons & Survivability Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.340"
                        },
                        "CurrentYear": {
                            "val": "27.985"
                        },
                        "BudgetYearOne": {
                            "val": "33.047"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.047"
                        },
                        "BudgetYearTwo": {
                            "val": "44.906"
                        },
                        "BudgetYearThree": {
                            "val": "40.211"
                        },
                        "BudgetYearFour": {
                            "val": "37.816"
                        },
                        "BudgetYearFive": {
                            "val": "38.533"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores high power electromagnetic (HPEM) applications and other unconventional\/innovative weapon concepts to support applications such as non-lethal counterpersonnel and disruption, degradation, and damage of electronic infrastructure.  This research will allow most effects to be covert with no collateral structural or human damage.  This project also investigates the effects of potential HPEM weapons and mitigation of HPEM effects.  HPEM includes but is not limited to high power microwaves and millimeter waves."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "HPEM and Unconventional  Weapon Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate technologies for HPEM components.  Investigate HPEM and other unconventional weapon concepts using innovative technologies.  Investigate advanced technologies that support force protection tactical applications, including non-lethal counter-personnel applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.049"
                                            },
                                            "Text": {
                                                "val": "Investigated technologies to enhance standoff capabilities of microwave components used for electronic attack.  Conducted high energy density plasma experiments.  Improved HPM source design software input-file suite for a new HPM source that can produce multi-gigawatts of power in a smaller volume and provide longer range and higher probability of effects for the next generation counter-electronics HPM systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.367"
                                            },
                                            "Text": {
                                                "val": "Develop technologies to provide frequency agile, broadband sources.   Develop state-of-the-art components to shrink antennas, microwave components, and energy storage\/prime power technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.933"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.933"
                                            },
                                            "Text": {
                                                "val": "Begin integration of state-of-the-art components to shrink antennas, microwave sources, and energy storage\/prime power systems.  Investigate technologies to provide frequency agile, broadband sources.  Conduct assessments on the feasibility of particle beam weapons for counter-electronics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HPEM Effects and Mitigation Research"
                                    },
                                    "Description": {
                                        "val": "Assess the effects\/lethality of HPEM technologies.  Develop and apply sophisticated models to enhance the development of HPEM and related technology.  Investigate technologies to counter the effects of HPEM."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.291"
                                            },
                                            "Text": {
                                                "val": "Investigated mitigation effects of HPEM on U.S. systems of interest including modern tactical aircraft components.  Updated models based on latest experimental HPEM data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.618"
                                            },
                                            "Text": {
                                                "val": "Investigate effects of high bandwidth technologies, exploring issues to exploit\/prevent cyber-attack.  Develop smart waveform technologies and techniques as well as predictive effects methodologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.114"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.114"
                                            },
                                            "Text": {
                                                "val": "Begin incorporating effects of high bandwidth and smart waveform technologies and techniques into numerical simulations.  Begin funding the Air Force portion of the High Power Microwave Software Applications Institute (HSAI).  This is an Air Force\/DoD High Performance Computing Modernization Program for the development of advanced, user friendly, modeling and simulation capability for entire HPM systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}