{
    "id": "438b444b92ffc20d808eef0490aec143fac09a41",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602120A"
        },
        "ProgramElementTitle": {
            "val": "Sensors and Electronic Survivability"
        },
        "R1LineItemNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "42.189"
            },
            "CurrentYear": {
                "val": "45.260"
            },
            "BudgetYearOne": {
                "val": "43.170"
            },
            "BudgetYearOneBase": {
                "val": "43.170"
            },
            "BudgetYearTwo": {
                "val": "47.802"
            },
            "BudgetYearThree": {
                "val": "57.460"
            },
            "BudgetYearFour": {
                "val": "52.969"
            },
            "BudgetYearFive": {
                "val": "54.285"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 - Funding realigned to higher priority efforts"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates designs and evaluates sensors and electronic components and software that enhance situational awareness, survivability, lethality, and autonomous mobility for tactical ground forces. Project H15 focuses on Combat Identification (CID) technologies, which include devices to locate, identify, track, and engage targets in the Joint fires environment. Project H16 investigates sensors, signal processing and information fusion technologies to increase target detection range and speed of engagement. Project SA2 conducts applied research on biological sensors and biologically derived electronics that exploits breakthroughs in biotechnology basic research in collaboration with the Institute for Collaborative Biotechnology (ICB) a University Affiliated Research Center (UARC) led by the University of California, Santa Barbara in partnership with California Institute of Technology and Massachusetts Institute of Technology and their industry partners. Project TS1 researches and evaluates space-based remote sensing, signal, and information processing software in collaboration with other Department of Defense (DoD) and government agencies to support space force enhancement and space superiority advanced technology integration into Army battlefield operating systems. Project TS2 focuses on advancing perception for autonomous ground mobility, intelligent vehicle control and behaviors, human-robot interaction, robotic manipulation, and unique mobility for unmanned vehicles.  \n\nWork in this program element (PE) complements and is fully coordinated with efforts in PE 0602307A (Advanced Weapons Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602709A (Night Vision Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603006A (Command, Control, Communications Advanced Technology), PE 0603008A (Command Electronic Warfare Advanced Technology),\nPE 0603710A (Night Vision Advanced Technologies), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology),\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy\n\nWork is performed by the Army Research Laboratory, Adelphi, MD and Aberdeen Proving Ground, MD; the Communications-Electronics Research, Development, and Engineering Center, Aberdeen Proving Ground, MD; and the US Army Space and Missile Defense Technical Center, Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.453"
                },
                "CurrentYear": {
                    "val": "45.260"
                },
                "BudgetYearOne": {
                    "val": "50.877"
                },
                "BudgetYearOneBase": {
                    "val": "50.877"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "42.189"
                },
                "CurrentYear": {
                    "val": "45.260"
                },
                "BudgetYearOne": {
                    "val": "43.170"
                },
                "BudgetYearOneBase": {
                    "val": "43.170"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.264"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-7.707"
                },
                "BudgetYearOneBase": {
                    "val": "-7.707"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.068"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.823"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-7.707"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.707"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.373"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H15"
                    },
                    "ProjectTitle": {
                        "val": "Ground Combat Id Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.033"
                        },
                        "CurrentYear": {
                            "val": "2.181"
                        },
                        "BudgetYearOne": {
                            "val": "2.328"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.328"
                        },
                        "BudgetYearTwo": {
                            "val": "2.330"
                        },
                        "BudgetYearThree": {
                            "val": "4.384"
                        },
                        "BudgetYearFour": {
                            "val": "4.456"
                        },
                        "BudgetYearFive": {
                            "val": "4.536"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research and investigates emergent techniques, devices and software for combat identification (CID) of Joint, allied, and coalition forces, including air-to-ground and ground-to-ground for mounted, dismounted, forward observer, and forward air controller missions. Efforts include research to enable a common battlespace picture for Joint and coalition situation awareness and fusion efforts to increase the survivability and lethality of coalition forces by fusing battlefield sensor and situational awareness data to identify friend from foe.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Soldier and Ground portfolios. Efforts in this project are complimentary of PE 0602270A (EW Techniques), PE 0603270A (EW Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combat Identification (CID) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and enhances CID modeling and simulation tools, concepts, and algorithms to improve anti-fratricide and combatant\/non-combatant identification capabilities. Soldier-to-Soldier CID algorithms that interoperate with non-traditional CID sensors (air and ground) are developed to increase situational awareness (SA), feed the common operating picture, and increase the combat effectiveness of Soldier and  Brigade Combat Teams (BCTs). Work being accomplished under PE 0603270A\/project K16 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.033"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improved algorithms to deconflict, fuse and correlate warning receiver and blue force emitter data with DCGS-A, provided intelligence, surveillance and reconnaissance, based on initial user jury results; Investigated data transport requirements needed to support the generation of an enterprise-wide ground and air common operating picture that provides accurate and timely reporting of high value targets for enterprise-wide as well as organic platform SA for increased CID awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.181"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate tactical and emerging commercial communications, wireless personal area networks and position location information beaconing through modeling and simulation to assess their potential as components of a Soldier-to-Soldier CID capability; evaluate capacity of existing mobile\/handheld platforms to perform CID display and training; investigate signature data from multiple sensor types (infrared, RF and other) to support non-cooperative CID technology development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.328"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.328"
                                            },
                                            "Text": {
                                                "val": "Will design and integrate tactical and commercial communications, wireless personal area networks and position location beaconing for a Soldier-to-Soldier CID capability utilizing equipment that is already employed by Soldiers; design CID display and training tools to be implemented on existing mobile and handheld platforms being targeted by applicable programs of record."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H16"
                    },
                    "ProjectTitle": {
                        "val": "S3I Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.699"
                        },
                        "CurrentYear": {
                            "val": "20.726"
                        },
                        "BudgetYearOne": {
                            "val": "20.808"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.808"
                        },
                        "BudgetYearTwo": {
                            "val": "21.198"
                        },
                        "BudgetYearThree": {
                            "val": "21.382"
                        },
                        "BudgetYearFour": {
                            "val": "21.370"
                        },
                        "BudgetYearFive": {
                            "val": "21.755"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, investigates and evaluates advanced sensor components, signal processing, and information fusion algorithms that will provide the future Soldier decisive new capabilities to locate, identify, decide and engage battlefield targets in tactical environments.  The ultimate impact and utility of this work will be to greatly increase the lethality, range, and speed of engagement of the Soldier.  Emphasis is on solving critical Army-specific battlefield sensing and information management problems such as false targets, complex terrain (including urban applications), movement of sensors on military vehicles, and exploitation of multimodal sensors.  Significant areas of research include: low cost sensors designed to be employed in large numbers of networked sensors for force protection, hostile fire defeat, homeland defense, counter terrorism operations, and munitions; fusion of disparate sensors such as non-imaging acoustic, seismic, electric-field (E-field), magnetic, radar; imaging infrared (IR), forward looking IR (FLIR), laser detection and ranging (LADAR), visible imagers; low cost acoustic, seismic, and magnetic sensors that can passively detect, classify, and track battlefield targets such as personnel, heavy\/light vehicles, and helicopters.  Other areas of research include sensing technologies for tagging, tracking, and locating (TTL) non-traditional targets as well as the location of direct and indirect fires and other hostile threats. Further areas of research include Ultraviolet (UV) optoelectronics for battlefield sensors, networked compact radar for vehicle and dismount identification and tracking; ultra wideband radar for buried and concealed threat detection, enhanced robotic mobility, stand-off characterization of infrastructure; and the detection, classification, and tracking of humans in urban terrain.  Additional areas of research are aided\/automatic target recognition (ATR) allowing sensors to autonomously locate and identify targets; advanced battlefield sensor and information processing to conduct a dynamic and real time situational assessment to present a common picture of the battlespace focused on low echelon commanders; and advanced information processing methods to provide automatic information technologies that utilize widely dispersed sensor and legacy information sources.\n\nThis project supports Army science and technology efforts in the Command Control and Communications, Ground and Soldier portfolios.  The work in this project complements efforts funded in PE 0601104A (University and Industry Research Centers), PE 0602709A (Night Vision Technology), PE 0603710A (Night Vision Advanced Technologies), and PE 0603001A (Warfighter Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this area is performed by the Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Non-Imaging Intelligence, Surveillance, and Reconnaissance (ISR) Sensing"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and designs technologies for multi-modal low-cost networked sensors to enhance persistent sensing capabilities with increased probability of target detection and reduced false alarms.  A key focus is on acoustic, seismic, magnetic, E-field, and passive RF with unique capabilities for Army & DoD applications such as technologies that enable detection of underground facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.790"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated new fusion techniques for enhanced discrimination between vehicles, humans and animals and developed algorithms for acquiring 360 degree situational awareness from multisensory wide-area persistent surveillance platforms; applied acoustic, seismic, magnetic, and E-field to subsurface anomaly detection and characterization; applied advanced transient event classification algorithms to fielded acoustic systems; and enhanced detection range and localization accuracy of airborne acoustic systems to include an unmanned aerial vehicle (UAV) with both acoustic and E-field sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.014"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate, design, and code new algorithms and assess sensor performance to enable faster identification and localization of transient\/hostile threat events such as gunfire, explosions, weapon launches, etc. to enable rapid counter responses in urban environment and for base camps; and investigate, code new algorithms for fusing the output of multi-modal sensors to differentiate, with very high confidence, the presence of humans versus animals to reduce the costs for sensor deployment required for target classification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.590"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.590"
                                            },
                                            "Text": {
                                                "val": "Will evaluate combination of co-located passive IR sensors to discriminate humans from animals with high confidence; investigate new algorithms to detect digging using seismic and magnetic sensors; develop and evaluate algorithms to fuse input from acoustic velocity sensors, electric-field charge detectors, narrow-band burn-product sensor and infrared flash detector to improve detection and classification of hostile threats such as gunfire, mortars, and rockets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Sensing and Data Fusion"
                                    },
                                    "Description": {
                                        "val": "This effort will develop and assess a concept to link physical sensors and information sources to Soldiers and small units.  Specifically the research focuses on (1) multi-modal sensor fusion for detection and classification of human activities and infrastructures such as personnel, vehicles, machinery, RF emissions, chemicals and computers in hidden and confined spaces (i.e., tunnels, caves, sewers and buildings (2) interoperability and networking of disparate sensors and information sources, (3) distributed information for decision making and (4) devise approaches for fusing results of processed outputs of multimodal sensors such as visible, IR and hyperspectral imagers, and acoustic, magnetic & E-field sensors. This effort is complementary with PE 0601104A\/H50 and PE0601104A\/J22."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.057"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Applied advanced fusion algorithms to multimodal sensors and systems; exploited magnetic and E-field fusion for equipment characterization, power line monitoring, and target localization; employed acoustic and seismic techniques to augment E-field subsurface imaging; enhanced sensing from airborne platforms with multi-modal sensors, cueing and fusion algorithms; and implemented fusion algorithms to discriminate humans versus other targets with high accuracy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and assess novel multi-modal sensing and processing algorithms for acquiring information on human activity; investigate and perform experiments in a realistic or simulated environment to evaluate FY12 distributed networking and interoperability algorithms and tools for coalition information sharing and decision making; and implement quality of information (QoI) based data discovery, collection and fusion techniques to extract desired information from large data sets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.022"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.022"
                                            },
                                            "Text": {
                                                "val": "Will develop pattern of life algorithms and statistics to discriminate between potential threat activities and normal behavior; develop and evaluate fusion algorithms that correlates bearing information from  multiple soldier-worn gunfire detection systems for localization of shooter with reduced errors and uncertainties; develop protocols and message formats to enable interoperability between disparate sensor systems; develop tools to understand value and quality of information based on data discovery, collection and fusion of large datasets; evaluate fusion of acoustic and E-field sensing systems to enable passive ranging of near-miss bullets based on wave propagation velocity differences; develop passive EM target detection and localization using multi-axis electric-field and magnetic field sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging Tracking and Locating (TTL)"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research to support advances in state-of-the-art clandestine TTL for non-traditional hostile forces and non-cooperative targets. Specific technical details related to this effort are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.553"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimized and transitioned TTL technologies to CERDEC and implemented improvements to RF and IR Tags."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.072"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate alternate technologies including ultra violet (UV), infrared (IR), radio frequency (RF), and acoustic modalities for application to TTL; design advanced hyperspectral algorithms for locating and tracking targets of interest; develop advanced biometric techniques for locating and identifying humans of interest."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.189"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.189"
                                            },
                                            "Text": {
                                                "val": "Will investigate battery free tags for extending the operating life of tags; develop and extract signals from targets of interest using mechanical and electromechanical coupling methods combined with applicable sensing modalities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ultra Wideband Radar"
                                    },
                                    "Description": {
                                        "val": "Design technical underpinnings of ultra wideband (UWB) radar for several key Army concealed target detection technology requirements including landmine detection, sensing through-the-wall (STTW), and obstacle detection.  Validate advanced computational electromagnetic algorithms, estimate performance improvements of proposed radar systems, and predict target signatures for advanced detection requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.341"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Collected data with improved forward-looking UWB radar testbed to assess IED detection performance gains relating to the following areas: increased antenna height above ground, new antenna\/balun design with enhanced low frequency content for better ground penetration, and polarimetric effects; and investigated techniques to utilize information embedded in low frequency radar data to develop an effective combination of interior building maps, moving target indication algorithms and RF Measurement & Signatures Intelligence technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete FY12 assessments that combine electromagnetic models, rough surface models, measurement data and signal processing techniques to recommend forward looking radar parameters for optimized detection of IEDs to improve detection performance at increasing standoff distances; continue to investigate utilizing radar data to build interior structure maps as well as stationary target detection techniques using 3-D computer-generated radar images."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.529"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.529"
                                            },
                                            "Text": {
                                                "val": "Will develop techniques for combining UWB radar with complementary sensors (e.g., video, thermal IR) for improving probability of detection and confirmation of targets;  investigate computational electromagnetic  models of the radar signature of RF devices placed in a complex building environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Compact Radar, Wide Bandgap Optoelectronics, and Laser Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "Design Networked Compact Radar for use on small ground and air vehicles and future Soldier technologies. Develop understanding of phenomenology for an integrated RF sensor that performs radio, radar, and control functions to allow communications, combat ID, and target acquisition\/tracking,. Develop semiconductor-based ultraviolet (UV) optoelectronics for communications, water\/air\/surface purification, and detection and identification of biological threats. Conduct applied research in sensor and eye protection from laser threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.291"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed new methods of moving target classification based on micro-doppler analysis; explored the phenomenology and image processing associated with sub-mmW imaging of human-borne IEDs and validated new sub-mmW \/ terahertz device technology; extended research on 230-275-nm optical sources including LEDs, lasers, and detectors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.115"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess the application of RF micro-Doppler algorithms to the remote sensing of human activities for counter-IED applications; investigate non-traditional radar modes in a compact radar device for force protection and surveillance; improve performance of UV lasers, LEDs, and detectors operating at wavelengths of 230-275-nanometers for enabling communications, water\/air\/surface purification, and detection and identification of biological threats; and investigate new optical limiting components for detecting emerging laser threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.544"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.544"
                                            },
                                            "Text": {
                                                "val": "Will create software and hardware architectures that enable compact radars to network with other unattended ground sensors for small unit force protection; evaluate nonlinear optical materials and tune their properties to optimize performance of the overall vision protection system; grow and characterize gallium nitride materials for extending the spectral range of UV lasers, LEDs, and detectors to wavelengths of 230-365-nanometers for enabling communications, water\/air\/surface purification, detection and identification of biological threats, and electro-optic countermeasures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Information Collection and Fusion  (previously titled Information Fusion)"
                                    },
                                    "Description": {
                                        "val": "This effort develops network and processing infrastructure concepts, and validates algorithms to enable assets to dynamically modify their physical and information producing behaviors to adaptively operate within the dynamics and timelines of small unit decision makers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.667"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed algorithms and enhanced applications directed to persistent surveillance, sensor management, and asset-to-asset taskings to minimize the cognitive workload of a lower echelon commander."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.761"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess Cloud-based cellular architectures and explore implementation of decision support tools at the sensor level to more effectively support the collection and dissemination of information specifically tailored to the Soldiers cognitive requirements for more accurate decision making."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.934"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.934"
                                            },
                                            "Text": {
                                                "val": "Will evaluate decision-adaptive anomaly detection techniques as a means of filtering data at the sensor level to improve situation understanding for small unit decision makers and evaluate the impact of these techniques on data latency and situation awareness; integrate these filtering algorithms into an autonomous collaborative collection framework and assess the impact on delay and situation awareness."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SA2"
                    },
                    "ProjectTitle": {
                        "val": "Biotechnology Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.321"
                        },
                        "CurrentYear": {
                            "val": "4.852"
                        },
                        "BudgetYearOne": {
                            "val": "4.037"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.037"
                        },
                        "BudgetYearTwo": {
                            "val": "4.059"
                        },
                        "BudgetYearThree": {
                            "val": "4.491"
                        },
                        "BudgetYearFour": {
                            "val": "3.372"
                        },
                        "BudgetYearFive": {
                            "val": "3.795"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, develops and evaluates biotechnology with application to sensors, electronics, photonics, and network science.  This project funds collaborative applied research and integration of government, academic and industry scientific research on biotechnology from PE 0601104\/H05, Institute for Collaborative Biotechnologies (ICB) to advance innovative capabilities. Areas of applied research include bio-array sensors, biological, and bio-inspired power generation and storage, biomimetics, proteomics, genomics, network science, DNA research and development, control of protein, and gene expression.  \n\nThe ICB is a collaborative effort led by the University of California, Santa Barbara (Santa Barbara, CA) in partnership with the California Institute of Technology (Pasadena, CA), the Massachusetts Institute of Technology (Cambridge, MA), the Army Laboratories and Research, Development and Engineering Centers, and the ICB industrial partners.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research Laboratory, Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Biotechnology Applied Research"
                                    },
                                    "Description": {
                                        "val": "This effort exploits breakthroughs in biotechnology basic research invented at the ICB to enable capabilities in sensors, electronics, photonics, and network science."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.321"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed\/built hardware\/software required to image single cells in 3D and collect initial 3D images; applied the lessons learned in microbial fuel cells to implement enhanced fermentation, environmental monitoring, and investigated waste water treatment; completed characterization and investigation of bacterial nanowires fabricated artificially from the naturally occurring proteins; completed and validated algorithms for control of data displayed on crew stations based on neural processing; began two new start projects selected in FY11, \"Biological Power Source for Unattended Ground Sensors\" and \"Biomimetic UAV-based System for Soldier Navigation and Situational Awareness.\""
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.852"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete the design and fabricate hardware and software required to image single cells in 3D to better understand the interactions between biological materials and inorganic surfaces; experimentally validate increased electron acceptors ability to improve fermentation for bioprocessing and monitoring systems; analyze wastewater treatment on increased laboratory scale to optimize bioremediation; characterize artificial biofilms doped with organic conductive structures for increased current density microbial fuel cells; evaluate bio-inspired algorithms for control of swarms of micro-unmanned aerial vehicles; evaluate yeast cell based electrodes and membranes in a microbial fuel cell for powering unattended ground sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.037"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.037"
                                            },
                                            "Text": {
                                                "val": "Will improve bio-fuel cell electrode and membrane materials design, and validate for powering unattended ground sensors and other monitoring systems; complete and validate bio-inspired algorithms for control of swarms of micro-unmanned aerial vehicles; evaluate the use of a virus to template electrode materials to design improved batteries for small-scale, unmanned aerial vehicles; evaluate protein capture agents and synthetic bio-molecules as materials to improve stability, affinity for overall environmental tolerance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TS1"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Space Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.606"
                        },
                        "CurrentYear": {
                            "val": "4.303"
                        },
                        "BudgetYearOne": {
                            "val": "5.306"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.306"
                        },
                        "BudgetYearTwo": {
                            "val": "6.278"
                        },
                        "BudgetYearThree": {
                            "val": "6.950"
                        },
                        "BudgetYearFour": {
                            "val": "7.052"
                        },
                        "BudgetYearFive": {
                            "val": "7.179"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project researches and evaluates technologies for space-based, high altitude, and cyberspace applications for Army tactical ground forces.  Applied research efforts include the design and development of sensors and electronic components, communications, signal and information processing, target acquisition, position\/navigation, and threat warning within space and high altitude environments as well as the design and development of technologies and analytical tools for cyber risk assessment and mitigation in acquisition systems.  The applied research and technology evaluations conducted under this Project leverage other DoD space science and technology applications to support Army space force enhancement and cooperative satellite payload development.  \n\nThis project supports Army science and technology efforts in the Command, Control, Communications, and Intelligence (C3I) portfolio.\n\nWork in this project complements and is fully coordinated with PE 0603006A (Space Applications Technology).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.     \n  \nWork in this project is performed by the US Army Space and Missile Defense Command (SMDC) in Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Space Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs, develops, and evaluates space-based technologies, components, and tools that lead to smaller, lighter, more responsive payloads and applications. These technologies allow for the rapid integration and development of tactical payloads in support of responsive space environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.636"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development of advanced power technologies for use in space satellite applications; continued component development for small satellite electro-optical\/infrared (EO\/IR) sensors; developed L-Band communications components for insertion into a small satellite software defined radio."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.292"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and develop optics, processor, and gimbal systems component technologies for small satellite Electro-Optical (EO) video subsystems, small satellite deployable arrays, and small satellite constellation enablers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.242"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.242"
                                            },
                                            "Text": {
                                                "val": "Will design and develop tracking system and antenna pointing component technologies for small satellites; develop orbit planning and analysis tools to support small satellite constellation concept of operation feasibility studies; research and develop propulsion concepts for small satellite station keeping and maneuvering."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space and Analysis Lab"
                                    },
                                    "Description": {
                                        "val": "This effort provides an in-house capability to design and conduct analytic evaluations of space, high altitude, and cyberspace technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.970"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implemented the design of the Space Analysis Lab to stand up an in-house capability to support component development and system integration for ground demonstrations and evaluation of space, high altitude, and cyberspace technology applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.011"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design payload ground systems to monitor health and status of small satellite systems during flight operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.064"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.064"
                                            },
                                            "Text": {
                                                "val": "Will design and implement a communications satellite testbed to conduct and evaluate nanosatellite assembly, payload integration, ground testing and preflight checkout; improve ground station capabilities within the lab to support on-orbit communications and imagery nanosatellite demonstrations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TS2"
                    },
                    "ProjectTitle": {
                        "val": "Robotics Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.530"
                        },
                        "CurrentYear": {
                            "val": "13.198"
                        },
                        "BudgetYearOne": {
                            "val": "10.691"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.691"
                        },
                        "BudgetYearTwo": {
                            "val": "13.937"
                        },
                        "BudgetYearThree": {
                            "val": "20.253"
                        },
                        "BudgetYearFour": {
                            "val": "16.719"
                        },
                        "BudgetYearFive": {
                            "val": "17.020"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, evaluates, and investigates autonomous technologies to enable robotics to assist military missions.  Technical efforts are focused on advancing perception for autonomous ground mobility, intelligent vehicle control and behaviors, human-robot interaction, robotic manipulation, and improved mobility for unmanned vehicles of scales from micro-systems through tactical vehicles.  The project provides the underpinning research of the Robotics Collaborative Technology Alliance (CTA), a cooperative arrangement with industry and academia to conduct a concerted, collaborative effort advancing key enabling robotic technologies required for future unmanned systems.  This project sustains Army science and technology efforts supporting the Ground portfolio.\n\nThis project leverages basic research conducted under PE 0601102A, project T63 and PE 0601104A, project H09 and transitions knowledge and emerging technologies to PE 0603005A (Combat Vehicle Advanced Technology) for maturation and demonstration.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas, and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL) at the Aberdeen Proving Ground, MD, and the Robotics Collaborative Technology Alliance consisting of: Boston Dynamics, Carnegie Mellon University, Florida A&M University, General Dynamics Robotics Systems, Jet Propulsion Laboratory, QinetiQ North America, University of Central Florida, and University of Pennsylvania."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Robotics CTA"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research to provide essential capabilities for advanced perception, intelligent control and tactical behavior, human-robot interaction, robotic manipulation, and unique mobility for unmanned systems to conduct multiple military missions for a full range of robots from man-portable to larger systems. Research focuses on new sensor and sensor processing algorithms for rapid detection and classification of objects in cluttered and unknown environments, enabling autonomous mobility and intelligent tactical behavior by future unmanned systems; implementing adaptive control strategies that will enable unmanned systems to display intelligent tactical behavior, formulation of control strategies that will facilitate use of unmanned systems in populated environments and minimize the cognitive workload on Soldier operators enabling more dexterous manipulation of objects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.311"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enabled lower cost sensory capability for smaller unmanned systems; examined issues of trust in automation and developed a common mental picture between soldier and unmanned system; and examined mid- and long- range scene recognition to facilitate tactical behavior in unmanned systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design algorithms to enable both improved comprehension of the sensed environment by small unmanned systems and adaptability in planning and execution of tactical behaviors; and investigate concepts for more efficient locomotion by small, legged unmanned systems to improve mobility."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.323"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.323"
                                            },
                                            "Text": {
                                                "val": "Will continue to design perception and intelligence algorithms that will permit unmanned systems to team with soldiers in moderately complex environments and conduct missions; will instantiate learning algorithms to enable robots to continually learn from experience and recognize intent of other agents; will focus on the implementation of hybrid cognitive\/metric architecture to minimize the workload placed upon soldier, including implementation of non-traditional control techniques; and will implement concepts for manipulation of objects and improved ground mobility for complex and constrained environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Perception and Intelligent Control"
                                    },
                                    "Description": {
                                        "val": "Advance perception and intelligent control technologies required to achieve autonomous tactical behaviors and other objective capabilities for future unmanned vehicles of multiple size scales and to transition this technology to advanced development programs being conducted under PE 0603005A (Combat Vehicle and Automotive Advanced Technology) project 515 (Robotic Ground Systems) for integration into test bed systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.013"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted applied research for improved shared understanding of tactical environment between soldier and unmanned systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate FY12 learned understanding of tactical environment between soldier and unmanned systems for improving autonomous tactical behaviors and validate technologies in collaboration with CTA efforts; investigate and evaluate the state-of-the-art in intelligent control and focus on the technology gaps."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.368"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.368"
                                            },
                                            "Text": {
                                                "val": "Will implement algorithms for perception of the local environment employing a hybrid cognitive\/metric architecture; will incorporate advanced algorithms for whole body manipulation on to testbed platforms; will implement novel approaches to mobility in complex and constrained environments; and will assess performance of algorithms in an integrated context."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Robotics - Component Maturation"
                                    },
                                    "Description": {
                                        "val": "Matures component technologies on unmanned ground vehicle test beds by  conducting extensive field evaluation and technology characterization to establish improved capability for near autonomous UGVs. Conduct regular, periodic evaluation at Ft. Indiantown Gap, PA, and other military facilities that will stress the technology in complex environments to further focus CTA sponsored research, assess performance, and provide the opportunity for US Army Training and Doctrine Command to engage in the early development of the tactics, techniques, and procedures required for successful utilization of unmanned systems in future conflicts. Work is done collaboratively with industry, academia and other government agencies to include Tank and Automotive Research, Development, and Engineering Center (TARDEC) to support future transitions of knowledge and emerging technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.206"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct initial assessments to establish baseline capability for unmanned systems to understand terrain and behaviors."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}