{
    "id": "46ab9f8142d6e3aa182bc08d40d427e9a8ece360",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603680D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Wide Manufacturing Science and Technology Program"
        },
        "R1LineItemNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "49.026"
            },
            "CurrentYear": {
                "val": "21.966"
            },
            "BudgetYearOne": {
                "val": "34.041"
            },
            "BudgetYearOneBase": {
                "val": "34.041"
            },
            "BudgetYearTwo": {
                "val": "22.539"
            },
            "BudgetYearThree": {
                "val": "23.268"
            },
            "BudgetYearFour": {
                "val": "23.574"
            },
            "BudgetYearFive": {
                "val": "24.031"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Defense-wide Manufacturing Science and Technology (DMS&T), established within the Manufacturing Technology Program directed in Title 10 USC Section 2521, provides the Department with a comprehensive manufacturing program to achieve the strategic goals of focused technology, improved acquisition across the life cycles, and cost-effective logistics.  By designing for manufacturability early in development, anticipated results will have an impact on increasing reliability and decreasing the life cycle burden of weapon systems. The mission to anticipate and close gaps in defense manufacturing capabilities and drive significant system life cycle affordability benefits makes DMS&T an increasingly important leveraging tool in the current budget environment.\n\t\t\t\nDMS&T will: 1) address manufacturing enterprise game-changing initiatives that are beyond the scope of any one Military Department or Defense Agency or platform and, 2) establish and mature cross-cutting manufacturing processes required for transitioning emerging technologies which impact the time lines, affordability, and productivity of acquisition programs and shorten the deployment cycle times.\n\t\t\t\nThe DMS&T program is fundamental to a coordinated development process.  Concurrent development of manufacturing processes with the S&T development enables the use of emerging technologies.  Key technical areas for investment for DMS&T include Advanced Electronics and Optics Manufacturing, Advanced Materials Manufacturing, and Enterprise and Emerging Manufacturing.  Advanced Electronics and Optics addresses advanced manufacturing technologies for a wide range of applications such as sensors, radars, power generation, switches, and optics for defense applications.  Advanced Materials addresses advanced manufacturing technologies for a wide range of materials such as composites, metals, ceramics, nanomaterials, metamaterials, and low observables.  Enterprise and Emerging Manufacturing addresses advanced manufacturing technologies and enterprise business practices for defense applications.  Key focus areas include the industrial information infrastructure, advanced design\/qualification\/cost tools, supply network integration technologies and management practices, direct digital (or additive) manufacturing, machining; robotics, assembly, and joining."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "46.277"
                },
                "CurrentYear": {
                    "val": "21.966"
                },
                "BudgetYearOne": {
                    "val": "22.407"
                },
                "BudgetYearOneBase": {
                    "val": "22.407"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "49.026"
                },
                "CurrentYear": {
                    "val": "21.966"
                },
                "BudgetYearOne": {
                    "val": "34.041"
                },
                "BudgetYearOneBase": {
                    "val": "34.041"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.749"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "11.634"
                },
                "BudgetYearOneBase": {
                    "val": "11.634"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.749"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "AT&L More Disciplined Use of Resources - two percent reduction for resource realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.366"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.366"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Establishment of collaborative Institutes for Manufacturing Innovation per Administration\/OMB guidance"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "12.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "12.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012 $3.000 approved omnibus reprogramming per FY12-18 PA to support emerging manufacturing projects to continue significant advancements to additive manufacturing processes.\n\nFY 2014 includes $12.000 for Advanced Manufacturing Innovation Institute program priorities of the Department and the Administration."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P680"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Science and Technology Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "49.026"
                        },
                        "CurrentYear": {
                            "val": "21.966"
                        },
                        "BudgetYearOne": {
                            "val": "34.041"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.041"
                        },
                        "BudgetYearTwo": {
                            "val": "22.539"
                        },
                        "BudgetYearThree": {
                            "val": "23.268"
                        },
                        "BudgetYearFour": {
                            "val": "23.574"
                        },
                        "BudgetYearFive": {
                            "val": "24.031"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The DMS&T program has a two-pronged approach: 1) technology initiatives and 2) specific single projects.  Technology initiatives, in collaboration with the Joint Defense Manufacturing Technology Panel (JDMTP) and industry, identify and develop investment strategies to advance the manufacturing processes needed to support the specific technology.  Above-the-shop-floor investments focus on new manufacturing processes that have potential to significantly improve manufacturing efficiencies. Single specific projects address investment opportunities not associated with selected technology initiatives and enable the program to respond to urgent, compelling manufacturing needs and provide seed funding to more high risk-high payoff technologies.\n \t\t\t\nData calls are launched through two methods to identify technology initiatives and single specific issues requiring investment.  One method is through the JDMTP.  The JDMTP is comprised of the ManTech Directors from the Services, Defense Logistics Agency, and Office of Secretary of Defense (OSD).  The call is distributed through the ManTech Directors to the four JDMTP sub panels: Metals Processing and Fabrication Subpanel, Composites Processing and Fabrication Subpanel, Electronics Processing and Fabrication Subpanel and Advanced Manufacturing Enterprise Subpanel. Potential candidates are evaluated by the JDMTP based on criteria set forth in the call and announcements and down-selected for further development prior to final selection.  The other method is through Broad Agency Announcements to industry.  Priority is given to investments that support affordability and producibility of critical enabling manufacturing technologies that cut across multiple platforms.  Investments also balance defense priorities in specialty materials, electronics, propulsion and power, and manufacturing processes including \"above the shop floor\" (lean and business technologies facilitating interoperable manufacturing).  Final projects are selected by the OSD ManTech Director, considering input from the JDMTP and Director of Manufacturing, and as approved by Deputy Assistant Secretary of Defense, Manufacturing and Industrial Base Policy (MIBP).  Technology initiatives and projects are executed at the Component level."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Industrial Base Innovation Fund"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "30.000"
                                        },
                                        "Text": {
                                            "val": "Program investments were executed in manufacturing technology that: addressed urgent operational needs; expanded domestic manufacturing capacity; and addressed concerns over limited competition or reliance on foreign sources for certain defense products.  The IBIF programs all addressed key defense-wide manufacturing science and technology issues, with the additional requirements of addressing surge and\/or diminishing material source issues.  In addition, these programs all had a clear transition path with implementation on a current platform or one undergoing acquisition targeted to be within 2-3 years of project completion.  The following areas of investment were executed to enable a diverse suite of advanced manufacturing production improvements:\n\n- Connecting American Manufacturing – created a national-level, integrated framework to enable rapid, high-density, multi-sector brokering between buyers and US suppliers\n- Additive manufacturing initiative – created a large collaboration on additive manufacturing, which enabled innovative research, transition to multiple DoD platforms, and educational opportunities\n- Non-Destructive Evaluation (NDE) for Electron Beam additive manufacturing – developed rapid and affordable NDE techniques for Ti and other metal parts manufactured using a directed energy additive technique \n- Read-out Integrated Circuit for Electro-optical distributed aperture system (EODAS) – redesigned, fabricated, tested, and laser hardened EODAS ROIC to use state-of-the-art foundry equipment and increase yield.  \n- Slurry Dip Automation – developed an automated dipping and slurry management system for flare countermeasure products that effectively eliminated human operators from the dangerous process\n- On-tool Inspection of Fiber Placement – developed non-destructive evaluation and quality inspection techniques within the fiber placement head for in-process, rapid inspection,  improving yield and process control\n- Curved transparent armor – developed manufacturing technology of transparent armor, which enabled curved and thinner transparent structures and decreasing cost\n- Transparent Ceramics – Sapphire – created an approach to determine the significant factors affecting the velocity of single crystal growth of large sheet sapphire production. \n- Quallion Lithium-ion 6T Vehicle Starter Battery – Developed a lithium-ion military vehicle starter battery that significantly improves power and energy density of the standard 6T lead acid battery.   Implemented semi-automated manufacturing processes to move this key component into high volume production and utilize Quallion Zero-Volt cells to reduce life cycle costs.\n- Saft Lithium Ion Energy Storage – Developed lithium ion electrochemical solution integrated with appropriate packaging and systems engineering that provides a Starting \/ Lighting \/ Ignition battery for military 14 Volt systems.  This program will prime the pump of domestic lithium battery manufacture in large volumes.\n- Multi Function Periscope – specified goals and requirements, and began design work to develop a periscope for armored vehicles that merges an external view with sensor and vehicle health data.\n\nMultiple users benefitted from these programs including Air Force\/Navy F-35 users, Army\/Air Force flare users, and Special Operations Command."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Electronics Manufacturing - Advanced RF Packaging"
                                    },
                                    "Description": {
                                        "val": "This effort applies an existing radar system already in production to satisfy a low-cost, open-architecture radar requirement for the Littoral Combat Ship (LCS) program. This program will reduce the cost of the current radar system by $1M per ship set, and will fit into the existing TRS-3D top side and below decks available footprint. The open architecture configuration will allow upgrades for new technologies over the lifetime of the program as well as offer lower cost via the potential for open competition for the radar’s building blocks.  Radar manufacturing and support capability will be transferred from a foreign company to a domestic company and facility.  Transmit\/Receive (T\/R) module packaging cost will be reduced through near-hermetic, commercial Monolithic Microwave Integrated Circuit (MMIC) packaging and automated Surface Mount Technology (SMT) assembly techniques, reducing touch labor costs.  Model Based Enterprise (MBE) concepts will be integrated to ensure supportability and technology refresh via an Intelligent Technical Data Package.  The commercial packaging effort for T\/R module components as a part of this program will have a direct impact on the Volume Search Radar (VSR) on CVN-79 – creating a $1M\/hull cost savings for the Navy.  This effort will provide the Navy with the first truly open architecture radar solution that will be able to accommodate different Monolithic Microwave Integrated Circuit (MMIC) technologies, Line Replaceable Unit (LRU) technologies, processor, and power supplies from multiple vendors.  The system will use fiber optics to connect the above-deck equipment (antenna) with the below-deck equipment (signal processing and control) which will allow greater flexibility in location of below-deck equipment (allowing a lower center of gravity and thus improved ship stability)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.375"
                                            },
                                            "Text": {
                                                "val": "The project contract began in November 2011 and the Transition Plan was signed by all stakeholders in December 2011.  All Technical Data Package (TDP) related software and hardware was received, installed and is functional.  A complete drawing package for the TDP was received.  Requirements Traceability Matrix and Rational DOORS data was received.  Development of the S-band Open-architecture Component Knowledge and Event Tester (SOCKET) LRU based verification system is in progress.  The SOCKET test equipment was specified and ordered.  The SOCKET system requirements definition was completed.  The SOCKET Kernel is under configuration management and revision control via a WindChill environment.  The SOCKET Preliminary Design Review was completed.  Supplier evaluation for the design and production of the PowerBook Transmit\/Receive (T\/R) module was completed.  The decision was made to re-design the PowerBook in house, leveraging the existing design, and making use of Advanced RF Packaging and Automated Assembly ManTech improvements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.875"
                                            },
                                            "Text": {
                                                "val": "Develop the S-band Open-architecture Component Knowledge and Event Tester (SOCKET) Graphical User Interface (GUI), interface to test equipment, Intelligent Technical Data Package (ITDP) interface, data logging & LRU test scripts, and training & simulator software.  Complete the SOCKET Critical Design Review.  Complete SOCKET integration and testing, and a SOCKET string test.  Write SOCKET test reports and the user manual.  Complete the SOCKET LRU based verification system and deliver the SOCKET hardware and software to the Navy. \n\nComplete gallium nitride (GaN) component supplier evaluation and selection for the Transmit\/Receive (T\/R) module.  Complete PowerBook T\/R module Preliminary Design Review (PDR), Critical Design Review (CDR).  Build, test, and qualify the PowerBook module.  Conduct System Engineering training.  Complete land-based radar integration and testing. Initiate the sub-array string testing. Complete the String Test Verification Demonstration.    Deliver the final Intelligent Technical Data Package (ITDP).  Complete the transfer of radar system production from the offshore COTS manufacturer to the domestic manufacturer.  Complete the Radar Producibility Analysis and Final Project Report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronics Manufacturing - Chip Scale Atomic Clock"
                                    },
                                    "Description": {
                                        "val": "Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems require precise timekeeping even if the Global Positioning System (GPS) is unavailable. The size, weight, power, and cost components of conventional atomic clocks are too high for tactical applications. Chip Scale Atomic Clock (CSAC) provides improved long-term frequency stability that gets integrated into long-term time accuracy. The focus of this project is leveraging Defense Advanced Research Projects Agency (DARPA) investments in the CSAC technology to reduce operational costs and transition beyond custom fabrication of the current CSAC.  Objectives include improving the existing batch manufacturing processes such as atomic cell filling, cell sealing, physics package assembly, and sub-system testing to reduce the “touch hours” required for CSAC assembly and testing. Development of a network of multiple vendors to foster competition and ensure a viable supply base is a complementary goal. Current manual assembly processes can produce CSAC in small quantities with low yield at high cost ($8,000\/unit).  The DMS&T funding enables producibility at an affordable cost ($100–$300\/unit). Successful performance enables an environment of continued operation of critical C4ISR systems, regardless of the presence or absence of global positioning system (GPS). The ability to rapidly reacquire GPS military code in a hostile Electro Magnetic Interference (EMI) environment is an additional targeted benefit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.394"
                                            },
                                            "Text": {
                                                "val": "Demonstrated automated assembly of physics package (top\/sub levels). Enabled physics package tester. Reduced electronics Bill of Materials >50%. Identified yield limitations in laser selection. Physics package redesign implies a manufacturing rate of >30K units\/yr is possible (exceeding the project goal by 50%). Signed Tech Transition Agreement with program of record (Product Director Positioning Navigation and Timing). Provided Phase I prototypes to Army Communications-Electronics Research, Development and Engineering Center for evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Sign a Tech Transition Agreement with an additional program of record (Joint Counter Radio Controlled Improvised Explosive Device Electronic Warfare (JCREW). Re-tool automated assembly for improved physics package design and yield engineering. Conduct Phase II prototype assembly and testing. Demonstrate the assembly run rate, validate the cost model. Achieve an end-of-project objective of a Technology Readiness Level (TRL)7 and Manufacturing Readiness Level (MRL)8. Deliver Phase II prototypes.  Document the final CSAC architecture and components, operating procedures and software interface requirements. Achieve Low Rate Initial Production (LRIP) readiness. Realize final production capability goals. Transition to GPS Wing, JCREW, and other programs of record."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronics Manufacturing - Large Affordable Substrates"
                                    },
                                    "Description": {
                                        "val": "High performance infrared (IR) focal plane arrays (FPAs) are grown on Cadmium Zinc Telluride (CZT) substrates that are currently only available in relatively small wafer sizes. This effort will leverage prior and concurrent Department of Defense (DoD) investments to enable a domestic source to manufacture larger CZT substrates. The results will be reduced cost and assured availability of CZT substrates that will enable affordable, high performance ground and air IR sensor systems with rapid wide area search, long range ID, and dual band multispectral aided target detection capability against difficult targets while on-the-move.  Large, affordable CZT substrates from a domestic source will initially transition on FPAs for the 3rd Gen forward-looking infrared imaging systems (FLIR) Engine Engineering Manufacturing Development program, to be followed by multiple transitions to space, strategic, and tactical systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.825"
                                            },
                                            "Text": {
                                                "val": "Design reviews of a furnace capable of handling larger boules were completed.  Continued boule growth and substrate polishing efforts.  Produced and tested 720p Focal Plane Arrays (FPAs).  Matured vertical gradient freeze boule growth.  Incorporated domestic substrates into various IR programs including AIDE LRAS3 (rapid prototype in-theater system). Cut and characterized one CdZnTe boule to produce substrates for downstream manufacturing processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Complete installation of the furnace for boule and substrate manufacturing. Evaluate the potential growth of boules of increasing size.  Improve uniformity and reduce precipitates size in boule. Evaluate critical substrate factors that are part of the final substrate specification, such as parallelism, total thickness variation, chipping, scratches, etc.  Initiate a Low Rate Production status. Conduct a final demonstration of the product. Obtain a TRL6\/MRL7 level. Participate in a 3rd Gen Forward Looking Infrared Radar Development and Demonstration build."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronics Manufacturing - Sensor Hardening"
                                    },
                                    "Description": {
                                        "val": "The F-35 Joint Strike Fighter (JSF) has the requirement to minimize low and high powered laser effects on mission accomplishment.  Current F-35 Electro-Optical Targeting System (EOTS) and Electro-Optical Distributed Aperture System (EODAS) focal plane arrays (FPAs) suffer manufacturing yield and cost issues.  This effort will leverage prior and concurrent DoD investments in laser protection technology to make manufacturing improvements that incorporate laser protection technology into the FPA’s Read-Out Integrated Circuits (ROICs) while concurrently reducing ROIC defects (improving yield) and minimizing the total cost to F-35 to meet this requirement.  The goal is to increase the Transition Readiness Level\/Manufacturing Readiness Level to TRL\/MRL 6 (demonstrate\/produce prototype system or subsystem in a relevant environment) and to transition laser-hardened FPAs in time for the F-35 Block 5 Upgrade.  These technologies are applicable not just for F-35, but to any Medium Wavelength Infrared detector, including those on tactical and reconnaissance sensor systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.096"
                                            },
                                            "Text": {
                                                "val": "Continued Manufacturing Readiness Assessments (MRA) for both EOTS and EODAS FPA manufacturers. Initiated an FPA production scale-up effort which yielded multiple Grade A devices (hybridized ROICs). Began integration of FPA devices into dewars. Completed thermal cycle testing of an initial group of dewars. Began life cycle testing. Completed a hardened ROIC Critical Design Review. Provided the ROIC design to the foundry. Determined the thermal modeling and placement concepts for limiters in dewars. Evaluated\/identified numerous qualified alternative foundries and ROIC designers.  Continued efforts to address FPA damage through enhancement of the ROIC detector, incorporating design changes simultaneously with wafer scale-up to increase manufacturability. Initiated system engineering studies on targeting and warning systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Conclude FPA production scale-up activities to achieve a TRL6\/MRL6 level. Make available a Hardened EOTS FPA and a Hardened EODAS FPA. Conclude system engineering studies on targeting and warning systems. Continued life cycle testing. Initiate additional thermal cycle testing of dewars. Begin a second version of the ROIC\/detector hybridization effort. Conduct another MRA. Complete the ROIC fabrication. Finish the FPA build. Conduct laser susceptibility testing at Wright Patterson Air Force Base.  Conduct transitional activities in preparation for the F-35 Block 5 Upgrade decision point in FY 2014."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronics and Optics"
                                    },
                                    "Description": {
                                        "val": "Advanced Electronics is a series of efforts addressing advanced manufacturing technologies for a wide range of applications such as sensors, radars, power generation, switches, and optics for defense applications.  These efforts provide significant productivity and efficiency gains in the defense manufacturing base.  These manufacturing technologies accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs.\n\nTin Whisker Mitigation project: One significant issue is the need to move toward lead-free electronics.  However, current methods to produce lead-free solder create further issues such as the formation of unwanted tin whisker structures, which can cause electronics to short out.  The Tin Whisker Mitigation project will demonstrate controlled grain structure in soldered joints and plated surfaces.  The objective is to show significantly reduced or completely prevented tin whisker growth, while maintaining the original performance characteristics of the test components.\n\nSilicon Carbide (SiC) High Efficiency Power Switches: Another emerging manufacturing technology undergoing development is for Silicon Carbide High Efficiency Power Switches to enable a new class of power electronics that allows flexible new architectures at higher voltages, higher frequencies, less volume \/ weight, higher temperatures, higher efficiency (reduced fuel consumption), and better power quality for Program Executive Office Ground Combat Systems and the Air and Missile Defense Radar Radar Power Conversion Module.\n\nMini Short Wave Infrared (SWIR) Cameras and ManTech for SWIR Imagers: Thermoelectric Cooler (TEC)-less SWIR imagers are being developed that are smaller, use less power, have a lower cost than currently available SWIR imagers, and offer improved functionality over sensors presently in use.  These new SWIR imagers will be used by warfighters including SOF to see target designation lasers during day and night, to identify friend or foe at long range at night, and to operate with covert lasers.  Applications include several night vision and targeting system programs with the Army, Navy, Air Force, and SOCOM.\n\nManufacturability of Vertical Cavity Surface Emitting Lasers (VCSELs): One emerging manufacturing technology undergoing development focuses on the manufacturability of VCSELs. This effort will allow the enhanced use of high-power laser diode technologies by reducing their operational cost, increasing their reliability and yield, and improving their large array scalability without substantially increasing the processing and packaging requirements. Will apply a modern factory approach of a fab-less front-end with specialized in-house process steps, allowing more flexibility for DoD procurement cycles and leveraging installed, previously-invested capital. This project is expected to benefit numerous programs, including: PUMA, RAVEN, TigerShark, Anubis, Spectre-FINDER, Speckles, TigerMoth, WAAS, PAWS, IPODS, AngelFire, MAV-OBAT, nLoss, LOS-short, CLRF, JETS, IDNST, TLDS, Big Safari, OEF, OIF,  STINGER , and ARGUS.\n\nFuture efforts will focus on advances in fuel cells, radars, conformal sensors, and solder free electronics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.626"
                                            },
                                            "Text": {
                                                "val": "Tin Whisker Mitigation project: Initiated mitigation manufacturing activities, including tests on the lead-free joints and plates to demonstrate the elimination of tin whiskers. Fabricated and tested controlled grain structures during solder deposition process to test whisker propensity and perform other mechanical tests. Assessed the solder joint quality effect that treatments have on surface plating, wave, Surface Mount Technology reflow, hot bar, and hand soldering processes with lead-free soldering. Effort addressed: 1) reduction of internal stresses that cause tin whisker formation; 2) strength of the solder joint to cause pad cratering; 3) crystal orientation and cross-sectional analysis of a variety of solder joints; and 4) improvement for electrochemical migration during Surface Insulation Resistance testing with marginal levels of contamination."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.255"
                                            },
                                            "Text": {
                                                "val": "SiC High Efficiency Power Switches. Focus on improvements in SiC starting materials.  Continue efforts to increase SiC wafer size to 6”.  Reduce substrate defects, including micropipe density, to improve device yield.  Begin power device fabrication using 6” substrates.\n\nMini SWIR Cameras and ManTech for SWIR Imagers:   Develop robust 4” wafer processes to reduce breakage and increase yield.  Improve backside processing costs.\n\nManufacturability of VCSELs: Initiate hermetic design efforts, creating hermetic packaging for VCSEL arrays. Develop a “hermetic by design” VCSEL chip process technology by processing direct passivation schemes directly onto the wafer to extend the operating life and shelf-life. Begin to standardize the package at the sub-mount and heat-sink level. This is required for ease of insertion to replace edge-emitting products in use by the marketplace and will increase packaging throughput of high power arrays."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.640"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.640"
                                            },
                                            "Text": {
                                                "val": "SiC High Efficiency Power Switches: Develop manufacturing technologies to increase throughput and decrease cost of SiC power devices through enhanced material growth and high-yield device fabrication processes. Continue power device fabrication using 6” substrates.\n\nMini SWIR Cameras and ManTech for SWIR Imagers: Continue efforts to improve wafer level processing to improve yields and reduce costs.  Improve hybridization yields and costs; develop a high throughput, self aligning process.  Reduce packaging costs with automation of die bonding and wire bonding.  Plan for sensor packaging and camera calibration tasks.\n\nManufacturability of VCSELs: Continuing hermetic design and standardized packaging efforts. Explore low-cost standard packaging alternatives for high-volume system insertion opportunities. Develop low-cost wafer level packages compatible with Pick-n-Place and Surface Mount Technology PCB-stuffing assembly lines, using multilayer ceramics and PCB technology to remain consistent with wafer-scale packaging.  Evaluate cooling technologies to determine the most cost-effective, manufacturable techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials Manufacturing - Advanced Body Armor"
                                    },
                                    "Description": {
                                        "val": "While current body armor is effective, it is too heavy for some threats, environments, and operations.  Even a 10% reduction in system weight would significantly increase warfighter acceptance, mobility, agility, and endurance.  This effort will leverage prior DoD investments to mature three complimentary manufacturing technologies that will reduce body armor weight by 10%-15% while improving ballistic performance and flexibility.  Cost will be reduced 5%-10% and cycle time will be reduced by 10X-20X.  The project will mature three manufacturing technologies for lighter weight armor from a capability to produce the technologies in a laboratory to a capability to produce them in an environment representative of a production facility.  The three technologies are: 1) Dissimilar Material Assembly Technology to integrate ceramic, polymer adhesives, composites, and other organic and inorganic constituents into a unified body armor system. 2) Co-consolidation processing, to reduce cost and cycle time for the production of composite material enabling 10% lighter armor while maintaining ballistic performance. 3) Multi-scale modification of ballistic ceramics and associated processes, which will include new additive processes and metallic substrates to improve ballistic integrity and manage adverse shock events due to ballistic impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.913"
                                            },
                                            "Text": {
                                                "val": "Successfully demonstrated novel backing architecture to reduce back face deformation. Eight percent weight reduction demonstrated on flat plate configurations using modified ceramic processes and ceramic powder compositions. First-of-its-kind Dissimilar Materials Assembly System (DMAS) machine design complete.  Built, installed, and operational.  DMAS directly enables 20-40% reduction in touch labor associated with complicated assembling of composite backing materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "Technology down-select initiated (including composite, ceramic, adhesive, and encapsulation sub-processes).  Demonstrate 10% lighter (5.5 pounds for size medium) ESAPI side plate.  Conduct interlayer materials bonding and assembly.  Develop evaluation parameters and complete ballistic and related testing.  Process down select and integration.  Enable LRIP process development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials Manufacturing - Field Assisted Sintering Technology (FAST)"
                                    },
                                    "Description": {
                                        "val": "This effort addresses limitations of conventional sintering processes.  Conventional sintering takes from hours to days in a sintering oven, and the beneficial characteristics of nano-structured materials are lost when the material is sintered.  FAST has the potential to dramatically reduce cycle time and manufacturing costs while maintaining the beneficial characteristics of nano-structured materials.  The FAST process passes a pulsed direct current through the part while it is pressed in a die, and the combination of rapid heating and compressive loading results in fine grained, fully dense materials in short processing times that are not possible with conventional sintering processes.  Many parts that are made with a powder press and sinter process are candidates for FAST, but this project will focus on ceramic body and vehicle armor, tungsten kinetic energy penetrators, infrared windows, heat sinks for electromagnetic propulsion cooling, and hypersonic and high temperature for enhanced performance jet propulsion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Fabricated explosively formed penetrators and components, ballistic tiles, and functional components.  Demonstrated faster process in fabricating ceramic matrix composite components with fiber’s structural properties maintained.  Demonstrated experimentally the benefit of WC (Tungsten Carbide) additives for minimizing grain growth in both Ta (Tantalum) and W (Tungsten).  Began sintering study on WC-12%Co.  Designed molds for mass production by FAST."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "Extend Area Protection & Survivability Warhead Testing.  Fabrication of automated sample handling system, implementation\/testing of automation, optimization of automation system, document process efficiency\/cost savings."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise and Emerging Processes - Rapid Manufacturing of Aerospace Structures"
                                    },
                                    "Description": {
                                        "val": "There is a strong need to fabricate timely and affordable aerospace structures in a production environment for rapid fielding of materials and systems to serve the defense manufacturing base.  An example of a system that could benefit from additive manufacturing is one in which there are multiple, complex, embedded systems, such as air flow control actuators within an inlet duct.  This program involves design, fabrication, testing and performance analysis of various parts using additive manufacturing.  Complex designs such as conformal lattice structures, with high strength and low mass, are highly advantageous for small remotely piloted aircraft, but may only be successfully manufactured using methods such as additive manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.516"
                                            },
                                            "Text": {
                                                "val": "Used conformal lattice software developed to optimize lightweight conformal lattice structures for small Remotely Piloted Aircraft (RPA).  Completed mechanical analysis of nanomodified polymeric parts and microwave post processing densification.  Completed thermal control upgrades for greater thermal uniformity and material densification.  Designed small RPA using conformal lattice structure approach (wings, tail, fuselage, nosecone).  Cost comparison to carbon fiber composite structure initiated.   Manufactured inlet duct actuator inserts with integrated powered resonance tubes (PRTs) using additive manufacturing techniques.  Manufactured various PRT designs and air flow testing was compared to the theoretical values.  Built composite tooling using a washout mandrel additive manufacturing. Test the full composite inlet duct built on the polymeric additive manufacturing tool with active flow control inserts also manufactured using one of the two polymeric additive manufacturing techniques.  Complete flight test for the conformal lattice structure RPA, along with Final program reviews."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Advanced Materials Manufacturing is a series of efforts addressing advanced manufacturing technologies for a wide range of materials such as composites, metals, ceramics, nanomaterials, metamaterials, and low observables.  These efforts will provide significant productivity and efficiency gains in the defense manufacturing base.  These manufacturing technologies will accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs.\n\nAdvanced materials manufacturing technologies undergoing development include materials for ballistic survivability and materials for rapid fabrication of structural components.\n\nCast Eglin Steel: An effort is underway to establish Cast Eglin steel chemistry specs to maximize strength and ductility for maximum protection and effectiveness for Hard and Deeply Buried Target (HDBT) targets. Will create a primary casting process for the single piece cast underbody protection system, and bomb bodies. Developing cast-in pockets, slopes, and curves in order to meet geometric and blast requirements.\n\nCold Spray Deposition: The objective for Cold Spray Deposition is to create a proven repair process and original equipment manufacturer applied corrosion\/wear prevention treatment for magnesium gearbox housings and parts on numerous platforms. Inability to repair is causing significant readiness, sustainment, and safety issues (20% of the fleet is affected at any given time). Working with the original equipment manufacturer to transition the process to industry to treat new parts and to maintain, repair, and overhaul condemned gearboxes in storage.  \n\nNet-Shaped Field Assisted Sintering Technology (FAST): FAST will set the processing limits and qualify the process for the production of two ultra high temperature materials components that require full density materials with nano tailored microstructures that are not achievable via other processes.  This technology addresses near net shaped, thin walled axial rocket nozzle inserts (flute shaped) made from W (Tungsten) and TaC alloys and sharp leading edges with attachment features made from Hf-based ceramics.  This effort will mature the manufacturing readiness of conventional FAST while reducing costs and providing faster delivery times.\n\nFastener Fill: The F-35 Fastener Fill project will address the challenges incurred in the manual fastener fill installation process, which can take as long as 2 minutes per fastener and provides no indication of installation quality other than feel.  With over 40,000 fasteners per aircraft for F-35, this is a significant manufacturing issue.  In addition, excess materials must be manually skived to meet flushness requirements. The project objective is to refine the contractor’s prototype Rapid Intelligent Fastener Fill System which is an automated combination melt, compress, and skive tool capable of installing fastener fill material in less than 15 seconds per fastener. \n\nAutomated and Rapid Boot Installation Process: This process will reduce the labor-intensive nature of the installation procedures, which are not suitable for full-rate production and represent 40% of the cost in component finishing. A risk assessment analysis has identified the following areas to be targeted: (1) automation of the hand-cut\/trimmed, multi-piece boot installations; (2) automation of additional trimming, bonding, and pasting activities currently performed manually; (3) improved quality of technician skill\/training; and (4) reduction of the waste incurred in cutting\/darting boots."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.524"
                                            },
                                            "Text": {
                                                "val": "Cast Eglin Steel: Request for Proposal, conducted contract award evaluation, and awarded contract.\n\nCold Spray: Project Kickoff June 5, 2012. Created a proven repair process developed by the US Army Research Laboratory and the original equipment manufacturer applied corrosion\/wear prevention treatment for magnesium gearbox housings on numerous platforms. Inability to repair was causing significant readiness, sustainment, and safety issues.\n\nNet-Shaped Field Assisted Sintering (FAST): The near net shape densification by Field FAST were explored using TaC-based composite powders. Two different vertical die designs were developed and tested to produce a near net shape, nozzle throat. The preliminary results showed that the near net shape consolidation by FAST was successful, resulting in close to ideally dense microstructures.\n\nFastener Fill: Released Request for Proposal, conducted contract award evaluation, and awarded contract.\n  \nAutomated and Rapid Boot Installation: Released Request for Proposal, conducted contract award evaluation, and awarded contract."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.311"
                                            },
                                            "Text": {
                                                "val": "Cast Eglin Steel: Establish Eglin steel chemistry specifications to maximize strength and ductility for maximum protection, and maximum effectiveness for hard and deeply buried targets. Create a  primary casting process for the single piece cast underbody protection system, and bomb bodies. Employ an integrated computational casting process model to simulate the net-shape casting process to mitigate potential processing problems. \n\nCold Spray: Work with the original equipment manufacturer to transition the process to industry to treat new parts and to maintain, repair, and overhaul condemned gearboxes in storage. Process validation & repair demonstration.\n\nNet-shaped FAST: Complete high temperature bend strength with grain size analysis and melting point estimations. Down-select for the carbide dispersoid and conduct a more detailed processing study. Fabricate a large billet in the large FAST unit for enough material to conduce a detailed thermal-mechanical behavior analysis. Develop understanding between processing conditions and morphology, mechanical and thermal properties and Non-Destructive Evaluation results.  Start fabrication of prototype and scale-up to near net shape nozzle and segmented leading edge.\n\nFastener Fill: Develop automation plan and integrate into robotic arm. Modify Rapid Intelligent Fastener Fill System current applications to include hard to reach areas such as inlet ducts and QC verification to ensure the fill dot has been installed and skived per requirements.\n\nAutomated and Rapid Boot Installation:. Automated boot kit development and pressure sensitive adhesive application development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.680"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.680"
                                            },
                                            "Text": {
                                                "val": "Cast Eglin Steel: Validate cast process that ensures cast in pockets, slopes, and curves in order to meet geometric and blast requirements that also facilitate ease of next higher level assembly. Eglin Steel processing developments are planned to have full scale demonstrations.\n \nCold Spray: Original equipment manufacturer demonstration & qualification of the UH-60 Sump Housing. System prove-out analysis and engineering validations are scheduled.\n\nNet-shaped FAST: Complete validation and durability testing then proceed with a nozzle and leading edge component demonstration.  The team will document process efficiency, and then identify cost reductions and savings; then support transition to industry.\n\nFastener Fill: Installation at Northrop Grumman Palmdale F-35 inlet duct manufacturing line and qualification and testing which includes first article acceptance.\n\nAutomated and Rapid Boot Installation: Single piece injection molding applications development along with automated hole & drilling applications development which will include scanning & compensation analysis. In-process first article inspection planning to coincide with manufacturing development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise and Emerging Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Enterprise and Emerging Manufacturing is a series of efforts addressing advanced manufacturing technologies and enterprise business practices for defense applications.  Key focus areas include direct digital (or additive) manufacturing, advanced manufacturing enterprise, machining, robotics, assembly, and joining.  These manufacturing technologies and enterprise business practices will accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs.\n\nWith our adversaries forced to innovate rapidly to survive, it's become increasingly important for the U.S. military to improve its own agility and flexibility. The focus is to find a solution to overcome a burdensome acquisition cycle requiring a great amount of cost, time, security, and storage space. Through the use of secure satellite data links or a local parts database, warfighters can access CAD designs for replacement parts, allowing them to repair equipment without the need to establish supply chains or wait for shipments. It allows operators to modify a part's design based on its performance in the field.\n\nEmerging manufacturing technologies undergoing development include:  Large-scale, challenge for advanced, interoperable machine tool applications, and methods for exchange of 3D official technical data throughout the supply chain and between government and contractors.\n\nNational Additive Manufacturing Innovation Institute (NAMII): Collaborative efforts with NAMII enable the production of finished parts directly from digital data such as 3D Computer-aided design (CAD) drawings. It provides almost limitless freedom to designers, allowing the use of very complicated geometries. It is as economical to produce single items as it is to produce thousands and thus undermines economies of scale. Using additive manufacturing would allow for rapid replacement of parts in the field and enable deployed units to remain mission-ready.  Through the use of secure satellite data links or a local parts database, warfighters near deployment locations could access CAD designs for replacement parts, allowing them to repair equipment without the need to establish supply chains or wait for shipments. It would allow operators to modify a part's design based on its performance in the field.  There is a strong need to fabricate timely and affordable aerospace structures in a production environment for rapid fielding of materials and systems.  An example of a system that could benefit is an air flow control actuator within an inlet duct.  This program involves design, fabrication, testing and performance analysis of various parts using additive manufacturing.  Complex designs, such as conformal lattice structures, may only be successfully manufactured using methods such as additive manufacturing.\n\nMTConnect Challenge: The MTConnect Challenge focuses on developing manufacturing solutions (tools) using newly developed MTConnect interoperable protocol, for use on machining platform development. MTConnect is an open communication standard that provides the capability to pass data from machine tools to higher level systems for further processing using the XML based standard.  \n\nFramework for Assessing Cost and Technology (FACT): Producibility analysis tools will be matured so that component performance, manufacturing processing techniques and cost can be simultaneously considered to achieve an optimum design solution.  Current producibility analysis tools do not reuse and connect existing design, manufacturing and cost models. Sustainment and Maintenance will be impacted by maturing advanced sustainability analyses operating within FACT to reduce sustainment costs associated with spare parts acquisition and weapon system maintenance.  The technology will enable correct selection of a manufacturing process to minimize cost given the estimated spare part lot sizes. Block Upgrades or Recapitalization using FACT will be critical for performing analyses associated with integrating new requirements into an existing platform to highlight the manufacturing and lifecycle costs associated with the necessary changes to the weapon system in order to meet new operational requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.257"
                                            },
                                            "Text": {
                                                "val": "MT Connect Challenge: Launched a shop floor application (including machine tools)challenge. Initiated an effort to engage and stimulate a broader base of software and system architects, to develop advanced enterprise, facility, and machine control applications based on extensions to the MTConnect standard to enable a more efficient and competitive domestic manufacturing infrastructure for the defense enterprise. Began an effort to create valuable tools and applications that can be easily adopted by manufacturing, especially the lower tier producers, to enhance their manufacturing capabilities and support DoD supply chain management goals. Established subcontractors contract agreements.\n\nNAMII: Developed a national roadmap for additive manufacturing in metals, electronics, and polymers.  Launched initial projects to improve additive manufacturing methods for DoD weapons systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.575"
                                            },
                                            "Text": {
                                                "val": "MTConnect Challenge:  Study the incorporation of in situ metrology, process controls, and non-destructive evaluation techniques to measure\/improve part quality and system performance. Execute concepts to improve build rates, manufacturing throughput, process reliability, and yield. Research materials, part, and component characterization to better understand structure\/process\/property relationships to maximize potential effectiveness. Enable the rapid design and fabrication of current and future platforms through integration of digital product designs and manufacturing capability models.\n\nFramework for Assessing Cost and Technology (FACT): Identify, solicit, and plan desired improvements to current capabilities. Reduce the time required to perform tradeoff analyses for new system production planning (such as for the Amphibious Combat Vehicle). This will improve the integrated nature of the components, reducing the risk of underperformance and\/or becoming too costly."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.721"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.721"
                                            },
                                            "Text": {
                                                "val": "MTConnect Challenge: Review submissions for accuracy, credibility, effectiveness, and potential savings data. Complete an evaluation and assessment of the competing offerings, determine the winning entries, and award the prizes. \n\nFramework for Assessing Cost and Technology (FACT): Evaluate and model current data to 3D annotated baseline technical data for insertion to a PLM-to-PLM information data exchange format. It is anticipated that benefits associated with updating design specifications to accommodate welding and machining processes will begin for the LTV in the 2Q-FY15, with the benefits for the M777 spare parts project to be realized starting in the 3Q-FY15."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Manufacturing Innovation Institutes"
                                    },
                                    "Description": {
                                        "val": "Technical innovation and leadership in manufacturing are essential to sustaining the foundations of economic prosperity to enable our military to maintain technological advantage and global dominance. To support these goals, Institutes for Manufacturing Innovation (IMI) will serve as regional hubs to accelerate technological innovation into commercial application and concurrently develop the educational competencies and production processes via shared public-private sectors.   Collaborative execution and funding by the Departments of Defense (DoD), Energy (DoE), and Commerce (DoC), NASA, and the National Science Foundation (NSF) to support the establishment of the IMIs will spur industry cost-share for manufacturing innovation and quickly develop a pathway for technology-focused regional hubs for collaboration among government, industry, and academia that will meet critical government and Warfighter needs.  The concept of these institutes is highlighted in the President’s Council of Advisors on Science and Technology (PCAST) report titled “Capturing Domestic Competitive Advantage in Advanced Manufacturing,” published in July 2012."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "Establish two Advanced Manufacturing Innovation Institutes to address Intelligent Design and Manufacturing (IDM) and III-V Opto-Electronics Manufacturing Innovation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "(BA3) 0603680F"
                                    },
                                    "Title": {
                                        "val": "Air Force ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7)  0708045A"
                                    },
                                    "Title": {
                                        "val": "Army ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7) 0708011N"
                                    },
                                    "Title": {
                                        "val": "Navy ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7) 0708011S"
                                    },
                                    "Title": {
                                        "val": "DLA ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item. Outyear data for \"Other Program Funding\" is contained within the Service budgets."
                        },
                        "PerformanceMetrics": {
                            "val": "The majority of project performance metrics are specific to each effort and include measures identified in the project plans.  The metrics include items such as target dates from project work break down schedules, production measures, production goals, production numbers and demonstration goals and dates. In addition, generic performance metrics applicable to the Defense-Wide Manufacturing, Science and Technology (DMS&T) program includes attainment of previous administration goal, \"Speed technology transition focused on warfighting needs\".  The metrics for this objective and the objective of DMS&T is to transition 30% of completing demonstrations program per year.  Due to the relatively new time frame of the DMS&T program, transition rates for completed efforts for this new project are not available yet."
                        }
                    }
                }
            ]
        }
    }
}