{
    "id": "4a41b8a14d2dbbb958bb94ea0b61ef8fce51f79f",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA1_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601103A"
        },
        "ProgramElementTitle": {
            "val": "University Research Initiatives"
        },
        "R1LineItemNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "78.380"
            },
            "CurrentYear": {
                "val": "80.986"
            },
            "BudgetYearOne": {
                "val": "79.359"
            },
            "BudgetYearOneBase": {
                "val": "79.359"
            },
            "BudgetYearTwo": {
                "val": "79.679"
            },
            "BudgetYearThree": {
                "val": "79.977"
            },
            "BudgetYearFour": {
                "val": "80.156"
            },
            "BudgetYearFive": {
                "val": "81.159"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) supports Army basic research efforts in the Multidisciplinary University Research Initiative (MURI) program, the Defense University Research Instrumentation Program (DURIP) and the Presidential Early Career Awards for Scientists and Engineers (PECASE) program by funding basic research in a wide range of scientific and engineering disciplines pertinent to maintaining the U.S. land combat technology superiority.  Army MURI program efforts involve teams of researchers investigating high-priority, transformational topics that intersect more than one traditional technical discipline (e.g., Intelligent Luminescence for Communication, Display, and Identification).  For many complex problems, this multidisciplinary approach serves to accelerate research progress and expedite transition of results to application.  The DURIP provides funds to acquire major research equipment to augment current, or devise new, research capabilities in support of Army transformational research. The PECASE program funds single-investigator research efforts performed by outstanding academic scientists and engineers early in their independent research careers.\nProject support Minerva Research Initiative (MRI), a university based social science research project initiated by the Secretary of Defense in FY09.\n\nWork in the PE provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering science and technology focus areas and the Army Modernization Strategy.\n\nWork on this project is performed by the Army Research Laboratory (ARL), Research Triangle Park, NC."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "80.850"
                },
                "CurrentYear": {
                    "val": "80.986"
                },
                "BudgetYearOne": {
                    "val": "82.953"
                },
                "BudgetYearOneBase": {
                    "val": "82.953"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "78.380"
                },
                "CurrentYear": {
                    "val": "80.986"
                },
                "BudgetYearOne": {
                    "val": "79.359"
                },
                "BudgetYearOneBase": {
                    "val": "79.359"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.470"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.594"
                },
                "BudgetYearOneBase": {
                    "val": "-3.594"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.470"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.594"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.594"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "D55"
                    },
                    "ProjectTitle": {
                        "val": "University Research Initiative"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "75.149"
                        },
                        "CurrentYear": {
                            "val": "77.650"
                        },
                        "BudgetYearOne": {
                            "val": "76.021"
                        },
                        "BudgetYearOneBase": {
                            "val": "76.021"
                        },
                        "BudgetYearTwo": {
                            "val": "76.339"
                        },
                        "BudgetYearThree": {
                            "val": "76.637"
                        },
                        "BudgetYearFour": {
                            "val": "76.759"
                        },
                        "BudgetYearFive": {
                            "val": "77.701"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the Multidisciplinary University Research Initiative (MURI), the Defense University Research Instrumentation Program (DURIP) and the Presidential Early Career Awards for Scientists and Engineers (PECASE) program.  The MURI program funds university based basic research in a wide range of scientific and engineering disciplines pertinent to maintaining US land combat technology superiority.  Army MURI efforts involve teams of researchers investigating high-priority, transformational topics that intersect more than one traditional technical discipline (e.g. Intelligent Luminescence for Communication, Display, and Identification).  For many complex problems, this multidisciplinary approach serves to accelerate research progress and expedite transition of results to application.   The DURIP provides funds to acquire major research equipment to augment current, or devise new, research capabilities in support of Army transformational research.  The PECASE program funds single-investigator research efforts performed by outstanding academic scientists and engineers early in their independent research careers.\n\nWork in this project provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.   \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.   \n \nWork on this project is performed by the Army Research Laboratory (ARL) located in Research Triangle Park, NC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multidisciplinary University Research Initiative (MURI)"
                                    },
                                    "Description": {
                                        "val": "MURI programs are typically 5 years in length at a cost of $1.25M\/yr."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "58.872"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported MURI with 8 new awards that are critical to the Army's future operating capabilities.  MURI topics and lead institutions were High-Resolution Quantum Control of Chemical Reactions (Yale Univ), The Physics of Surface States with Interactions mediated by Bulk Properties,  Defects and Surface Chemistry (Princeton), Translating Biochemical Pathways to Non-Cellular Environments (Arizona State), Multivariate Heavy -Tail Phenomena: Modeling, Diagnostics, and Applications in Tactical Operations (Cornell), Imaging how a neuron computes (Columbia), Associating growth conditions with cellular composition in Gram-negative bacteria (UT-Austin), Coherent effects in hybrid nanostructures for lineshape engineering of electromagnetic media (Rice), and Evolution of Cultural Norms and Dynamics of Socio-Political Change (Univ Penn)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "59.410"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support MURI awards made in prior years and initiated 8 FY13 start MURI awards critical to future operating capabilities.  Effective transition mechanisms include collaboration among principal investigators, participation by 6.2\/6.3 program managers in MURI program reviews, and communication of the MURI research results to the Army Research Laboratory, the Research, Development, and Engineering Centers including Engineer Research and Development Center, U.S. Army Medical Research and Materiel Command, U.S. Army Research Institute, and industry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.743"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.743"
                                            },
                                            "Text": {
                                                "val": "Will provide support for MURI awards made in prior years will continue and will start 7-8 new FY14 MURI awards critical to future operating capabilities.  Effective transition mechanisms include collaboration among principal investigators, participation by 6.2\/6.3 program managers in MURI program reviews, and communication of the MURI research results to the Army Research Laboratory, U.S. Army Research, Development and Engineering Command, the Research, Development, and Engineering Centers (RDECs)  the Center of Excellences, including Engineer Research and Development Center (ERDC), U.S. Army Medical Research and Materiel Command, and the U.S. Army Research Institute, and industry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Presidential Early Career Awards for Scientists and Engineers (PECASE)"
                                    },
                                    "Description": {
                                        "val": "Supports PECASE investigators started in prior years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued support for prior year awardees and selected four new awards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.559"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Select four new awardees and supported prior year's awardees."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.414"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.414"
                                            },
                                            "Text": {
                                                "val": "Will continue support for prior year PECASE awards and select new FY14 PECASE awardees."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense University Research Instrumentation Program (DURIP)"
                                    },
                                    "Description": {
                                        "val": "Supports basic research through competitive grants for research instrumentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.677"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Awarded competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.681"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.864"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.864"
                                            },
                                            "Text": {
                                                "val": "Will award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "V72"
                    },
                    "ProjectTitle": {
                        "val": "Minerva"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.231"
                        },
                        "CurrentYear": {
                            "val": "3.336"
                        },
                        "BudgetYearOne": {
                            "val": "3.338"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.338"
                        },
                        "BudgetYearTwo": {
                            "val": "3.340"
                        },
                        "BudgetYearThree": {
                            "val": "3.340"
                        },
                        "BudgetYearFour": {
                            "val": "3.397"
                        },
                        "BudgetYearFive": {
                            "val": "3.458"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the Minerva Research Initiative (MRI), a university-based social science research program initiated by the Secretary of Defense in FY09.  It focuses on areas in the social sciences that are of strategic importance to U.S. national security policy which have not been substantially pursued in the past.  The Minerva research effort will be performed to understand the internal military-political dynamics of repressive regimes, the vulnerabilities of regimes and institutions to various kinds of disruption and instability, the nature of crowd dynamics, group violence, community belief structures, the potential to influence public opinion and attitudes in diverse cultures, cultural effects on network security and military operations, the influence of technology on military capabilities of potential adversaries and allies, and other intersections of social-cultural issues with military activities and national security.  Predictive models and other analysis tools will be developed.  Leveraging the expertise in the social sciences within the academic community is needed to provide understanding of the roots of terrorist organizations and the challenges and opportunities for military operations in a culturally diverse environment.  Better understanding at a fundamental level and new computational tools will provide a beneficial impact on war fighting capabilities at the national policy, military strategy, operational, and tactical levels, and will enhance the capabilities of intelligence activities at all levels.  All research results are open source.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Office."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Minerva Outreach and In-house Capability"
                                    },
                                    "Description": {
                                        "val": "Supports Minerva basic research projects and establishment of a Chairs program at principally military educational institutions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.033"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This effort was transferred to the Office of the Secretary of Defense (OSD) in FY2012 and will be executed by OSD in FY2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "The Minerva Research Initiative (MRI)"
                                    },
                                    "Description": {
                                        "val": "The MRI is a university-based social science research program initiated by the Secretary of Defense. It focuses on areas in the social sciences of strategic importance to U.S. national security policy. It seeks to increase the Department's intellectual capital in the social sciences and improve its ability to address future challenges and build bridges between the Department and the social science community. Minerva will bring together universities, research institutions, and individual scholars and support multidisciplinary and cross-institutional projects addressing specific topic areas determined by the Department."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.198"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued large university consortium research projects which were initiated in FY09 to conduct studies of the relationship of technology and national security in China, the stability vulnerabilities of African states and institutions to environmental stress, and the internal dynamics of the Baathist regime from the Iraqi perspective.  Support was provided to OSD in managing the program in social science studies related to strategy and policy via research chairs and fellowships at Service schools and universities, and directed by previous Congressional language on the Minerva program from authorization and appropriations committees."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.336"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue efforts on 3 existing projects described above and focused on social science and cultural issues affecting US military warfighting capabilities. Continue providing support to OSD in managing the program in social science studies related to strategy and policy via research chairs and fellowships at Service schools and universities. Validate predictive models developed in previous research with extensive field research and extended by new theoretical development. Collaborations with combatant commands, DoD policy staff, and governmental activities are being extended and strengthened. Increase the number of workshops and training courses for high level policy staff."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.338"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.338"
                                            },
                                            "Text": {
                                                "val": "The 3 university consortium projects started in FY09 (and described in FY2012 above) will be completed. Funds  will also support new and ongoing Minerva social science research of strategic importance to the Army and U.S. national security policy. Research efforts will focus on understanding group belief formation, factors causing or influencing social change and violence, societal resilience, theories of deterrence, and new approaches to conflict and cooperation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}