{
    "id": "4ede78efb1a518e568a90247561a0f3bcede73c9",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0605075D8Z"
        },
        "ProgramElementTitle": {
            "val": "DCMO Policy and Integration"
        },
        "R1LineItemNumber": {
            "val": "130"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "27.594"
            },
            "CurrentYear": {
                "val": "25.269"
            },
            "BudgetYearOne": {
                "val": "22.297"
            },
            "BudgetYearOneBase": {
                "val": "22.297"
            },
            "BudgetYearTwo": {
                "val": "25.135"
            },
            "BudgetYearThree": {
                "val": "21.932"
            },
            "BudgetYearFour": {
                "val": "22.187"
            },
            "BudgetYearFive": {
                "val": "22.618"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Deputy Chief Management Officer (DCMO), a position created by the National Defense Authorization Act for 2008, is the Principal Staff Assistant (PSA) and advisor to the Secretary and Deputy Secretary of Defense for matters relating to management and improvement of integrated DoD business operations.  The Office of the DCMO (ODCMO) was created to integrate business processes and over 2,400 business systems costing approximately $7B \/ year to acquire, modernize and operate.  Following FY 2012 disestablishment of the Business Transformation Agency (BTA), the ODCMO conducts research and development of the Business Enterprise Architecture (BEA) for the Department’s Business Mission Area (BMA).  The BEA, along with data standards development and war fighter support, provides the foundation for several Departmental priorities to include Financial Auditability and directed efficiencies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "41.529"
                },
                "CurrentYear": {
                    "val": "25.269"
                },
                "BudgetYearOne": {
                    "val": "22.672"
                },
                "BudgetYearOneBase": {
                    "val": "22.672"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "27.594"
                },
                "CurrentYear": {
                    "val": "25.269"
                },
                "BudgetYearOne": {
                    "val": "22.297"
                },
                "BudgetYearOneBase": {
                    "val": "22.297"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-13.935"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.375"
                },
                "BudgetYearOneBase": {
                    "val": "-0.375"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-13.935"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Economic Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.144"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.144"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "efficiencies"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.231"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.231"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2014, the decrease is a result of efficiencies.  Efforts where made  to centralize and consolidate contracting services and realize contracting efficiencies to improve acquisition planning and oversight. \n\nIn FY 2012  the funding was reprogrammed for civilian pay moved from RDT&E to O&M."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "075"
                    },
                    "ProjectTitle": {
                        "val": "DCMO Policy and Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.594"
                        },
                        "CurrentYear": {
                            "val": "25.269"
                        },
                        "BudgetYearOne": {
                            "val": "22.297"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.297"
                        },
                        "BudgetYearTwo": {
                            "val": "25.135"
                        },
                        "BudgetYearThree": {
                            "val": "21.932"
                        },
                        "BudgetYearFour": {
                            "val": "22.187"
                        },
                        "BudgetYearFive": {
                            "val": "22.618"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Deputy Chief Management Officer (DCMO), a position created by the National Defense Authorization Act for 2008, is the Principal Staff Assistant (PSA) and advisor to the Secretary and Deputy Secretary of Defense for matters relating to management and improvement of integrated DoD business operations.  The Office of the DCMO (ODCMO) was created to integrate business processes and over 2,400 business systems costing approximately $7B \/ year to acquire, modernize and operate.  Following FY 2012 disestablishment of the Business Transformation Agency (BTA), the ODCMO conducts research and development of the Business Enterprise Architecture (BEA) for the Department’s Business Mission Area (BMA).  The BEA, along with data standards development and war fighter support, provides the foundation for several Departmental priorities to include Financial Auditability and directed efficiencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DCMO Policy and Integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.594"
                                            },
                                            "Text": {
                                                "val": "Development and employment of Integrated Semantic Business Enterprise Architecture (BEA)\n• Continued to extend the BEA and its supporting development and maintenance tools into the Semantic Web technical domain. \n• Used the BEA to guide and constrain investment in Information Technology (IT) business systems and inform business process re-engineering(BPR)\/process improvement opportunities.\n\t\t\nEnd to End (E2E Process)\n• Refined, improved, re-engineered and represented in the BEA, the end-to-end processes that represent integrated DoD business operations.\n• Focused on defining detailed E2E processes for Procure-to-Pay (P2P) and Hire-to-Retire (H2R).\n  \nTools Development \n•The evaluation and oversaw development and testing of tools to build, analyze and execute the BEA throughout \nthe Business Mission Area. \n  \nEnterprise Information Webs (EIWs)\n• Conducted dedicated research and system engineering to design EIW Proof of Delivery (PoDs) pilots to establish the Initial Operational Capability (IOC) of Human Resource Enterprise Information Web (HR EIW) capability.  \n• Matured integration requirements and maintained fidelity of existing systems to work and to develop new\nCapabilities through PoDs that translate these results to executable Enterprise Transition Plans (ETPs).  \n• Continued the development and established baseline standards for  Business Intelligence (BI) standards and services which will access authoritative data sources from anywhere in the Department and present business information to DoD and external customers consistent with performance data standards modeled in the BEA.  \n\nBEA Ontologies\/Standards\n• Through systems engineering and incremental strategy of developing the BEA, managed Enterprise data standards to \ninclude standards of the Standard Financial Information Structure (SFIS) and Common Human Resources Information System (CHRIS) to support efficient and interoperable business systems.\n\nEIW Acquisition \n• Provided technical support to Defense Acquisition System\/Business Capability Life Cycle (DAS\/BCL) and Investment Review Boards (IRBs).\n• Continued, development and integration to support acquisition oversight requirements of Major Automated \nInformation System (MAIS).\t\t\n\nAcquisition Accountability Office for Afghanistan (AAOA)\n• Oversaw and guided, establishment of complete visibility of business operations to achieve  accountability and built a comprehensive common operating picture (COP) with tracking system traceability for all DoD funds obligated in-theater, electronically capturing DoD approved and funded requirements, obligations, disbursements.\n\nAdaptive Logistics Network (ALN)\nGuided establishment of repeatable processes and metrics that operationalize US Africa Command (AFRICOM) logistics strategy by developing a Logistics Clearinghouse and Geographic Information Systems (GIS) Access Tool Proof-of-Concept (Phase I). Efforts will improve logistics coordination among DoD, US Government Agencies and International Partners and will leverage existing logistics capabilities of the international logistics response community."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.269"
                                            },
                                            "Text": {
                                                "val": "Development and employment of Integrated Semantic Business Enterprise Architecture (BEA)\n• Continue evolution of the BEA to meet the 2012 NDAA direction to effectively guide, constrain and permit implementation of interoperable defense business system solutions. \n• Evaluate adherence to the Defense Business Systems Investment Management Process and oversee the development of the BEA, as well as the development and testing of tools and methods to build, analyze and execute the BEA throughout the Business Mission Area.\n\nEnd to End (E2E Process)\n• Complete mapping Procure-to-Pay (P2P) process mapping; continue Hire-to-Retire (H2R) process mapping; begin mapping Budget-to-Report (B2R) as directed by the Defense Business Systems Management Committee (DBSMC).\n• Provide evaluation and test of tools to support  management of core business mission process and data teams to the BEA build team in the construction of End to End processes.  \n• Deploy and baseline the automated Federation and Semantic compliance with the Semantic BEA. \n\nEnterprise Information Webs (EIWs)\n• Utilize the IOC of HR EIW capability to serve as the basis for future EIW releases.  \n• Through the Semantic BEA, continue to manage Enterprise Data standards to include the existing standards and new\nstandards such as the Procurement Data Standard (PDS), etc. \nTools Development \n• Establish a robust program for “Equipping the Workforce” to enable the implementation of BEA methods and processes across the Department.  This includes the training, tools and services to ensure success.\n• Develop and deploy services and support for automated BEA and architecture compliance using federation technologies for enabling compliance.\n• Expand the role of the BEA to validate and apply viable semantic capabilities to serve the ODCMO and DoD Enterprise and Federal reporting requirements.  \n• Develop, coordinate and promulgate policies in support of DoD business operations which will uniformly ensure \nefficiency and consistency.  \n• Use the BEA to guide and constrain investment in IT business systems, to maintain fidelity of existing systems, and  to develop new capabilities that translate these results to an executable ETP.  \n• Coordinate coupling between BEA and ETP business systems' development and deployment milestones.  \n• Provide resources and tools to update milestones, measure guidance, related templates and workbooks to be included in the ETP and reports to Congress.\n \nBEA Ontologies\/Standards\nEnable innovation through utilization of technology to support more and better business operations for the \nDepartment.  Innovations will support the full spectrum of operations to include people, processes and technology. \n• Be the technology strategic thought leadership for the DCMO.  These efforts include the articulation of business \nstrategy, metrics and outreach to business stakeholders, civilian and commercial thought leaders.  \n• Collaborate with DoD Chief Information Officer (CIO) for DoD Architecture Framework (DoDAF) implementation methods and standards, IT \nConsolidation and required DoD IT infrastructure to support business operations.  \n• Provide input to analyze progress against business system milestones and document analysis in the Congressional Report on Defense Business Operations.  \n• Encourage the evolution of architecture and data standards in support of DoD requirements and processes for engagement with international Standards bodies such as World Wide Web Consortium (W3C) and Object Management Group (OMG).\n• Support the DoD\/Veterans Affairs (VA) Joint Program Office for iEHR for BPR and architecture development and the use of technical standards.  \n• Enable deployment of Enterprise Resource Planning (ERP) tools consistent with evolving BEA direction  and guidance.  \n• Assess and respond to DoD Component CIO Evaluation Scorecard.  \n• Provide input to support Acquisition Oversight requirements of MAIS.\n• Collaborate with the Federal Chief Technology Officer (CTO) and (CIO) in support of Federal Reporting and Performance Initiatives.  \n• Support IT Business Acquisition Oversight by providing technical standards and real time support to Infrastructure IRBs.\n\nAcquisition Accountability Office for Afghanistan (AAOA)\n• Focus areas for AAOA and ALN will be a continuation of identifying business process gaps and supporting the\ninstitutionalization of process improvements.  Key activities would include oversight in capturing lessons learned and supporting Joint Staff, Services and OSD offices in developing new processes, policies and other pertinent Doctrine, Organization, Training, Materiel, Leadership, Personnel and Facilities (DOTMLPF) issues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.297"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.297"
                                            },
                                            "Text": {
                                                "val": "Development and employment of Integrated Semantic Business Enterprise Architecture (BEA)\n• Continue evolution of the BEA to meet the 2012 NDAA direction to effectively guide, constrain and permit implementation of interoperable defense business system solutions.\n\nTools Development \n• Evaluate adherence to Defense Business Systems Investment Management Process and oversee development of the BEA, as well as development and testing of tools and methods to build, analyze and execute the BEA throughout the Business Mission Area.\n  \nEnd to End (E2E Process)\n• Complete Hire-to-Retire (H2R)process mapping; continue Budget-to-Report (B2R) process mapping; begin\nfollow-on E2E mapping as directed by the Defense Business Council (DBC).\n• Deploy and baseline the automated Semantic BEA.\nEnterprise Information Webs (EIWs) \n• Continue to build EIW capabilities based on stakeholder needs.\n• Continue open source code of EIW federation engine and support the open source community to maintain and improve \ncode.\n• Evolve Investment Review Board data analytics capability with additional authoritative data sources and views.\n• Apply EIW framework to additional OSD and COCOM data analytic use cases.\n• Manage and maintain baseline capability and research additional optimizations and functions as required by emergent analytic use cases.  \n• Manage Enterprise Data standards to include the existing standards and new standards such as the PDS, etc. \n• Support automated BEA and architecture compliance using semantic technologies as the basis for compliance.\n• Establish Semantic BEA as a central function in the ODCMO and DoD Enterprise and Federal reporting.  \n• Develop, coordinate and promulgate policies in support of DoD business operations which will uniformly ensure \nefficiency and consistency in business operations.  \n• .  Use the BEA to guide and constrain investment in IT business systems, to maintain fidelity of existing systems, and  to develop new capabilities that translate these results to an executable ETP.\"\n• Coordinate coupling between BEA and ETP business systems' development and deployment milestones.  \n• Provide resources and tools to update milestones, measure guidance, related templates and workbooks to be included in the ETP and reports to Congress.  \n• Enable innovation through the utilization of technology to support more and better business operations for the\nDepartment.  Innovations will support the full spectrum\nof operations to include people, processes and technology.  Be the technology strategic thought leadership for the DCMO.  These efforts include the articulation of business strategy, metrics and the outreach to business stakeholders and civilian and commercial thought leaders. \n• Collaborate with DoD CIO for DoD Architecture Framework (DoDAF) implementation methods and standards, IT \nConsolidation and required DoD IT infrastructure to support business operations.  \n\n• Provide input to analyze progress against business system milestones and document analysis in the Congressional Report on Defense Business Operations.  \n\nBEA Ontologies\/Standards\n• Encourage evolution of architecture and data standards in support of DoD requirements and processes for engagement with international Standards bodies such as World Wide Web Consortium (W3C) and Object Management Group (OMG).  \n• Support the DoD\/Veterans Affairs (VA) Joint Program Office for iEHR (Electronic Health Record) BPR and architecture development and the use of technical standards.  \n•.Enable deployment of Enterprise Resource Planning (ERP) tools consistent with evolving BEA direction  and guidance.  \n• Assess and respond to DoD Component CIO Evaluation Scorecard.  \n• Provide input to support Acquisition Oversight requirements of MAIS.\n• Collaborate with the Federal CTO and CIO in support of Federal Reporting and Performance Initiatives.  \n• Support IT Business Acquisition Oversight by providing technical standards and real time support to the IRB.\n\nAcquisition Accountability Office for Afghanistan (AAOA)\n• RDT&E funding required to provide services that include all phases of planning, design, development, testing, \nproduction fielding, acquisition and management of logistics and DoD business systems related to AAOA and ALN in FY 14 will be completed.  Future AOAA and ALN accomplishments in FY 14 will require O&M funding in order to sustain and maintain all concepts of operations, roles and responsibilities.\n\nAcquisition Support\n\n• Provide input to support Acquisition Oversight requirements of MAIS DBS.\n• Develop, coordinate and promulgate policies in support of DoD business operations which will uniformly ensure \nefficiency and consistency in business operations.  \n• Provide input to analyze progress of delivery of business system capability against assigned portfolios for both Functional Strategies and Organizational Execution Plans."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This is a new DCMO Metric.  Incorporate Principal Staff Assistant (PSA) identified functional strategy goals, objectives, and outcomes into new releases of the BEA as directed by the Defense Business Council.  This metric based on the Section 2222 of Title 10, USC.  DCMO requirement for managing a single IRB for Business Mission Area which resulted in the requirement for PSAs to develop Functional Strategies.  DCMO FY 12 Goals N\/A.  FY 13 Goals will include 80% of PSA Functional Strategy Goals, Objectives and Outcomes.  FY 14 Goals will include 90% of PSA Functional Strategy Goals, Objectives and Outcomes."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "DCMO"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Most of the contracts fall into this cateqory"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "BEA and Planning, IMIE-Operation of Federal information Systems \/Services ,Resource information management system, Enterprise information Warehouse,"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "27.594"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "25.269"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.297"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.297"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "22.297"
                                                    },
                                                    "TotalCost": {
                                                        "val": "97.457"
                                                    },
                                                    "TargetValue": {
                                                        "val": "22.297"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}