{
    "id": "55c731475a430c9b2f52f0da81216fcc868ed5fe",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602670D8Z"
        },
        "ProgramElementTitle": {
            "val": "Human Social Culture Behavior (HSCB) Modeling Applied Research"
        },
        "R1LineItemNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.658"
            },
            "CurrentYear": {
                "val": "6.771"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Change from FY 2013 to FY 2014 reflects a reallocation of funds from the Office of the Secretary of Defense (OSD) Human Social Culture Behavior (HSCB) Modeling program to higher priority DoD requirements."
        },
        "ProgramElementMissionDescription": {
            "val": "The OSD HSCB Modeling Program is a vertically integrated effort to research, develop, and transition technologies, tools, and systems to programs of record and users in need.  The program exists to optimize U.S. forces’ ability to perform population-centric sensing, understand behaviors driven by social and cultural variables, and select effective courses of action in the full range of military operations.  Program research will enhance population-centric intelligence, surveillance, and reconnaissance (ISR) capabilities for understanding the increasingly complex global environment to address national strategic challenges such as instability, aggression, proliferation of weapons of mass destruction, and violent extremism.  In three integrated program elements (PE), the program will conduct applied research, mature and demonstrate advanced technology, and develop transitionable methods, technology, tools, and prototypes.  Work under PE 0602670D8Z  will focus on developing an applied science base, to include validated theory and methods, along with knowledge products and resources to support sociocultural behavior data collection, analysis and forecasting of sociocultural behavior, course of action planning, and effects analysis.  Research will address needs in two areas:  modeling and data.  It will develop and validate theoretical constructions, generate knowledge products, and develop stand-alone computational models of sociocultural behavior; and improve methods for collecting data that will facilitate model development and enhance forecasting and analysis capabilities.  The program will ensure that supported research is clearly tied to warfighters and their needs. \n\nHuman behavior based theory, knowledge products, and stand-alone models will support development of software to help users represent, understand, and forecast sociocultural behavior at strategic, operational, and tactical levels.\n\nImproved data collection methods will help build the sociocultural science base, facilitate subsequent model development and validation, and address emerging data types and sources."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.602"
                },
                "CurrentYear": {
                    "val": "6.771"
                },
                "BudgetYearOne": {
                    "val": "6.923"
                },
                "BudgetYearOneBase": {
                    "val": "6.923"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.658"
                },
                "CurrentYear": {
                    "val": "6.771"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.944"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-6.923"
                },
                "BudgetYearOneBase": {
                    "val": "-6.923"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.941"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-6.923"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.923"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 baseline adjustments are reflective of DoD priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P270"
                    },
                    "ProjectTitle": {
                        "val": "Human Social Culture Behavior (HSCB) Modeling Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.658"
                        },
                        "CurrentYear": {
                            "val": "6.771"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Change from FY 2013 to FY 2014 reflects a reallocation of funds from the Office of the Secretary of Defense (OSD) Human Social Culture Behavior (HSCB) Modeling program to higher priority DoD requirements."
                        },
                        "ProjectMissionDescription": {
                            "val": "The OSD HSCB Modeling Program is a vertically integrated effort to research, develop, and transition technologies, tools, and systems to programs of record and users in need.  The Program exists to optimize U.S. forces’ ability to perform population-centric sensing, understand behaviors driven by social and cultural variables, and select effective courses of action in the full range of military operations.  Program research will enhance population-centric intelligence, surveillance, and reconnaissance (ISR) capabilities for understanding the increasingly complex global environment to address national strategic challenges such as instability, aggression, proliferation of weapons of mass destruction, and violent extremism.  In three integrated program elements (PEs), the Program will conduct applied research, mature and demonstrate advanced technology, and develop transitionable methods, technology, tools, and prototypes.  Work under PE 0602670D8Z  will focus on developing an applied science base, to include validated theory and methods, along with knowledge products and resources to support sociocultural behavior data collection, analysis and forecasting of sociocultural behavior, course of action planning, and effects analysis.  Research will address needs in two areas:  modeling and data.  It will develop and validate theoretical constructions, generate knowledge products, and develop stand-alone computational models of sociocultural behavior; and improve methods for collecting data that will facilitate model development and enhance forecasting and analysis capabilities.  The Program will ensure that supported research is clearly tied to warfighters and their needs. \n\nHuman behavior based theory, knowledge products, and stand-alone models will support development of software to help users represent, understand, and forecast sociocultural behavior at strategic, operational, and tactical levels.\n\nImproved data collection methods will help build the sociocultural science base, facilitate subsequent model development and validation, and address emerging data types and sources."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Behavior Based Theory and Model Development"
                                    },
                                    "Description": {
                                        "val": "Conduct the research necessary to develop and refine theoretical constructs and validate them using empirical data.  Develop knowledge products including conceptual models, decision frameworks, and ontologies that will support population-centric sensing.  Apply validation techniques to quantitative models of sociocultural factors in coalition warfare and sociocultural factors of military significance for emerging conflicts.  Develop stand-alone models that instantiate social science theoretical constructs to address mission-specific needs to support population centric sensing and warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.507"
                                            },
                                            "Text": {
                                                "val": "Delivered models that can assist in measuring non-kinetic effects.  Advanced the development of methods for tracking narrative to monitor and mitigate violent extremism.  Developed theoretically-grounded methods for analysis of open source text to support indications and warnings, and situation awareness.  Developed tools to detect and measure changes in population and group sentiment to support instability forecasting.  Tested software that uses hybrid model to forecast strategic courses of actions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.371"
                                            },
                                            "Text": {
                                                "val": "Complete the development of and demonstrate model-based tools for understanding adversarial networks and tracking the impacts of adversary communications.  Deliver model to detect indicators of instability at level below country\/state using geographically clustered data.  Complete, develop, and deliver approaches for detecting and developing countermeasures for rumors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Visualization Methods"
                                    },
                                    "Description": {
                                        "val": "Develop common categorization of meta-information (i.e., the data source and pedigree, what types of uncertainty are associated with it, how old is the data, etc.) in existing visualization tools\/decision aiding systems.  Develop methods for visually and digitally depicting the incomplete, subjective, volatile, and\/or imprecise nature of cultural information to support manual and automated analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.326"
                                            },
                                            "Text": {
                                                "val": "Identified concepts for human-system interaction (HSI) capabilities that will enable an interactive exploration environment. Developed general and area of responsibility (AOR)-specific tools that enable U.S. government personnel to display hybrid sources of geospatially referenced data relating to Humanitarian Assistance and Disaster Relief (HADR) and other whole-of-government activities.  Matured techniques for visualizing terrorist rhetoric and network dynamics.  Developed approaches for graphical representation of extremist narrative structures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sociocultural Competencies and Training Methods"
                                    },
                                    "Description": {
                                        "val": "Define sociocultural behavior competencies, tailored to Military Occupational Specialties.  Develop conceptual model for sociocultural training of military personnel, including specification of competencies focused on relevant operational scenarios.  Develop methods and resources to support training of personnel, including non-experts, in most appropriate and effective use of computational models and model-based tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.180"
                                            },
                                            "Text": {
                                                "val": "Developed a framework and characterized the sociocultural knowledge, skills, and ability to enable virtual training of culture-general capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Collection Methods"
                                    },
                                    "Description": {
                                        "val": "Develop scientifically validated strategies to collect cultural and societal information in denied or difficult to penetrate areas.  Develop methodologies and supporting technologies capable of extracting relevant data into databases for further modeling to support denied, restricted, or unavailable area sociocultural data.  Develop technologies capable of leveraging extracted data, and processing and validating it, with a particular focus on data from social media."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.645"
                                            },
                                            "Text": {
                                                "val": "Researched multi-scale analysis of conflict and stability based upon micro-scale geographical data on violent events and potential causal factors.  Developed automated machine learning coding techniques for detecting bias (sentiment) in data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "Complete development and deliver assessment of the HSCB factors that can be inferred from overhead imagery and the limitations of imagery-derived data.  Complete automated methods for determining sentiment in social media\/news to support counterinsurgency courses of action.  Test and validate new methods for collection of data from open sources, including emerging media."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0603670D8Z BA 3"
                                    },
                                    "Title": {
                                        "val": "HSCB Advanced Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.153"
                                        },
                                        "CurrentYear": {
                                            "val": "8.235"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0604670D8Z BA 4"
                                    },
                                    "Title": {
                                        "val": "HSCB Research and Engineering"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.037"
                                        },
                                        "CurrentYear": {
                                            "val": "5.131"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}