{
    "id": "5ba02047b4db8ce93a40d95bda5ebca543a323b8",
    "meta": {
        "filename": "dod-2014_RDTE_2014_NAVY_BA1_3_RDTE_MasterJustificationBook_Navy_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Navy_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604258N"
        },
        "ProgramElementTitle": {
            "val": "Target Systems Development"
        },
        "R1LineItemNumber": {
            "val": "140"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "52.561"
            },
            "CurrentYear": {
                "val": "59.221"
            },
            "BudgetYearOne": {
                "val": "71.872"
            },
            "BudgetYearOneBase": {
                "val": "71.872"
            },
            "BudgetYearTwo": {
                "val": "29.126"
            },
            "BudgetYearThree": {
                "val": "27.729"
            },
            "BudgetYearFour": {
                "val": "20.386"
            },
            "BudgetYearFive": {
                "val": "34.017"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds the development and procurement of aerial targets, sea surface targets, control systems, and associated Target Augmentation and Auxiliary Systems needed to represent real world threat systems.  These capabilities are key enablers to the successful execution of the developmental and operational test and evaluation of naval combat weapons systems and to the satisfaction of advanced fleet training requirements. \n\nThis program is funded under Research, Development, Test, and Evaluation Management Support because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "44.700"
                },
                "CurrentYear": {
                    "val": "59.221"
                },
                "BudgetYearOne": {
                    "val": "32.999"
                },
                "BudgetYearOneBase": {
                    "val": "32.999"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "52.561"
                },
                "CurrentYear": {
                    "val": "59.221"
                },
                "BudgetYearOne": {
                    "val": "71.872"
                },
                "BudgetYearOneBase": {
                    "val": "71.872"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "7.861"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "38.873"
                },
                "BudgetYearOneBase": {
                    "val": "38.873"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "8.760"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.899"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "9.884"
                                },
                                "BudgetYearOneBase": {
                                    "val": "9.884"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "28.989"
                                },
                                "BudgetYearOneBase": {
                                    "val": "28.989"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The Subsonic Aerial Target (SSAT) (designated the BQM-177A) program required additional funding in FY 2014 to meet revised program cost estimates for the addition of (Classified) requirements for an Increment 2.\n\nThe Multi-Stage Supersonic Target (MSST) (designated the GQM-173A) program increased in design\/development costs, requiring additional funding in FY 2012 to align to the Contractor's Estimate to Complete (EAC) and prevent delays in the initial production schedule. The reprogramming transactions were compiled from the midyear sweep and internal realignments. The GQM-173A encountered test failures and as a result Milestone (MS) C is now planned for FY 2015. Funds in the amount of $28.987 million have been shifted from WPN (BLI 22800) in FY 2014 to continue EMD in order to complete all tests satisfactorily.  \n\nAir Superiority Target (AST) program: For FY 2012 the Navy share was reduced from the planned amount and shifted to FY 2013 because work on the Pre-EMD contract was delayed by water flooding a Boeing subcontractor.  For FY 2013, increased budget covers efforts on the Boeing EMD contract and also the acquisition of 3 QF-16 targets. FY 2014 will not include costs for EMD contract efforts.\n\nQF-4 Full Scale Aerial Target (FSAT):  The expenses of this effort are a function of the number of sorties\/target-presentations combined with the quantity of aircraft on the ramp at Tyndall and Holloman Air Force Bases requiring calendar maintenance."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0609"
                    },
                    "ProjectTitle": {
                        "val": "Aerial Target System Dev"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "46.353"
                        },
                        "CurrentYear": {
                            "val": "36.223"
                        },
                        "BudgetYearOne": {
                            "val": "53.020"
                        },
                        "BudgetYearOneBase": {
                            "val": "53.020"
                        },
                        "BudgetYearTwo": {
                            "val": "13.155"
                        },
                        "BudgetYearThree": {
                            "val": "10.354"
                        },
                        "BudgetYearFour": {
                            "val": "10.569"
                        },
                        "BudgetYearFive": {
                            "val": "11.341"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Aerial target systems, Target Control (TC), and associated Target Augmentation and Auxiliary Systems (TA\/AS) are developed to support test & evaluation and advanced fleet training for Joint Strike and Littoral Warfare Systems required to defend fleet surface and air units in a hostile environment. In addition to hardware, software and operational concept development, studies will be performed by an University Affiliated Research Center (UARC) to specify and verify needed target performance for future target development. For the design and validation of targets under development, the UARC will provide engineering studies in areas such as structures, controls, guidance, and propulsion.  For those hardware and software items presently under development by commercial vendors, the UARC will provide oversight and validation of vendor design and development approach.\nAs to specific harware development, this project includes:\n- Subsonic Targets: Subsonic Aerial Target (SSAT) (designated the BQM-177A) development.  The BQM-177A primarily represents subsonic anti-ship cruise missile threats in direct support of the test & evaluation (T&E) of major combat weapons systems programs and of fleet training.  \n- Supersonic Targets: Supersonic Sea Skimming Target (SSST), Multi-Stage Supersonic Target (MSST) (designated the GQM-173A), and supersonic high-diver capability development.  The family of supersonic target capabilities represents supersonic anti-ship cruise missile threats in direct support of Developmental Test and Evaluation (DT&E), Operational Test and Evaluation (OT&E) and Live Fire Test and Evaluation of major combat weapons systems programs in development.\n- TC and TA\/AS development: TC provides command and control of targets to enable the execution of threat-representative mission profiles.  TA\/AS enables each target to be uniquely configured for specific mission profiles. TA\/AS-configured targets are used for radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement and testing, radar cross section evaluation, decoy-effectiveness testing, maneuver analysis, electronic warfare evaluation, warhead-effectiveness testing and evaluation of fleet tactics.  TA\/AS scoring capabilities include both surface and airborne scalar and vector scoring systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Supersonic Targets"
                                    },
                                    "Description": {
                                        "val": "The GQM-173A target emulates a two-stage anti-ship cruise missile. The GQM-173A will have a subsonic bus stage vehicle which will tumble and fall into the sea, and a supersonic sprint stage vehicle which continues flight to impact. The fielded system will provide threat representation in support of DT&E and OT&E and will identify deficiencies in shipboard air defense systems. Funding will also continue for GQM-163 SSST upgrades\/evolutionary development to keep pace with evolving threat characteristics. Efforts include continuing to establish operational capability at Pacific Missile Range Facility, developing performance envelope characteristics to include flight termination performance, and continuing development of high-diver capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.149"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Entered Developmental Testing (DT).  Conducted first Engineering Development Model (EDM) flight.  Conducted Program Management Reviews (PMRs) and a Schedule Risk Assessment (SRA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct a technical re-baseline of the target to correct deficiencies found during the first EDM flight.  Conduct wind tunnel and ground testing.  Conduct redesign technical interchange meetings, PMRs and SRAs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.058"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.058"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct three EDM flights.  Continue ground testing.  Conduct rocket motor qualification, hazard classification and insensitive munitions testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Subsonic Targets"
                                    },
                                    "Description": {
                                        "val": "The BQM-177A represents subsonic anti-ship cruise missile threat in direct support of the T&E of major combat weapons systems programs and fleet training. It is the follow-on to the BQM-74 and BQM-34 targets, featuring longer range, lower cruise altitudes and greater maneuverability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.929"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted Engineering and Manufacturing Development (EMD). Completed Test Readiness Review and initiated the Preliminary Design Review. Commenced effort on Developmental Test I."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.217"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct EMD, including a Preliminary Design Review and a Critical Design Review.  Conduct developmental flight and ground testing, including software testing and electromagnetic interference, compatibility and vulnerability testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.644"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.644"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct eight Developmental Test Flights. Present to the Milestone C decision panel. Close out the EMD contract."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Control and Target Augmentation and Auxiliary Systems"
                                    },
                                    "Description": {
                                        "val": "Continue to support TC and TA\/AS capable of supporting T&E and fleet training activities.  TC involves the improved command and control systems capable of controlling multiple targets simultaneously while delivering adequate fidelity of T&E telemetry data. Augmentation and Auxiliary systems must be capable of augmenting targets in support of radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement\/test, radar cross section evaluation, decoy effectiveness, maneuver analysis, electronic warfare, warhead effectiveness and evaluation of fleet tactics, readiness and training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.275"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Filthy Badger DRFM - continued incremental upgrade efforts.\nContinued MMW Threat Emitter development.\nOngoing intelligence gathering and exploitation accomplished."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.606"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and prototype Electronic Attack Threat Simulators\nDevelop and prototype Active Emitter Threat Simulators\nGather and exploit threat intelligence"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.318"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.318"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and prototype Electronic Attack Threat Simulators\nDevelop and prototype Active Emitter Threat Simulators\nGather and exploit threat intelligence"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN 22800"
                                    },
                                    "Title": {
                                        "val": "Aerial Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "46.359"
                                        },
                                        "CurrentYear": {
                                            "val": "61.518"
                                        },
                                        "BudgetYearOne": {
                                            "val": "41.799"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "41.799"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "77.042"
                                        },
                                        "BudgetYearThree": {
                                            "val": "80.287"
                                        },
                                        "BudgetYearFour": {
                                            "val": "87.666"
                                        },
                                        "BudgetYearFive": {
                                            "val": "75.877"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "WPN 612020"
                                    },
                                    "Title": {
                                        "val": "Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.072"
                                        },
                                        "CurrentYear": {
                                            "val": "1.756"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.858"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.858"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.154"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.161"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.464"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.081"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT         PERFORMANCE REQUIREMENT               OBJECTIVE                       THRESHOLD                  TEST RESULT\n\n BQM-177           Maximum Speed at Low Altitude                  0.95 M @ 6.6 ft @              0.90 M @10.0 ft @           TBD\n EMD                   [Mach (M) at feet (ft) above wave                 Sea State 5                             Sea State 3\n program              crest at WMO Sea State conditions]\n                   \n GQM-173A       Speed of separated sprint                               Mach 2.2 to Mach 3.5           Threshold=Objective             TBD\n EMD                   vehicle\n\n TC-TA\/AS          Microwave power module -                         100 Watts output                    Threshold=Objective             TBD\n  Target Threat                   Second Source                                              power\n  Simulation Program"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0610"
                    },
                    "ProjectTitle": {
                        "val": "Wpn Sys T&E Trng Dev\/Proc"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.865"
                        },
                        "CurrentYear": {
                            "val": "21.608"
                        },
                        "BudgetYearOne": {
                            "val": "14.464"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.464"
                        },
                        "BudgetYearTwo": {
                            "val": "5.123"
                        },
                        "BudgetYearThree": {
                            "val": "10.618"
                        },
                        "BudgetYearFour": {
                            "val": "5.721"
                        },
                        "BudgetYearFive": {
                            "val": "18.598"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the development and procurement of aerial targets and associated systems used exclusively for test and evaluation of naval weapons systems which closely represent current and projected threats to fleet units in the Joint Strike and the Littoral Warfare environments. These representations must include characteristics related to size, performance envelope, and electromagnetic and infrared signatures. As threats change, changes must be made to keep the targets threat representative in response to changes in the test requirements of the developers of naval weapons systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Superiority Target (AST)"
                                    },
                                    "Description": {
                                        "val": "The AST is being developed as the follow-on to the current Full Scale Aerial Target (FSAT) and is an Air Force-managed program.  The QF-16 is a converted F-16 aircraft and provides a supersonic, high altitude, remote-controlled aerial target.  This target will have full command and control capability through normal flight maneuvers. The AST target presentations will support aircraft and weapons systems testing and development, including that of the Joint Strike Fighter (JSF), AIM-9X Sidewinder missile, Advanced Medium Range Air-to-Air Missile (AMRAAM), and Standard Missile 6 (SM-6)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.504"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued conduct of Pre-EMD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.395"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct EMD.  Commence procurement of AST assets with RDT&E,N funding.  Provide depreservation and conversion of three F-16 aircraft retrieved from Davis Monthan AFB storage."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.391"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.391"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue procurement of AST assets with RDT&E,N funding.  Conduct depreservation and conversion of three more F-16 aircraft retrieved from Davis Monthan AFB storage."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "QF-4 FSAT"
                                    },
                                    "Description": {
                                        "val": "The FSAT is a supersonic, high altitude, remote-controlled aerial target.  This target has full command and control capability through normal flight maneuvers.  The program will include engineering and logistics support for the FSAT, including Aviation Depot Level Repairables and procurement of kit material. The QF-4 target presentations support aircraft and weapons systems testing and development, including that of the JSF, AIM-9X Sidewinder missile, AMRAAM and Standard Missile 6."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.361"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintained and operated the fielded inventory earmarked for the Navy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.213"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plan to maintain and operate the fielded inventory earmarked for the Navy.  FSAT annual cost varies with the number of target sorties\/presentations required and the number of targets remaining on the ramp requiring service."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.073"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.073"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plan to maintain and operate the fielded inventory earmarked for the Navy."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT          PERFORMANCE REQUIREMENT                OBJECTIVE                 THRESHOLD             TEST RESULT\n\nQF-4                Flight Termination Sys.- Reliable                 Achieve requirement        Threshold=objective       Satisfactory\nFull                  & effective auto & manual failsafe\nScale                 fast destruct, orbit destruct, &\nTarget               destruct receiver capability\n\nAST - Air           Capable of carrying, operating                   Achieve requirement           Threshold=objective        TBD\nSuperiority         and monitoring required\nTarget                payloads\n(QF-16)"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0612"
                    },
                    "ProjectTitle": {
                        "val": "Surface Targets Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.343"
                        },
                        "CurrentYear": {
                            "val": "1.390"
                        },
                        "BudgetYearOne": {
                            "val": "1.366"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.366"
                        },
                        "BudgetYearTwo": {
                            "val": "1.410"
                        },
                        "BudgetYearThree": {
                            "val": "1.431"
                        },
                        "BudgetYearFour": {
                            "val": "1.473"
                        },
                        "BudgetYearFive": {
                            "val": "1.483"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops seaborne targets and their related target augmentation systems in support of air-to-surface and surface-to-surface weapons test and evaluation and fleet training."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Surface Targets Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.343"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Monitored developments in Command and Control (C2)\nPortable Command and Control Unit (PCCU) software baseline updated and tested\nReviewed capabilities of inventory with regard to threat, weapons test schedules and fleet training requirements\nRe-baselined Radar Cross-Section (RCS) for various powered and towed targets with augmentation   \nDeveloped packages to tailor RCS\nDeveloped signature management techniques to address evolving threats\nCompleted polyethylene tow target development\nCompleted deployable tow target development\nIntegrated PCCU into System for Naval Target Control (SNTC)\nIntegrated realistic human target (Humannequin) onto powered seaborne targets\nCompleted real-time target sea state measurement and operator feedback"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.390"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Monitor developments in C2\nPCCU software baseline update and testing\nReview capabilities of inventory with regard to threat, weapons test schedules and fleet training requirements\nRe-baseline RCS for various powered and towed targets with augmentation   \nDevelop packages to tailor RCS\nDevelop signature management techniques to address evolving threats\nIntegrate PCCU into SNTC"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.366"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.366"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of short burst data communication by satellite with Portable Command and Control Unit (PCCU) aboard seaborne platforms\nEvaluate transmission latency and applicability with Over The Horizon counter-swarm strategies\nSupport software development and continued testing of the transition to single hardware platform for joint hosting of PCCU and System for Naval Target Control (SNTC)\nDevelop PCCU ground station enhancements allowing for control of greater than 15 independent remote targets\nReview existing capabilities of seaborne Program of Record (POR) platform inventory with regard to threats, weapons test schedules and evolving Fleet training requirements\nEvaluate Fleet counter-swarm efforts to date and evaluate adequacy of existing  POR targets for Fleet support\nEvaluate high-speed targets with regard to Anti-Surface Warfare (ASuW) weapons test requirements and recommend a path forward\nRefine Hummanequin Graphical User Interface (GUI) on PCCU display to ease utility\nImprove scoring algorithms for real-time feedback for small caliber weapons\nWork with Multiple Integrated Laser Engagement System (MILES) systems developers to incorporate larger shipboard weapon systems with MILES technology\nDevelop updated Technical Data Package (TDP) for replacement Mobile Ship Target (MST) based upon lessons learned and emerging ship-sized target requirements\nProvide cost analysis of new missile capable patrol boat simulator\nInitiate development of upgraded polyethylene hull components for towed targets with goal of reduced unit cost and enhanced survivability\nRefine design and fabrication of passive Radio Frequency reflectors across varied aperture lengths to reduce unit cost and ease fabrication\nDevelop large polyethylene towed target (>50') for ASuW alternatives to high value powered targets"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/5455"
                                    },
                                    "Title": {
                                        "val": "ASW Range SE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.823"
                                        },
                                        "CurrentYear": {
                                            "val": "47.930"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.694"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.694"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "17.912"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.022"
                                        },
                                        "BudgetYearFour": {
                                            "val": "18.173"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.293"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "171.163"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Review capability of inventory with respect to threat, weapons test schedules and fleet training requirements.  OBJECTIVE:  Available inventory of seaborne targets to meet fleet requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2159"
                    },
                    "ProjectTitle": {
                        "val": "ASW TARGET"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.022"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.022"
                        },
                        "BudgetYearTwo": {
                            "val": "9.438"
                        },
                        "BudgetYearThree": {
                            "val": "5.326"
                        },
                        "BudgetYearFour": {
                            "val": "2.623"
                        },
                        "BudgetYearFive": {
                            "val": "2.595"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "A new cost effective expendable ASW Training Target is required to acoustically and dynamically emulate threat submarines for fleet qualification and proficiency training on and off undersea ranges.  Acoustically a new system is required to provide a higher fidelity active sonar system and torpedo sonar system with expanded frequency coverage than current systems to be compatible with sonar and torpedo systems being fielded on the P-8, SH-60R, and AN-SQQ-89 capable surface ships and the MK54 Mod 0 and MK48 Mod 7 Torpedoes. Dynamically the target needs to emulate both low and high speed ends of threat submarines performance envelope to provide needed training realism."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ASW Target Development"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.022"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.022"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Acquisition documentation development and specification development to be supported by risk reduction engineering analysis in areas of transducers, high energy batteries and air launch related technologies.  Further engage fleet commands\/users to develop and refine detailed system performance requirements, industry engagement, and draft RFP release."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "3141"
                                    },
                                    "Title": {
                                        "val": "ASW Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "31.803"
                                        },
                                        "CurrentYear": {
                                            "val": "10.385"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.031"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.031"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.686"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.245"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.243"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.302"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "81.695"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "-Frequent IPT meeting with contract and government technical program personnel\n-Rigorous acoustic, environmental and in-water dynamic test program\n-Specification with threshold and objectives requirements\n-Industry Day completed\n-Draft RFP released for industry review"
                        }
                    }
                }
            ]
        }
    }
}