{
    "id": "5e01bf5524f612f9be65388dd9c740dd215cb9a3",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA3_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603001A"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "29"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "55.679"
            },
            "CurrentYear": {
                "val": "39.359"
            },
            "BudgetYearOne": {
                "val": "56.056"
            },
            "BudgetYearOneBase": {
                "val": "56.056"
            },
            "BudgetYearTwo": {
                "val": "65.433"
            },
            "BudgetYearThree": {
                "val": "53.068"
            },
            "BudgetYearFour": {
                "val": "42.567"
            },
            "BudgetYearFive": {
                "val": "42.547"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 increases support for Technology Enabled Capability Demonstrations (TECDs) 1.b (Force Protection Soldier\/Small Unit), 2.a (Overburdened Physical Burden) and 4.a (Basing Sustainment and Logistics)."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) provides Soldiers and Small Combat Units with the most effective personal clothing, equipment, combat rations, shelters and logistical support items with the least weight and sustainment burden. This PE supports the maturation and demonstration of technologies associated with air delivery of personnel and cargo (Project 242), rapid ammunition\/munitions deployability and resupply (Project 543), combat rations and combat feeding equipment (Project C07), combat clothing and personal equipment (including protective equipment such as personal armor, helmets, and eye wear) (Project J50) and expeditionary base camps (Project VT5). Project J52 funds congressional special interest items. The projects in this PE adhere to Tri-Service Agreements on clothing, textiles, and food with coordination provided through the Cross-Service Warfighter Equipment Board, the Soldier as a System Integrated Concepts Development Team, and the DoD Combat Feeding Research and Engineering Board.   \n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nWork in this PE is related to, and fully coordinated with, PE 0602786A (Warfighter Technology), PE 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602705A (Electronics and Electronic Devices), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology), PEs 0602623A and 0603607A (Joint Service Small Arms Program) and PEs 0602784A (Military Engineering Technology) and 0603734A (Military Engineering Advanced Technology).   \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy. \n \nWork is led, performed, and\/or managed by the Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA and the Armament Research, Development, and Engineering Center (ARDEC), Picatinny, NJ."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "52.896"
                },
                "CurrentYear": {
                    "val": "39.359"
                },
                "BudgetYearOne": {
                    "val": "42.186"
                },
                "BudgetYearOneBase": {
                    "val": "42.186"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "55.679"
                },
                "CurrentYear": {
                    "val": "39.359"
                },
                "BudgetYearOne": {
                    "val": "56.056"
                },
                "BudgetYearOneBase": {
                    "val": "56.056"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.783"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "13.870"
                },
                "BudgetYearOneBase": {
                    "val": "13.870"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.247"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.464"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "13.870"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.870"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "242"
                    },
                    "ProjectTitle": {
                        "val": "Airdrop Equipment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.755"
                        },
                        "CurrentYear": {
                            "val": "3.222"
                        },
                        "BudgetYearOne": {
                            "val": "3.768"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.768"
                        },
                        "BudgetYearTwo": {
                            "val": "3.812"
                        },
                        "BudgetYearThree": {
                            "val": "3.361"
                        },
                        "BudgetYearFour": {
                            "val": "4.421"
                        },
                        "BudgetYearFive": {
                            "val": "3.859"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates equipment and innovative techniques for precision aerial delivery of cargo and personnel.  Aerial delivery is a key capability for rapid force projection and global precision delivery. These efforts are designed to advance state of the art precision delivery technologies such as parachutes, guidance and navigation and control components and subsystems, tracking sensors, software algorithms, and safety rigging which integrates with currently equipped aircraft, unmanned aerial systems (UAS) and advanced rotary wing aircraft.  These efforts provide the Warfighter with highly accurate, timely cargo\/payload delivery and resupply in all terrain and weather conditions.  Precision delivery\/resupply reduces vulnerability of ground soldiers, aircraft and crew. Precision aerial delivery supports remote warfare with activities such as placement of battlefield sensors, reduction of Soldier load and initial delivery of key expeditionary base camp assets.  Demonstrated technologies transition to Product Manager (PM)-Force Sustainment Systems (PM FSS), PM-Soldier Clothing and Individual Equipment (PM-SCIE) as well as other Army PMs.\n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nWork in this project is fully coordinated with PE 0602786A (Warfighter Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Precision Aerial Delivery of Cargo"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY13, this effort will be captured in the new Airdrop\/Aerial Delivery Demonstration technology effort. This effort demonstrates enhancements for increasing the precision of aerial delivery using components and technical breakthroughs from PE 0602786A\/Project 283."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.814"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured, demonstrated and transitioned sensor technologies for real-time monitoring of weather to PM-FSS Joint Precision Aerial Delivery Systems (JPADS); matured advanced rotary wing aerial delivery sling load net technologies for low cost one-time-use."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Airborne Insertion (Personnel Airdrop)"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY13, this effort will be captured in the new Airdrop\/Aerial Delivery Demonstration technology effort. This effort demonstrates technical breakthroughs identified by PE 0602786A\/Project 283 which provide safety and security enhancements for the aerial insertion of Airborne troops."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.941"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured technologies for cargo\/jumper locators and demonstrated payload-to-payload, jumper-to-jumper and payload-to-jumper in-flight communications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Airdrop\/Aerial Delivery"
                                    },
                                    "Description": {
                                        "val": "This effort (previously conducted in Advanced Precision Aerial Delivery of Cargo and Advanced Airborne Insertion (Personnel Airdrop) matures and demonstrates parachute materials and designs, precision guidance and navigation software and hardware, tracking sensors and safety devices to increase the accuracy in the delivery of cargo to remote locations and\/or complex terrains, as well as increase safety of personnel insertions into theaters of operations. Projects transition to this effort from previous Advanced Precision Aerial Delivery of Cargo entry.  This work further evolves breakthroughs from PE 0602786A\/Project 283 and is coordinated with PE0602786A\/Project VT4. In FY13 and 14 this effort supports Technology Enabled Capability Demonstration 2a Overburdened Physical Burden for tactical aerial resupply technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.222"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate Helicopter Sling Load (HSL) hardware for unmanned payload hookup to increase safety for ground personnel; mature in-flight deconfliction and tracking sensors and software to prevent midair collisions of payloads; demonstrate mission planning software and tracking devices for rapid drop zone (DZ) assembly of troops and their equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.768"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.768"
                                            },
                                            "Text": {
                                                "val": "Will integrate and demonstrate net-centric in-flight collision avoidance and wind sharing technologies into the precision aerial delivery system for the Ultra Light Weight (<500 pounds) payload weight class to prevent midair collisions of payloads and to optimize aerial re-supply to Soldiers as a means of reducing carried weight; mature and demonstrate technologies to create the capability for multiple airdrops from a single helicopter via sling load release that increases effectiveness and efficiency for logistic delivery of personnel and equipment; mature and demonstrate sensor technologies and software algorithms for real-time monitoring and systems communication between payloads and ground stations to support tactical aerial resupply; demonstrate accuracy of parafoil to increase accuracy of payload resupply, reduce cost as well as equipment retrograde\/retrieval weight and volume to decrease the burden of Soldiers engaged in airborne operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "543"
                    },
                    "ProjectTitle": {
                        "val": "Ammunition Logistics"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.125"
                        },
                        "CurrentYear": {
                            "val": "2.308"
                        },
                        "BudgetYearOne": {
                            "val": "2.505"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.505"
                        },
                        "BudgetYearTwo": {
                            "val": "2.524"
                        },
                        "BudgetYearThree": {
                            "val": "2.261"
                        },
                        "BudgetYearFour": {
                            "val": "2.300"
                        },
                        "BudgetYearFive": {
                            "val": "2.341"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates technologies for rapidly deploying and resupplying munitions and improving the return of unused ammunition from deployment.  This effort contributes to force readiness and reduction in the logistics footprint through improvements in Materials Handling Equipment (MHE), ammunition and missile packaging\/palletization, explosives safety, weapons re-arm, and asset throughput\/management.\n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy. \n\nWork in this project is performed and managed by the US Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automated Material Handling Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates smart sensors and robotic load handling equipment as add-on kits for side loading forklifts used in ammunition storage igloos and tactical forklifts to provide quick, safe, and cost effective transfer of munitions pallets between storage areas and transportation assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.241"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Applied automated capabilities to a manually operated forklift and evaluated performance within an ammunition igloo."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.308"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Will integrate inventory planning and control software into a robotics applique kit; demonstrate autonomous forklift operations in an ammunition igloo."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.391"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.391"
                                            },
                                            "Text": {
                                                "val": "Will provide preliminary design architecture of an autonomous material handling applique kit for the 5000 lb capacity tactical forklift."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapon System Rearm Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates automated modular re-arm systems for the medium caliber ground combat vehicle, as well as towed and self-propelled howitzers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.884"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Selected concepts and preliminary designs for re-arm system designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Packaging"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a lightweight multi-modal pallet with embedded container restraint systems.  The system automatically locks down onto the top surface of a redesigned advanced cargo platform to form a multimodal distribution capability for rapid, more efficient deployment and sustainment operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.714"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.714"
                                            },
                                            "Text": {
                                                "val": "Will complete material market survey and initiate prototype pallet and platform designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Safety for Automated Base Camp Planning"
                                    },
                                    "Description": {
                                        "val": "This effort integrates explosives safety site planning software with automated base camp planning tool to reduce time to plan base camps and improve soldier safety.\nIn FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection – Basing."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Will complete preliminary system integration and engineering tests of automated base camp planning software that incorporates explosives safety."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C07"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Combat Feeding Tech Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.400"
                        },
                        "CurrentYear": {
                            "val": "2.180"
                        },
                        "BudgetYearOne": {
                            "val": "3.737"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.737"
                        },
                        "BudgetYearTwo": {
                            "val": "4.005"
                        },
                        "BudgetYearThree": {
                            "val": "2.123"
                        },
                        "BudgetYearFour": {
                            "val": "2.088"
                        },
                        "BudgetYearFive": {
                            "val": "2.097"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates technologies for military combat feeding systems and combat rations.  Areas of emphasis include: enhanced nutrient composition to maximize cognitive and physical performance on the battlefield; cutting edge food stabilization and preservation techniques that increase the variety and quality of rations used by the Joint Services; novel ration packaging solutions to minimize degradation of combat rations during storage; field portable biosensors for food-borne pathogen detection and identification as well as predictive modeling tools to protect the Warfighter from food-borne illnesses. This project demonstrates combat feeding equipment with reduced logistics (in component parts, weight, volume, fuel, and water) and labor requirements, while improving the quality of food service. The project, a Department of Defense (DoD) program for which the Army has Executive Agent responsibility, provides technology development for Joint Service Combat Feeding. The DoD Combat Feeding Research and Engineering Board provides oversight for this project.  Demonstrated field feeding equipment transition to Product Manager (PM)-Force Sustainment Systems (PM FSS).\n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nWork in this project complements and is fully coordinated with PE 0602787A (Medical Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the US Army Natick Soldier Research, Development and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Combat Feeding Equipment Technology"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY13, this effort will be renamed from Combat Feeding Equipment Technologies to Joint Combat Feeding Equipment Technology Demonstrations. This effort demonstrated equipment and energy technologies to enhance effectiveness and reduce logistics footprint of field feeding systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.192"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a fully integrated Battlefield Kitchen with improved habitability and safety, as well as reduced fuel consumption; demonstrated a grey water recycling system for mobile kitchens to manage liquid waste on the battlefield; demonstrate mission tailorable, man-portable appliances capable of integrating into current kitchen platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.940"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct technology demonstration of kitchen appliances with an integrated fuel fired, low cost, rugged burner that enables high efficiency operation and is logistically supportable."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.488"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.488"
                                            },
                                            "Text": {
                                                "val": "Will conduct technical demonstrations of new refrigeration technologies to improve fuel efficiency, increase operation in hot environments, and reduce failure rates as well as procurement and maintenance costs; integrate new power technologies to demonstrate self-sustaining appliances that reduce reliance on field generators in field kitchens as well as to reduce fuel costs and reduce resupply demands."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ration Stabilization, Packaging, Nutrient Delivery and Food Safety Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates mature nutritional biochemistry, food processing and packaging solutions to enhance nutrition and improve food stabilization, ration packaging and food safety to support Warfighter's physical and cognitive performance on the battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.208"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated ration packaging permeability models that will be used to develop better ration packaging systems to decrease battlefield waste and packaging weight; demonstrated fortified ration components that will result in a wider variety of eat-on-the-go rations with nutrient composition optimized for Warfighter physical and cognitive performance for specific missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.240"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate the effectiveness of using Super-Critical Carbon Dioxide to increase the long term storage shelf life of rations; evaluate the capability for the Joint Biological Agent Identification System (JBAIDS) to detect both bio-threat agents and food service risk and demonstrate nutritional compounds identified in collaboration with US Army Medical Research Institute of Environmental Medicine to augment muscle recovery."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.249"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.249"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate reduction of secondary packaging by utilizing emerging polymer materials and manufacturing methods to reduce packaging bulk\/weight, and eliminate field waste; validate increased availability and stability of anti-oxidants within ration components to improve Warfighter performance and recovery time; verify safety, acceptability, cost, and shelf-life of meat\/seafood processed in novel drying processes for application to group rations options and expanded shelf-life."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J50"
                    },
                    "ProjectTitle": {
                        "val": "Future Warrior Technology Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.127"
                        },
                        "CurrentYear": {
                            "val": "28.616"
                        },
                        "BudgetYearOne": {
                            "val": "38.215"
                        },
                        "BudgetYearOneBase": {
                            "val": "38.215"
                        },
                        "BudgetYearTwo": {
                            "val": "47.386"
                        },
                        "BudgetYearThree": {
                            "val": "37.010"
                        },
                        "BudgetYearFour": {
                            "val": "28.282"
                        },
                        "BudgetYearFive": {
                            "val": "28.675"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, demonstrates and integrates lightweight, multifunctional materials and components to provide Soldier and Small Units with the most effective personal protection, electronics connectivity and mission specific equipment while evaluating the potential to reduce physical weight, cognitive burden and sustainment needs within the required protection and functional capabilities required for the Small Unit. This project develops, matures and maintains a Soldier systems engineering architecture commensurate with other major Army platforms. Efforts in this project focus on maturing, integrating and demonstrating personal protection (such as armor, headgear, eyewear and hearing protection); durable clothing for all weather conditions; and power management solutions. In addition, special focus is on understanding and demonstrating the impacts of physical and cognitive load on Soldier mission performance and implementing strategies to reduce load and\/or optimize loads to reduce injuries. These efforts integrate geographically dispersed laboratory environments to conduct comprehensive assessments and report the technical viability of Soldier system solutions and conducts field demonstrations to obtain relevant feedback for user acceptance and performance validation.\n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nWork in this project complements and is fully coordinated with PEs 0602786A (Warfighter Technology), PE 0602618A (Ballistics Technology), PE 0602105A (Materials Technology), PE 0602787A (Medical Technology), PE 0602716A (Human Factors Engineering Technologies), PE 0602705A (Electronics and Electronic Devices), PE 0603710A (Night Vision Advanced Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology) and 0603015A (Next Generation Training & Simulation Systems.)\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the US Army Natick Soldier Research, Development and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier\/Small Unit Ballistic and Blast Protection"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY13, this effort will be captured in the Soldier \/Small Unit Integrated Protection technology effort. This effort matures and demonstrates Soldier systems level modeling, test devices, protocols and technologies to improve Warfighter survivability against blast and ballistic (B&B) threats.  Work in this project is fully coordinated with PEs 0602786A\/Project H98, 0602618\/Project 61 and 0602787A\/Project 878 Demonstrated technologies transition to Product Manager-Soldier Protection and Individual Equipment and\/or industry partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.874"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improved the body armor assessment protocol by validating range of motion measurements with operationally-relevant Soldier agility assessment techniques; demonstrated head and face protection retrofit for existing helmets and will transition detailed specification and prototypes; synchronized and focus Modeling and Simulation programs to analyze existing data (mobility, protection, payload, lethality) and established trade space, quantify risk\/tradeoffs to optimize protection concepts and advance state-of-the-art design rules for individual armor."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier\/Small Unit Integrated Protection"
                                    },
                                    "Description": {
                                        "val": "This effort is one component of the previously named Soldier\/Small Unit Integrated Protection and Load Management. In FY14, the load management component will transition to Soldier and Small Unit Load Management. This effort matures and demonstrates proven components and material advancements which are integrated into experimental ensembles or prototypes that have potential to significantly increase protection of individual Soldiers and\/or reduce physical load at equal or better capability. This work is fully coordinated with PE 060786A\/Project H98, PE 0602716A\/Project H70 and PE 0602705\/Project H94. Demonstrated technologies transition to various PEO-Soldier Product Managers. In FY13 and FY14 this efforts supports Technology Enabled Capability Demonstration 1b Force Protection-Soldier\/Small Unit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.936"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to refine and improve the integrated Soldier-centric headgear design and conduct system evaluations; selected promising Flame Resistant, visual, thermal, ballistic and concealment\/signature management technologies; and baselined mission specific equipment for modular Soldier as a System protection variants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.820"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate protective eyewear with improved ballistic impact, anti-fog, scratch resistance lenses; demonstrate upgradeable headgear protection with improved ballistic, eye, face, hearing protection and a display that enhances the situational awareness in combat conditions (night, rain, obscurants); complete validation of a body armor assessment protocol integrating Soldier agility and physiology parameters; develop camouflage ensemble components for a lab-based assessment; build on ballistic and blast strategy developed in FY12 to exploit lighter weight materials, processing methods, and equipment configurations to reduce Soldier borne load; apply modeling and simulation tools to assess load mitigating technologies to reduce physical injuries and enhance small unit mobility and Soldier endurance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.940"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.940"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate lightweight multifunctional materials for protective clothing and individual equipment to increase protection to vital areas such as pelvis, torso, extremity, head and face; validate protective area of coverage and weight balance for shoulders and hips to optimize Soldier protective armor design; mature hearing protection that mitigates impulse noise exposure without diminishing auditory situational awareness; conduct field assessments and modeling and simulation to optimize the design of multi threat protective components incorporating capabilities such as signature management, environmental protection (flame\/thermal, cold\/wet, insect) hygiene management; transition technologies, metrics and tools matured in this effort to PEO Soldier Product Managers, TRADOC for future requirements development and into the Soldier systems engineering architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier\/Small Unit Load Management and Mobility Enhancement"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY13, this effort will be captured in the Soldier \/Small Unit Integrated Protection technology effort. This effort uses a system engineering approach to reduce Soldier and Small Unit load by integrating lighter weight materials into components, employing energy\/power management strategies and devising mechanisms\/equipment to offload some mission equipment. This work is fully coordinated with PE 060786A\/Project H98, PE 0602716A\/Project H70 and PE 0602705\/Project H94."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.953"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Focused on a holistic approach to identify capabilities that enable the Small Unit to efficiently shoot or move across varying terrain; devised measures to assess the impact of load on marksmanship performance; conducted field validation of mobility aids to exploit Soldier's use and application of spatial information; developed Soldier\/Small Unit applications to be incorporated into mission planning tools for load management, Soldier cross-loading and resupply analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System Integration of Soldier and Small Unit Operated Electronics"
                                    },
                                    "Description": {
                                        "val": "This effort (previously titled Small Unit C4 Interfaces) matures and integrates hardware and software components into a robust and effective information system of systems for Soldier and Small Unit. The goal of this effort is to define standard electronic interfaces for select platforms and aggregate information from unattended robotic assets that support Small Unit operations.  Effort is coordinated with PE 0602786A\/Project H98, PE 0603710A\/Project K70, PE 0602624A\/Project H18, PE 0603005\/Project 497, PE 0603008A\/TR1 and PE 0603004\/Project 232. In FY13-14 this efforts supports Technology Enabled Capability Demonstration 2a Overburdened Physical Burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.806"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated gunfire detection and target identification into the Soldier network; increased Wireless Personal Area Network (WPAN) Application Specific Integrated Circuit (ASIC) functionality to connect a wide range of Soldier-borne hardware components (such as sensors for weapon target pairing) and optimized form factor for efficient operation and layout; developed and demonstrated user interface technologies for mission command networking of Soldier and unmanned sensors; conducted field demonstrations of capabilities Small Units employ during intelligence gathering, training, and other operations; optimized Soldier acceptance parameters including form factor graphical user displays for efficient task completion and power management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.212"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature and optimize information portrayal interfaces for full spectrum operations in cognitively burdened environments; refine system architectures by duty positions for hand held (e.g. Smart phones) access to Company level data required during tactical operations in restricted terrains and expeditionary base camps; mature and demonstrate optimized dismounted operations software algorithms enabling tactile relevant information transfer and explore technology solutions to refine the design sets for integrating nano unmanned air system into the Soldier Network architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.949"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.949"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate Soldier\/Small Unit load planning tool and decision support software for reducing individual Soldier load by distributing mission specific combat loads across the unit based on mission and physical metrics (e.g. mission environment, terrain, physical condition, load as a percentage of body weight, etc.); building on work completed in FY13, demonstrate information portrayal integration from handheld un-manned air and ground sensors relayed to Soldier-borne electronic devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier and Small Unit Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates lightweight, energy dense Soldier power storage, generation and power management components and subsystems.  The goal is to fully support the power needs of a dismounted mission in an electronically equipped battlefield. This effort is fully coordinated with 0602705A\/Project H11 and Project H94.  In FY13-14 this efforts supports Technology Enabled Capability Demonstration 2a Overburdened Physical Burden. Beginning in FY14, efforts for power and energy demand management will be captured within the effort titled Soldier and Small Unit Load Management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.944"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated central conformal headgear power source; demonstrated wireless power transfer from body to weapon or helmet; and mature multi-fueled (JP8, DF, kerosene) man-packable tactical power source and battery charger; evaluated laboratory data assessing network power requirements and mature smaller, lighter wearable hybrid power source to enable extended missions. Effort is coordinated with PE 0602705A\/projects H11 and H94."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.441"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate improved power source with one or more systems and demonstrate performance in a relative environment; integrate and evaluate wearable fuel cell hybrid power source enabling longer mission durations; mature higher efficiency wireless power transfer on the body to eliminate cables; demonstrate higher power and energy density multi-fuel engine based man-packable power source; investigate energy harvesting models and concepts; analyze energy efficiency improvements in power sinks to optimize battery size; demonstrate power centric software."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System Integration Laboratory for Evaluation of Emerging Technological Capabilities"
                                    },
                                    "Description": {
                                        "val": "This effort (previously titled Small Unit Systems Engineering, Integration and Demonstration) develops and matures a Soldier systems engineering architecture and system integration laboratory environment in which current and emerging Soldier systems can be assessed to determine viability and military utility. This capability is used to assess new and emerging Soldier clothing and equipment components as well as configurations against established baselines using Human-in-the-Loop principles. This effort also matures and integrates human performance assessment measures, evaluation devices required at various testing locations and develops standardized methodologies required for demonstrations to provide operationally relevant assessments. This effort is coordinated with PE 0602716A\/Project H70, PE 0602786A\/Project H98, 060315A\/Project S28 and 0603004A\/Project 232. In FY13-14 this efforts supports Technology Enable Capability Demonstration 1b Force Protection Soldier\/Small unit and 2a Overburdened Physical Burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.903"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed, integrated, and demonstrated embedded laboratory data collection tools for assessing cognitive burden associated with information management algorithms and physical burden associated with hardware and network component interfaces; continued assessing maturity of Soldier-borne technologies and power centric architectures in simulated field relevant environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.143"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimize laboratory diagnostic tool suites required to measure and analyze mission effectiveness, power, and mobility metrics that will provide the necessary information to make trade-off decisions for Soldier and Small Unit capability sets and enabling technologies; mature the Soldier\/Squad virtual simulation capability by integrating design and performance parameters including physical and cognitive load, select blast and ballistic effects, mission command networking, and terrain data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.236"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.236"
                                            },
                                            "Text": {
                                                "val": "Will develop and mature a Soldier systems engineering architecture with an established Soldier baseline platform developed using the laboratory diagnostic tool suites defined in FY13; will apply system integration tools to conduct lab and field assessments in relevant environments to demonstrate and validate integrated load planning tools with capabilities such as equipment cross-loading options across the small unit, expedited route planning, metabolic cost estimation and initial validation for heat strain prediction; will build on FY13 body armor system integration laboratory assessment tools, assess emerging body armor systems for improved Soldier combat effectiveness and survivability relative to system sizing, weight and configuration; will provide knowledge products such as empirical component and systems performance data, TRL assessments, trade-off analyses, and standardized performance metrics for capability demonstrations and acquisition decisions and future requirements development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Combat Unit Load Reduction"
                                    },
                                    "Description": {
                                        "val": "Identify technologies to improve Soldier and Small Unit mobility and endurance. Analyze reductions in physical load and load-related injuries as well as impacts to cognitive behavior and mission success.  Conduct concept and technology assessments of components and subsystems or systems models and demonstrate general military utility when applied to different types of military techniques. Work in this effort is fully coordinated with all other tasks in this PE.  Beginning in FY13, the results from this effort will transition to Soldier\/Small Unit Integrated Protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.711"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Defined a Small Combat Unit representative load baseline; surveyed Government and Industry to identify and harvest opportunities to reduce or better manage loads; identified tools necessary to diagnose and visualize load effects of equipment as well as measure mission effectiveness and mobility; developed concept and technology assessment plan with methods, metrics and measures; conducted a technology assessment of the representative baseline; conducted a concept assessment of the best collection of soldier technologies identified in survey; identified impact to capabilities created by the concept and identify tradeoffs required to make a difference in Small Combat Unit Load."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier and Small Unit Load Management"
                                    },
                                    "Description": {
                                        "val": "This effort (previously conducted under Soldier\/Small Integrated Protection and Load Management and Small Combat Unit Load Reduction) matures and demonstrates proven components and strategies for materiel weight reduction, load management mission planning tools and off-loading approaches which have potential to reduce Soldier physical carried load. This work is fully coordinated with PE 060786A\/Project H98, PE 0602716A\/Project H70 and PE 0602705\/Project H94. Demonstrated technologies transition to various PEO-Soldier Product Managers. In FY12-FY14 this efforts supports Technology Enabled Capability Demonstration 2a Overburdened Physical Burden. Technologies, metrics and tools developed in this effort will transition to PEO Product Managers, TRADOC and integrate into the Soldier systems engineering architecture and Systems Integration Laboratory environment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.090"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.090"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate weight reduction technologies and load management concepts identified in FY12 and FY13 that reduce the physical carried load of dismounted Soldiers at the squad level without negatively impacting Soldier performance and squad effectiveness; demonstrate reductions in Soldier carried load through integration of technologies such as materiel weight reductions (e.g. clothing and equipment, power and energy, and weapons and ammo) gained from lightweight multifunctional materials and reduction of size and cube of Soldier carried items; demonstrate the impact of incorporating Soldier performance prediction capabilities into the mission planning process as a means to manage individual and squad carried loads in concert with emerging tactical aerial resupply or off-loading options; validate human performance and musculoskeletal injury reduction metrics and tools to diagnose and visualize load effects of equipment as well as measure mission effectiveness and mobility; mature and demonstrate select off-loading technologies such as augmentation and weight distribution devices and determine the applicability of these technologies in dismounted and forward operations missions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VT5"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Mobile Base Camp Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.272"
                        },
                        "CurrentYear": {
                            "val": "3.033"
                        },
                        "BudgetYearOne": {
                            "val": "7.831"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.831"
                        },
                        "BudgetYearTwo": {
                            "val": "7.706"
                        },
                        "BudgetYearThree": {
                            "val": "8.313"
                        },
                        "BudgetYearFour": {
                            "val": "5.476"
                        },
                        "BudgetYearFive": {
                            "val": "5.575"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates mission-specific plug and play components, subsystems and modules designed to optimize manpower requirements, improve situational awareness, increase survivability, improve habitation, reduce logistics footprint, enhance supportability and reduce cost.  Expeditionary Base Camp (EBC) systems (or remote command outposts) provide an operational capability for Small Combat Units (battalion and below) and Soldiers which are rapidly deployable\/re-locatable and require no Military Construction and limited materiel handing support. The need for this technologically enabled capability has arisen as a result of new tactics, techniques and procedures used in austere, remote, and challenging environments in which stability operations, counterinsurgency operations and peace keeping missions are conducted. The Army envisions continuing to conduct this full range of operations worldwide, particularly in the Asia Pacific and Middle East regions. This project integrates mature technologies to create mission specific lab demonstrators and evaluates the performance capabilities using metrics and methodologies developed under PE 0602786\/\/Project VT4.   \n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.  \n\nWork in this project is led, performed and\/or managed by the US Army Natick Soldier Research, Development and Engineering Center (NSRDEC), Natick, MA and fully coordinated with PE 0602786A (Warfighter Technology), PE 0602784A and 0603734A (Military Engineering) PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Base Camp (EBC) Technology Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort assesses and integrates maturing technologies required to plan, establish, operate, protect, sustain and redeploy a holistic small unit base camp system and manage its power, waste and water resources. In FY13 and FY14, this effort supports Technology Enabled Capability Demonstration 4a Basing Sustainment and Logistics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.272"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed maturing power, waste and water technologies and defined an operationally effective architecture for a basic base camp demonstrator; began system integration of best performing components, and validated system effectiveness measures; began to mature and demonstrate the architecture for a unit mission base camp planning tool identifying pertinent system aspects such as interoperability requirements and power demand."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.033"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Apply FY12 system effectiveness measures and technical performance criteria to validate that the baseline architecture reduces basing manpower needs and operational energy efficiencies; use performance measures, interoperability criteria and power demand as attributes to begin development of a small unit base camp planning tool; mature passive protection, power, waste and water technology systems in compliance with the parameters defined in the baseline architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.831"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.831"
                                            },
                                            "Text": {
                                                "val": "Will mature self-sustaining contingency basing and system technologies that are modular and man-portable to support the needs of the Squad and Small Unit by providing a high quality of living in efficient, expeditionary systems; demonstrate technical performance parameters identified in FY13 to assess basing manpower needs, operational energy efficiency, water demand and waste remediation and sub-system interoperability; demonstrate contingency basing technologies to assess the performance of an integrated basing system with reduced sustainment requirements that limit delivery of water and fuel as well as the need for collecting, managing and disposing of solid and liquid waste."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}