{
    "id": "5ea3dcd9ab609db7212e63c2435801499bdfdfb6",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601120D8Z"
        },
        "ProgramElementTitle": {
            "val": "National Defense Education Program (NDEP)"
        },
        "R1LineItemNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "87.874"
            },
            "CurrentYear": {
                "val": "87.979"
            },
            "BudgetYearOne": {
                "val": "84.271"
            },
            "BudgetYearOneBase": {
                "val": "84.271"
            },
            "BudgetYearTwo": {
                "val": "96.906"
            },
            "BudgetYearThree": {
                "val": "97.393"
            },
            "BudgetYearFour": {
                "val": "82.727"
            },
            "BudgetYearFive": {
                "val": "84.337"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The purpose of the National Defense Education Program (NDEP) is to attract, engage, and develop current and future generations of science, technology, engineering, and mathematics (STEM) talent to benefit the Department of Defense (DoD) mission.  NDEP is DoD’s primary program to execute high quality, experiential STEM efforts for pre-Kindergarten-12th Grade (PK-12) students through world-class researchers to address DoD’s STEM workforce needs, and to provide current and future scientific and technological capabilities.  NDEP initiatives align with the four priority areas of the National Science and Technology Council (NSTC) Committee on STEM Education (CoSTEM) Federal Five-Year STEM Strategic Plan: (1) STEM teacher training, (2) groups underrepresented in STEM, (3) STEM undergraduate education, and (4) STEM engagement. \n\nNDEP consists of three components:  (1) Science, Mathematics, and Research for Transformation (SMART); (2) the National Security Science and Engineering Faculty Fellowship (NSSEFF); and (3) pre-Kindergarten-12th Grade (PK-12).  NDEP aligns to the Science and Technology (S&T) priorities and emerging scientific research areas, the integrated STEM\/Historically Black Colleges and Universities and Minority Institutions (HBCU\/MIs) synchronized with the Federal Five-Year STEM Strategic Plan, the DoD STEM Strategic Plan and the in-progress DoD Strategic Workforce Plan.  NDEP components are guided and informed by the Office of Management and Budget’s “Use of Evidence and Evaluation in the 2014” memorandum and are consistent with Government Accountability Office guidance on assessment and evaluation practices. \n\nSMART awards highly competitive scholarships-for-service to undergraduate and graduate students in 19 academic STEM disciplines and moves graduates directly into DoD's workforce following graduation.  Internships provide SMART scholars with an opportunity to engage in hands-on research and work experiences in DoD labs, thereby enhancing their educational experience and building a public service commitment to the Department’s mission.  Since its inception as a pilot program in FY 2005, SMART has supported approximately 1,130 students from bachelor’s to doctoral levels and to date approximately 550 have completed program studies and transitioned into the DoD workforce.  SMART ensures that DoD has a steady infusion of highly educated, high caliber U.S. technical talent, prepared in areas of critical importance to DoD, ready to apply their technical knowledge, skills, and abilities to help DoD fulfill its mission. \n\nNSSEFF supports 29 world-class researchers (NSSEFF Fellows) in areas of critical importance to DoD and ensures the cultivation of exceptional future talent.  The NSSEFF Fellows work with approximately 100 undergraduate students, 200 graduate students, and 100 post-doctoral scholars at their respective academic institutions.  Three cohorts of NSSEFF Fellows, with the first selected in FY 2008, have provided critical connections between academia and the DoD science and engineering enterprise.  Fellows’ work spans all seven DoD S&T priorities and the six emerging scientific research areas.  NSSEFF Fellows serve as speakers at DoD events, reviewers on panels for DoD science, and as collaborators with scientists and engineers at DoD’s laboratories and other research facilities.\n\nNDEP PK-12 engages, develops, and attracts STEM talent for future DoD military and civilian workforce needs via 68 local sites and nine national organizations.  NDEP PK-12 leverages the DoD’s STEM expertise to connect students, teachers, schools, and public sector and industry partners with DoD subject matter experts (SMEs) primarily in those communities adjacent to DoD laboratories and bases where the talent pool resides.  Authentic STEM experiences for teachers and students include hands-on activities that are aligned with DoD’s technical workforce requirements.  Since FY 2007, NDEP PK-12 has increased the number of DoD facilities that directly engage local education authorities (LEAs) to: (1) build student interest in STEM fields and disciplines and in careers specific to DoD; (2) develop DoD-relevant science, engineering and mathematics skills; and (3) provide future talent to fulfill DoD’s demand for highly skilled STEM professionals. NDEP PK-12 has utilized 4,100 exceptional DoD STEM professionals to reach 500,000 students and 8,300 teachers in 30 states. As one specific example, DoD SMEs contributed over 8,000 hours to lead FIRST Robotics Competition teams, with over 90 percent of team members reporting that the hands-on experience taught them about how science and technology can be used to solve real-world science and engineering problems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "83.577"
                },
                "CurrentYear": {
                    "val": "87.979"
                },
                "BudgetYearOne": {
                    "val": "78.690"
                },
                "BudgetYearOneBase": {
                    "val": "78.690"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "87.874"
                },
                "CurrentYear": {
                    "val": "87.979"
                },
                "BudgetYearOne": {
                    "val": "84.271"
                },
                "BudgetYearOneBase": {
                    "val": "84.271"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.297"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.581"
                },
                "BudgetYearOneBase": {
                    "val": "5.581"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.323"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "5.581"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.581"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.026"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 baseline adjustments are reflective of DoD priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P120"
                    },
                    "ProjectTitle": {
                        "val": "National Defense Education Program (NDEP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "87.874"
                        },
                        "CurrentYear": {
                            "val": "87.979"
                        },
                        "BudgetYearOne": {
                            "val": "84.271"
                        },
                        "BudgetYearOneBase": {
                            "val": "84.271"
                        },
                        "BudgetYearTwo": {
                            "val": "96.906"
                        },
                        "BudgetYearThree": {
                            "val": "97.393"
                        },
                        "BudgetYearFour": {
                            "val": "82.727"
                        },
                        "BudgetYearFive": {
                            "val": "84.337"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The purpose of the National Defense Education Program (NDEP) is to attract, engage, and develop current and future generations of science, technology, engineering, and mathematics (STEM) talent to benefit the Department of Defense (DoD) mission.  NDEP is DoD’s primary program to execute high quality, experiential STEM efforts for pre-Kindergarten-12th Grade (PK-12) students through world-class researchers to address DoD’s STEM workforce needs, and to provide current and future scientific and technological capabilities.  NDEP initiatives align with the four priority areas of the National Science and Technology Council (NSTC) Committee on STEM Education (CoSTEM) Federal Five-Year STEM Strategic Plan: STEM teacher training, groups underrepresented in STEM, STEM undergraduate education, and STEM engagement. \n\nNDEP consists of three components:  (1) Science, Mathematics, and Research for Transformation (SMART); (2) the National Security Science and Engineering Faculty Fellowship (NSSEFF); and (3) pre-Kindergarten-12th Grade (PK-12).  NDEP aligns to the Science and Technology (S&T) priorities and emerging scientific research areas, the integrated STEM\/Historically Black Colleges and Universities and Minority Institutions (HBCU\/MIs) synchronized with the Federal Five-Year STEM Strategic Plan, the DoD STEM Strategic Plan and the in-progress DoD Strategic Workforce Plan.  NDEP components are guided and informed by the Office of Management and Budget’s “Use of Evidence and Evaluation in the 2014” memorandum and consistent with Government Accountability Office guidance on assessment and evaluation practices. \n\nSMART awards highly competitive scholarships-for-service to undergraduate and graduate students in 19 academic STEM disciplines and moves graduates directly into DoD's workforce following graduation.  Internships provide SMART scholars with an opportunity to engage in hands-on research and work experiences in DoD labs, thereby enhancing their educational experience and building a public service commitment to the Department’s mission.  Since its inception as a pilot program in FY 2005, SMART has supported approximately 1,130 students from bachelor’s to doctoral levels and to date approximately 550 have completed program studies and transitioned into the DoD workforce.  SMART ensures that DoD has a steady infusion of highly educated, high caliber U.S. technical talent, prepared in areas of critical importance to DoD, ready to apply their technical knowledge, skills, and abilities to help DoD fulfill its mission. \n\nNSSEFF supports 29 world-class researchers (NSSEFF Fellows) in areas of critical importance to DoD and ensures the cultivation of exceptional future talent.  The NSSEFF Fellows work with approximately 100 undergraduate students, 200 graduate students, and 100 post-doctoral scholars at their respective academic institutions.  Three cohorts of NSSEFF Fellows, with the first selected in FY 2008, have provided critical connections between academia and the DoD science and engineering enterprise.  Fellows’ work spans all seven DoD S&T priorities and the six emerging scientific research areas.  NSSEFF Fellows serve as speakers at DoD events, reviewers on panels for DoD science, and as collaborators with scientists and engineers at DoD’s laboratories and other research facilities.\n\nNDEP PK-12 engages, develops, and attracts STEM talent for future DoD military and civilian workforce needs via 68 local sites and nine national organizations.  NDEP PK-12 leverages the DoD’s STEM expertise to connect students, teachers, schools, and public sector and industry partners with DoD subject matter experts (SMEs) primarily in those communities adjacent to DoD laboratories and bases where the talent pool resides.  Authentic STEM experiences for teachers and students include hands-on activities that are aligned with DoD’s technical workforce requirements.  Since FY 2007, NDEP PK-12 has increased the number of DoD facilities that directly engage local education authorities (LEAs) to: (1) build student interest in STEM fields and disciplines and in careers specific to DoD; (2) develop DoD-relevant science, engineering and mathematics skills; and (3) provide future talent to fulfill DoD’s demand for highly skilled STEM professionals. NDEP PK-12 has utilized 4,100 exceptional DoD STEM professionals to reach 500,000 students and 8,300 teachers in 30 states. As one specific example, DoD SMEs contributed over 8,000 hours to lead FIRST Robotics Competition teams, with over 90 percent of team members reporting that the hands-on experience taught them about how science and technology can be used to solve real-world science and engineering problems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Science, Mathematics, and Research for Transformation (SMART) Defense Education Program"
                                    },
                                    "Description": {
                                        "val": "SMART is a scholarship-for-service program that provides support to high performing U.S. graduate and undergraduate students in 19 academic STEM disciplines identified as areas of future workforce need by DoD.  \n\nThe disciplines align with the Department’s seven S&T priorities and emerging scientific research areas.  The disciplines are: Aeronautical and Astronautical Engineering; Biosciences; Chemical Engineering; Chemistry; Civil Engineering; Cognitive, Neural, and Behavioral Sciences; Computer Science; Electrical Engineering; Geosciences; Industrial and Systems Engineering; Information Sciences; Materials Science and Engineering; Mathematics; Mechanical Engineering; Naval Architecture and Ocean Engineering; Nuclear Engineering; Oceanography; Operations Research; and Physics.  Upon completion of their degree, students fulfill a service commitment to DoD on a one-to-one payback per year of education funded.  In part, SMART success is measured by participants that remain in the DoD workforce beyond their required service commitment.\n\nOversight of the SMART program falls under the Office of the Assistant Secretary of Defense for Research and Engineering (OASD(R&E)).  Two types of individuals participate in the program: retention scholars who are current DoD employees and recruitment scholars who are college students enrolled in undergraduate and graduate programs and represent new talent for the DoD.  Internships provide SMART scholars with an opportunity to engage in hands-on research and work experiences in DoD labs, thereby enhancing their educational experience and building a public service commitment to the Department’s mission.\n\nSince FY 2005, approximately 1,130 students have participated in SMART at approximately 160 sponsoring facilities.  As of July 2012, approximately 550 SMART scholars have transitioned into the service commitment phase.  To date, these scholars have transitioned as civilian employees into the Air Force, Army, Navy, and other DoD components.  Among those who transitioned to employment, 82 percent who have completed their service commitment are still employed by DoD beyond their original service commitment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "43.325"
                                            },
                                            "Text": {
                                                "val": "• Successfully transitioned the administration of the SMART program from the Naval Postgraduate School to OASD(R&E).\n•  Examined the effectiveness of efforts to increase the number of eligible applicants from underrepresented groups such as women and minorities, veterans, and individuals preparing to separate from the military.\n•  Continued to increase the number of eligible applicants as well as application reviewers from HBCU\/MIs.\n•  Assessed the effectiveness of the transition process through data analysis and implementation of direct hiring authority.\n•  Transitioned approximately 250 participants into the DoD STEM workforce.\n•  Selected new participants based on available funding.\n•  Created efficiencies through the streamlining of processes and development of Web portals and information management systems.\n•  Collected data on the impact of the SMART investment on DoD and its facilities (e.g., patents, publications, and other outputs) in order to measure the efficacy of SMART as an approach to distributed research and as a collaborative method for networking DoD programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "46.867"
                                            },
                                            "Text": {
                                                "val": "•  Continue to examine the effectiveness of efforts to increase the number of eligible applicants from underrepresented groups such as women and minorities, veterans, and individuals preparing to separate from the military.\n•  Increase transparency and effectiveness of the program through the engagement of and benchmarking across the DoD components.\n•  Continue to assess the mentoring and workforce development initiatives for current participants and the effectiveness of the transition process.\n•  Transition approximately 100 participants into the DoD workforce.\n•  Select new participants based on available funding.\n•  Coordinate with the HBCU\/MI program to increase the number of eligible applicants as well as application reviewers from HBCU\/MIs.\n•  Conduct a study to benchmark the performance of SMART PhD scholars (i.e., time to degree) with those of their peers in the general U.S. PhD population."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "48.720"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "48.720"
                                            },
                                            "Text": {
                                                "val": "•  Continue to examine the effectiveness of efforts to increase the number of eligible applicants from underrepresented groups such as women and minorities, veterans, and individuals preparing to separate from the military.  \n•  Examine SMART participation and growth of degrees conferred at HBCU\/MIs.\n•  Continue to assess SMART mentoring and workforce development initiatives for current participants and the effectiveness of the transition process.\n•  Transition approximately 100 participants into the DoD workforce.\n•  Increase the number of candidate spots and select new participants based on available increased funding.\n•  Establish metrics to measure effectiveness of SMART program, including: (1) percentage of SMART participants enrolled at HBCU\/MIs; (2) percentage of eligible SMART participants transitioned to the DoD workforce; and (3) percentage of SMART scholars retained post-service commitment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National Security Science and Engineering Faculty Fellowship (NSSEFF)"
                                    },
                                    "Description": {
                                        "val": "NSSEFF ensures that DoD has a research portfolio that supports the foremost creative, innovative, and productive university researchers, and their students and trainees.  \n\nObjectives of the program are to:\n•  Support scientific research that may lead to breakthroughs for DoD.\n•  Educate and train outstanding student and post-doctoral researchers in support of DoD and national security research areas and the DoD technical workforce.\n•  Foster long term relationships between outstanding university researchers and DoD.\n•  Familiarize select university researchers and their students with DoD’s current and future scientific and technical challenges.\n•  Increase the number of exceptionally talented technical experts who contribute to DoD’s mission and upon whom DoD may draw to serve on advisory boards, panels, and groups.\n\nThe program funds distinguished researchers at our Nation’s leading universities to conduct innovative basic research in areas of interest to DoD.  Ensuring that students and trainees are actively engaged in conducting research with world-class researchers that are funded by DoD is an important priority.  In addition, NSSEFF Fellows forge research partnerships with DoD labs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.099"
                                            },
                                            "Text": {
                                                "val": "•  Continued to support current NSSEFF Fellows.\n•  Engaged undergraduate students through post-doctoral scholars with DoD scientists and engineers to strengthen their understanding of topic areas of importance to DoD.\n•  Continued to foster engagement opportunities for students and Fellows with DoD’s scientific and technical community."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.930"
                                            },
                                            "Text": {
                                                "val": "•  Continue support for current NSSEFF Fellows.\n•  Conduct a NSSEFF program review and report on Fellows’ progress.\n•  Develop a new competition solicitation.\n•  Organize and conduct two scientific workshops to further develop the collaborative relationships between DoD researchers and NSSEFF Fellows in areas of scientific or technological importance to DoD.\n•  Develop metrics for NSSEFF program effectiveness as both a high prestige scientific program for national leaders in their fields, and as an effective means for long-term engagement of the PIs and their research team’s with DoD scientific staff."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.551"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.551"
                                            },
                                            "Text": {
                                                "val": "•  Continue support for current NSSEFF Fellows.\n•  Conduct a NSSEFF program review and report on Fellows’ progress.\n•  Organize and conduct two scientific workshops to further develop the collaborative relationships between DoD researchers and NSSEFF Fellows in areas of scientific or technological importance to DoD.\n•  Utilize the metrics developed in FY 2013 to assess the effectiveness and impact of the program.\n•  Conduct a new competition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PK-12"
                                    },
                                    "Description": {
                                        "val": "As the demand for a diverse, highly skilled scientific and technical military and civilian DoD workforce grows, DoD is investing in and strengthening local defense communities by enhancing student engagement in STEM initiatives that support DoD research areas.  NDEP PK-12 leverages the DoD’s STEM professionals and facilities to connect students, teachers, schools, and public sector and industry partners with DoD subject matter experts (SMEs) in communities adjacent to DoD laboratories and bases.  NDEP PK-12 (1) builds student interest in STEM fields and disciplines and in careers specific to DoD; 2) develops DoD-relevant science, engineering and mathematics skills; and (3) provides a future talent pool to fulfill DoD’s demand for highly skilled STEM professionals by increasing access to authentic STEM experiences."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.550"
                                            },
                                            "Text": {
                                                "val": "•  Increased the quality and duration of engagements led by DoD SMEs in local communities adjacent to DoD laboratories and bases.\n•  Initiated development of a system wide evaluation and assessment plan to determine effective practices and opportunities to expand engagement with students, teachers, schools, the public sector and industry partners, and national organizations in alignment with the National Science and Technology Council’s Federal Committee on STEM Education (CoSTEM) Strategic Plan and in concert with the Office of Management and Budget and General Accountability Office guidance on assessment and evaluation.\n•  Built upon existing, sustainable partnerships between NDEP PK-12 and DoD laboratories and bases to identify effective engagement practices and work to build long-term sustainability and institutionalization of PK-12 informal education.\n•  Expanded partnerships across DoD to maximize NDEP investments in PK-12 learning to leverage available funding and to build a future STEM workforce capacity for DoD.\n•  Supported the FY 2012 U.S.A. Science and Engineering Festival Expo, where DoD was the second largest exhibitor, with 30 DoD organizations represented.\n•  Provided over 5,000 copies of the NDEP funded “Engineering – Go For It” magazines to middle school teachers to enrich their instruction and increase student awareness of engineering careers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.182"
                                            },
                                            "Text": {
                                                "val": "•  Perform strategic planning activities to foster connectivity of NDEP PK-12 initiatives to the DoD civilian and military STEM workforce, optimize NDEP STEM investment, update and improve DoD STEM policy related to NDEP, and achieve greater coordination among NDEP Defense Component participants.\n•  Increase the quality and duration of engagements led by DoD SMEs in communities near DoD laboratories and bases.\n•  Develop a performance management system to enable on-going monitoring of key initiatives.\n•  Engage evaluation expertise to build assessment and evaluation capabilities for NDEP PK-12 investments in alignment with CoSTEM guidelines and in concert with Office of Management and Budget and General Accountability Office guidance on assessment and evaluation.\n•  Ensure all NDEP PK-12 investments are managed consistent with the CoSTEM general management criteria and are building robust evaluation systems.\n•  Build upon existing, sustainable partnerships amongst higher education institutions and PK-12 school systems to build capacity for long-term sustainability.\n•  Build upon existing, sustainable partnerships between NDEP PK-12 and DoD laboratories and bases to identify effective engagement practices associated with authentic STEM experiences and in alignment with DoD STEM requirements (military and civilian) and work to build long-term sustainability and institutionalization of PK-12 informal education. \n•  Insure the quality of partnerships across DoD to maximize NDEP’s investments in PK-12 learning to leverage available funding and to build a diverse future STEM workforce for DoD.\n•  Leverage and maximize the FY 2013 NDEP PK-12 investment through the implementation of effective practices for the engagement of local partners with DoD SMEs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "•  The PK-12 program will transfer to the National Science Foundation in FY 2014."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National Defense Science and Engineering Graduate (NDSEG) Fellowship Program"
                                    },
                                    "Description": {
                                        "val": "The NDSEG Fellowship program develops and attracts current and next generation STEM talent by funding competitive scholarships to U.S. citizens and nationals pursuing doctoral degrees in STEM research areas critical to DoD.  These research areas include bioscience, engineering, computer and computational science, mathematics, and cognitive and behavioral science."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.900"
                                            },
                                            "Text": {
                                                "val": "•  Funded tuitions and stipend payments for the 2012 NDSEG class.\n•  Participated in STEM outreach.\n•  Supported the 2012 NDSEG selection process."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "• The increase in the direct and indirect connectivity of NDEP participants (SMART, NSSEFF, and PK-12 students) with DoD.\n• SMART PhD scholars research productivity:  (1) number of research papers; (2) number of research citations.\n• The increase in the number of SMART scholars that are transitioned into the DoD workforce. \n• The increase in the number of SMART scholars that are retained by DoD post-service commitment.\n• The increase in the number of eligible SMART\/NSSEFF applicants from HBCU\/MIs.\n• The increase in the number of SMART\/NSSEFF application reviewers from HBCU\/MIs.\n• Conduct a study to benchmark the performance of SMART PhD scholars (i.e., time to degree) with those of their peers in the general U.S. PhD population. \n• Increase directly and indirectly the connectivity of NSSEFF Fellows with DoD.\n• The increase in the direct support and\/or advancement of research into DoD S&T emphasis areas and the six emerging scientific research areas by:  (1) new scientifically relevant publications in peer reviewed journals; and (2) new patents filed\/awarded in these areas.\n• NDEP PK-12:  The increase in the number of investments that (1) are of meaningful duration (i.e., ten hours or greater); and (2) include age-appropriate, hands-on activities that connect directly to DoD’s skills requirements."
                        }
                    }
                }
            ]
        }
    }
}