{
    "id": "6442ab12239bb4614b86a019cbc4c1402d9b82ad",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604441F"
        },
        "ProgramElementTitle": {
            "val": "Space Based Infrared System (SBIRS) High EMD"
        },
        "R1LineItemNumber": {
            "val": "70"
        },
        "MdapCodes": {
            "val": "210"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "8347.364"
            },
            "PriorYear": {
                "val": "621.629"
            },
            "CurrentYear": {
                "val": "448.594"
            },
            "BudgetYearOne": {
                "val": "352.532"
            },
            "BudgetYearOneBase": {
                "val": "352.532"
            },
            "BudgetYearTwo": {
                "val": "279.888"
            },
            "BudgetYearThree": {
                "val": "278.002"
            },
            "BudgetYearFour": {
                "val": "202.362"
            },
            "BudgetYearFive": {
                "val": "187.952"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Space-Based Infrared Systems (SBIRS) primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS will enhance detection and improve reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. SBIRS supports Missile Defense, Battlespace Awareness, and Technical Intelligence missions by providing reliable, accurate, and timely data to Unified Combatant Commanders, Joint Task Force (JTF) Commanders, the intelligence community, and other users. SBIRS provides increased detection and tracking performance in order to meet requirements in Air Force Space Command's Operational Requirements Document. The SBIRS system includes both space and ground elements. The space segment consists of Geosynchronous Earth Orbit (GEO) satellites, payloads hosted on satellites in Highly Elliptical Orbit (HEO), and Defense Support Program (DSP) satellites. The ground segment consists of both fixed and mobile data processing elements, communications infrastructure, and relay ground stations serving all SBIRS space elements. The HEO-1 and HEO-2 payloads are on-orbit and certified for Integrated Tactical Warning\/Attack Assessment (ITW\/AA) missile warning operations and technical intelligence operations. The GEO-1 satellite is on-orbit and is undergoing testing and calibration to prepare for operational acceptance. GEO-2 exited storage in 4Q FY12 and is in final preparation for launch, scheduled in March 2013. Ground segment development continues through the FYDP. Concept studies\/activities may be implemented to investigate obsolescence issues, Overhead Persistent Infrared (OPIR) solutions to potential operational concerns, and future evolution paths of the ground and\/or space segment.\n\nFuture SBIRS OPIR satellites will be procured using the Department of Defense (DOD) Efficient Space Procurement (ESP) concept (formerly Evolutionary Acquisition for Space Efficiency (EASE)). ESP is an approach which seeks stable production and efficient sub-contractor product management through the block buy of two space vehicles at one time (please see SBIRS P-40 Exhibit). A portion of the savings realized from ESP block buys are reinvested into the OPIR Space Modernization Initiative (SMI). The primary objective of SMI is to enable and inform future decisions to maintain a capable, resilient, and affordable OPIR architecture. SMI supports the Program of Record by assessing future parts\/material obsolescence and future affordability and capability design modifications. SMI funds engineering activities to reduce future system and production costs through manufacturing\/ producibility enhancements and through technology insertion. SMI will also mature potential technology upgrades at the component and system level for future space and ground architecture affordability and capability enhancements. The SBIRS OPIR SMI plan includes studies and risk reduction activities to evolve the current Program of Record SBIRS GEO satellites.  SMI funded data exploitation efforts include OPIR data processing, data publication, algorithm development, network connectivity, and sensor performance assessments. The data exploitation efforts will identify affordable, responsive, and resilient measures to improve battlespace awareness data dissemination to the warfighter. SMI Architecture and Component Study efforts will assess future architecture alternatives for viability, affordability, capability and resilience. The SMI Hosted Payloads and Wide Field of View Testbeds efforts will explore technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture.\n\nThe Commercially Hosted Infrared Payload (CHIRP) demonstration received FY11 and FY12 funds for a Wide-Field-of-View (WFOV) demonstration for technology maturation.  CHIRP performed risk reduction and evaluation of WFOV infrared staring and data processing technology to potentially evolve future SBIRS staring sensors and processing algorithms.  An on-orbit demonstration quantified performance levels of a prototype WFOV sensor in an operational environment.  CHIRP sensor testing provided Focal Plane Array (FPA)performance\/calibration characteristics, assessed WFOV staring algorithm performance in an operational environment, and investigated compatibility with current OPIR ground systems for missile warning, missile defense, and other mission areas.  CHIRP experience and lessons learned have been incorporated into plans and objectives for SMI activities, to include the need for further on-orbit performance demonstration, WFOV algorithm development, and ground mission data processing for all OPIR mission areas.\n\nThis program is assigned to Budget Activity 5, System Development and Demonstration (SDD), because it funds the development and integration of mature systems, and the test, evaluation, and demonstration of those systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "621.629"
                },
                "CurrentYear": {
                    "val": "448.594"
                },
                "BudgetYearOne": {
                    "val": "357.532"
                },
                "BudgetYearOneBase": {
                    "val": "357.532"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "621.629"
                },
                "CurrentYear": {
                    "val": "448.594"
                },
                "BudgetYearOne": {
                    "val": "352.532"
                },
                "BudgetYearOneBase": {
                    "val": "352.532"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.000"
                },
                "BudgetYearOneBase": {
                    "val": "-5.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY14: -$5.0M for higher Department priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "653616"
                    },
                    "ProjectTitle": {
                        "val": "SBIRS High Element EMD"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8325.239"
                        },
                        "PriorYear": {
                            "val": "605.111"
                        },
                        "CurrentYear": {
                            "val": "365.406"
                        },
                        "BudgetYearOne": {
                            "val": "267.408"
                        },
                        "BudgetYearOneBase": {
                            "val": "267.408"
                        },
                        "BudgetYearTwo": {
                            "val": "190.174"
                        },
                        "BudgetYearThree": {
                            "val": "187.685"
                        },
                        "BudgetYearFour": {
                            "val": "111.957"
                        },
                        "BudgetYearFive": {
                            "val": "98.000"
                        },
                        "CostToComplete": {
                            "val": "107.000"
                        },
                        "TotalCost": {
                            "val": "10257.980"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "1"
                            },
                            "PriorYear": {
                                "val": "1"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Quantity of RDT&E articles above reflect delivery of GEO-1 in FY11 and GEO-2 in FY12.  Both were developed under this project."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Space-Based Infrared Systems (SBIRS) primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS will enhance detection and improve reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. SBIRS supports Missile Defense, Battlespace Awareness, and Technical Intelligence missions by providing reliable, accurate, and timely data to Unified Combatant Commanders, Joint Task Force (JTF) Commanders, the intelligence community, and other users. SBIRS provides increased detection and tracking performance in order to meet requirements in Air Force Space Command's Operational Requirements Document. The SBIRS system includes both space and ground elements. The space segment consists of Geosynchronous Earth Orbit (GEO) satellites, payloads hosted on satellites in Highly Elliptical Orbit (HEO), and Defense Support Program (DSP) satellites. The ground segment consists of both fixed and mobile data processing elements, communications infrastructure, and relay ground stations serving all SBIRS space elements. The HEO-1 and HEO-2 payloads are on-orbit and certified for Integrated Tactical Warning\/Attack Assessment (ITW\/AA) missile warning operations and technical intelligence operations. The GEO-1 satellite is on-orbit and is undergoing testing and calibration to prepare for operational acceptance. GEO-2 exited storage in 4Q FY12 and is in final preparation for launch, scheduled in March 2013. Ground segment development continues through the FYDP. Concept studies\/activities may be implemented to investigate obsolescence issues, Overhead Persistent Infrared (OPIR) solutions to potential operational concerns, and future evolution paths of the ground and\/or space segment.\n\nThis program is assigned to Budget Activity 5, System Development and Demonstration (SDD), because it funds the development and integration of mature systems, and the test, evaluation, and demonstration of those systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIRS EMD"
                                    },
                                    "Description": {
                                        "val": "Continued EMD contracts for Space and Ground segment development, concept studies\/activities for obsolescence issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "605.111"
                                            },
                                            "Text": {
                                                "val": "Continued GEO development.  Continued GEO-1 on-orbit testing. Began starer tuning to enable accelerated starer processing in support of battlespace awareness and technical intelligence. Continued GEO-2 integration, assembly and test, design activities, Ground System Development (Block 10), System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/ Exploitation\/ground integration activities, Combined Task Force (CTF) support activities, and continuation of systems integration and test studies. Stored GEO-2 and be ready to execute GEO-2 launch campaign. Initiated concept studies on space vehicle bus capabilities for future WFOV demonstrations. Continued Program Office and related support activities (to include SETA), technical analysis and independent verification and validation of contractor. Continued Systems Engineering and Integration (SE&I)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "365.406"
                                            },
                                            "Text": {
                                                "val": "Continue GEO development. Complete GEO-1 operational user evaluation and certification. Accelerate starer tuning and infrastructure improvements to make starer data available to battlespace awareness and technical intelligence users. Conduct GEO-2 launch campaign and begin on-orbit testing. Continue Ground System Development (Block 10), System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/Exploitation\/ground integration activities, CTF support activities, systems integration and test studies. Continue Program Office and related support activities (to include SETA), technical analysis and independent verification and validation of Contractor. Continue SE&I."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "267.408"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "267.408"
                                            },
                                            "Text": {
                                                "val": "Complete development of Ground mission processing risk reduction build, which includes starer processing for ITW\/AA users. Complete GEO-2 operational user evaluation and certification. Continue Ground System Development (Block 10), System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/Exploitation\/ground integration activities, CTF support activities, systems integration and test studies. Continue Program Office and related support activities, technical analysis and independent verification and validation of Contractor. Continue SE&I."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: Line Item # 836720"
                                    },
                                    "Title": {
                                        "val": "Space Based Ir Sensor Pgm Space"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "49.674"
                                        },
                                        "CurrentYear": {
                                            "val": "47.135"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.235"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.235"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "26.332"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.725"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.703"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.842"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MPAF: BA05: Line Item # MSSBIR"
                                    },
                                    "Title": {
                                        "val": "SBIR High (Space) TOA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "324.889"
                                        },
                                        "CurrentYear": {
                                            "val": "454.251"
                                        },
                                        "BudgetYearOne": {
                                            "val": "583.192"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "583.192"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "580.888"
                                        },
                                        "BudgetYearThree": {
                                            "val": "537.971"
                                        },
                                        "BudgetYearFour": {
                                            "val": "570.759"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1143.014"
                                        },
                                        "CostToComplete": {
                                            "val": "191.481"
                                        },
                                        "TotalCost": {
                                            "val": "8004.874"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The pre-SDD SBIRS contracts were competed in full and open competition.  Two contracts were awarded to Lockheed\/Loral\/Aerojet and Hughes\/TRW in 1995 for the pre-SDD phase.  A single contract was awarded to Lockheed Martin in 1996 for the SDD phase.  This contract is still ongoing and will deliver GEO-2 and the ground segment.  Production contracts are discussed in the procurement budget exhibits."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "The total EMD program cost estimate is based on the Apr 11 Service Cost Position."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "SBIRS EMD includes SBIRS EMD prime contract with Lockheed Martin, Program\/Mission Support and Host SPO efforts. Award dates represent date of first award of the funds for that fiscal year."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Pre-EMD (LMMS & Hughes)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Hughes Aircraft Company"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "159.600"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "159.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "159.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIRS EMD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Prime: Lockheed Martin Sunnyvale; Sub: Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7513.196"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "532.771"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "313.123"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "230.238"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "230.238"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "584.888"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9174.216"
                                                    },
                                                    "TargetValue": {
                                                        "val": "9174.216"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems engineering and Integration (SEI)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "The Analytical Sciences Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Andover, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.509"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "11.628"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.682"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.613"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.613"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "13.470"
                                                    },
                                                    "TotalCost": {
                                                        "val": "61.902"
                                                    },
                                                    "TargetValue": {
                                                        "val": "61.902"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIRS Pre-SDD Contract Adjustment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.780"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.780"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.780"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.600"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Phenomenology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.350"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.350"
                                                    },
                                                    "TargetValue": {
                                                        "val": "17.350"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sensor Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sandia National Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "10.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Award dates represent date of first award of the fiscal year."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "WFOV Flight Demonstration"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "American Government Services"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.188"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.188"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.188"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "WFOV Testbed Concept Study"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Millennium Space Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Torrance, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Various Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.142"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.675"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.817"
                                                    },
                                                    "TargetValue": {
                                                        "val": "10.817"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Support (FFRDC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "385.098"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "22.741"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "20.164"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "15.506"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "15.506"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "54.942"
                                                    },
                                                    "TotalCost": {
                                                        "val": "498.451"
                                                    },
                                                    "TargetValue": {
                                                        "val": "498.451"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMC Admin Support (PMA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Quantech Services, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.878"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.988"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.196"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.113"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.113"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.304"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.479"
                                                    },
                                                    "TargetValue": {
                                                        "val": "15.479"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMC Technical Support (PMA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Scitor Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "59.870"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.144"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.654"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.755"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.755"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "10.662"
                                                    },
                                                    "TotalCost": {
                                                        "val": "87.085"
                                                    },
                                                    "TargetValue": {
                                                        "val": "87.085"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMC Financial Support (PMA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tecolote, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Goleta, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.335"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.596"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.301"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.020"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.020"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.403"
                                                    },
                                                    "TotalCost": {
                                                        "val": "21.655"
                                                    },
                                                    "TargetValue": {
                                                        "val": "21.655"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Various Management Support Services (PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "112.881"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "19.380"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "14.286"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.163"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.163"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "24.147"
                                                    },
                                                    "TotalCost": {
                                                        "val": "180.857"
                                                    },
                                                    "TargetValue": {
                                                        "val": "180.857"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604441F_BPAC_653616_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "GEO-1 Payload Calibration and Tuning"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Critical Design Review (CDR) Complete"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GEO-2 Satellite Available for Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Mission Control Station (MCS) Fit Up"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GEO-1 OUE\/GEO Message Cert"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MCSB Fit Up"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GEO-2 Payload Calibration and Tuning"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Integration & Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MCSB Integration & Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MCS Launch and Anomaly Resolution Center (LARC) ready for GEO-3 launch and early on-orbit System Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GEO-2 Operational Acceptance"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "657009"
                    },
                    "ProjectTitle": {
                        "val": "Space Modernization Initiative"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "83.188"
                        },
                        "BudgetYearOne": {
                            "val": "85.124"
                        },
                        "BudgetYearOneBase": {
                            "val": "85.124"
                        },
                        "BudgetYearTwo": {
                            "val": "89.714"
                        },
                        "BudgetYearThree": {
                            "val": "90.317"
                        },
                        "BudgetYearFour": {
                            "val": "90.405"
                        },
                        "BudgetYearFive": {
                            "val": "89.952"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The SBIRS Space Modernization Initiative (SMI) is funded in PE 0604441, project 657009 and began in FY13."
                        },
                        "ProjectMissionDescription": {
                            "val": "Future SBIRS Overhead Persistent Infrared (OPIR) satellites will be procured using the Department of Defense (DOD) Efficient Space Procurement (ESP) concept (formerly Evolutionary Acquisition for Space Efficiency (EASE)). ESP is an approach which seeks stable production and efficient sub-contractor product management through the block buy of two space vehicles at one time (please see SBIRS P-40 Exhibit). A portion of the savings realized from ESP block buys are reinvested into the OPIR Space Modernization Initiative (SMI). The primary objective of SMI is to enable and inform future decisions to maintain a capable, resilient, and affordable OPIR architecture. SMI supports the Program of Record by assessing future parts\/material obsolescence and future affordability and capability design modifications. SMI funds engineering activities and studies to reduce future system and production costs through manufacturing\/ producibility enhancements and through technology insertion. SMI will also mature potential technology upgrades at the component and system level for future space and ground architecture affordability and capability enhancements. The SBIRS OPIR SMI plan includes studies and risk reduction activities to evolve the current Program of Record SBIRS GEO satellites.  SMI funded data exploitation efforts include OPIR data processing, data publication, algorithm development, network connectivity, and sensor performance assessments. The data exploitation efforts will identify affordable, responsive, and resilient measures to improve battlespace awareness data dissemination to the warfighter. SMI Architecture and Component Study efforts will assess future architecture alternatives for viability, affordability, capability and resilience. The SMI Hosted Payloads and Wide Field of View Testbeds efforts will explore technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture.\n\nThis program is assigned to Budget Activity 5, System Development and Demonstration (SDD), because it funds the development and integration of mature systems, and the test, evaluation, and demonstration of those systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Evolved SBIRS"
                                    },
                                    "Description": {
                                        "val": "Assess future parts\/material obsolescence and future affordability and capability design modifications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.100"
                                            },
                                            "Text": {
                                                "val": "Conduct a study to identify parts\/material obsolescence issues and corresponding hardware\/software design modifications to mitigate future production risks for the SBIRS Program of Record GEO Satellites."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.658"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.658"
                                            },
                                            "Text": {
                                                "val": "Complete SBIRS GEO obsolescence study.  Conduct studies to identify payload, spacecraft, and software modifications to improve affordability of the SBIRS Program of Record GEO Satellites.  These affordability studies will address simplifying mechanical systems (e.g., Pointing and Control subsystem); technology insertion (e.g., digital focal planes, micro-processor); A2100 spacecraft fleet stardarization (e.g., Command and Control and Electrical Power components); and Scanner-only design modifications (e.g., remove the Step-Starer Sensor).  Initiate a study on simplified sensors to determine affordability and capability impacts across space and ground architectures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Exploitation"
                                    },
                                    "Description": {
                                        "val": "Exploit existing OPIR data (DSP, SBIRS, CHIRP, other classified sources) through data processing, data publication, algorithm development, network connectivity and sensor performance assessments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.447"
                                            },
                                            "Text": {
                                                "val": "Extend data collection and analysis from the on-orbit CHIRP payload.  Provide enhanced ground segment capability for command and control, data collection, mission processing, and data product dissemination."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.515"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.515"
                                            },
                                            "Text": {
                                                "val": "Continue to collect and analyze CHIRP data, if the sensor is still operating.  Provide enhanced ground segment capability for command and control, data collection, mission processing, and data product dissemination."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Architecture Studies"
                                    },
                                    "Description": {
                                        "val": "Assess future architecture alternatives for viability, affordability, capability, and resilience."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.400"
                                            },
                                            "Text": {
                                                "val": "Conduct architecture and component studies to define spacecraft and payload requirements and performance trade space for disaggregated elements of alternative SBIRS GEO architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.316"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.316"
                                            },
                                            "Text": {
                                                "val": "Continue SBIRS GEO alternative architecture and component studies.  Conduct architecture study to evaluate impacts of classified HEO host architecture change and evaluate alternative polar strategic missile warning coverage."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hosted Payloads"
                                    },
                                    "Description": {
                                        "val": "Explore payload technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.082"
                                            },
                                            "Text": {
                                                "val": "Continue development of WFOV staring sensors, capabilities, and concepts that could support non-strategic missions that can be hosted or flown on a dedicated small bus.  Initiate development of prototype sensors for a 6-degree WFOV payload(s) including evaluation of several sensor design alternatives through Preliminary Design Review (PDR) phase."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.079"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.079"
                                            },
                                            "Text": {
                                                "val": "Continue to develop prototype sensors for the next generation of 6-degree WFOV payload(s), emerging with Critical Design Review (CDR) quality designs and preparing for at least one flight demonstration.  Initiate development of prototype sensors for a 9-degree WFOV payload(s) including evaluation of several sensor design alternatives through Preliminary Design Review (PDR) phase."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WFOV Testbeds"
                                    },
                                    "Description": {
                                        "val": "Explore spacecraft technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture.  Explore international, commercial, or other rideshare opportunities for an on-orbit WFOV payload demonstration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.557"
                                            },
                                            "Text": {
                                                "val": "Evaluate international partnership rideshare, commercial rideshare, or small free-flyer on orbit demonstrations.  Continue concept studies on space vehicle bus capabilities initiated in FY12 under SBIRS EMD program.  Initiate development of a small WFOV testbed spacecraft bus to host a 6-degree WFOV payload through Preliminary Design Review (PDR) phase."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.106"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.106"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate international partnership rideshare or commercial rideshare opportunities for a 9-degree WFOV Payload on-orbit demonstration.  Continue development of a small WFOV testbed spacecraft bus through Critical Design Review (CDR) phase."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Description": {
                                        "val": "Conduct System Engineering and Program Management to include Program Office support such as Federally Funded Research and Development Center (FFRDC) analyses and System Engineering Technical Assistance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.602"
                                            },
                                            "Text": {
                                                "val": "Provide Program Office support for all SMI projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.450"
                                            },
                                            "Text": {
                                                "val": "Provide Program Office support for all SMI projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: Line Item # 836720"
                                    },
                                    "Title": {
                                        "val": "Space Based Ir Sensor Pgm Space"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "49.674"
                                        },
                                        "CurrentYear": {
                                            "val": "47.135"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.235"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.235"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "26.332"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.725"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.703"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.842"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MPAF: BA05: Line Item # MSSBIR"
                                    },
                                    "Title": {
                                        "val": "SBIR High (Space) TOA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "324.889"
                                        },
                                        "CurrentYear": {
                                            "val": "454.251"
                                        },
                                        "BudgetYearOne": {
                                            "val": "583.192"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "583.192"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "580.888"
                                        },
                                        "BudgetYearThree": {
                                            "val": "537.971"
                                        },
                                        "BudgetYearFour": {
                                            "val": "570.759"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1143.014"
                                        },
                                        "CostToComplete": {
                                            "val": "191.481"
                                        },
                                        "TotalCost": {
                                            "val": "8004.874"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program office will use a variety acquisition approaches to execute various concept studies, technology maturation efforts, testbed\/prototype demonstrations, and data exploitation initiatives and projects.  The program office will collaborate with appropriate contracting agencies to support each individual effort. Activities such as SBIRS GEO obsolescence and affordability enhancements to the existing satellite design will leverage existing Program of Record contracts. Technology maturation and component prototyping and\/or qualification could leverage existing contracts, but where practical could be competed.  New technology, replacement components and system designs will be acquired with government data rights to a maximum extent to allow their incorporation into any future OPIR satellite production or system development. Contracting partnerships with other agencies will also be used to study, develop and demonstrate and prove emerging capabilities.  FFRDC and SETA contractors will also be used to conduct and support studies."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Each Cost Category Item with \"TBD\" or \"Various\" annotated contains several contract elements with some contracts still TBD."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Evolved SBIRS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.658"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.658"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "69.473"
                                                    },
                                                    "TotalCost": {
                                                        "val": "88.231"
                                                    },
                                                    "TargetValue": {
                                                        "val": "88.231"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Exploitation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Americom Government Services Mclean VA; Northrop Grumman Boulder, CO; Others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "21.447"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.515"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.515"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "92.750"
                                                    },
                                                    "TotalCost": {
                                                        "val": "136.712"
                                                    },
                                                    "TargetValue": {
                                                        "val": "136.712"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Architecture and Component Studies"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.316"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.316"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.716"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.716"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hosted Payloads"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "26.082"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "29.079"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "29.079"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "85.263"
                                                    },
                                                    "TotalCost": {
                                                        "val": "140.424"
                                                    },
                                                    "TargetValue": {
                                                        "val": "140.424"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "WFOV Testbeds"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Millenium Space Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Torrance, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.557"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "17.106"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "17.106"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "94.500"
                                                    },
                                                    "TotalCost": {
                                                        "val": "123.163"
                                                    },
                                                    "TargetValue": {
                                                        "val": "123.163"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Engineering and Integration (SE&I)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.158"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.158"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.158"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Support (FFRDC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.155"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.178"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.178"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "4.953"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.286"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.286"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Various Management Support Services (PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.447"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.272"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.272"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "10.291"
                                                    },
                                                    "TotalCost": {
                                                        "val": "18.010"
                                                    },
                                                    "TargetValue": {
                                                        "val": "18.010"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604441F_BPAC_657009_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "WFOV Testbeds"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Architecture & Component Studies"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Hosted Payloads Tech Maturation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OPIR Data Exploitation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evolved SBIRS Studies"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "65A040"
                    },
                    "ProjectTitle": {
                        "val": "Commercially Hosted Infrared Payload (CHIRP)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "22.125"
                        },
                        "PriorYear": {
                            "val": "16.518"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "38.643"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Commercially Hosted Infrared Payload (CHIRP) provided risk reduction and evaluation of WFOV infrared staring and data processing technology to potentially evolve future SBIRS staring sensors and processing algorithms.  An on-orbit demonstration quantifed performance levels of a prototype WFOV sensor in an operational environment. CHIRP sensor testing provided Focal Plane Array (FPA) performance\/calibration characteristics, assessed WFOV staring algorithm performance in an operational environment, and investigated compatibility with current Overhead Persistent Infrared (OPIR) ground systems for missile warning, missile defense, and other mission areas.  CHIRP experience and lessons learned have been incorporated\ninto plans and objectives for SMI activities, to include the need for further on-orbit performance demonstration, WFOV algorithm development, and\nground mission data processing for all OPIR mission areas.\n\nThe CHIRP demonstration continued effort begun under Third Generation Infrared Surveillance PE 060443F. CHIRP received FY11 and FY12 funds to continue the Wide-Field-of-View (WFOV) demonstration for technology maturation. Funding was moved to the SBIRS RDT&E Program Element under a separate project number.\n\nThis program is assigned to Budget Activity 5, System Development and Demonstration (SDD) because it funds the development and integration of mature systems, and the test, evaluation, and demonstration of those systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CHIRP"
                                    },
                                    "Description": {
                                        "val": "Continued contracts for Commercially Hosted Infrared Payload (CHIRP) demonstration and related support activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.518"
                                            },
                                            "Text": {
                                                "val": "Continued development and test of mission data processing and ground infrastructure to mature WFOV algorithms and technologies. Demonstrated CHIRP on-orbit capabilities to include fusion of CHIRP data with other OPIR systems. Collected, archived and analyzed on-orbit data against cooperative targets and continue to mature  WFOV algorithms.  Continued Program Office and related support activities. CHIRP mission demonstration and data analysis\/exploitation continuing under SMI Data Exploitation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA05: PE 0604443F"
                                    },
                                    "Title": {
                                        "val": "Third Generation Infrared Surveillance"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "78.420"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Risk reduction and evaluation of WFOV infrared staring and data processing technology will be continued via the SMI project BPAC 657009."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Performing Activities: System Dynamics Lab (Logan, UT), Americom Government Services (McLean, VA), Northrop Grumman Electronic Systems (Azusa, CA), Science Applications International Corporation (McLean, VA)."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "**Put all R-3 Remarks in the summary Remark Text Box.**"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "WFOV IR staring technologies risk reduction activities"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "*See Remarks"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.797"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.553"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "25.350"
                                                    },
                                                    "TargetValue": {
                                                        "val": "21.800"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Various Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.712"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.793"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.505"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.352"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Cobham Analytic Solutions"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lake Forest, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.783"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.360"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.143"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.143"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Support (FFRDC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.833"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.812"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.645"
                                                    },
                                                    "TargetValue": {
                                                        "val": "10.348"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604441F_BPAC_65A040_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Mission Data Analysis\/Data Exploitation (continued under SMI)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Hosted Payload Mission Demonstration (continued under SMI)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}