{
    "id": "68653723f38f8a9757e571c77f6d510347a1ffd3",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603680F"
        },
        "ProgramElementTitle": {
            "val": "Manufacturing Technology Program"
        },
        "R1LineItemNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "39.165"
            },
            "CurrentYear": {
                "val": "37.045"
            },
            "BudgetYearOne": {
                "val": "41.353"
            },
            "BudgetYearOneBase": {
                "val": "41.353"
            },
            "BudgetYearTwo": {
                "val": "41.444"
            },
            "BudgetYearThree": {
                "val": "38.884"
            },
            "BudgetYearFour": {
                "val": "41.233"
            },
            "BudgetYearFive": {
                "val": "41.975"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Manufacturing Technology (ManTech) program executes technical programs to maintain and develop an affordable and reliable industrial base and manufacturing capability that will be responsive to warfighter needs. The program develops and improves manufacturing technologies and processes to enable cost reduction, improve component and system quality, and enhance industrial capability. Further, value stream modifications and manufacturing throughput improvements are effected to shorten cycle times of weapon systems during design, development, production and sustainment. ManTech objectives are conducted through industrial partnerships which enable the demonstration of manufacturing technologies for existing weapon system upgrades and\/or for new warfighter systems. Efforts in the program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. Manufacturing Technologies is in Budget Activity 3, Advanced Technology Development, since it develops and demonstrates manufacturing technologies for existing upgrades and\/or new system developments that have military utility and address warfighter needs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "40.103"
                },
                "CurrentYear": {
                    "val": "37.045"
                },
                "BudgetYearOne": {
                    "val": "36.353"
                },
                "BudgetYearOneBase": {
                    "val": "36.353"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "39.165"
                },
                "CurrentYear": {
                    "val": "37.045"
                },
                "BudgetYearOne": {
                    "val": "41.353"
                },
                "BudgetYearOneBase": {
                    "val": "41.353"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.938"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.000"
                },
                "BudgetYearOneBase": {
                    "val": "5.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.938"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "5.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY14 is due to increased emphasis on agile manufacturing capability for intelligence, surveillance, and reconnaissance components to reduce manufacturing risk."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635280"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "38.275"
                        },
                        "CurrentYear": {
                            "val": "37.045"
                        },
                        "BudgetYearOne": {
                            "val": "41.353"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.353"
                        },
                        "BudgetYearTwo": {
                            "val": "41.444"
                        },
                        "BudgetYearThree": {
                            "val": "38.884"
                        },
                        "BudgetYearFour": {
                            "val": "41.233"
                        },
                        "BudgetYearFive": {
                            "val": "41.975"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Manufacturing Technology (ManTech) program executes technical programs to maintain and develop an affordable and reliable industrial base and manufacturing capability that will be responsive to warfighter needs.  The projects include development and improvement of manufacturing  technologies and processes; collaboration with government program offices, industry, and academia; investments in generic technologies that can be applied to different applications; cost-sharing; multiple system\/customer applications; potential for significant return on investment; and customer commitment to implement.  To this end, ManTech develops and demonstrates advanced manufacturing processes and technologies to reduce costs, improve quality\/capability, and shorten cycle times of weapon systems during design, development, production, and sustainment.   Where mature processes are not available, laboratory-developed and demonstrated initial process capabilities are made available for transition into weapon system programs. ManTech objectives are conducted through partnerships with all industry levels, from large prime contractors to small material and parts vendors."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainment Manufacturing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and implement cost-effective maintenance, repair, and manufacturing technologies for sustainment of Air Force weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.465"
                                            },
                                            "Text": {
                                                "val": "Continued efforts for cost-effective development of conventional and low-observable repair and manufacturing technologies enabling affordable sustainment of aircraft and turbine engine components.  Continued assessments and manufacturing technology development to reduce logistics support costs, lead times for high value supply chain commodities, and cycle times for depot repair.  Continued efforts supporting High Velocity Maintenance concept at Air Logistics Centers to reduce Program Depot Maintenance cycle times and cost.  Pursued improvements in energy consumption required during manufacturing operations to reduce processing costs.  Training responsibilities were transitioned to Air University to be utilized for Manufacturing Readiness Assessment (MRA) and Manufacturing Readiness Level (MRL) support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.798"
                                            },
                                            "Text": {
                                                "val": "Continue efforts for cost effective development of conventional and low observable production and repair technologies enabling affordable sustainment of aircraft systems.  Continue assessments and manufacturing technology development to reduce logistics support costs, lead times for high value supply chain commodities, and cycle times for depot repair.  Provide subject matter expertise in support of Manufacturing Readiness Assessments (MRAs) on Advanced Technology Demonstrations (ATDs), selected high-visibility technology programs and selected Air Force acquisition programs to aid in Milestone Decision Reviews and\/or to mitigate cost\/schedule issues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Text": {
                                                "val": "Continue development of cost effective conventional and low-observable production and repair technologies to enable affordable sustainment of aircraft systems. Continue assessments and manufacturing technology development to reduce logistics support costs, lead times, and cycle times for depot repair. Provide subject matter expertise in support of MRAs on ATDs, selected high-visibility technology programs and selected Air Force acquisition programs to aid in Milestone Decision Reviews for mitigation of cost, schedule and risk."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Manufacturing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and transition pervasive affordability and producibility technologies for weapon systems and processes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.810"
                                            },
                                            "Text": {
                                                "val": "Continued development demonstration of rapid response and flexible manufacturing methods, commercial\/military integration, quality processing, and supply stream improvements. Continued demonstration of manufacturing capabilities for more affordable low-observable structures, advanced propulsion technologies, electronics manufacturing technologies for Command, Control, Intelligence, Survelliance, and Reconnaissance (C2ISR), space, and advanced radar applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.247"
                                            },
                                            "Text": {
                                                "val": "Continue development demonstration of rapid response and flexible manufacturing methods, commercial\/military integration, quality processing and supply stream improvements.  Continue demonstration of manufacturing capabilities for more affordable low-observable structures, advanced propulsion technologies, electronics and optics manufacturing technologies for C2ISR, space solar cells, and advanced radar applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.853"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.853"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of next generation agile manufacturing methods, commercial\/military integration, quality processing and supply chain improvements. Continue development and demonstration of manufacturing capabilities for more affordable and hot structures, advanced propulsion technologies, Air Force munitions, and electronics manufacturing technologies for communications, space solar cells, advanced Active Electronically Scanned Array (AESA) sensor applications, and Mid Wave Infrared optics.  Initiate agile manufacturing risk reduction assessments on intelligence, surveillance, and reconnaissance components."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635281"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Readiness"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.890"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Manufacturing readiness of technologies is a key concern when identifying and mitigating risk to successfully transition these technologies and systems into production.  Within each product sector (aeronautical, space, munitions\/directed energy, and C2ISR), manufacturing readiness assessments (MRAs) will be applied and manufacturing readiness levels (MRLs) utilized to gauge and manage manufacturing related issues.   Advanced Technology Demonstrations (ATDs) will be used when appropriate to aid in efficient transition.  Selected acquisition programs will also be assessed to determine readiness for milestone decisions and\/or to reduce manufacturing risk.  Pervasive, generic and system-specific manufacturing maturation plans will be developed and implemented based on the assessments to reduce overall program risk and to provide an increased awareness of manufacturing issues throughout major weapon system life cycles.  Generic and pervasive manufacturing issues will be identified and considered as potential ManTech programs to transition advanced manufacturing technologies into multiple sectors."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Manufacturing Maturation"
                                    },
                                    "Description": {
                                        "val": "Through application of MRAs, develop and implement manufacturing maturation plans to improve affordability and producibility and mitigate transition risk from development to production."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.890"
                                            },
                                            "Text": {
                                                "val": "Completed development of Manufacturing Maturation Plans (MMPs) for Category I ATDs and selected high-visibility programs based on MRAs.  Conducted MRAs on selected Air Force acquisition programs to aid in Milestone Decision Reviews and\/or to mitigate cost, schedule, or rate issues."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Manufacturing readiness work to continue under Manufacturing Technologies (BPAC 635280)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}