{
    "id": "696ef73671709a8e4114229e18a7a166b2b08d5c",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602705A"
        },
        "ProgramElementTitle": {
            "val": "ELECTRONICS AND ELECTRONIC DEVICES"
        },
        "R1LineItemNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "74.518"
            },
            "CurrentYear": {
                "val": "60.300"
            },
            "BudgetYearOne": {
                "val": "59.021"
            },
            "BudgetYearOneBase": {
                "val": "59.021"
            },
            "BudgetYearTwo": {
                "val": "56.711"
            },
            "BudgetYearThree": {
                "val": "60.593"
            },
            "BudgetYearFour": {
                "val": "62.078"
            },
            "BudgetYearFive": {
                "val": "60.097"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) designs and evaluates, power components, frequency control and timing devices, high power microwave devices, display technologies; and electronic components. The applied research on these technologies enable the ability to perform precision deep fires against critical mobile and fixed targets; investigate all-weather, day or night, theater air defense against advanced enemy missiles and aircraft; as well as investigate enhanced communications and target acquisition through support of capabilities such as autonomous missile systems, advanced land combat vehicles, smart anti-tank munitions, electric weapons, secure jam-resistant communications, automatic target recognition, foliage-penetrating radar, and combat identification. Project EM8 designs and evaluates high-power, microwave, electronic components and technologies. Project H11 designs, fabricates and evaluates advanced portable power technologies (batteries, fuel cells, hybrids, engines, chargers, and power management). Project H17 designs and evaluates flexible displays in conjunction with the Flexible Display Center. Project H94 researches and evaluates electronic component technologies such as photonics, micro electromechanical systems, imaging laser radar, magnetic materials, ferroelectrics, microwave and millimeter-wave components, and electromechanical systems. \n\nWork in this PE complements and is fully coordinated with efforts in PE 0602120A (Sensors and Electronic Survivability), PE 0602709A (Night Vision Technology), PE 0602782A (Command, Control, Communications Technology), PE 0602783A (Computer and Software Technology), PE 0603001A (Warfighter Advanced Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research Laboratory, Adelphi, MD, and the Army Communications-Electronics Research, Development, and Engineering Center, Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "62.862"
                },
                "CurrentYear": {
                    "val": "60.300"
                },
                "BudgetYearOne": {
                    "val": "55.721"
                },
                "BudgetYearOneBase": {
                    "val": "55.721"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "74.518"
                },
                "CurrentYear": {
                    "val": "60.300"
                },
                "BudgetYearOne": {
                    "val": "59.021"
                },
                "BudgetYearOneBase": {
                    "val": "59.021"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "11.656"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.300"
                },
                "BudgetYearOneBase": {
                    "val": "3.300"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.100"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "12.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.073"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.300"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.300"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.329"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EM4"
                    },
                    "ProjectTitle": {
                        "val": "Electric Component Technologies (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.500"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Electronic Component applied research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Silicon Carbide Research"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This is a Congressional Interest Item."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EM8"
                    },
                    "ProjectTitle": {
                        "val": "High Power And Energy Component Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.174"
                        },
                        "CurrentYear": {
                            "val": "15.116"
                        },
                        "BudgetYearOne": {
                            "val": "14.927"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.927"
                        },
                        "BudgetYearTwo": {
                            "val": "14.233"
                        },
                        "BudgetYearThree": {
                            "val": "14.257"
                        },
                        "BudgetYearFour": {
                            "val": "14.398"
                        },
                        "BudgetYearFive": {
                            "val": "14.657"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the research, development, and evaluation of high-power electronic components, materials, and related technologies.  These technologies have application in compact and efficient power conversion, conditioning, and management sub-systems; energy storage and conversion devices; radio frequency (RF)\/microwave and solid-state laser directed energy weapons (DEW); and traditional and non-traditional RF and laser electronic attack. All project elements are coordinated with and, as appropriate, leveraged by DEW and power\/energy programs in the Air Force, Navy, High Energy Laser Joint Technology Office, Defense Threat Reduction Agency, national labs, university consortia, and relevant industry and foreign partners.   The products of this research are required by developers of Army (DoD) systems to evolve traditional (mechanical-based) sub-systems such as geared transmissions, plate armor, and kinetic projectiles to electrically-based ones.  These products will provide the Soldier enhanced survivability and lethality through increased power management and energy savings as well as new fighting capabilities offered only by electrical power.\n\nThis project sustains Army science and technology efforts supporting the Ground and Soldier portfolio.\n\nThe work in this project is coordinated with the Tank and Automotive Research, Development, and Engineering Center (TARDEC PE 063005, project 441); Armaments Research, Development, and Engineering Center (ARDEC) PE063004, project 232; Aviation and Missile Research, Development, and Engineering Center (AMRDEC) PE 063313, project G03; and Communications-Electronics Research, Development, and Engineering Center (CERDEC) PE 062705, project H11.  These efforts were previously funded in PE 0602120A (Sensors and Electronic Survivability).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork on this project is performed by the Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Power and Energy Technologies"
                                    },
                                    "Description": {
                                        "val": "Research and evaluate electronic materials, structures, and components that will enable the realization of higher energy density and efficiency required by future Army systems such as electromagnetic armor, directed energy weapons, power grid protection, and other pulsed-power systems.  Special emphasis is on components operating at high voltages - greater than (>) 10 kilovolts (kV)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.322"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated advanced wide band gap materials for use in high voltage pulse applications (>10kV)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and conduct experiments with FY12 advanced wide band gap materials, such as silicon carbide (SiC), operation at  e20kV with emphasis on high voltage packaging based on the results of FY12's >10 kV SiC component research; identify and assess wide band-gap semiconductors (such as aluminum nitride) that allow higher voltage (>25kV) operation for expanded power control in survivability and lethality applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.296"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.296"
                                            },
                                            "Text": {
                                                "val": "Will investigate and develop advanced wide band gap materials and devices, for operation at and above 20kV to support survivability, lethality systems, and high voltage microgrid application requirements; evaluate high voltage packaging needs and identify packaging research; initiate research into wide band-gap semiconductors indentified in FY13."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technology"
                                    },
                                    "Description": {
                                        "val": "Research novel solid-state laser concepts, architectures, and components with the goal of providing technology to Army directed energy weapon developers.  Exploit breakthroughs in laser technology, material development and photonics basic research to meet the stringent weight\/volume requirements for platforms. Applied research will be conducted in close collaboration with domestic and foreign material vendors, university researchers, as well as major laser diode manufacturers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.449"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated scalability and efficiency potential of resonantly-pumped, eye-safe, lasers in a 2-2.1 micrometer atmospherically transparent spectral domain based on Holmium (Ho)-doped crystals and ceramics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.541"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate solid-state laser thermal management based on composite design of the gain elements (materials that are stimulated to produce laser light) with optically transparent heat sinking material in order to further increase beam power while preserving high beam quality."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.544"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.544"
                                            },
                                            "Text": {
                                                "val": "Will experimentally validate feasibility of a fiber laser, based on fully-crystalline, rare-earth-doped, double clad fibers, which will provide significantly improved thermal management in order to achieve advanced power scalability (>10X) with good beam quality out of single-aperture laser. Will scale chirped diode laser seed technique to obtain multi kW power output from a 1060 nm fiber amplifier."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy\/Electromagnetic Environments (EME) Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate and evaluate emerging technologies related to DE technology, electronic warfare (EW) survivability\/lethality, operations in the EME, and supporting high power components with the goal of  enhancing the survivability\/lethality of Army platforms. In FY13 and FY14 this effort supports Technology Enabled Capability Demonstration 4a, Sustainability\/Logistics-Basing [Directed Energy\/Electromagnetic Environments (EME) Technologies]."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.115"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the development of counter electronic systems and electronic warfare (EW) technology for CERDEC; continued susceptibility investigations of a variety of targets; transitioned effects data to applicable Research Development and Engineering Centers (RDECs)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate the susceptibility of a variety of Improvised Explosive Device (IED) targets in order to determine the vulnerability of these threats as well as design neutralization strategies; design and experimentally validate an initial neutralization sub-component that is a part of a integrated radio frequency based detection, location and IED Neutralization technology for future counter IED devices; investigate the effect of Digital Radio Frequency Memory (DRFM) technology (one of the top concerns in EW across the DoD) on US sensors and receivers and transition data to ARDEC, CERDEC, Army Test and Evaluation Center (ATEC), and program managers as appropriate."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.218"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.218"
                                            },
                                            "Text": {
                                                "val": "Will characterize the susceptibility of emerging Improvised Explosive Device (IED) threats to identify their unique susceptibilities\/vulnerabilities. Design neutralization waveforms and techniques based on their vulnerabilities.  Develop and evaluate smart RF waveforms to create countermeasures to affect electronic devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Components and Materials Research"
                                    },
                                    "Description": {
                                        "val": "Investigate, and evaluate compact, high-efficiency, high-temperature, high-power component technologies (such as semiconductor, magnetic, and dielectric devices) for hybrid-electric propulsion, electric power generation and conversion, and smart\/micro-grid power distribution.  Research addresses current and future Army-unique performance and operational requirements. In FY13-14, this efforts supports Technology Enabled Capability Demonstration 4a, [Sustainability\/Logistics-Basing Operational & Organizational Concept & Plan]."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.502"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated small, high efficiency wide band-gap power modules and circuits utilizing high power component technologies as well as high performance passive components operating at a coolant temperature of 100 °C."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.435"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate advanced wide band gap modules developed in FY12 for use in vehicle and micro-grid applications that potentially  provide improved fault tolerant operation and  efficiency; conduct applied research on next-generation wide band-gap materials and devices to provide high temperature, voltage, and current conversion for micro-grid applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.442"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.442"
                                            },
                                            "Text": {
                                                "val": "Will investigate advanced control and diagnostic methods intended for power switches to improve fault tolerance and efficiency.   Conduct applied research on next-generation materials and fabrication methods for passives and wide band-gap materials and devices and develop switching components to provide power conversion components for micro-grid applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power System Components Integration and Control Research"
                                    },
                                    "Description": {
                                        "val": "Research and evaluate the configuration of electronic components and control strategies required to achieve high-power density and high efficiency power utilization in current and future platform sub-systems, vehicle, and micro-grid (installation) applications to include the operation of military-specific power distribution topologies at the system and circuit levels. In FY13-14, this effort supports Technology Enabled Capability Demonstration 4a, [Sustainability\/Logistics-Basing Operational & Organizational Concept & Plan]."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.528"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Researched control techniques and the use of advance passive devices to provide <60kW high-temperature (110 C) converters; and investigated advanced power conversion techniques for directed energy applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research in designing advanced control techniques, such as smart switches, to provide more efficient, robust, and reliable power delivery for vehicle power applications; conduct investigations at the system and circuit levels to evaluate micro-grid topology effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.687"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.687"
                                            },
                                            "Text": {
                                                "val": "Will conduct applied research in intelligent controls and diagnostics for power conversion modules and circuits to provide more efficient, robust, and reliable power delivery and conversion for vehicle and microgrid power applications; research intelligent control methodologies for microgrids and other power distribution systems; investigate bi directional power conversion circuits for platform and microgrids."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pulsed-Power Components and Systems Research"
                                    },
                                    "Description": {
                                        "val": "Investigate, and evaluate emerging technologies such as energy storage capacitors, high voltage converters, and high rate-of-current-rise semiconductor switches, explosive based pulse generators, that improve the reliability and efficiency of pulsed-power components for applications such as electromagnetic armor, electronic fuze initiators, and electronic protection systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated silicon carbide (SiC) pulse switch die at 6 kA with fast rate-of-current-rise; and experimentally validated a compact power converter for self-contained battery module concept that allows advanced high power systems to be used on current force and next-generation vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.020"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experimentally characterize and validate the FY12 SiC switch and other components in an electromagnetic armor demonstration system  in support of efforts in PE 062618, project H80 and with TARDEC in PE 063005 project 441; and design novel compact high power devices, modules, converters and passive components utilizing emerging wideband gap materials that provide enhanced power density for survivability systems with reduced space and weight."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.740"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.740"
                                            },
                                            "Text": {
                                                "val": "Will analyze semiconductor switch and component operation under extreme currents and voltages.  Experimentally characterize and validate improved FY13 SiC switches and other components for electromagnetic armor systems.   Develop enhanced power dense power conversion hardware to reduce size and weight for platform survivability efforts through the implementation of novel materials, circuits and module designs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H11"
                    },
                    "ProjectTitle": {
                        "val": "Tactical  And Component Power Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.174"
                        },
                        "CurrentYear": {
                            "val": "10.022"
                        },
                        "BudgetYearOne": {
                            "val": "11.691"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.691"
                        },
                        "BudgetYearTwo": {
                            "val": "11.736"
                        },
                        "BudgetYearThree": {
                            "val": "14.980"
                        },
                        "BudgetYearFour": {
                            "val": "15.102"
                        },
                        "BudgetYearFive": {
                            "val": "12.840"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project identifies, advances, and enhances emerging power generation, energy storage, and power management components and software. This project researchs electrochemistry, energy conversion, and signature suppression for primary batteries, rechargeable battery hybrids, fuel cells, power management, and components for electromechanical power generation. This project also researches power sources that are smaller and more fuel-efficient, advanced cooling systems that enable tactical sustainability and survivability, and investigates novel power management methods through low power design tools and dynamic power management software.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Soldier and Ground portfolios.  Work in this Project complements and is fully coordinated with efforts in PE 0603001A (Warfighter Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development and Engineering Command, Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Hybrid Power and Smart Chargers"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates and validates Soldier-borne hybrid power sources, batteries, rapid battery chargers, and power management software, devices and techniques in order to decrease Soldier load and power burden, increase power capabilities such as extending battery run-time, and decrease battery sizes and costs.  Work in this effort includes research in Soldier-borne external combustion power generation, fuel cells and batteries, as well as experimenting with chemicals and other material to improve battery components such as electrolyte additives, ceramic membranes, and new cathode materials. In FY13 and FY14 this effort supports Technology Enabled Capability Demonstration 2a Overburdened – Physical Burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.144"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed a lower cost membrane for protected lithium anode portion of lithium air (Li\/Air) battery; optimized solid electrolyte membrane to prevent lithium metal corrosion; investigated and developed lower cost processes capable of high volume manufacturing of Li\/Air battery; experimented with packaged battery having >800 watt hours per kilogram (Wh\/kg) energy density; validated safety characteristics of disposable Soldier battery (Li\/Air); experimented with disposable Soldier battery (Li\/Air) in an operational environment; assessed balance of plant (controls, fans, heat transfer coatings, etc.) that will help improve efficiency for portable squad power source\/charger and reduce weight of hybrid power source; experimented with hybrid power source in a relevant environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.124"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate higher rate lithium ion conducting membranes and air electrode catalysts for advanced Li\/Air disposable battery; validate bio-inspired cathode coatings for rechargeable lithium ion cells to improve and exhibit battery safety characteristics and cell performance in a representative environment; further enhance rechargeable Li\/Air battery to achieve and exhibit greater cell energy density in laboratory environment; validate a rechargeable Soldier hybrid power source (external combustion or fuel cell) with greater energy density and extended run time in a laboratory environment; optimize electro-catalyst and alkaline membrane electrolyte performance with different fuels; improve sulfur tolerant catalysts to promote longer system life."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.721"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.721"
                                            },
                                            "Text": {
                                                "val": "Will investigate very high energy density lighter weight Soldier hybrid power sources including wearable conformal Li\/Air disposable batteries; increase power density of Li\/Air by designing, fabricating and assessing carbon nano-based air electrodes; investigate highly conducting, robust, lower cost lithium ion conducting membranes to further reduce weight and cost of Soldier batteries; investigate renewable multi-fueled Soldier portable power sources and aluminum hydride (high energy density) based fuel cells with extended run time, higher energy density and higher fuel to energy conversion efficiency; assess Soldier wireless power and energy harvesting concepts to reduce electrical wiring and connectors, achieve greater power transmission efficiencies and reduce energy logistics for extended missions; investigate processes, techniques and hardware for safe wireless power distribution for Soldier borne equipment and wireless charging of Soldier borne batteries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Silent Mobile Power"
                                    },
                                    "Description": {
                                        "val": "This effort investigates power generation materials, components and systems to increase energy output, reduced weight and noise, while increasing fuel and cost efficiency in mobile power generation sources. Products are silent mobile power components and materials, waste-heat recovery components and systems, transitional power sources in the 500 watts (W)-2 kilowatts (kW) range,  towable generator sets up to 100 kW and renewable energy components and power management systems up to 5 kW. In FY13 and FY14 this effort supports Technology Enabled Capability Demonstration 4a Sustainability\/Logistics Basing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.030"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted studies to identify emerging nanomaterials for applications to power electronics and fuel processing subsystems for 250 W to 2 kW applications; advanced and incorporated a new generation of materials (like catalysts for processing jet propellant-8 (JP-8) for use in gasoline engines, ceramic nanocoatings applied to key electromechanical components to enhance durability\/life\/power-output of current generator sets, and nanotubes applied to develop thermoelectric materials with high electrical but low thermal conductivity) to augment performance of emerging and military power systems in the less than 2 kW range."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.898"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate and validate advanced logistic fueled 250 to 1000 W mobile power generators with advanced sensors, power electronics\/controls and advanced materials to achieve greater fuel-to-electric efficiency and increase component survivability through real time response to rapid changes in load, environment, and usage; design and fabricate 3 to 5 kWh military standard hybrid energy storage components to maximize fuel economy, extend mission times, reduce recharging and disposal burden of batteries, and support patrol base and command post applications; design and fabricate integrated components and code software for power management of a smart power grid scalable from brigade to installation power levels; fabricate and conduct experiments with smaller, lighter hybrid renewable (battery\/engine\/wind\/solar) energy and co-generation equipment with improved fuel-to-electric efficiencies that provide environmental control (i.e., air conditioning) for brigade tactical operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.970"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.970"
                                            },
                                            "Text": {
                                                "val": "Will investigate monitoring tools for squad, platoon and brigade command post renewable energy power grids (300 W to 10 kW) to provide grid status to the commander; code intelligent power management protocols to increase reliability and efficiency of renewable energy integrated with fossil fuel generators; design and assess high energy density, efficient energy storage modules; investigate advanced harvesting of carbon dioxide (CO2) from exhaust to provide for autonomous power generation (fuel cells and external\/internal combustion) and reduced fuel logistics; design alternative CO2 based co-generation capabilities for greater cooling capacity and reduced weight\/size of environmental control units."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H17"
                    },
                    "ProjectTitle": {
                        "val": "Flexible Display Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.271"
                        },
                        "CurrentYear": {
                            "val": "6.629"
                        },
                        "BudgetYearOne": {
                            "val": "2.704"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.704"
                        },
                        "BudgetYearTwo": {
                            "val": "0.854"
                        },
                        "BudgetYearThree": {
                            "val": "0.854"
                        },
                        "BudgetYearFour": {
                            "val": "1.866"
                        },
                        "BudgetYearFive": {
                            "val": "1.882"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project fabricates and evaluates flexible display components emerging from the Army's Flexible Display Center (FDC) at the Arizona State University. The FDC conducts applied research on flexible display technologies that would make them inherently rugged (no glass), light weight, conformal, potentially low cost, and low power.  The resultant display technology would enable enhanced and new capabilities across a broad spectrum of Army applications (such as hands-free\/wrist mounted situational awareness devices, flexible hand-held control devices, and monitors in vehicles).\n\nThis project supports Army science and technology efforts in the Command,Control,Communications and Intelligence and Soldier portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is executed by the Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Flexible Display Center (FDC) and Flexible Electronics development"
                                    },
                                    "Description": {
                                        "val": "The Flexible Display Center is developing high resolution flexible reflective (electrophoretic) and emissive (organic light emitting diodes) displays."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.358"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FDC continued to integrate color reflective displays and transition displays to integration efforts to include further development of emissive displays with size and resolution optimized to fulfill needs and requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.629"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to design full color light emitting displays and the related flexible electronics for soldier applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.704"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.704"
                                            },
                                            "Text": {
                                                "val": "Will develop flexible electronic sensor devices for Army applications to include radiation sensors (visible to x-ray) and particle detection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FlexTech Alliance (FTA)"
                                    },
                                    "Description": {
                                        "val": "Flexible display partnerships funded through the FTA for development of tools, processes, and materials that directly support the FDC mission for the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.913"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FTA supported the goals of the FDC and has direct impact on the development of reflective and emissive displays that will transition into a number of ongoing efforts.  Toolsets necessary for further display and flexible electronics development are being supported."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H94"
                    },
                    "ProjectTitle": {
                        "val": "Elec & Electronic Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.399"
                        },
                        "CurrentYear": {
                            "val": "28.533"
                        },
                        "BudgetYearOne": {
                            "val": "29.699"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.699"
                        },
                        "BudgetYearTwo": {
                            "val": "29.888"
                        },
                        "BudgetYearThree": {
                            "val": "30.502"
                        },
                        "BudgetYearFour": {
                            "val": "30.712"
                        },
                        "BudgetYearFive": {
                            "val": "30.718"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs and evaluates electronics and electronic components and devices for Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) applications and battlefield power and energy applications.  Significant areas of component research relevant to C4ISR  include: antennas, millimeter wave components and imaging, micro- and nanotechnology, eye-safe laser radar (LADAR), vision and sensor protection, infrared imaging (IR), photonics, and prognostics and diagnostics. Areas of research relevant to power and energy include power and thermal management, micro-power generators and advanced batteries, fuel reformers, fuel cells for hybrid power sources, and photosynthetic routes to fuel and electricity. \n\nThis project supports Army science and technology efforts in the Command Control and Communications, Soldier, Ground and Air portfolios.  Work in this project is fully coordinated with PE 0602709A (Night Vision Technology), PE 0603001A  (Warfighter Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603008A (Command, Control, Communications Advanced Technology), PE 0603313A (Missile and Rocket Advanced Technology) and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antennas and Millimeter Wave Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort designs evaluates and validates high performance antenna components and software for multifunction radar and communication systems.   Research areas include scanning techniques, broadbanding, beamforming, polarization, platform integration, and affordability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.410"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and fabricated new antenna material structures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop low-profile antennas suitable for conformal and embedded platform applications; develop and assess millimeter wave and terahertz imaging devices and phenomenology for a wide range of applications such as low-visibility navigation and detection of concealed body-borne threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.574"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.574"
                                            },
                                            "Text": {
                                                "val": "Will develop new terahertz detector for covert surveillance; continue millimeter wave antenna development; develop and evaluate carbon nanotube based antenna structures as well as low-profile metaferrite based, for potential integration into soldier uniforms; design and develop antenna components to allow interoperability of and reduce interference between electronic warfare and communications functions on a single antenna system; validate performance of antenna components in laboratory experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Micro and Nano Devices"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates micro and nanotechnology components for multifunctional and integrated radio frequency (RF) applications; microrobotics, integrated energetics, control sensor interfaces and sensors for improved battlefield awareness. Work being accomplished under PE 0601102A \/project H47 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.105"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determined cycle reliability in packaged Piezo-microelectromechanical systems (piezo-MEMS) switches targeted lifetimes in excess of 1 Billion Cycles; developed switch technologies with extremely low on state resistances (<0.5 Ohm); developed switchable filter technology spanning low MHz to low GHz; and investigated Piezo-MEMS devices for operation near or above 100 GHz."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.553"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate mechanical microcontroller for integrated control of electronically-scanned antennas; develop methods to extend autonomous jumping microrobot to multiple jumps > 5cm for increased mobility; design and evaluate MEMS based, low power  rotational acceleration switch arrays for detection of potential traumatic brain injury-causing events; evaluate carbon based devices and develop circuits for future amplifiers and frequency doublers; grow, characterize and fabricate graphene materials and structure for future high performance and low power Army electronic applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.637"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.637"
                                            },
                                            "Text": {
                                                "val": "Will develop, synthesize and evaluate conformal and transparent graphene based electronics, and super-capacitors for high energy and power density; develop MEMS UHF switchable filter module with variable bandwidth, center frequency tuning, and insertion loss <3 dB; investigate integration of MEMS and nano-energetics to enable directionality for jumping microrobots; develop piezoMEMS actuators for tethered flight and millimeter scale robotics; develop a digital interface between the MEMS acceleration switch arrays and the electronics to reduce power consumption; investigate MEMS-based magnetic permeability sensing hardware for reading and writing non-erasable magnetic memory."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Millimeter Wave Components and Architectures for Advanced Electronic Systems"
                                    },
                                    "Description": {
                                        "val": "This effort researches, designs and evaluates component materials, structures, devices, and the electromagnetic issues of millimeter wave components and active devices.  The goal is to develop components that can enable advanced systems that combine multiple RF functionalities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.651"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed highly integrated silicon based technology for multi-channel, multi-function RF Integrated Circuits (ICs); developed emerging III-V devices for heterogeneous integration of millimeter wave to terahertz subsystems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.841"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design high density RF circuit with reduced size, weight and power (SWaP) for radar, communications, and electronic warfare applications; refine millimeter wave power amplifier linearization design to optimize efficiency and output power for improved data throughput and reduced SWaP in SATCOM applications; design, fabricate and experimentally validate radio receiver components that can sense, identify and exploit RF threat signatures for improved standoff threat signal identification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.207"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.207"
                                            },
                                            "Text": {
                                                "val": "Will investigate and evaluate RF component integration techniques and build and test antennas and amplifiers capable of receiving inherently weak wideband threat signatures; design and fabricate a circuit that digitizes signals at millimeter wave frequencies to enable architectures for SATCOM with smaller form factors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Imaging Laser Radar (LADAR) and Vision Protection"
                                    },
                                    "Description": {
                                        "val": "This effort develops and assesses eye-safe three dimensional (3-D) LADAR components and phenomenology for long-range reconnaissance and short-range unmanned ground and air vehicle applications. The effort also develops and evaluates materials for passive protection of electro-optic (EO) vision systems from lasers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.591"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed skin-based phenomenology measurements for development of long-range uncooperative biometric identification; integrated LADAR onto additional small-robotic platforms and performed relevant-environment experiments; experimentally validated multi-element electro-optic shutter array."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.296"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess skin-based, long-range biometric identification phenomenology for uncooperative subjects; complete assessment of LADAR on small-robotic platforms to validate perception performance under realistic conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.715"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.715"
                                            },
                                            "Text": {
                                                "val": "Will integrate and evaluate enhanced switching technology with an inorganic crystal-based optical switch for improving laser protection electro-optic shutters; develop and evaluate skin-based spectroscopic and advanced holographic technologies for the identification and verification of uncooperative subjects; design and develop miniaturized components for high resolution active imaging systems (ladar and holographic) for higher range and angular resolution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Photonics and Opto-Electronic devices"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates novel photonic components and architectures to enable detection of hazardous substances for enhanced Soldier situational awareness and survivability.  In addition, this effort develops and assesses the hybridization of Opto-electronic (OE) devices with electronics for optical fuze applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.576"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated active and passive optical fuzes; down-selected laser pulse-shaping excitation scheme for further investigations of energetic materials detection; down-selected and developed photoacoustics method with most potential for trace energetic detection using currently maturing infrared laser diodes sources; investigated construction of advanced peptide recognition elements using iterative process involving computational modeling coupled with experimental characterization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.901"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate active optical fuses to advance target detection device performance; evaluate laser spectroscopic phenomenology to determine inherent specificity and sensitivity for detection of hazardous or suspicious materials at several ranges; examine trace detection capability of infrared photoacoustic spectroscopy for detecting energetic materials as well as electromagnetic signatures to enhance detection of hostile threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.316"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.316"
                                            },
                                            "Text": {
                                                "val": "Will measure the optical spectra of energetic and energetic related materials using ultra fast Laser spectroscopy techniques and infrared photo-acoustic spectroscopy to identify explosive materials; simulate, fabricate, and characterize advanced silicon photonic devices for improved sensing and processing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power and Thermal Management for Small Systems"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and fabricates MEMS based components to improve power generation and micro-cooling technology for both dismounted Soldier and future force applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.140"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured a milliwatt scale battery to actuator power converter component for micro robotic systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.917"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and evaluate compact thermal management components utilizing phase change materials to improve heat rejection capabilities, increase cooling capacity, and reduce volume; fabricate efficient high power density, multifunctional components and sub-systems for capturing, transforming, and delivering power to emerging Microsystems; develop and experimentally validate combustion models for JP-8 and alternative fuels and integrate into the design of catalytic liquid fueled energy converters; characterize catalysts for fuel conversion and fuel synthesis to identify mechanisms for efficient alternative fuels production."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.972"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.972"
                                            },
                                            "Text": {
                                                "val": "Will establish models for package integrated thermal solutions to balance continuous and transient loads in electronic substrates; assess emerging thermoelectric materials and modules for power generation under the high temperature conditions required for efficient direct power generation or waste heat recovery; characterize catalysts for fuel conversion (JP-8 and alternative fuels) to build reaction models for efficient combustion design; investigate improved interconnects between solar cells with gallium nitride materials with advanced structures and interfacing to lower resistance and thereby improve efficiency of the modules; investigate new 3D ultra-High Density Integration Process that will enable disparate best-of-breed sensors and electronics to be integrated within a single package with minimal packaging overhead and interconnect losses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prognostics and Diagnostics (P&D)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates prognostics and diagnostics algorithms; designs, fabricates, and evaluates MEMS and other sensors to enable early detection of mechanical failure and hence reduce maintenance costs; designs models and evaluates databases for integration into decision systems to extend sensor rationalization and minimize downtime via condition-based maintenance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.979"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implemented and conducted experiments of P&D on a vehicle electronic system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.973"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess and evaluate digital source collectors for use in the areas of structural health, usage monitoring, and integrated prognosis;  apply prognostics and diagnostics methodologies for built-in self test of RF integrated circuits; evaluate algorithms to assess current health and predict the remaining useful life of wide bandgap (WBG) RF power devices and circuits; explore diagnostic sensing with non-traditional semiconductors that are potentially extremely low cost, very robust, and conformable."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.769"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.769"
                                            },
                                            "Text": {
                                                "val": "Will develop and design built-in self test of high speed integrated circuits; determine figures of merit for power electronics devices and circuits and apply prognostic and diagnostic strategies to microgrid energy & power applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infrared (IR) Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates materials, components and focal plane arrays (FPA) for the next generation of Army's night vision systems, missile seekers, and general surveillance devices.  Technologies investigated include mercury cadmium telluride (HgCdTe) on Silicon (Si), strained layer superlattices (SLS) and corrugated quantum well infrared photodetector (C-QWIP) detector arrays for both the mid-wave infrared (MWIR) and long-wave infrared (LWIR) spectral regions with goals to increase the operating temperature and decrease the cost of focal plane arrays.  Work accomplished under PE 0602709A\/ project H95 and PE 0601120A\/project 31B compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.639"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experimentally validated an improvement in superlattice minority carrier lifetimes and progressed towards 2K x 2K quantum well infrared focal plane arrays."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experimentally validate optimized HgCdTe devices on alternate substrates to provide a more sensitive large format and higher resolution LWIR and MWIR C-QWIP FPA; design voltage tunable two color C-QWIP FPAs that results in increased resolution and higher operating temperatures for more efficient operation and robust target detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.410"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.410"
                                            },
                                            "Text": {
                                                "val": "Will model and exploit electromagnetic resonant effects to design and fabricate high quantum efficiency (up to 70%), large format, long wavelength, quantum well infrared photo-detetector focal plane arrays with resolution up to 4 megapixel or higher; develop high quality scalable substrates with Cadmium (Zinc, Selenium) Telluride buffer layers on Silicon; develop Mercury Cadmium (Telluride, Selenide) based infrared sensing materials and devices; use thermal cycle annealing to reduce dislocations propagating in the active region, which currently limits operability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates chemistries, materials and components for advanced batteries, fuel reformers, and fuel cells.  Potential applications include hybrid power sources, smart munitions, hybrid electric vehicles, and Soldier power applications.  Investigate applicability of photosynthesis to provide fuel and electricity for Soldier power applications.  Investigate silicon carbide (SiC) power module components to enable compact high efficiency, high temperature, and high power density converters for motor drive and pulse power applications.  This effort supports Technology Enabled Capability Demonstration 4.a: Sustainability\/Logistics-Basing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.308"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated high-temperature (110-120 C) high-frequency SiC power modules with integrated sense and gate drive for use in compact high-efficiency power conversion modules; investigated stable high voltage anode, cathode and electrolyte components for Lithium (Li) ion batteries; incorporated Si anode materials in Li ion cells; developed improved alkaline fuel cell membranes; as well as evaluated lifetime and rise time of thin film batteries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.172"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and evaluate thin film battery devices for munitions; evaluate advanced alkaline membranes and catalysts with improved efficiency for alkaline fuel cells; evaluate catalyzed Li-air battery reactions for faster charging and high current discharge;  investigate and evaluate processes for synthetically generating energy through photosynthesis;  evaluate device physics reliability issues (i.e. material defects, interface impedances) of wide bandgap devices; investigate and characterize high frequency operation of wide bandgap devices and for new device material implementation in vehicle motor drives and pulse power applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.099"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.099"
                                            },
                                            "Text": {
                                                "val": "Will evaluate thin film thermal batteries; experimentally validate computational models of hydroxyl-ion transport in alkaline membranes for alkaline fuel cells; evaluate lithium\/sulfur battery chemistry for grid energy storage, investigate solid electrolyte interphase formation on Si anodes for Li ion batteries; demonstrate production of hydrogen gas using photosynthetic methods for alternative energy applications; Continue to evaluate and characterize material defects and interface impedances using a diode structure to improve the reliability of electronic power devices; investigate and characterize high frequency operation of silicon carbide devices for new device material implementation in vehicle motor drives and pulse power applications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}