{
    "id": "6ae088fea7ffc9ea0713e4c2de6340269cd5419f",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DARPA_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603287E"
        },
        "ProgramElementTitle": {
            "val": "SPACE PROGRAMS AND TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "38"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "99.138"
            },
            "CurrentYear": {
                "val": "159.704"
            },
            "BudgetYearOne": {
                "val": "172.546"
            },
            "BudgetYearOneBase": {
                "val": "172.546"
            },
            "BudgetYearTwo": {
                "val": "169.757"
            },
            "BudgetYearThree": {
                "val": "169.796"
            },
            "BudgetYearFour": {
                "val": "169.186"
            },
            "BudgetYearFive": {
                "val": "170.186"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Space Programs and Technology program element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to dramatically reduce costs associated with advanced space systems and provides revolutionary new system capabilities for satisfying current and projected military missions.\n\nA space force structure that is robust against attack represents a stabilizing deterrent against adversary attacks on space assets.  The keys to a secure space environment are situational awareness to detect and characterize potential threats, a proliferation of assets to provide robustness against attack, ready access to space, and a flexible infrastructure for maintaining the capabilities of on-orbit assets.  Ready access to space requires the delivery of defensive systems, replenishment supplies to orbit, and rapid manufacturing of affordable space capabilities.  An infrastructure to service the mission spacecraft allows defensive actions to be taken without limiting mission lifetime.  In addition, developing space access and spacecraft servicing technologies will lead to reduced ownership costs of space systems and new opportunities for introducing technologies for the exploitation of space.\n\nSystems development is also required to increase the interactivity of space systems, space-derived information and services with terrestrial users.  Studies under this project include technologies and systems that will enable satellites and microsatellites to operate more effectively by increasing maneuverability, survivability, and situational awareness; enabling concepts include novel propulsion\/propellants, unique manufacturing processes; precision control of multi-payload systems, and payload isolation and pointing systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "97.541"
                },
                "CurrentYear": {
                    "val": "159.704"
                },
                "BudgetYearOne": {
                    "val": "232.546"
                },
                "BudgetYearOneBase": {
                    "val": "232.546"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "99.138"
                },
                "CurrentYear": {
                    "val": "159.704"
                },
                "BudgetYearOne": {
                    "val": "172.546"
                },
                "BudgetYearOneBase": {
                    "val": "172.546"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.597"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-60.000"
                },
                "BudgetYearOneBase": {
                    "val": "-60.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.255"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.658"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-60.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-60.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012:  Increase reflects internal below threshold reprogrammings offset by the SBIR\/STTR transfer. \nFY 2014:  Decrease reflects rephasing of the major systems efforts in this PE."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SPC-01"
                    },
                    "ProjectTitle": {
                        "val": "SPACE PROGRAMS AND TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "99.138"
                        },
                        "CurrentYear": {
                            "val": "159.704"
                        },
                        "BudgetYearOne": {
                            "val": "172.546"
                        },
                        "BudgetYearOneBase": {
                            "val": "172.546"
                        },
                        "BudgetYearTwo": {
                            "val": "169.757"
                        },
                        "BudgetYearThree": {
                            "val": "169.796"
                        },
                        "BudgetYearFour": {
                            "val": "169.186"
                        },
                        "BudgetYearFive": {
                            "val": "170.186"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Space Programs and Technology program element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to dramatically reduce costs associated with advanced space systems and provides revolutionary new system capabilities for satisfying current and projected military missions.\n\nA space force structure that is robust against attack represents a stabilizing deterrent against adversary attacks on space assets.  The keys to a secure space environment are situational awareness to detect and characterize potential threats, a proliferation of assets to provide robustness against attack, ready access to space, and a flexible infrastructure for maintaining the capabilities of on-orbit assets.  Ready access to space requires the delivery of defensive systems, replenishment supplies to orbit, and rapid manufacturing of affordable space capabilities.  An infrastructure to service the mission spacecraft allows defensive actions to be taken without limiting mission lifetime.  In addition, developing space access and spacecraft servicing technologies will lead to reduced ownership costs of space systems and new opportunities for introducing technologies for the exploitation of space.\n\nSystems development is also required to increase the interactivity of space systems, space-derived information and services with terrestrial users.  Studies under this project include technologies and systems that will enable satellites and microsatellites to operate more effectively by increasing maneuverability, survivability, and situational awareness; enabling concepts include novel propulsion\/propellants, unique manufacturing processes; precision control of multi-payload systems, and payload isolation and pointing systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System F6"
                                    },
                                    "Description": {
                                        "val": "The objective of the System F6 program is to demonstrate the feasibility and benefits of a satellite architecture wherein the functionality of a traditional \"monolithic\" spacecraft is replaced by a cluster of wirelessly-interconnected spacecraft modules.  Each such \"fractionated\" module would contribute a unique capability, for example, computation and data handling, communications relay, guidance and navigation, payload sensing, or it can replicate the capability of another module.  The fractionated modules would fly in a loose, proximate cluster orbit capable of semi-autonomous reconfiguration or a rapid defensive scatter\/re-gather maneuver.  Critical to this architecture is a robust, system-level approach to ensuring security, integrity, and availability, while implementing authentication and non-repudiation.  While delivering a comparable mission capability to a monolithic spacecraft, the objective of the System F6 program is to demonstrate the feasibility and benefits of a satellite architecture wherein the functionality of a traditional \"monolithic\" spacecraft is replaced by a cluster of wirelessly-interconnected spacecraft modules.  Each such \"fractionated\" module would contribute a unique capability, for example, computation and data handling, communications relay, guidance and navigation, payload sensing, or it can replicate the capability of another module.  The fractionated modules would fly in a loose, proximate cluster orbit capable of semi-autonomous reconfiguration or a rapid defensive scatter\/re-gather maneuver.  Critical to this architecture is a robust, system-level approach to ensuring security, integrity, and availability, while implementing authentication and non-repudiation.  While delivering a comparable mission capability to a monolithic spacecraft, System F6 significantly enhances architectural and programmatic adaptability and robustness - reducing risk through the mission life and spacecraft development cycle, enabling incremental deployment of the system, and enhancing survivability.  The System F6 architecture provides valuable options to decision makers throughout the life cycle development of future space systems that are absent in present-day monolithic architectures.\n\nThe System F6 program will culminate in an on-orbit demonstration of a multi-module space system incorporating the F6 Technology Package (F6TP) a suite of technologies, components, and algorithms that enables semi-autonomous multi-body cluster flight and secure, distributed, real-time sharing of various spacecraft resources at the cluster level.  Multiple versions of the F6 Technology Package will be developed on the basis of open-source interface standards, software, and reference designs termed the F6 Developer's Kit (FDK).  The on-orbit demonstration will be capable of accommodating one or more spacecraft payload modules supplied by a third-party mission partner.  Residual capability to support future payloads with the existing on-orbit infrastructure will also remain following the demonstration, and the infrastructure can be upgraded for a perpetual on-orbit resource capability.  The utility of the F6 architecture in low earth orbit (LEO) is significantly enabled by persistent broadband connectivity to the ground which allows resource sharing between space-based modules and terrestrial network nodes.  A solution to enable high-availability, low-latency, persistent, high-bandwidth communication with LEO spacecraft will be developed in the course of the F6 program.  The anticipated transition partner is the Air Force, though the architecture will have the ability to simultaneously accommodate payloads from multiple other partners including the Army and Navy.  The resultant architecture is expected to significantly lower the barrier to entry and enhance competiveness of the national security space industrial base."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed parametric model analyses of wireless intermodule communications and cluster flight.\n-  Completed and demonstrated prototype wireless transceivers.\n-  Completed prototype of design tool for adaptable fractionated space systems.\n-  Commenced development of the F6TP.\n-  Performed hardware-in-the-loop testing of the persistent broadband terrestrial connectivity solution via commercial communications relay for LEO fractionated clusters.\n-  Conducted critical design review (CDR) for the persistent broadband terrestrial connectivity solution for LEO fractionated clusters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "48.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete initial version of FDK software and demonstrate functionality in representative orbital conditions.\n-  Complete initial release of the FDK.\n-  Complete a fully-functional, polished, well-documented, user-friendly value-centric architecture and design tools for adaptable fractionated space systems.\n-  Conduct preliminary design review (PDR) for the F6TP.\n-  Conduct CDR for the F6TP.\n-  Take delivery of the F6TP breadboards.\n-  Purchase flight units of the F6TPs.\n-  Take delivery of flight unit of the persistent broadband terrestrial connectivity terminal for LEO fractionated clusters.\n-  Initiate development of spacecraft buses and payloads for on-orbit demonstration testbed.\n-  Initiate development of mission operations center.\n-  Initiate launch vehicle procurement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "50.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "50.000"
                                            },
                                            "Text": {
                                                "val": "-  Take delivery of F6TP engineering development units.\n-  Conduct PDR and CDR for the on-orbit demonstration testbed.\n-  Integrate flight unit of the persistent broadband terrestrial connectivity terminal into on-orbit demonstration spacecraft bus.\n-  Integrate wireless transceivers flight units into on-orbit demonstration spacecraft buses.\n-  Integrate mission payload and shared payloads into on-orbit demonstration spacecraft buses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Airborne Launch Assist Space Access (ALASA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Airborne Launch Assist Space Access (ALASA) program is to mature and demonstrate technologies for cost effective, routine, reliable, horizontal access to low earth orbit (LEO).  ALASA seeks improvements in cost, responsiveness, flexibility, and resilience with a single approach.  ALASA will enable small satellites to be deployed to orbit from an airborne platform, allowing performance improvement, reducing range costs, and flying more frequently, which drives cost per pound down.  The ability to relocate and launch from virtually any major runway around the globe reduces the time needed to deploy a satellite system.  Launch point offset permits essentially any possible orbit direction to be achieved without concerns for launch direction imposed by geography.  Finally, launch point offset allows the entire operation to be moved should a particular fixed airfield become unavailable due to natural phenomena or other issues.  Challenges include, but are not limited to: in-air separation of aircraft and orbit-insertion launch stages, development of alternatives to current range processes, control of weight and margin under a hard gross weight limit, and achieving a cost per flight of $1 million, including range support costs, to deploy satellites on the order of 100 lb.  The anticipated transition partners are the Air Force and Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed conceptual design of selected architecture focusing on key technology and affordability gaps.\n-  Initiated preliminary design.\n-  Developed and matured enabling and enhancing technologies including automatic flight termination systems, advanced rocket engine and pump manufacturing, and rapid mission planning tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete initial test plans for flight demonstrator.\n-  Complete risk management plan.\n-  Conduct preliminary design review and select enabling and enhancing technologies for incorporation into system concepts.\n-  Conduct critical design review and initiate detailed design.\n-  Integrate selected enabling and enhancing technologies on launch assist aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct trade studies of additional enabling technology to include propellants, manufacturing, mission planning and range support software, and tracking and flight termination software.\n-  Conduct critical design review of demonstration system and develop flight demonstrator.\n-  Complete ALASA vehicle flight readiness review.\n-  Conduct flight tests.\n-  Establish and publish open standards for interface specifications between launch assist aircraft and launch vehicle.\n-  Initiate demonstration of ALASA vehicle launches."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Domain Awareness (SDA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Space Domain Awareness (SDA) program is to develop and demonstrate an operational framework and responsive defense application to enhance the availability of vulnerable space-based resources.  Current space surveillance sensors cannot detect, track, or determine the future location and threat potential of small advanced technology spacecraft in deep space orbits, where a majority of DoD spacecraft are located.  Additionally, servicing missions to geosynchronous (GEO) orbits will require exquisite situational awareness, from ultra-high-accuracy debris tracking for mission assurance at GEO orbits to high resolution imaging of GEO spacecraft for service mission planning.\n\nSDA will investigate revolutionary technologies in two areas: 1) advanced space surveillance sensors to better detect, track, and characterize space objects, with an emphasis on deep space objects, and 2) space surveillance data collection and data processing\/ fusion to provide automated data synergy.  The resulting increase in space domain awareness will enhance overall space safety of flight, and allow space operators to make informed, timely decisions.  The SDA program will leverage data fusion and advanced algorithms developed under the Space Surveillance Telescope (SST) program, as well as seek to exploit new ground-breaking technologies across the electromagnetic spectrum and utilize already existing sensor technology in non-traditional or exotic ways, to bring advanced capabilities to the space domain.  SDA will correlate a wide range of operational support and space system user data to rapidly identify threat activities, propose mitigating countermeasures, and verify the effectiveness of selected responses.  Critical technologies include accessing disparate sources of relevant data, model-based situational awareness, and candidate response generation and evaluation.  Particular emphasis will be placed on the ability to continuously adapt to changes in defended system components and usage patterns as well as validation of system integrity.\n\nEfficient collection of data for SDA is crucial to controlling costs.  SDA will demonstrate new approaches to collection of data utilizing a variety of collection modalities, ranging from fusion of observations from non-traditional sources, such as amateur includes orbit outlook astronomers, to evaluation of sparse aperture imaging techniques.  The Galileo effort will develop technology to image a Geosynchronous Earth Orbit (GEO) satellite from the ground.  Galileo will utilize fixed mobile telescopes, each with adaptive optics and a guide star, to create multiple baselines that can be used to reconstruct the image through an inverse Fourier transform.  The concept is similar to existing astronomic interferometers, except Galileo will extend the basic interferometric technology to utilize fiber optic transport of light between each telescope to match the optical path length instead of the traditional evacuated light tubes.  Technical challenges include: controlling thermal effects and dispersion within the fiber to properly interfere the light from the two telescopes, precisely measuring the distance between the fixed and mobile telescope systems, and accurately measuring relative phase from low signal flux levels with low mutual coherence.  The potential transition customer is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed intensity correlation imaging study.\n-  Initiated Galileo sparse aperture imaging technology development.\n-  Initiated studies of market-based methods of acquiring SSA data from non-traditional sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.000"
                                            },
                                            "Text": {
                                                "val": "-   Develop architecture for low cost space situational awareness (SSA) data sources.\n-   Expand the concept of dynamically tasked sensors so that the entire SSA network is continuously optimized and capable of rapid response to any space anomaly or threat.\n-  Develop requirements and complete designs for the Galileo mobile telescope and fiber control system.\n-  Develop plans to integrate the Galileo mobile telescope and fiber control into a single proof-of-concept demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the advantages of a having a collaborative network of users with access to data from numerous distributed sensors over the traditional sensor-centric architecture.\n-  Demonstrate intuitive applications and adaptive understanding capabilities of the next-generation space information fusion center.\n-  Build, test, and deploy the Galileo mobile telescope system.\n-  Build, test, and deploy the Galileo fiber control system.\n-  Integrate the Galileo systems and perform an imaging campaign for a 10cm spatial resolution image of an 11 visual magnitude GEO satellite."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Surveillance Telescope (SST)"
                                    },
                                    "Description": {
                                        "val": "The Space Surveillance Telescope (SST) program will develop and demonstrate an advanced ground-based optical system to enable detection and tracking of faint objects in space, while providing rapid, wide-area search capability.  A major goal of the SST program is to develop the technology for large curved focal surface array sensors to enable an innovative telescope design combining high detection sensitivity, short focal length, wide field of view, and rapid step-and-settle to provide orders of magnitude improvements in space surveillance.  This capability will enable ground-based detection of un-cued objects in deep space for purposes such as asteroid detection and space defense missions.  The program is also investigating expanding the demonstration of the telescope to explore detection and tracking of broader classes of space objects under different orbital regimes, and the impact of observations from different environments.  The Air Force Space Command is the intended transition partner.\n\n In addition, the program is investigating data fusion and advanced algorithms for correlation of unknown objects.  SST is expected to generate a large number of uncorrelated targets (UCTs), and new methods will need to be employed to rapidly characterize and attribute the new objects.  Furthermore, the data fusion effort is investigating methods which combine observations from disparate sensors (such as optical and radar installations) to more rapidly, accurately, and completely provide knowledge about UCTs.  Specifically, the data fusion effort is investigating methods to quickly provide positive identification of orbital objects, rapidly characterize them and maintain a catalog of determined characteristics, and dynamically schedule available sensors to provide the most valuable and timely observations possible.  Where appropriate, SST will investigate new concepts which would provide complementary or further advances in ground-based deep space object detection and characterization.\n\nThe SST Australia effort will provide a further operational demonstration of the SST at an Australian site.  Such a location presents a more operationally relevant demonstration, with a richer and more interesting population of SSA targets in geosynchronous orbit.  A demonstration in Australia would investigate telescope performance and observe objects and orbits not visible from the current site in New Mexico.  In addition, the demonstration would generate data for analysis and fusion efforts, which will be used to further refine and evaluate data processing techniques, such as those developed under the Ibex effort.  This program will address technical challenges which may arise from an Australian site, including adaptations to a different telescope environment, and the logistical and communications challenges presented by a site significantly more remote than the current SST location."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.041"
                                            },
                                            "Text": {
                                                "val": "-  Completed final technical demonstration of SST system performance; evaluated demonstration activities and SST mission functionality.\n-  Conducted systems requirement review for the data fusion effort.\n-  Conducted preliminary and critical design reviews for the data fusion effort.\n-  Developed initial data fusion capability packages.\n-  Completed initial data fusion demonstration.\n-  Conducted preliminary investigation of locating the SST in more operationally relevant location in Australia in order to perform a more in-depth demonstration.\n-  Completed data acquisition for military utility analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.204"
                                            },
                                            "Text": {
                                                "val": "-  Transition data fusion services to users.\n-  Complete military utility assessment of SST. \n-  Complete investigation and planning for optimal SST location in Australia.\n-  Complete SST relocation plan.\n-  Complete evaluation of operational strategies, technology studies, and hardware demonstrations in order to optimize SST performance at Australia site."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Disassemble SST in New Mexico.\n-  Ship SST to Australian site and begin integration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Phoenix"
                                    },
                                    "Description": {
                                        "val": "To date, servicing operations have not been conducted on spacecraft beyond low earth orbit (LEO).  A large number of national security and commercial space systems operate at Geosynchronous (GEO) altitudes, furthermore, many end-of-life or failed spacecraft drift without control through portions of the GEO belt, creating a growing hazard to operational spacecraft.  Technologies for servicing of spacecraft with the expectation such servicing would involve a mix of highly autonomous and remotely (i.e., ground-based) teleoperated robotic systems have been previously pursued.  The Phoenix servicing program will build upon these legacy technologies, tackling the more complex GEO environment and going beyond pure traditional servicing functions.  The program seeks to repurpose high value long life components on existing satellites in GEO, in full collaboration and cooperation with existing satellite owners, utilizing commercial ride-along capability to send newly developed small, modular, and inexpensive \"satlet\" satellite modules into GEO for use in upgrading, fixing, repairing, and enhancing the repurposed components.  Key challenges include transportation and orbital maneuvering, robotic systems and integration, and extravehicular tool requirements.  The anticipated transition partner is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.097"
                                            },
                                            "Text": {
                                                "val": "-  Performed conceptual mission design and feasibility studies for a repurposing mission in GEO.\n-  Performed conceptual design of a selected demonstration mission, focusing on system architecture and key technology gaps, with candidates that would support aperture repurposing.\n-  Started technology exploration in redefining the morphology of satellites with satlets, to allow expansion of repurposing precepts at cost points that are orders of magnitude lower than new systems.\n-  Developed initial conceptual design and conducted evaluation of commercial hosted ride-along payloads ability to be ejected safely and securely at GEO to increase tempo of mass to orbit to support satlet architecture.\n-  Developed comprehensive concepts of operations for a one year circumnavigation of the GEO belt with up to two separate repurposed apertures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete preliminary design of robotic servicing payload architecture and systems for Phoenix vehicle.\n-  Develop payload orbital delivery systems (PODS) designs for commercial satellite ride-along and show first working prototype for dispensement.\n-  Initiate flight scale build of first satlets and demonstrate aggregation of performance functions in a ground testbed.\n-  Initiate development and build of robotic servicing components including tools and toolbelt systems and select a complete complement of tools for Phoenix.\n-  Initiate six degree of freedom testbed on ground; begin virtual system testing with the primary and secondary robotic arms.\n-  Initiate telepresence simulation and begin to test qualification and training standards for Phoenix robotic operations.\n-  Build first prototype of sensor suite for guidance and control on servicer and evaluate it with actual flight software algorithms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete critical design of robotic servicing system including primary and secondary robotic arms and toolbelt.\n-  Deliver sensor suite for guidance and control on servicer.\n-  Deliver primary and secondary robotic hardware and software.\n-  Deliver flight rated PODS for initial integration into a GEO communications satellite.\n-  Deliver a full complement of satlet hardware to support first repurposing aperture.\n-  Deliver repurposing equipment prototypes.\n-  Complete mission validation testing inside a six degree of freedom chamber."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SeeMe"
                                    },
                                    "Description": {
                                        "val": "The Army, Air Force, intelligence community, and other potential users require affordable support to the tactical warfighter via space.  The goal of the SeeMe program is to demonstrate the ability to get near-real-time, i.e., no older than ~90 minutes, images directly to individual users' handheld devices from space.  This will be accomplished via a very low cost constellation of inexpensive, disposable small satellites routinely and inexpensively put in orbit through low cost horizontal (aircraft-released) launches.  The current methodology for satisfying imagery needs from space is to build multipurpose systems with very high reliability and long life, at very high costs, and launch them on expensive vertical launch boosters. In most cases, commercial or military, the time to deliver an already built space intelligence, surveillance, and reconnaissance system suitable to meet tactically desired ground sample distance is on the order of 20+ months, and the data delivery mechanism is typically more than several days (and up to weeks) to the end user.  SeeMe intends to radically shorten the entire cycle: ground development time, launch cadence, and on-orbit request-to-image-delivery time through new satellite manufacturing techniques, advanced low-cost aperture technologies, leveraging alternative launch concepts, and a novel direct-to-user command and data exfiltration architecture.  The anticipated transition partners are the Air Force and the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted trade study of available technologies and investment opportunities.\n-  Initiated concept design.\n-  Performed detailed system trade between a low cost launch alternative and metrics associated with constellation size and altitude.\n-  Evaluated technologies for direct satellite to handheld device capabilities.\n-  Performed evaluation of a multitude of manufacturing processes and technologies from non-aerospace disciplines to achieve 10x cost reduction.\n-  Selected specific satellite architecture for hardware instantiation as prototypes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Text": {
                                                "val": "-  Execute technical prototype integration options for hardware level development.\n-  Demonstrate applicability to commercial production environment using commercial off the shelf (COTS) based hardware.\n-  Verify radio frequency and optical aperture template and begin prototype construction.\n-  Complete ground user hardware interface study\/development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.546"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.546"
                                            },
                                            "Text": {
                                                "val": "-  Prepare critical design of system hardware and software for the satellites to include the payload operations for a handheld communications device.\n-  Complete prototype hardware field demonstration to handheld devices.\n-  Deliver \"plan and shoot\" software and packaging for the onboard satellites.\n-  Complete and environmentally test initial production run of at least six units to verify the ability to build units within 90 days with no pre-purchased components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimental Solar Electric Propulsion Vehicle (X-SEP)"
                                    },
                                    "Description": {
                                        "val": "The X-SEP program will mature the technologies for advanced solar electric propulsion to support a wide range of future DOD missions.  Past DOD and NASA efforts have identified and begun maturing critical enabling technologies including light weight and high power solar arrays, advanced solar cells, efficient deployment mechanisms, power management and distribution; and advanced electric propulsion concepts.   A critically important technology gap is integration into a flight demonstration able to survive in the harsh radiation and thermal space environments.  The X-SEP program will mature and validate key technologies on the ground, then fabricate a deep space X-Satellite to demonstrate:  1) a space qualified power system 1\/3 the weight of anything ever flown 2) electric propulsion thrust over input power greater than 90 mN\/KW, and 3) modular power scaleable to over 1 MW.  A key goal is validating the critical technologies for a wide range of next generation high power space systems including highly survivable early missile warning sensors; space situational awareness; efficient on-orbit robotic servicing; new technical approaches for space based radar; next generation high power communications; and dynamic near continuous maneuvering for survivable information, surveillance and reconnaissance (ISR) orbital missions.  The anticipated transition partner is the Air Force with potential follow-on transitions to NASA and\/or the commercial sector."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct system requirements studies for alternative configurations and to determine operational requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Responsive Space Access X-Plane"
                                    },
                                    "Description": {
                                        "val": "The Small Responsive Space Access X-Plane program will mature the technologies and operations for low cost, persistent and responsive space access and global reach.  Past efforts have identified and demonstrated critical enabling technologies including composite or light weight structures, propellant tanks, thermal protection systems, rocket propulsion and advanced avionics\/software.   A critically important technology gap is integration into a flight demonstration able to deliver aircraft-like operability.  The program will validate key technologies on the ground, and then fabricate an X-Plane to demonstrate:   1) 10 flights in 10 days, 2) Mach 10+ flight, and 3) 10X lower cost space access for cargoes up to 5,000 lbs to low earth orbit.  A key goal is validating the critical technologies for a wide range of next generation high speed aircraft enabling new military capabilities including worldwide reconnaissance, global transport, small responsive space access aircraft and affordable spacelift.   The anticipated transition partners are the Air Force, Navy and\/or commercial sector."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform system level trade studies to identify alternative configurations and define tradespace."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}