{
    "id": "6c9b7cf75e3d5a12925dc803ae9817f3ecda20ca",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603401F"
        },
        "ProgramElementTitle": {
            "val": "Advanced Spacecraft Technology"
        },
        "R1LineItemNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "70.643"
            },
            "CurrentYear": {
                "val": "64.557"
            },
            "BudgetYearOne": {
                "val": "68.071"
            },
            "BudgetYearOneBase": {
                "val": "68.071"
            },
            "BudgetYearTwo": {
                "val": "69.975"
            },
            "BudgetYearThree": {
                "val": "51.193"
            },
            "BudgetYearFour": {
                "val": "52.117"
            },
            "BudgetYearFive": {
                "val": "53.293"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops, integrates, and demonstrates space technologies in the areas of spacecraft payloads, spacecraft protection, spacecraft vehicles, ballistic missiles, and space systems survivability.  The integrated space technologies are demonstrated by component or system level tests on the ground or in flight.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 3, Advanced Technology Development, since it develops and demonstrates technologies for existing space system upgrades and\/or new space system developments that have military utility and address warfighter needs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "74.009"
                },
                "CurrentYear": {
                    "val": "64.557"
                },
                "BudgetYearOne": {
                    "val": "61.690"
                },
                "BudgetYearOneBase": {
                    "val": "61.690"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "70.643"
                },
                "CurrentYear": {
                    "val": "64.557"
                },
                "BudgetYearOne": {
                    "val": "68.071"
                },
                "BudgetYearOneBase": {
                    "val": "68.071"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.366"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "6.381"
                },
                "BudgetYearOneBase": {
                    "val": "6.381"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.909"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.457"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "6.381"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.381"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY14 is due to increased emphasis on positioning, navigation, and timing space payload technologies and space communications.\n\nReprogrammed for specific projects in accordance with Section 219 of the Duncan Hunter National Defense Authorization Act for Fiscal Year (FY) 2009, as amended by Section 2801 of the National Defense Authorization Act for FY 2010."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "632181"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Payloads"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.601"
                        },
                        "CurrentYear": {
                            "val": "15.710"
                        },
                        "BudgetYearOne": {
                            "val": "16.492"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.492"
                        },
                        "BudgetYearTwo": {
                            "val": "11.306"
                        },
                        "BudgetYearThree": {
                            "val": "11.192"
                        },
                        "BudgetYearFour": {
                            "val": "11.604"
                        },
                        "BudgetYearFive": {
                            "val": "12.004"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the development, demonstration, and evaluation of radiation-hardened space electronic hardware, satellite control hardware, and software for advanced satellite surveillance operations.  Future improved space-qualifiable electronics and software for data and signal processing will be more interchangeable, interoperable, and standardized.  In the near-term, this project's work concentrates on converting (i.e., radiation-hardening) commercial data and signal processor technologies for use in Air Force space systems.  For mid-term applications, this project merges advanced, radiation-hardened space processor, memory, and interconnect technologies with commercially-derived, open system architectures to develop and demonstrate robust, on-board processing capabilities for 21st century Department of Defense (DoD) satellites.  In the long-term, this project area focuses on developing low-cost, easily modifiable software and hardware architectures for fully autonomous constellations of intelligent satellites capable of performing all mission related functions without operator intervention."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Space Electronics"
                                    },
                                    "Description": {
                                        "val": "Develop microelectronic devices, including radiation-hardened data processors and high-density hardened memories, advanced packaging technologies, and micro-electro-mechanical system components and applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.650"
                                            },
                                            "Text": {
                                                "val": "Completed development of Single Event Immune Reconfigurable Field Programmable Gate Array for flexible, cost-effective on-board processing in space.  Developed multiprocessor components to increase on-orbit processing capability.  Developed high-density volatile and non-volatile memory for increased on-orbit storage capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.047"
                                            },
                                            "Text": {
                                                "val": "Continue to develop multiprocessor components to increase on-orbit processing capability.  Continue to develop high-density volatile and non-volatile memory for increased on-orbit storage capability.  Complete digital structured application specific integrated circuits for affordable space electronics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.285"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.285"
                                            },
                                            "Text": {
                                                "val": "Focus development of multiprocessor components to reduce power required for on-orbit processing capability.  Develop volatile memory for satellite high-density data storage capability.  Begin to develop analog structured application specific integrated circuits for affordable space electronic support logic."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spacecraft Design Tools"
                                    },
                                    "Description": {
                                        "val": "Develop satellite system technologies for spacecraft operations and for satellite control, precision navigation, formation flying, and proximity operations technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.467"
                                            },
                                            "Text": {
                                                "val": "Completed rapid spacecraft development processes for automated spacecraft design, rapid assembly, automated flight and ground software configuration, and expedited integration and test.  Initiated second-generation plug-and-play ground testbed to fully test and demonstrate end-to-end flight ready spacecraft plug-and-play software and hardware.  Began plug-and-play network analysis for impact on spacecraft performance.  Assisted space acquisitions with plug-and-play technology assessment.  Supported Air Force development of a plug-and-play based space vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.991"
                                            },
                                            "Text": {
                                                "val": "Continue development and use of second-generation plug-and-play ground testbed to fully test and demonstrate end-to-end flight ready spacecraft plug-and-play software and hardware.  Support transition of spacecraft modular component technology to large spacecraft.  Continue assisting space acquisitions with modular space component technology assessment.  Continue supporting Air Force development of a modular component based space vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continue development, refinement and use of modular space component ground testbed.  Mature plug-and-play standards and structure.  Continue supporting Air Force development of a plug-and-play based space vehicle.  Note:  Funding for space plug-and-play technology development reduced due to higher AF priorities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Space Modeling and Simulation Tools"
                                    },
                                    "Description": {
                                        "val": "Develop modeling, simulation, and analysis tools for space-based surveillance systems, space capability protection technologies, access\/mobility technologies, and flight experiments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.343"
                                            },
                                            "Text": {
                                                "val": "Completed integration of autonomous flight software technologies with command, control, guidance, and navigation technologies.  Applied additional physics-to-engineering-to-engagement level models for systems engineering, technology trades, mission planning and operations, and utility analysis to satellite experiments in space superiority mission areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.781"
                                            },
                                            "Text": {
                                                "val": "Validate the guidance, navigation, and control aspects of the autonomous flight software using the mission simulator flight software.  Continue to provide engineering to engagement level models for systems engineering and trades, mission planning, and utility analysis to flight experiments and research areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.864"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.864"
                                            },
                                            "Text": {
                                                "val": "Validate system to mission-level modeling and simulation tools for flight program mission planning.  Finalize data requirements for upcoming flight programs to gather critical validation data on orbit to enhance previously developed modeling and simulation tools.  Evaluate the military and technical utility of emerging space vehicle technologies and associated software algorithms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Space Sensors"
                                    },
                                    "Description": {
                                        "val": "Develop space infrared technology and hardened focal plane detector arrays to enable acquisition, tracking, and discrimination of hot objects, as well as ''cold body'' objects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.141"
                                            },
                                            "Text": {
                                                "val": "Developed full focal plane array for exquisite imaging for adaptive, comprehensive space situational awareness (SSA).  Initiated higher operating temperature, large format medium wavelength infrared sensor development for wide area, global access detection and tracking."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.891"
                                            },
                                            "Text": {
                                                "val": "Continue large focal plane array development for exquisite imaging for adaptive, comprehensive SSA.  Continue development of higher operating temperature, large format medium wavelength infrared sensors for wide area, global access detection and tracking."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.343"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.343"
                                            },
                                            "Text": {
                                                "val": "Continue developing wide field of view large focal plane array for theater missile warning, missile detection, and battlespace awareness.  Initiate radiation hardened visible scanning effort to improve sensor capabilities for comprehensive SSA."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Positioning, Navigation, and Timing (PNT) Space Payload Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for the NavSat payload (PNT only) that enhance the affordability, resiliency and availability of accuracy of the GPS constellation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Begin to develop advanced solid state power amplifier and reprogrammable flexible digital waveform generator for NavSat PNT payload.  Initiate studies to identify other high payoff technologies to support the NavSat Global Positioning Sytem (GPS) augmentation deployment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "633834"
                    },
                    "ProjectTitle": {
                        "val": "Integrated Space Technology Demonstrations"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.388"
                        },
                        "CurrentYear": {
                            "val": "13.828"
                        },
                        "BudgetYearOne": {
                            "val": "11.817"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.817"
                        },
                        "BudgetYearTwo": {
                            "val": "18.121"
                        },
                        "BudgetYearThree": {
                            "val": "17.101"
                        },
                        "BudgetYearFour": {
                            "val": "18.192"
                        },
                        "BudgetYearFive": {
                            "val": "18.607"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project is a series of advanced technology demonstrations designed to address mission needs by applying emerging technologies from the Air Force Research Laboratory, other U.S. government laboratories, and industry.  These technologies are integrated into system-level demonstrations that are used to test, evaluate, and validate the technologies in a relevant environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Satellite Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Develop satellite technologies for integrated, robust, flexible, satellite demonstrations building on previous work and leveraging investments by other organizations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "33.388"
                                            },
                                            "Text": {
                                                "val": "Completed integration\/test and space environmental testing in preparation for launch of experimental satellite for geosynchronous orbit.  Completed ground system software for use in space operations.  Began design of next geosynchronous space flight demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.828"
                                            },
                                            "Text": {
                                                "val": "Complete satellite integration to the launch vehicle.  Complete satellite flight software and orbit analysis tools for commanding satellite.  Completed final testing of the satellite before it is put in storage to await a launch.  Continue design of next geosynchronous space flight demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.817"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.817"
                                            },
                                            "Text": {
                                                "val": "Begin space flight operations of geosynchronous orbit satellite demonstrating advanced autonomy technologies.  Continue maintenance and debugging of geosynchronous orbit experimental satellite flight software and orbit analysis tools.  Procure long-lead components, the platform, and Air Force payloads for planned demonstration of an augmented Evolved Expendable Launch Vehicle Secondary Payload Adaptor geosynchronous orbit experiment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "634400"
                    },
                    "ProjectTitle": {
                        "val": "Space Systems Protection"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.889"
                        },
                        "CurrentYear": {
                            "val": "5.047"
                        },
                        "BudgetYearOne": {
                            "val": "5.611"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.611"
                        },
                        "BudgetYearTwo": {
                            "val": "5.954"
                        },
                        "BudgetYearThree": {
                            "val": "6.213"
                        },
                        "BudgetYearFour": {
                            "val": "6.384"
                        },
                        "BudgetYearFive": {
                            "val": "6.515"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates tools, instruments, and mitigation techniques required to assure operation of U.S. space assets in potentially hostile warfighting environments.  The project performs assessments of critical components and subsystems, and evaluates susceptibility and vulnerability to radio frequency (RF) and laser threats.  This project also develops technologies that mitigate identified vulnerabilities.  Technologies are developed and demonstrated to support balanced satellite protection strategies for detecting and avoiding threats and operating in a hostile space environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Situational Awareness Capability Development"
                                    },
                                    "Description": {
                                        "val": "Develop tools and technologies that advance space-based proximity awareness capabilities and enable protection and countermeasure courses of action.  Efforts will assess a variety of phenomenologies and concepts in response to multiple threat classes and scenarios."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.922"
                                            },
                                            "Text": {
                                                "val": "Constructed and tested hardware and software for innovative deep space imaging concepts, conducted empirical experiments on test coupons for broad-spectrum effort, and used the results to create a predictive signature capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.898"
                                            },
                                            "Text": {
                                                "val": "Using results from deep-space imaging experiments, develop a brass board system traceable to a potential space-based capability.  Repeat developmental performance tests on brass board hardware and software to verify expected performance.  Conduct experiments to verify performance of predictive signature efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.510"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.510"
                                            },
                                            "Text": {
                                                "val": "Using experimental test results from deep-space imaging experiments, conduct an engineering trade study for a space-based concept."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Indicators and Warning Research"
                                    },
                                    "Description": {
                                        "val": "Develop passive satellite countermeasures and mitigation techniques for current and future threats to satellites."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.787"
                                            },
                                            "Text": {
                                                "val": "Identified local area sensors for indication and warnings concepts for engineering unit development.  Assessed novel imaging techniques and post-processing algorithms to improve detection and identification.  Completed systems engineering study to identify stakeholder courses of action in anomalous conditions and identified decision-maker information needs driving technology development.  Began process to identify future flight opportunity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.715"
                                            },
                                            "Text": {
                                                "val": "Initiate local area sensor for indication and warnings engineering unit development.  Design concept for integrated sensor suite and response system for automated response options.  Continue to identify future flight opportunity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.755"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.755"
                                            },
                                            "Text": {
                                                "val": "Continue local area sensor for indication and warning engineering unit development.  Continue design concept for integrated sensor suite and response system for automated response options.  Begin integration of technologies with identified flight opportunity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spacecraft Threat Detection"
                                    },
                                    "Description": {
                                        "val": "Develop active satellite local space awareness technologies.  Develop advanced exploitation tools for satellite systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.894"
                                            },
                                            "Text": {
                                                "val": "Designed on-orbit threat detection, assessment, and response software systems.  Focused technology development effort on on-orbit intelligent control of surveillance payloads.  Explored technology for miniaturization of sensor concepts and improved dynamic sensitivity of sensor components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.145"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a modular satellite autonomy flight architecture with responsive action to a selected directed energy threat to a hypothetical friendly satellite.  This includes the capability to detect threats on-board and provide autonomous potential courses of action to mitigate the postulated threat."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.346"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.346"
                                            },
                                            "Text": {
                                                "val": "Expand satellite autonomy architecture and demonstrate threat\/anomaly detection and response with real-time sensor processing and control."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Satellite RF Characterization"
                                    },
                                    "Description": {
                                        "val": "Develop RF characterization methods and performance analysis technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.286"
                                            },
                                            "Text": {
                                                "val": "Evaluated sensing techniques for potential active and\/or passive threat detection and tracking capabilities.  Developed requirements and concepts to reduce vulnerabilities to next generation U.S. satellites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.289"
                                            },
                                            "Text": {
                                                "val": "Develop engineering model sensor sub-systems for active and\/or passive threat detection and tracking capabilities.  Initiate technology risk reduction for U.S. satellite vulnerability mitigation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This thrust has been combined with Space Indicators and Warning Research in order to better align counterspace science and technology efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "634950"
                    },
                    "ProjectTitle": {
                        "val": "Space Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "16.000"
                        },
                        "BudgetYearOne": {
                            "val": "15.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.500"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project will provide mission design and development, payload integration, launch support, operations planning, and one-year of on-orbit operations for a science and technology space-launch mission.  The project will provide a launch opportunity in support of the multi-agency \"new entrant\" certification strategy and the Air Force Launch Services New Entrant Certification Guide."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "S&T Space Launch Integration and Test"
                                    },
                                    "Description": {
                                        "val": "Provide mission design and development, payload integration, launch support, operations planning, and one-year of on-orbit operations for a science and technology space-launch mission while supporting the multi-agency \"new entrant\" certification strategy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "Provide mission definition, design, development, and operations planning.  Select and\/or refine satellite and payload manifest.  Initiate planning and integration of satellites and payloads onto launch vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "Provide mission definition, design, development, and operations planning.  Refine satellite and payload manifest.  Continue planning and integration of satellites and payloads onto launch vehicle."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635021"
                    },
                    "ProjectTitle": {
                        "val": "Space Systems Survivability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.960"
                        },
                        "CurrentYear": {
                            "val": "2.907"
                        },
                        "BudgetYearOne": {
                            "val": "3.361"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.361"
                        },
                        "BudgetYearTwo": {
                            "val": "3.191"
                        },
                        "BudgetYearThree": {
                            "val": "3.244"
                        },
                        "BudgetYearFour": {
                            "val": "3.304"
                        },
                        "BudgetYearFive": {
                            "val": "3.365"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates technologies to improve space system survivability and reliability of current and future Department of Defense space systems that must continue operation despite natural space hazards. It develops and demonstrates cost-effective solutions to mitigate hazardous space environmental interactions including electrical charge buildup and electronics failures due to both single radiation events and long-term radiation doses."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Spacecraft Survivability\/Reliability"
                                    },
                                    "Description": {
                                        "val": "Develop technologies to provide improved space radiation and ionospheric hazard specification and forecasting."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.960"
                                            },
                                            "Text": {
                                                "val": "Developed advanced standard model of radiation belts, using data from recently launched space environment instruments.  Completed trade studies to narrow alternatives for a second-generation heliospheric imager for detecting and tracking solar coronal mass ejections (CMEs) which threaten space systems and degrade communications.  Completed development of a more precise CME propagation model to enhance space weather forecasting tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.907"
                                            },
                                            "Text": {
                                                "val": "Improve software tools to model surface and deep charging, radiation dose rate to spacecraft in real-time for evaluation of spacecraft anomalies.  Continue development of an engineering model of an improved instrument to measure high-energy electrons and protons that contribute to radiation dose and spacecraft charging.  Continue advanced development of concepts and technology for an operational capability in heliospheric imaging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.361"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.361"
                                            },
                                            "Text": {
                                                "val": "Exploit on-orbit data to improve accuracy of standard radiation belt model for satellite design.  Continue development of advanced data and modeling techniques to increase accuracy of spacecraft anomaly attribution.  Complete engineering model and begin construction of compact space environment sensor flight unit.  Implement material aging models into spacecraft charging design tool.  Develop technologies supporting next-generation upgrades to the Air Force's solar optical, radio, and imaging network."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635083"
                    },
                    "ProjectTitle": {
                        "val": "Ballistic Missiles Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.785"
                        },
                        "CurrentYear": {
                            "val": "5.081"
                        },
                        "BudgetYearOne": {
                            "val": "5.487"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.487"
                        },
                        "BudgetYearTwo": {
                            "val": "6.356"
                        },
                        "BudgetYearThree": {
                            "val": "6.460"
                        },
                        "BudgetYearFour": {
                            "val": "6.570"
                        },
                        "BudgetYearFive": {
                            "val": "6.682"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, integrates, and demonstrates advanced technologies for sustainment and modernization of strategic ballistic missiles.  The project focuses on developing robust, low maintenance inertial navigation instruments to sustain current ballistic missile systems, as well as provide new, small, low-powered, high-precision instrumentation for next generation missile systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Navigation Instruments"
                                    },
                                    "Description": {
                                        "val": "Develop, integrate, and demonstrate advanced navigation instrumentation applied to emerging vehicle designs and other technologies that support warfighter needs for a safe, secure, and reliable strategic deterrence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.785"
                                            },
                                            "Text": {
                                                "val": "Started follow-on effort to address next generation guidance and navigation technologies for future systems.  Developed technologies that facilitate planned Analysis of Alternatives on next generation strategic weapons.  Completed the build and tested Advanced Inertial Measurement Unit (AIMU) engineering model for enhanced ground testing and preparation for flight test."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.081"
                                            },
                                            "Text": {
                                                "val": "Improve AIMU design based on engineering model testing.  Begin engineering model build of AIMU for validation of performance in a sled test.  Begin preliminary design for hardening of AIMU to weapons level radiation hardness.  Begin development of technologies for next generation strategic weapons requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.487"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.487"
                                            },
                                            "Text": {
                                                "val": "Continue design and build of fully weapons hardened AIMU design to meet Minuteman III requirements.  Continue ground testing to include captive carry flight testing on a Navy test pod."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63682J"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Vehicles"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.020"
                        },
                        "CurrentYear": {
                            "val": "5.984"
                        },
                        "BudgetYearOne": {
                            "val": "10.303"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.303"
                        },
                        "BudgetYearTwo": {
                            "val": "13.547"
                        },
                        "BudgetYearThree": {
                            "val": "6.983"
                        },
                        "BudgetYearFour": {
                            "val": "6.063"
                        },
                        "BudgetYearFive": {
                            "val": "6.120"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates compact, low-cost, spacecraft power generation, storage, distribution, and thermal management technologies, including cryogenic cooling technologies.  This project also develops composites for spacecraft structures and technologies for spacecraft control and mechanisms."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Power Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop power generation space technologies such as multi-junction solar cells, thin-film solar cells, lightweight solar cell arrays, and radiation resistant solar cell modules."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.382"
                                            },
                                            "Text": {
                                                "val": "Extended inverted metamorphic (IMM)-based solar cell development toward 35-37% efficiency.  Conducted maturity development of quantum dot-enhanced IMM solar cells."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.188"
                                            },
                                            "Text": {
                                                "val": "Complete development of efficient 34% IMM solar cell.  Continue development of 35-37% IMM and quantum-dot enhanced IMM solar cells.  Continue maturation of IMM solar cell interconnection and module technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.375"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.375"
                                            },
                                            "Text": {
                                                "val": "Complete development of efficient 35% IMM solar cell.  Continue development of 36-37% IMM and quantum dot enhanced IMM solar cells.  Complete IMM solar cell interconnection and continue maturation of module technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spacecraft Thermal Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for long-life, efficient, low-vibration, lightweight mechanical cryocoolers and integration components for space applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.554"
                                            },
                                            "Text": {
                                                "val": "Worked to reduce size, weight, and power requirements, ease integration, and increase reliability of cryocoolers and supporting payload thermal management systems for very large format focal plane arrays for missile warning capability and for other modular systems.  Evaluated passive versus active cooling, based on heat loads, power requirements, size, and payload thermal modeling.  Provided correlated computer modeling results to industry to improve overall cryocooler design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.891"
                                            },
                                            "Text": {
                                                "val": "Continue to reduce size, weight, and power requirements, ease integration, and increase reliability of cryocoolers and supporting payload thermal management systems for very large format focal plane arrays for missile warning capability and for industry to significantly improve overall cryocooler design.  Expand computer modeling to cover additional cryocooler components, including the pulse tube, and provide correlated results to industry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.984"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.984"
                                            },
                                            "Text": {
                                                "val": "Using correlated computer modeling results, continue to reduce size, weight, and power requirements, ease integration, and increase reliability of cryocoolers and supporting payload thermal management systems for very large format focal plane arrays for missile warning capability and for industry to significantly improve overall cryocooler design.  Further expand computer modeling to additional cryocooler components, to include flow straightening effects and other refrigeration cycles (reverse Brayton), and provide correlated results to industry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spacecraft Structures Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop composites for spacecraft structures and space applications, such as launch vehicle shrouds, thermal protection structures, and space antennas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.338"
                                            },
                                            "Text": {
                                                "val": "Completed development of thermal management testbed for space structures.  Initiated development of system-level deployable architectures for advanced optical systems and low-cost RF reflectors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.338"
                                            },
                                            "Text": {
                                                "val": "Develop capability for providing structural dynamics data on large, deployable apertures for space systems.  Develop technologies and processes for rapid calibration of payloads for space applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.698"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.698"
                                            },
                                            "Text": {
                                                "val": "Perform data analysis on variable heat transfer modulation experiment aboard the International Space Station.  Produce flight-representative deployable baffle and folded optics for compact star-trackers and wide-field-of-view imagers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "On-Orbit Satellite Controls"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for spacecraft controls and mechanisms for on-orbit applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.746"
                                            },
                                            "Text": {
                                                "val": "Transitioned high accuracy star tracker flight unit for use in customer flight program.  Refined SSA camera tracking software in preparation for flight test.  Completed hardware development of momentum control systems (control-moment gyroscopes) for small satellites to improve system agility.  Designed an autonomous mission manager for flight autonomy and on on-orbit planning systems.  Implemented flight-like processors with hardware-in-the-loop to increase technical maturity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.567"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and transition SSA camera tracking software.  Demonstrate momentum control systems (control-moment gyroscopes) for small satellites in relevant environment.  Initiate advanced spacecraft guidance, navigation, and control subsystem hardware development efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Continue advanced spacecraft guidance, navigation, and control subsystem hardware development efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Communication and Control Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for next-generation space communications terminals and equipment, along with methods\/techniques to enable future space system operational command and control concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.946"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.946"
                                            },
                                            "Text": {
                                                "val": "Develop satellite communication flight experiments to support future Air Force satellite systems, particularly reconfigurable\/reprogrammable satellite transceivers, space laser communication terminals, and millimeter wave atmospheric propagation experiments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}