{
    "id": "6efe969b8adca374096ba376d2638ac6c0e0472f",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0708611F"
        },
        "ProgramElementTitle": {
            "val": "Support Systems Development"
        },
        "R1LineItemNumber": {
            "val": "243"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "50.990"
            },
            "CurrentYear": {
                "val": "15.873"
            },
            "BudgetYearOne": {
                "val": "10.925"
            },
            "BudgetYearOneBase": {
                "val": "10.925"
            },
            "BudgetYearTwo": {
                "val": "15.341"
            },
            "BudgetYearThree": {
                "val": "13.704"
            },
            "BudgetYearFour": {
                "val": "11.778"
            },
            "BudgetYearFive": {
                "val": "11.991"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2013, project 673318, Product Data Systems Modernization (PDSM), efforts transferred from PE 0708611F, Support Systems Development (SSD), to PE 0708012F, Logistics Support Activities, to better align with fielded and operational activities supported by PE 0708012F.\n\nIn FY 2014, project 673318, Product Data Systems Modernization (PDSM), efforts were transferred from PE 0708012F, Logistics Support Activities, to PE 0708611F, Support Systems Development (SSD), to better align with required RDT&E activities."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element supports two active projects [project 673318, Product Data System Modernization (PDSM), and project 675042, Logistics Application Logistics Integration (LALI)] and a third project, Logistics Systems Development (LSD), that provides a budgetary accounting location for projects funded through Congressional interest.\n\nProduct Data System Modernization (PDSM), project 673318, is an effort to perform enhancements to the following AF Logistics legacy systems:  1) the Air Force Technical Order functionality through the continued enhancement of the Enhanced Technical Information System (ETIMS) Enterprise, 2) implement the Aircraft Structural Integrity Management Information System (ASIMIS) Modernization, and 3) conduct the Product Lifecycle Management (PLM) Conference Room Pilot (CRP) that will document interface requirements with the Maintenance, Repair, and Overhaul (MRO) and Enterprise Supply Chain Analysis, Planning and Execution (ESCAPE) efforts, 4) use the ESCAPE program to develop a COTS-based Advanced Planning and Scheduling (APS) solution.  PDSM activities also include studies and analysis to support both current and future program planning and program execution to include Nuclear Weapons Related Material (NWRM) technical data requirements.\n\nProject Logisitics Application Logistics Integration (LALI), project 675042, includes Logistics, Installations and Mission Support - Enterprise View (LIMS-EV), an effort to provide integrated, singular information from multiple source systems through the Global Combat Support System - Air Force (GCSS-AF) Integration Framework (IF) to Air Force strategic to tactical level decision makers.\n\nLogistics Systems Development (LSD), project 675044, provides a budgetary accounting location for projects having Congressional interest.\n\nActivities also include studies and analysis to support both current program planning and execution and future program planning.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "50.990"
                },
                "CurrentYear": {
                    "val": "15.873"
                },
                "BudgetYearOne": {
                    "val": "15.420"
                },
                "BudgetYearOneBase": {
                    "val": "15.420"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "50.990"
                },
                "CurrentYear": {
                    "val": "15.873"
                },
                "BudgetYearOne": {
                    "val": "10.925"
                },
                "BudgetYearOneBase": {
                    "val": "10.925"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-4.495"
                },
                "BudgetYearOneBase": {
                    "val": "-4.495"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.495"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.495"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY14: Program is reduced by $4.495M due to reprogramming for higher Air Force priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "673318"
                    },
                    "ProjectTitle": {
                        "val": "Product Data Systems Modernization (PDSM)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.307"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.505"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.505"
                        },
                        "BudgetYearTwo": {
                            "val": "0.519"
                        },
                        "BudgetYearThree": {
                            "val": "0.539"
                        },
                        "BudgetYearFour": {
                            "val": "0.556"
                        },
                        "BudgetYearFive": {
                            "val": "0.567"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2013, project 673318, Product Data Systems Modernization (PDSM), efforts transferred from PE 0708611F, Support Systems Development (SSD), to PE 0708012F, Logistics Support Activities, project 673318, Product Data Systems Modernization (PDSM), to better align with fielded and operational activities supported by PE 0708012F, Logistics Support Activities.\n\nIn FY 2014, project 673318, Product Data Systems Modernization (PDSM), efforts were transferred from PE 0708012F, Logistics Support Activities, project 673318, Product Data Systems Modernization (PDSM), to PE 0708611F, Support Systems Development (SSD), to better align with RDT&E activities suppported by PE 0708611F, Support Systems Development (SSD)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Product Data System Modernization (PDSM), project 673318, is an effort to perform enhancements to the following Air Force Logistics legacy systems:\n \n1) The Air Force Technical Order functionality through the continued enhancement of the Enhanced Technical Information System (ETIMS) Enterprise.\n\n2) Implement the Aircraft Structural Integrity Management Information System (ASIMIS) Modernization that will include the Rehost of analysis output data in new database, replicate mainframe functionality in new environment (PC) and language, provide web-accessible data mining\/viewing, and expand CAC enabled access control & Helpdesk support.\n\n3) Conduct the Product Lifecycle Management (PLM) Conference Room Pilot (CRP) that will document interface requirements with the Maintenance, Repair, and Overhaul (MRO) and Enterprise Supply Chain Analysis, Planning and Execution (ESCAPE) efforts. It will facilitate an integrated approach with the ESCAPE and MRO CRPs by utilizing the Service Development and Delivery Process (SDDP). This effort is planned in two increments of 12 months each. Each increment of PLM CRP will test and validate integrated PLM, supply chain, and MRO data management requirements along with feedback loops required to maintain data currency and accuracy within PLM. \n\n4) Conduct the Enterprise Supply Chain Analysis, Planning and Execution (ESCAPE) program to further develop a commercial-off-the-shelf (COTS)-based Advanced Planning and Scheduling (APS) solution to modernize via technical refresh and integrate legacy planning capability within the United States Air Force.  This will be accomplished by modernizing and subsuming, where possible, existing supply chain planning information systems.\n\nActivities also include studies and analysis to support both current and future program planning and program execution to include Nuclear Weapons Related Material (NWRM) technical data requirements.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ETIMS"
                                    },
                                    "Description": {
                                        "val": "The Air Force Technical Order functionality implementation of Enhanced Technical Information System (ETIMS) Enterprise.  Activities also include  studies and analysis to support both current and future program planning and program execution to include Nuclear Weapons Related Material (NWRM) technical data requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.057"
                                            },
                                            "Text": {
                                                "val": "Continued ETIMS enhancements and incorporated technical data activities and technical integration.  Incorporated management and support of AF technical data activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.160"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.160"
                                            },
                                            "Text": {
                                                "val": "Continue development effort to integrate the Joint Computer-Aided Acquisition Logistics System (JCALS) functionality into ETIMS.  The AF will make further progress toward the complete Technical Order Management capability by satisfying, in one system, the six requirements met by JCALS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ASIMIS"
                                    },
                                    "Description": {
                                        "val": "Aircraft Structural Integrity Management Information System (ASIMIS) modernization that will include the re-host of analysis output data in new database, replicate mainframe functionality in new environment (PC) and language, provide web-accessible data mining\/viewing, and expand Common Access Card (CAC) enabled access control & Helpdesk support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.060"
                                            },
                                            "Text": {
                                                "val": "Initiated WEB Reports Database Development to provide a single entry point for all Individual Aircraft Tracking (IAT) and Loads\/Environment Spectrum Survey (L\/ESS) reports as well as data mining tools to query specific aircraft in the fleet and forecast \"what-if\" scenarios.  Also initiated Mainframe Data Dump.  Move archived data from a Defense Information Systems Agency (DISA) supported IBM mainframe to local PC Storage."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.120"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.120"
                                            },
                                            "Text": {
                                                "val": "Complete WEB Reports and the Mainframe Database.  Initiate the second increment of ASIMIS modernization acquisition focusing on moving five weapon systems off of the mainframe to stand-alone PCs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PLM CRP"
                                    },
                                    "Description": {
                                        "val": "Product Lifecycle Management Conference Room Pilot (PLM CRP) is a multiple-increment effort to document interface requirements for the Maintenance, Repair, and Overhaul (MRO) and Enterprise Supply Chain Analysis, Planning, and Execution (ESCAPE) efforts.  PLM CRP facilitates an integrated approach with the ESCAPE and MRO CRPs by utilizing the Service Development and Delivery Process (SDDP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.060"
                                            },
                                            "Text": {
                                                "val": "Initiated increment 1 of the PLM CRP to test and validate integrated PLM, supply chain, and MRO data management requirements along with feedback loops required to maintain data currency and accuracy within PLM.  PLM CRP results were developed and deployed into Product Lifecycle Management System (PLMS) maintenance releases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.120"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.120"
                                            },
                                            "Text": {
                                                "val": "Complete increment 2 of the PLM CRP.  Initiate increment 3 to support ESCAPE, MRO and DCC.  The PLM Pilot will test and evaluate requirements identified by the Engine and ICBM communities, and selected Master Data Management (MDM) workflows. PLM CRP results will be developed and deployed into Product Lifecycle Management System (PLMS) maintenance releases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ESCAPE"
                                    },
                                    "Description": {
                                        "val": "The Enterprise Supply Chain Analysis, Planning and Execution (ESCAPE) program will further develop a commercial-off-the-shelf (COTS)-based Advanced Planning and Scheduling (APS) solution to modernize via technical refresh and integrate legacy planning capability within the United States Air Force.  This will be accomplished by modernizing and subsuming, where possible, existing supply chain planning information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.030"
                                            },
                                            "Text": {
                                                "val": "Initiated ESCAPE planning and development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.105"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.105"
                                            },
                                            "Text": {
                                                "val": "Continue ESCAPE planning and development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management Administration (PMA)"
                                    },
                                    "Description": {
                                        "val": "Program Management Administration (PMA) funding supports engineering and technical development and implementation activities, along with acquisition support efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Continued PMA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE:  BA07:  0708012F"
                                    },
                                    "Title": {
                                        "val": "Logistics Support Activities"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.944"
                                        },
                                        "CurrentYear": {
                                            "val": "0.577"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy for the various PDSM efforts (ETIMS, ASIMIS, PLM CRP, ESCAPE) is to award on a firm-fixed price basis utilizing a competitive, best-value criteria as appropriate."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Manage and Support Technical Data Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NGIT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wright-Patterson AFB, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.258"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.258"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Data Integrator\/Developer Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wright-Patterson AFB, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.107"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.247"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.247"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration (PMA) System Program Office (SPO) Operations"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OASIS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wright-Patterson AFB, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708611F_BPAC_673318_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "ETIMS Concept Activities1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ETIMS Design\/Develop1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ETIMS Integration\/Test1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ETIMS Pre-Production1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ETIMS Production\/Fielding Review1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ETIMS Concept Activities2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ETIMS Design\/Develop2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ETIMS Integration\/Test2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ETIMS Pre-Production2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ETIMS Production\/Fielding Review2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ASIMIS Concept Activities"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ASIMIS Design\/Develop1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ASIMIS Design\/Develop2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ASIMIS Integration\/Test1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ASIMIS Integration\/Test2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ASIMIS Production\/Fielding Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Concept Activities"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Design\/Develop1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Design\/Develop2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Design\/Develop3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Integration\/Test1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Integration\/Test2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Integration\/Test3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Pre-Production1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Pre-Production2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Pre-Production3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Production\/Fielding Review1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Production\/Fielding Review2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PLM CRP Production\/Fielding Review3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ESCAPE Concept Activities"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ESCAPE Design\/Develop1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ESCAPE Design\/Develop2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675042"
                    },
                    "ProjectTitle": {
                        "val": "Log Application Logisitics Integration (LALI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.683"
                        },
                        "CurrentYear": {
                            "val": "15.873"
                        },
                        "BudgetYearOne": {
                            "val": "10.420"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.420"
                        },
                        "BudgetYearTwo": {
                            "val": "14.822"
                        },
                        "BudgetYearThree": {
                            "val": "13.165"
                        },
                        "BudgetYearFour": {
                            "val": "11.222"
                        },
                        "BudgetYearFive": {
                            "val": "11.424"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Project 675042, Logistics Installation Logistics Integration (LALI) supports a number of efforts.  Logistics, Installations and Mission Support - Enterprise View (LIMS-EV) funding provides Business Intelligence (BI) development efforts in support of the Air Force logistics transformation initiative.  As Air Force logistics transforms and streamlines its processes, new enterprise focused enablement is required. LIMS-EV develops and supports BI capabilities for transformation initiatives like Air Force Global Logistics Support Center, Aircraft Availability Program, Equipment and Vehicle Transformation Initiative, Global Ammunition Control Point and Repair Network Integration.  LIMS-EV capabilities provide integrated, one-version-of-truth information from multiple source systems to decision makers from strategic to tactical level.  LIMS-EV funding will allow development efforts to enable other transformation initiatives, extend current BI capabilities to provide configurable alerting, predictive analysis, what-if analysis and further integration of support equipment, vehicle, munitions, supply, commodities and components (engines, landing gears, etc) to increase weapons systems availability.\n\nMaintains the flexibility to conduct Business Process Re-Engineering (BPRE) by use of the Service Development and Delivery Plan (SDDP).  BPRE and SDDP activties, along with data discovery and migration support of legacy logistics systems, have been limited due to ongoing reevaluation and cancellation of ECSS.\n\nAs a result of the delay in migrating a number of legacy logistics systems to ECSS, the current state of Air Force Legacy Information Technology logistics systems is under evaluation.  Legacy Modernization and Legacy Remediation activities include efforts to bring systems originally planned to be subsummed by ECSS up to Financial Improvement and Audit Readiness (FIAR) compliance.\n\nWill continue Air Force development of a F-35 Autonomic Logistics Information System (ALIS) - User IT Data Exchange Service (UIDES) that will facilitate Information Exchange Requirement (IER) data transfer capability from the F-35 ALIS into data reports and configurable tables in order to receive, store and integrate F-35 operations, maintenance, training and financial data within existing Air Force enterprise views and capabilities to support the growing fleet of AF F-35 Air Vehicles.  Further, this funding will facilitate depot configuration and integration efforts along with data exchange configuration changes in order to facilitate receiving and consuming additional amounts as well as increasing types of ALIS IER data.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "LIMS-EV"
                                    },
                                    "Description": {
                                        "val": "Logistics, Installations and Mission Support - Enterprise View (LIMS-EV) funding provides business intelligence (BI) development efforts in support of the Air Force logistics transformation initiative for the 21st century, eLog21.  As Air Force logistics transforms and streamlines its processes, new enterprise focused enablement is required.  LIMS-EV develops and supports business intelligence capabilities for transformation initiatives like Air Force Global Logistics Support Center, Aircraft Availability Program, Equipment and Vehicle Transformation Initiative, Global Ammunition Control Point and Repair Network Integration (RNI).  LIMS-EV capabilities provide integrated one-version-of-truth information from multiple source systems to decision makers from strategic to tactical level.  LIMS-EV funding will allow development efforts to enable other eLog21 initiatives, extend current BI capabilities to provide configurable alerting, predictive analysis, what-if analysis and further integration of support equipment, vehicle, munitions, supply, commodities and components (engines, landing gears, etc) to increase weapons systems availability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.683"
                                            },
                                            "Text": {
                                                "val": "LIMS-EV developed\/deployed enterprise Business Intelligence (BI) capabilities for the following:  Repair Network View (spiral 1) provides an enterprise capability and capacity (CAP2) reporting and analysis tool and the ability to manage the standardized capability and capacity information provided by the propulsion repair nodes to determine the network(s) and node(s) ability to fulfill anticipated funded requirements with existing infrastructure and manpower; Engine View (spiral 1) provides analysis tool for senior leaders down to unit level users by delivering near real time and historical War Reserve Engine, Base Stock Level and other critical metrics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.373"
                                            },
                                            "Text": {
                                                "val": "Continued LIMS-EV planning, design, and development activities to develop additional Business Intelligence (BI) capabilities such as:  Repair Network View (spiral 2) to include Precision Measurement Equipment Laboratory and additional repair networks on landing gear, avionics and others; Engine View (spiral 2) to provide additional metrics and analysis in areas such as: maintainability, removal rates, production, and Time Compliance Technical Order (TCTO).  Optimize Weapon System View and include Remote Piloted Aircraft control systems to Weapons System View; Provide Logistics Readiness Squadron Dashboard to enable squadron commanders' enterprise view of approved metrics; Perform Metadata Repository Automate (MRA) updates as appropriate.  Plan to achieve BI capability IOC for Configuration Alerts fourth quarter (4 Qtr) 2013."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.670"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.670"
                                            },
                                            "Text": {
                                                "val": "Continue LIMS-EV activities to develop BI capabilities such as:  Repair Network View (spiral 3) to include additional repair networks on landing gear, avionics and others; enhance Equipment View to provide additional metrics and analysis in areas such as: support equipment availability, maintainability, retention, and mal-positioned assets; Provide Depot Maintenance View to improve overall depot maintenance enterprise; Perform Metadata Repository Automate (MRA) updates as appropriate."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Legacy Modernization"
                                    },
                                    "Description": {
                                        "val": "Continue Legacy Modernization design and development activities.  Enhanced Integrated Maintenance Data System (IMDS) for Combat Ammunition System (CAS) to modify the inventory program, Deployment Readiness Service (DRS) spiral developments, IMDS-Training Business Area (TBA) upgrade to training modules, IMDS-Electronic Maintenance Operations Center (EMOC) munitions, Integration interfaces, Integrated Logistics Systems-Supply (ILS-S) Phase I software upgrade, Weapons System Management Information System (WSMIS), Enhanced Technical Information Management System (ETIMS), and Reliability and Maintainability Information System (REMIS) modernization efforts.  Associated Logistics Data Interface Transition (LDIT) planning activities and Portfolio Management Process (PMP) and Logistics Information Requirements (LIR) updates."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.391"
                                            },
                                            "Text": {
                                                "val": "Continued Legacy Modernization design and development efforts to modernize Integrated Maintenance Data System (IMDS)-Combat Ammunition System (CAS), IMDS-Training Business Area (TBA), IMDS-Electronic Maintenance Operations Center (EMOC), Deployment Readiness Service (DRS).  Continued Logistics Data Interface Transition (LDIT) planning activities and Portfolio Management Process (PMP) and Logistics Information Requirements (LIR) updates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continued Legacy Modernization design and development activities.  Enhanced Integrated Maintenance Data System (IMDS) for Combat Ammunition System (CAS) to modify the inventory program, Deployment Readiness Service (DRS) spiral developments, IMDS-Training Business Area (TBA) upgrade to training modules, IMDS-Electronic Maintenance Operations Center (EMOC) munitions, Integration interfaces, Integrated Logistics Systems-Supply (ILS-S) Phase I software upgrade, Weapons System Management Information System (WSMIS), Enhanced Technical Information Management System (ETIMS), and Reliability and Maintainability Information System (REMIS) modernization efforts.  Associated Logistics Data Interface Transition (LDIT) planning activities and Portfolio Management Process (PMP) and Logistics Information Requirements (LIR) updates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continue Legacy Modernization design and development efforts to modernize Integrated Maintenance Data System (IMDS)-Combat Ammunition System (CAS), IMDS-Training Business Area (TBA), IMDS-Electronic Maintenance Operations Center (EMOC), Deployment Readiness Service (DRS).  Continued Logistics Data Interface Transition (LDIT) planning activities and Portfolio Management Process (PMP) and Logistics Information Requirements (LIR) updates."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Legacy Remediation\/FIAR"
                                    },
                                    "Description": {
                                        "val": "The Legacy Remediation\/FIAR (Financial Improvement Audit Readiness) effort seeks to design and develop solutions to remediate legacy processes, data, and systems to insure funds reported in the financial statements are accurate and complete and that IT controls are in place that follow accounting, security, and other Financial Improvement and Audit Readiness (FIAR) compliance mandates."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.109"
                                            },
                                            "Text": {
                                                "val": "Continued Legacy Remediation\/FIAR design and development efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.250"
                                            },
                                            "Text": {
                                                "val": "Continued Legacy Remediation\/FIAR design and development remediation activities for legacy processes, data, and systems to insure funds reported in the financial statements are accurate and complete and that IT controls are in place that follow accounting, security, and other Financial Improvement and Audit Readiness (FIAR) compliance mandates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Continue Legacy Remediation\/FIAR design and development efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-35 ALIS-UIDES Integration"
                                    },
                                    "Description": {
                                        "val": "The F-35 Autonomic Logistics Information System (ALIS) - User IT Data Exchange Service (UIDES) Data integration design and development effort will develop a UIDES that will facilitate Information Exchange Requirement (IER) data transfer capability from the F-35 ALIS into data reports and configurable tables in order to receive, store and integrate F-35 operations, maintenance, training and financial data within existing Air Force enterprise views and capabilities to support the growing fleet of AF F-35 Air Vehicles.  Further, this funding will facilitate depot configuration and integration efforts along with data exchange configuration changes in order to facilitate receiving and consuming of additional amounts of ALIS IER data as well as increasing types"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Initiated F-35 ALIS design and development efforts.  Completed configuration testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Text": {
                                                "val": "Continued Air Force development of a User IT Data Exchange Service (UIDES) that will facilitate Information Exchange Requirement (IER) data transfer capability from the F-35 Autonomic Logistics Information System (ALIS) into data reports and configurable tables in order to receive, store and integrate F-35 operations, maintenance, training and financial data within existing Air Force capabilities to support the growing fleet of AF F-35 Air Vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "Continue Air Force development of a User IT Data Exchange Service (UIDES) that will facilitate Information Exchange Requirement (IER) data transfer capability from the F-35 Autonomic Logistics Information System (ALIS) into data reports and configurable tables in order to receive, store and integrate F-35 operations, maintenance, training and financial data within existing Air Force capabilities to support the growing fleet of AF F-35 Air Vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CE IT Transformation"
                                    },
                                    "Description": {
                                        "val": "The Civil Engineer's (CE) Information Technology (IT) Transformation effort will"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Completed CE IT Transformation effort.  Achieved Initial Operational Capability (IOC) 4Q FY 2012."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management Administration (PMA)"
                                    },
                                    "Description": {
                                        "val": "Program Management Administration (PMA) funding supports engineering and technical development and implementation activities, along with acquisition support efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continued PMA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Continued PMA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Continue PMA."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Not Applicable"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "LALI projects will be competively acquired using a variety of fixed price, labor hour, time and material, and cost plus contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LALI LIMS-EV Systems Engineering Contractor Support (Product Development)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "WPAFB, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.806"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.269"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.395"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.395"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "LALI LIMS-EV Project Development Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DSD\/Deloitte"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.735"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.824"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.925"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.925"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Legacy Modernization"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Montgomery, AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.391"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Legacy Remediation\/FIAR"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Montgomery, AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.109"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ALIS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "WPAFB, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.780"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LALI Systems Ingineering Base Support & Test Development Range"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DSD\/Deloitte"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.242"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration (PMA) LALI Program Management Office (PMO) Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DSD\/Deloitte"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration (PMA) LALI PMO Tasks (Support Integration and Development)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DSD Deloitte"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708611F_BPAC_675042_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Logistics Installations and Mission Support Enterprise View (LIMS-EV) Planning"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LIMS-EV Design\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LIMS-EV BI Capabilities (Depot Maintenance) IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LIMS-EV Business Intelligence (BI) Maturation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Legacy Modernization Design\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Legacy Remediation\/FIAR Design\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Legacy Remediation\/FIAR - Full Audit Ready"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-35 ALIS Planning"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-35 ALIS Design\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-35 ALIS IOC Enterprise Data Visibility"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675044"
                    },
                    "ProjectTitle": {
                        "val": "Logistics Systems Development (LSD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Project 675044, Logistics Systems Development (LSD), is a budgetary accounting location for LSD projects having Congressional interest.\n\nIn FY 2012, completed Engine Health Management Plus Data Repository Center (EHMPDRC).  Congress continued to have interest in Alternative Energy Research (AER) and provided $40.000M for AER in 2012. \n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Alternative Energy Research, 2012"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "40.000"
                                        },
                                        "Text": {
                                            "val": "Continued Alternative Energy Research project."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Continued Alternative Energy Research project."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Not Applicable"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Project 675044, Logistics Systems Development (LSD), is a budgetary accounting location for LSD projects having Congressional interest.\n\nThe preferred acquisition strategy is to use a competitive, best value contracting strategy."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Alternative Energy Research, 2012"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "40.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708611F_BPAC_675044_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Engine Health Management Plus Data Repository Center (EHMPDRC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LSD Congressional Add - Alternative Energy Research (AER), 2011"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LSD Congressional Add - Alternative Energy Research (AER), 2012"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}