{
    "id": "7571166b05491400f1639d816656cdee830a4bc5",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603122D8Z"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism Technology Support"
        },
        "R1LineItemNumber": {
            "val": "30"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "74.563"
            },
            "CurrentYear": {
                "val": "77.144"
            },
            "BudgetYearOne": {
                "val": "77.792"
            },
            "BudgetYearOneBase": {
                "val": "77.792"
            },
            "BudgetYearTwo": {
                "val": "79.323"
            },
            "BudgetYearThree": {
                "val": "81.924"
            },
            "BudgetYearFour": {
                "val": "83.264"
            },
            "BudgetYearFive": {
                "val": "84.879"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Combating Terrorism Technical Support (CTTS) program developed and delivered capabilities that addressed needs and requirements with direct operational application in the national effort to combat terrorism.  Projects are distributed among 9 mission categories: Advanced Analytics and Capabilities, Chemical, Biological, Radiological, Nuclear, and Explosives; Improvised Device Defeat; Investigative Support and Forensics; Personnel Protection, Physical Security; Surveillance, Collection, and Operations Support; Tactical Operations Support; and Training Technology Development.  This program is a diverse, advanced technology development effort that capitalizes on interagency and international participation to demonstrate the utility or effectiveness of technology when applied to combating terrorism requirements.  It includes technology capability development, proof-of-principle demonstrations in field applications, and coordination to transition from development to operational use.  CTTS manages approximately 450 individual projects in support of Defense, federal, state, local, and international customers and partners.\n\nFor the Department of Defense, CTTS focused on requirements that support military forces in demanding or hostile environments in Afghanistan, Yemen, Africa, the Philippines, and Colombia; by rapidly developing and delivering leading edge products such as tactical sensors and unmanned vehicles, personal and physical protection, user friendly apps for analytical tools and reference guides, and weapons, sights, and ammo modifications.  Several of the highly successful products include Legacy human source information programs in Afghanistan and Mexico, the Lighthouse and PALANTIR information collection and analysis systems, the Enhanced Mortar Targeting System (EMTAS), and Insider Threat Situation Awareness Training. \n\nFor U.S. federal, state and local law enforcement and first responders, CTTS improved personal protection equipment for chemical, biological, radiological, nuclear, and high explosive protection; as well as developed apps for interactive reference data to assist in identifying and neutralizing threat agents in the field and in laboratories.  CTTS also hosted interagency and foreign partner information exchange seminars and capability exercises to share and enhance response techniques and procedures for first responders.  \n\nFY14 plans for CTTS will continue to address combating terrorism requirements from Defense, federal, state, local, and international customers and partners at home and abroad.  As U.S. forces are withdrawn from Afghanistan, CTTS will continue to address force protection needs for the remaining forces, as well as develop releasable technology solutions that may assist Afghan security forces.  Additionally, CTTS will address technology requirements requested from USSOCOM’s field components as they begin to increase their regional operations tempo in other parts of the world. Special emphasis will be for the Theater SOF in Africa and to support Theater SOF in the Pacific in support of the National Strategy to shift focus towards the Pacific.  Another areas of increased emphasis will be in the protection of U.S. personnel, to include State Department personnel in locations overseas that need increased security.  CTTS will also address technology and advanced analytical analysis requirements that will enhance Customs and Border Patrol along the U.S. Southwest Border; and will partner with Homeland Security as they identify requirements that will proactively address improvised explosive devices in a domestic environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "74.586"
                },
                "CurrentYear": {
                    "val": "77.144"
                },
                "BudgetYearOne": {
                    "val": "78.291"
                },
                "BudgetYearOneBase": {
                    "val": "78.291"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "74.563"
                },
                "CurrentYear": {
                    "val": "77.144"
                },
                "BudgetYearOne": {
                    "val": "77.792"
                },
                "BudgetYearOneBase": {
                    "val": "77.792"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.023"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.499"
                },
                "BudgetYearOneBase": {
                    "val": "-0.499"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.023"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.499"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.499"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2014 baseline budget was reduced due to fiscal constraints and higher priorities within the Department."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "484"
                    },
                    "ProjectTitle": {
                        "val": "Combating Terrorism Technology Support (CTTS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "74.563"
                        },
                        "CurrentYear": {
                            "val": "77.144"
                        },
                        "BudgetYearOne": {
                            "val": "77.792"
                        },
                        "BudgetYearOneBase": {
                            "val": "77.792"
                        },
                        "BudgetYearTwo": {
                            "val": "79.323"
                        },
                        "BudgetYearThree": {
                            "val": "81.924"
                        },
                        "BudgetYearFour": {
                            "val": "83.264"
                        },
                        "BudgetYearFive": {
                            "val": "84.879"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Combating Terrorism Technical Support (CTTS) program developed and delivered capabilities that addressed needs and requirements with direct operational application in the national effort to combat terrorism.  Projects are distributed among 9 mission categories: Advanced Analytics and Capabilities, Chemical, Biological, Radiological, Nuclear, and Explosives; Improvised Device Defeat; Investigative Support and Forensics; Personnel Protection, Physical Security; Surveillance, Collection, and Operations Support; Tactical Operations Support; and Training Technology Development.  This program is a diverse, advanced technology development effort that capitalizes on interagency and international participation to demonstrate the utility or effectiveness of technology when applied to combating terrorism requirements.  It includes technology capability development, proof-of-principle demonstrations in field applications, and coordination to transition from development to operational use.  CTTS manages approximately 450 individual projects in support of Defense, federal, state, local, and international customers and partners.\n\nFor the Department of Defense, CTTS focused on requirements that support military forces in demanding or hostile environments in Afghanistan, Yemen, Africa, the Philippines, and Colombia; by rapidly developing and delivering leading edge products such as tactical sensors and unmanned vehicles, personal and physical protection, user friendly apps for analytical tools and reference guides, and weapons, sights, and ammo modifications.  Several of the highly successful products include Legacy human source information programs in Afghanistan and Mexico, the Lighthouse and PALANTIR information collection and analysis systems, the Enhanced Mortar Targeting System (EMTAS), and Insider Threat Situation Awareness Training. \n\nFor U.S. federal, state and local law enforcement and first responders, CTTS improved personal protection equipment for chemical, biological, radiological, nuclear, and high explosive protection; as well as developed apps for interactive reference data to assist in identifying and neutralizing threat agents in the field and in laboratories.  CTTS also hosted interagency and foreign partner information exchange seminars and capability exercises to share and enhance response techniques and procedures for first responders.  \n\nFY14 plans for CTTS will continue to address combating terrorism requirements from Defense, federal, state, local, and international customers and partners at home and abroad.  As U.S. forces are withdrawn from Afghanistan, CTTS will continue to address force protection needs for the remaining forces, as well as develop releasable technology solutions that may assist Afghan security forces.  Additionally, CTTS will address technology requirements requested from USSOCOM’s field components as they begin to increase their regional operations tempo in other parts of the world. Special emphasis will be for the Theater SOF in Africa and to support Theater SOF in the Pacific in support of the National Strategy to shift focus towards the Pacific.  Another areas of increased emphasis will be in the protection of U.S. personnel, to include State Department personnel in locations overseas that need increased security.  CTTS will also address technology and advanced analytical analysis requirements that will enhance Customs and Border Patrol along the U.S. Southwest Border; and will partner with Homeland Security as they identify requirements that will proactively address improvised explosive devices in a domestic environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Analytic Capabilities (AAC)"
                                    },
                                    "Description": {
                                        "val": "The AAC's Subgroup objective is to become an integral part in the development and deployment of integrated analytic capabilities that enable Warfighters to make better decisions. AAC is developing tools that will assist with interagency requirements to improve sense-making, decision-making, and data management for counterterrorism, counterinsurgency, stabilization\/re-construction missions and cyber-defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.660"
                                            },
                                            "Text": {
                                                "val": "Delivered the results of an independent capability assessment of an operational integrated fusion and analysis platform that enables analysts and operators to store, organize, access, retrieve and analyze massive amounts of intelligence information from disparate data sets.  Integrated a knowledge discovery tool with geospatial data extraction and viewing capabilities into operational platforms to support intelligence analysis and operational decision making.  Continued ongoing spiral development of integrated analytic platforms to enhance analysis of diverse and disparate data sources to support near real-time decision making for specific operational applications.  Independently tested and verified the advanced secure industrial control system.  Developed an advanced audit tool to determine over network or serial communications the security configuration settings on field devices in industrial control systems.  Initiated the development of a multi-intelligence data fusion and analysis capability for automated behavior and activity identification and exploitation.  Initiated the development of a proof of concept for data and network analysis workbench for rapid analysis and understanding of collections of intelligence reports and real-time generation of alarms and warnings for suspicious activity based on incoming streams of surveillance and intelligence data.  Initiated the development on multi-model analysis using Model Predictive Controllers to make better decisions and establish measures of effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.196"
                                            },
                                            "Text": {
                                                "val": "Develop an enhanced integrated analytic platform that enables analysis of diverse and disparate data sources to support near real-time decision making, support new operational applications, and geographic locations.  Develop and deliver an advanced audit tool to determine over the network or serial communications for the security configuration settings on field devices in industrial control systems.  Develop and deliver an initial version of prototype software that enables fusion of imagery and text-based data for patterns of life analysis.  Independently test and verify a proof of concept data and network analysis workbench for rapid analysis and understanding of collections of intelligence reports and real-time generation of alarms and warnings for suspicious activity based on incoming streams of surveillance and intelligence data.  Continue development for multi-model analyses using Model Predictive Controllers that provide better decisions and establish measures of effectiveness. Initiate the development of an enhanced Critical Thinking Tool that will support the application of evidence-based reasoning to intelligence questions and capture analytic problem-solving approaches.  Initiate development of a program that will provide the commander\/executive decision maker with information in both real-world and exercise scenarios within the joint, interagency, intergovernmental, and multinational organizations (JIIM) environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Text": {
                                                "val": "Complete the development and transition of an integrated analytic platform that enables analysis of diverse and disparate data sources to support near real-time decision making to support new operational applications and geographic locations to major commands.  Continue development and deliver an independently tested and verified proof of concept data and network analysis workbench for rapid analysis and understanding of collections of intelligence reports and real-time generation of alarms and warnings for suspicious activity based on incoming streams of surveillance and intelligence data.  Deliver a multi-model analyses tool using Model Predictive Controllers to make better decisions and establish measures of effectiveness.  Deliver a refined Critical Thinking Tool that will support the application of evidence-based reasoning to intelligence questions and capture analytic problem-solving approaches.  Continue development on a program that will inform commander\/executive decision making in both real-world and exercise scenarios within the joint, interagency, intergovernmental, and multinational organizations (JIIM) environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CHEMICAL, BIOLOGICAL, RADIOLOGICAL, NUCLEAR, AND EXPLOSIVES (CBRNE)"
                                    },
                                    "Description": {
                                        "val": "The CBRNE subgroup’s objective is to improve defense capabilities to meet tomorrow’s CBRNE threats. To meet this objective, the subgroup focuses on rapid research, development, test and evaluation on threat characterization; materials attribution; personal protective equipment; detection of CBRNE materials at trace and bulk levels at point, proximity and stand-off distances; development of information resources and decision support tools to assist response elements with risk-based decision making; and consequence management for post-event activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.651"
                                            },
                                            "Text": {
                                                "val": "Developed a flexible powered air purifying respirator system for CBRN environments.  Developed a protective mask for CBRN environments.  Developed enhanced testing procedures that are used to evaluate protective ensembles.  Performed heat stress studies on new CBRN protective ensembles.  Tested, evaluated, and certified inconspicuous protective garments against evolving threats.  Developed and tested protective ensembles that will provide enhanced CBRN protection in tactical environments.  Continued developing noise cancelling technology that enhances communication for a person wearing a self contained breathing apparatus in a CBRN environment.  Continued development and evaluation of a water desalination filter for military field survival situations.  Developed and evaluated tools for the decontamination of infrastructure, personnel, and equipment. Tested and evaluated new materials for field decontamination methods with reduced logistical burden.  Continued development of an orthogonal system for the detection and identification of trace levels of toxic industrial chemicals.  Continued evaluation of a person portable mass spectrometer with gas chromatograph inlet for the rapid detection and identification of target chemicals.  Developed methods for determining the origin of CBRN materials.  Evaluated potential methods of production of threat materials and identified key indicators and warnings for response personnel.  Developed an enhanced cosmic ray attenuation capability for the detection of special nuclear materials. Continued development with the incorporation of unique explosive spectra into a prototype detection system. Fabricated a prototype orthogonal sensor standoff system. Continued development of systems for sub-millimeter wave imaging of personnel for explosive detection. Continued the fabrication and assessment of prototype expeditionary wet chemical kits for explosives precursor detection.  Developed and fielded an explosives detection technologies evaluation guide."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.556"
                                            },
                                            "Text": {
                                                "val": "Evaluate a flexible powered air purifying respirator system for CBRN environments.  Evaluate and test a protective mask for CBRN environments.  Continue testing protective ensembles that provide enhanced CBRN protection in tactical environments.  Complete evaluation of noise cancelling technology that enhances communication for a person wearing a self contained breathing apparatus in a CBRN environment.  Develop and test an enhanced water filter for military field survival situations.  Develop next generation CB glove.  Develop enhanced testing procedures for the evaluation of protective ensembles. Evaluate tools for the decontamination of infrastructure, personnel, and equipment. Evaluate and test an orthogonal system for the detection and identification of trace levels of toxic industrial chemicals.  Evaluate and test a person portable mass spectrometer with gas chromatograph inlet for the rapid detection and identification of target chemicals.  Develop gas chromatograph mass spectrometer quality control field methods.  Continue development of methods for determining the origin of CBRN materials.  Evaluate potential methods of production of threat materials, and identify key indicators and warnings for response personnel.  Develop methods for the evaluation of CBRN contaminated evidence.  Develop decision support tools to provide science-based risk analysis for emergency personnel in the selection of appropriate protective equipment, decontamination techniques, evacuation zones and other data-driven decisions.  Develop a miniature hand-portable mass spectrometer for the detection of chemical and explosive threats. Evaluate cosmic ray attenuation capability for the detection of special nuclear materials. Develop explosives detection technology for monitoring cargo containers. Develop training packages for deployed personnel that use explosive detection equipment.  Continue testing a prototype of an orthogonal sensor standoff system.  Fabricate and test sub-millimeter wave imaging of personnel for explosive detection. Continue assessment of prototype expeditionary wet chemical kits for homemade explosives detection. Develop a portable system to quickly screen personnel for explosive threats at temporary venues. Develop an optimized sampling media for the collection of bulk explosive materials.  Develop colorimetric fabrics for the detection of bulk explosive materials. Develop a system capable of identifying materials through containers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.600"
                                            },
                                            "Text": {
                                                "val": "Develop advanced analytical tools for the analysis of chemical and biological agent production methods. Evaluate next generation systems for respiratory protection.  Develop decision support tools for providing medical information and advice in hostile environments.  Evaluate enhanced testing procedures for the evaluation of protective ensembles. Develop tools for the identification of protective equipment failures.  Continue development of gas chromatograph mass spectrometer quality control field methods. Continue development of a portable system to quickly screen personnel for explosive threats at temporary venues. Evaluate an optimized sampling media for the collection of bulk explosive materials. Test and evaluate colorimetric fabrics for the detection of bulk explosive materials. Continue development and test a system capable of identifying materials through containers. Develop next generation sensors for use in trace, bulk, proximity and stand-off detection of explosives-based threats.  Develop tools to assist in disaster victim identification.  Develop tools for identification of and protection from CBR hazards in the postmortem environment. Develop a portable glove box suitable for working with CBRN materials in field operations. Develop enhanced sampling materials and systems for CBRNE threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IMPROVISED DEVICE DEFEAT (IDD)"
                                    },
                                    "Description": {
                                        "val": "The IDD Subgroup’s objective is to provide rapid prototyping, capability development and delivery of advanced technologies, tools, and information to improve the operational capabilities of federal, state, and local bomb squads and the U.S. military Explosive Ordnance Disposal (EOD) community to defeat and neutralize the full spectrum of terrorist explosive devices. In collaboration with military, federal, state, and local agencies, the IDD Subgroup identifies and prioritizes multi-agency user requirements through joint working groups and then actively works with vendors and end users to deliver an advanced prototype systems that provide more efficiency and a greater degree of safety for bomb Technicians to investigate, access, evaluate and if needed renders safe or dispose of suspect devices whether emplaced, person borne, vehicle borne or water borne."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.252"
                                            },
                                            "Text": {
                                                "val": "In accordance with the HSPD 19 - Combating Terrorist Use of Explosives in the United States and the National Strategic Plan for Bomb Squads, the IDD subgroup Delivered and evaluated the Body Bomb Tool Kit to robotically counter person borne IED’s. Updated and delivered version two of the IED Tool Characterization Guide allowing for a decision support tool for Bomb squads. Delivered, operationally tested and commercialized the VBIED Tool Kit to aid in the access and defeat of VBIED’s. Developed a Bomb Technician Wikipedia for sharing of bomb technician and EOD related information. Developed a video enhancement module for robot cameras allowing a clearer picture in low lighted areas.  Completed development and commercialized the Scalable Improvised Device Disruptor to counter VBIED. Developed an IED Instant Notification System Application to provide real time incident notification that will ‘Spread the word” between FBI, ATF and Civil and military bomb technicians on device makeup.  Characterized common disruptors against homemade explosives (HME). Developed robotically employed forensic collection tools for explosives and other hazardous materials. Develop a VBIED Threat Assessment System to assist in locating unknown hazards in vehicles.  Developed improved end effectors for remote controlled vehicles. Delivered an Advanced Diver Display System prototype. Delivered a diver mask-mounted display systems for underwater MCM operations.\nDelivered and commercialized a VBIED Precision X-ray Targeting Tool Kit to aid in three dimensional imaging and precise targeting of internal IED components used in render safe techniques.  Delivered, evaluated, and commercialized the camera blinding system for Special Operations.  Delivered and evaluated affordable robust mid-sized unmanned ground vehicles (UGV) for defense and homeland security applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.967"
                                            },
                                            "Text": {
                                                "val": "To assist in supporting HSPD 19 - Combating Terrorist Use of Explosives in the United States and the National Strategic Plan for Bomb Squads, the IDD subgroup will finalize drawings and commercialize the robotically employed Body Bomb Tool Kit to assist in rendering person born IED’s safe.  Deliver and evaluate the Bomb Technician Wikipedia to for sharing of Bomb Technician and EOD related information. Evaluate the video enhancement module for robot cameras. Characterize the Scalable Improvised Device Disruptor to counter VBIED. Develop a submersible remotely operated vehicle to counter water borne IEDs.  Develop, deliver and evaluate a VBIED threat assessment system. Test and evaluate the forensic collection tools to gather possible DNA and fingerprints on suspect devices before other dynamic procedures are utilized destroying evidence and intelligence on IED’s. Miniaturize the IED Diagnostic and Defeat Kit for dismounted operations in Afghanistan and along the southwest border. Develop a remote wire cutting tool that will increase safe separation from command or detonator wires being cut.  Develop a remote window breaking tool to ensure breakage of improved safety glass to access VBIED."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "To support HSPD 19 - Combating Terrorist Use of Explosives in the United States and the National Strategic Plan for Bomb Squads, Implement online application of the Bomb Technician Wikipedia for sharing of Bomb Technician and EOD related information. Deliver and evaluate a submersible remotely operated vehicle to counter water borne IEDs.  Evaluate a robotically deployed three dimensional scanner to image large vehicle cargo areas.  Evaluate a low cost disposable remote firing device for special operations use. Commercialize a VBIED threat assessment system. Commercialize the forensic collection tools for explosives and other hazardous materials. Deliver and evaluate the Mini IED Diagnostic and Defeat Kit for dismounted operations such as in Afghanistan and along the southwest border. Deliver and evaluate a remote wire cutting tool that will increase safe separation from command or detonator wires being cut.  Evaluate a remote window breaking tool to ensure breakage of improved safety glass to access VBIED. Develop Robotic End Effectors for the Bob Cat to access and counter large VBIED."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INVESTIGATIVE SUPPORT AND FORENSICS (ISF)"
                                    },
                                    "Description": {
                                        "val": "The ISF subgroup’s objective is to advance combating terrorism capabilities in investigative and forensic science.  ISF supports joint, interagency, and other partners who apply investigative and forensic science methods, means, or practices for forensic intelligence or investigations. To meet this objective, the subgroup focuses on rapid research, development, test and evaluation of new and advanced technology, equipment, forensic techniques, and tools, as well as development of information resources and decision support tools for risk-based decision making and rapid exploitation of evidence.  Projects emphasize rapid and field DNA analysis, identification of insider threat within agencies, pre and post-blast forensic examination, electronic evidence data acquisition, sensitive site exploitation, forensic intelligence, and criminalistics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.575"
                                            },
                                            "Text": {
                                                "val": "Established an online forensic digital video player examination site that is accessible and usable by all law enforcement agencies.  Developed advanced techniques for more accurate and efficient credibility assessments of subjects through thermal imaging of the face.  Completed and disseminated the results of a comprehensive evaluation on the accuracy and functionality of automated facial expression recognition for credibility assessment.  Distributed to all US law enforcement agencies an updated, advanced version of a system for witness identification of the makes and models of automobiles involved in terrorist incidents.  Established and fielded a new forensic procedure for the detection and verification of altered and tampered terrorist related digital audio records.  Completed the development and fielding of a combating terrorism geographic area economic data source tool.  Developed and distributed a more accurate and quicker system for credibility assessment through facial expression recognition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.229"
                                            },
                                            "Text": {
                                                "val": "Complete development and field an automated digital communication analysis system that determines persons who are potential insider threats.  Develop and distribute an advanced procedure to separate complex DNA mixtures and provide individual identification of each source.  Develop and field a new technology to locate, extract, and forensically analyze latent visual images from printer ribbons.  Complete development of an automated system to extract and categorize data stored on memory components of damaged electronic equipment.  Develop and field a comprehensive method and database to identify and link the origin of materials from homemade explosives.  Complete the development of a catalyst based technique for visualizing latent fingerprints.  Test and evaluate commercially available rapid DNA systems for adaption to combating terrorism operations.  Develop a portable USB-powered instrument with low cost microchips to detect explosive materials and residues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.250"
                                            },
                                            "Text": {
                                                "val": "Complete and validate a forensic technique to visualize latent fingerprints and concurrently recover explosive residues from them.  Develop and field a portable three-dimensional identification system for fired cartridge casings.  Establish a forensic counterfeit identity and travel document examination system and link-analysis database.  Develop a systematic procedure for comprehensive forensic analysis and comparison of ink on questioned documents.  Complete and field a stand-off portable scanner that detects disturbed ground for locating human remains, forensic evidence, and IEDs.  Develop a field-deployable prototype system for the automated processing of human DNA profiles using analysis of short tandem repeat loci.  Develop advanced methods for the analysis of digital communications, visual, verbal, and behavioral cues for the determination of insider threats.  Develop advanced interviewing and interrogation methods for human intelligence collection in both law enforcement and tactical intelligence environments.  Develop advanced and improved methods for linguistic analysis for credibility assessment and determination of intent.  Develop a micro-fluidic portable analytical device based on paper that rapidly detects a wide range of organic explosives.  Develop and validate a non-traditional latent fingerprint detection method based on novel antibodies and nano-technology approaches."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PERSONNEL PROTECTION"
                                    },
                                    "Description": {
                                        "val": "The Personnel Protection Subgroup’s objective is to develop new equipment, reference tools, and standards to improve the protection of personnel. Projects focus on putting innovative tools such as automated information management systems, communication devices, tagging, tracking and locating devices, mobile surveillance systems, as well as personal and vehicle protection equipment in the hands of personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.457"
                                            },
                                            "Text": {
                                                "val": "Validated the performance of multi-threat concealable body armor and delivered systems for operational evaluation.  Deployed the protective services portal training system at federal law enforcement training centers and deployed the standalone protective services portal. Delivered the canine armor system for operational evaluation with local law enforcement.  Developed and delivered a prototype emergency egress system for use in armored vehicles.  Delivered a new test rig for the evaluation of behind armor blunt trauma for body armor systems. Tested a novel biofidelic headform for the blast environment to use as a tool to evaluate head protection systems.  Delivered inconspicuous vehicle armor kits for operational use.  Developed guidelines for tuning anthropomorphic test devices for the blast environment.  Developed and delivered a mass alert capability that is an application that runs on a smart phone and provides bidirectional communication and situational awareness. Tested and validated the emergency response capabilities of alternative fuel vehicles. Developed systems to enhance situational awareness, intelligence collection capabilities, and personnel recovery efforts. Evaluated the performance of aged body armor systems to develop guidelines for use and lifetime of body armor systems.  Optimized and ruggedized a micro unmanned aerial system for situational awareness enhancement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.004"
                                            },
                                            "Text": {
                                                "val": "Deploy systems to enhance situational awareness, intelligence collection capabilities, and personnel recovery efforts. Develop a multifunctional earpiece that provides in ear hearing protection as well the ability to collect pressure and acceleration data during blast or blunt impact events. Deliver an analysis on the performance of alternative fuel vehicles and their ability to perform emergency operations and recommendations on the use for law enforcement.  Design a personal cooling system that can be integrated for use with the current improved outer tactical vest.  Develop a whole body deformation tool and analysis for the development of protective solutions for vehicles, ships, and buildings.  Design and deliver a novel vehicle armor solution to be deployed on alternative fuel vehicles.  Design a tethered aerial platform that is capable of providing enhanced situational awareness and communication capabilities.  Deliver an optimized anthropomorphic test device for blast testing and the test evaluation community.  Develop and deliver a portable system for vehicle protection in crowds.  Test and evaluate a novel biofidelic headform for use in blast testing as a tool to evaluate the performance of head protection.  Develop and deliver a mobile surveillance platform that captures, records, encrypts, and streams multi-channel video and audio with associated GPS position information. Design a capability that activates a vehicle tracking, tagging, and locating device upon detection of a blast."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.100"
                                            },
                                            "Text": {
                                                "val": "Complete the development of the novel biofidelic headform for blast testing and deliver for test and evaluation of head protection systems.  Deliver a multifunctional earpiece that provides in ear hearing protection and the ability to record pressure and acceleration data during blast and blunt impact events.  Deploy the mobile surveillance platform to gain situational awareness from moving platforms and man-portable assets.  Deliver a personal cooling system for deployment under the improved outer tactical vest.  Test and validate the performance of a tethered aerial platform for enhanced situational awareness and communication capabilities.  Develop a truly concealable armor system that provides rifle threat protection.  Integrate a new tagging, tracking and locating device with an existing back end processing system for enhanced situational awareness and tracking capabilities.  Develop a three dimensional personnel tracking and locating system for use within structures.  Analyze the performance of hybrid and fuel efficient vehicles that are armored to determine their feasibility for protection operations.  Develop a capability for local data storage of maps for operational use in austere environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PHYSICAL SECURITY"
                                    },
                                    "Description": {
                                        "val": "Develop capabilities to address vulnerabilities associated with forward deployed and domestic U.S. Government facilities and interests, as well as for local responder and interagency requirements while emphasizing rapidly transitioning capabilities to the user.\nMaximize efficiencies by leveraging relationships and resources across the community of interest while eliminating duplication of projects, pursuing the use of commercial off-the-shelf (COTS) products, ensuring systems integration, and promoting interoperability and sustainability.  \nPosture the Subgroup to address emerging requirements as the Nation pursues new partnerships and as global counter terrorism efforts become more widely distributed, and are characterized by a mix of direct action and security force assistance.\nFocus efforts along the U.S. borders, at mass transportation and commerce nodes, and in support of large scale public gatherings."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.676"
                                            },
                                            "Text": {
                                                "val": "Coordinated test program results to determine best solutions for temporary, semi-permanent, or permanent facilities and deployed decision aids to assist with pre-event, preventative planning.  Coordinated design standards with appropriate government agencies for increased force protection.  Continued development of an ongoing test program in an urban environment to include novel explosives. Completed the development and deployed tactical and integrated security system concepts.  Developed a comprehensive homemade explosives database with multiple levels of access.  Demonstrated and delivered a system that provides enhanced night vision capabilities to austere outposts. Provided advanced physical security technologies for operational assessments, field training, and operational support that satisfy requirements in support of deployed forces and interagency operational requirements. Continued development of a rocket detection system that provides warning time sufficient to find cover.  Continued development of an on-the-move IED detection capability. Initiated development of a swimmer detection technology based on an electro-optical sensor. Continued development of a next generation Short Wave Infrared (SWIR) capability for use in tactical environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.855"
                                            },
                                            "Text": {
                                                "val": "Continue development of a test program in an urban environment using modular configurations to represent urban environments to better understand the impact of fixed urban structures on blast wave propagation for conventional explosives and enhanced novel explosive mixtures. Develop a fast running computational tool to assist DoD and first responder personnel in predictive blast analysis in an urban environment. Develop enhanced video assessment and tracking techniques. Conduct user evaluation of a comprehensive homemade explosives database with multiple levels of access. Operationally test and evaluate a next generation Short Wave Infrared (SWIR) capability for use in tactical environments. Complete construction of an integrated test facility for technology demonstrations and pre-operational testing.  Develop and field test a portable persistent surveillance system for covert emplacement and enhanced tracking of suspicious activity. Complete development and transition a security system that contains a camera observation system and a sensor alarm system coupled in an integrated package for concealable installation.  Globally support site security implementation and execution and large scale events\/large scale public gatherings. Deliver and evaluate a system for detection of rocket attacks.  Develop an integrated biometrics solution for deployment in uncontrolled pedestrian traffic scenarios.  Continue development of a swimmer detection technology based on an electro-optical  sensor.  Evaluate a technology demonstrator for on-the-move, standoff IED detection.  Evaluate a technology demonstrator for standoff underground void and tunnel detection.  Complete development of interagency agreement on protocols as related to safety, testing, measurement and scale-up standards for improvised and homemade explosives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.150"
                                            },
                                            "Text": {
                                                "val": "Develop capabilities to address vulnerabilities associated with forward deployed and domestic U.S. Government facilities and interests, as well as for local responder and interagency requirements with a focus of effort along the U.S. borders, at mass transportation and commerce nodes, and in support of large scale public gatherings.  Develop technologies for: Tunnel Detection; Video Analytics; Intelligent Sensor Fusion; Simplified Integrated Interface systems; and uncontrolled pedestrian traffic integrated biometrics solutions.  Develop a rapidly deployable, non-lethal, temporary barrier system to protect fixed and expeditionary facilities for augmented protection in response to increased threat levels or to support special events.  Develop a tool for an absolute understanding of TNT equivalency that will provide operational forces necessary information for protecting personnel and infrastructure.  Continue testing explosives effects in an urban environment and provide data\/test results required by first responders and military engineers.  Complete development of novel explosive characterization and provide test results. Evaluate a swimmer\/small vessel detection technology based on Electro Optical sensors to provide situational awareness for port security and open water operations.  Emphasize rapidly transitioning capabilities to the user communities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURVEILLANCE, COLLECTION AND OPERATIONS SUPPORT"
                                    },
                                    "Description": {
                                        "val": "Identify high-priority user requirements and special technology initiatives focused primarily on countering terrorism through offensive operations.  Enhance US intelligence capabilities to conduct retaliatory or preemptive operations and reduce the capabilities and support available to terrorists."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.457"
                                            },
                                            "Text": {
                                                "val": "Adapted and integrated existing foreign language applications, practices, and tools into a tactical site exploitation capability.  Improved the timely collection of intelligence and evidence to support follow-on targeting, effective detainee prosecution, and theatre-wide exploitation of tactical intelligence.  Enhanced the capability to identify targets through biometric modalities.   Streamlined the processes of data collection, sharing, identity management, mobile identification, and detection of targets of interest.  Developed enhanced capabilities, force structures, and training programs to leverage Information Operations capabilities.  Provided canine Homemade Explosive (HME) detection capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.447"
                                            },
                                            "Text": {
                                                "val": "Develop and deliver field technical surveillance capabilities. Develop and improve operational tactics, techniques, and procedures used by military working dog teams.  Complete the development and deploy expeditious foreign language analytical tools in support of tactical exploitation. Continue development and enhance research and technology to assist analysts with biometric intelligence and reporting. Develop advanced Information Operations applications, practices, and tools. Evaluate methods of improving intelligence, surveillance, and reconnaissance technologies in Unmanned Aerial Systems.  Expand canine Homemade Explosive (HME) detection capabilities.  Develop cyber-related tools for the timely collection of intelligence and evidence to support follow-on targeting, effective detainee prosecution, and theatre-wide exploitation of tactical intelligence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.492"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.492"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and enhance technical surveillance capabilities.  Continue to improve military working dog scent kits for training and operational tactics, techniques, and procedures.  Develop a method to integrate foreign language analytical tools into agile workflow platforms and media monitoring systems.  Develop capabilities, force structure, and training programs to leverage information operations and technical site exploitation efforts.  Utilize Unmanned Aerial Vehicles platforms as novel communication relay nodes.  Enhance cyber-related capabilities in support of tactical intelligence."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TACTICAL OPERATIONS SUPPORT"
                                    },
                                    "Description": {
                                        "val": "The Tactical Operations Support subgroup mission is to identify, prioritize, and execute rapid research and development projects that enhance the capabilities of DoD and Interagency special operations tactical teams engaged in finding, fixing, and finishing terrorists.  This includes support to state and local law enforcement agencies to combat domestic terrorism.  The development focus is enabling small units of dominance by providing state of the art overmatch capacities in:  Communication Systems; Intelligence, Surveillance, Target Acquisition, and Reconnaissance Systems (ISTARS); Offensive Systems; Specialized Access Systems; Survivability Systems; Unconventional Warfare \/Counter-Insurgency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.985"
                                            },
                                            "Text": {
                                                "val": "Initiated and completed development of a low-cost cellular tracking device for use in Hostile Force Tagging, Tracking and Locating. Initiated and completed development of a reporting and dissemination system for use on commercial mobile devices to increase situational awareness. Initiated and delivered an offensive tactical cyber program of instruction. Initiated and completed a lightweight micro tactical ground robot with high maneuverability in order to climb complex obstacles for visual and acoustic surveillance and reconnaissance missions. Initiated and completed a mobile mortar targeting systems with an integrated Fire Control System that provides rapid and accurate indirect fire solutions for 81mm mortar systems using legacy U.S. standard mortars and ammunition. Completed development of a comprehensive reference source to summarize the performance characteristics of the available and proven breaching methods, tools, and tactics as they apply in a maritime environment. Completed development of a fully integrated helmet for law enforcement using advanced materials that are capable of withstanding NIJ Level IIIA body armor ballistic threats as well as bodily damage against blast, fragmentation, and blunt force trauma. Developed and delivered low visibility plain clothes audio video collection and recording system.\nDeveloped and delivered a lightweight, compact personal infrared emitter capability for viewing with thermal sensors. Completed spiral development of a lightweight, compact system that combines motion-sensing alert with an IR illuminator to provide broader early-warning security for deployed teams. Completed spiral development of a program of instruction and developed new equipment for Special Operations Forces to improve sniper accuracy and efficiency at ranges up to 1,800 meters. Completed development of a small, passive, and affordable imaging device capable of extracting object depth information along with a video stream of scenes. Completed development of a system that provides a self-healing, ad-hoc air-to-ground mesh network for the transmission of real-time voice and data communications. Completed development of a persistent real-time visual surveillance system that has an integrated power supply and SATCOM\/Cellular data link. Completed a low-profile gunshot localization system for use on non-standard vehicles. Completed development of a visual and thermal camouflage system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.043"
                                            },
                                            "Text": {
                                                "val": "Deliver mobile mortar targeting systems with an integrated Fire Control System that provides rapid and accurate indirect fire solutions for 81mm mortar systems using legacy U.S. standard mortars and ammunition. Initiate and complete development of a concealable sniper rifle with all components measuring less than 16.5 inches. Develop and deliver an upper receiver group that provides a significant improvement to suppression of both sound and flash from the current U.S. standard M4 carbine rifle. Deliver a lightweight organic cell phone network that will provide secure voice and secure high speed data services to at least 16 users simultaneously. Deliver a specialized application for commercially available smart phones to provide a rapid mass alert tool that receives or reports incidents for U.S. Border Patrol agents via geo-rectified pictures or SMS messages. Complete spiral development and deliver an offensive tactical cyber program of instruction. Deliver a system that will alert a ground force commander as to the status of his deployed sniper teams in real-time over organic radio links. Deliver in-depth analysis and reference books on activities and motives of specific countries and threat subjects of interest. Deliver ballistic protective eyewear for tactical operators capable of near instantaneous transition from clear to amber, blue, and dark smoke for use in dynamic lighting environments. Deliver a handheld intelligence, surveillance, target acquisition, reconnaissance system. Deliver additional lightweight micro tactical ground robots with high maneuverability in order to climb complex obstacles for visual and acoustic surveillance and reconnaissance missions. Deliver a single man-portable, collapsible-wing tactical micro unmanned aerial system with a secure mobile ad-hoc network data-link that is capable of being hand-launched from a man-portable canister. Deliver a next generation tactical mesh network system that provides a self-healing, ad hoc mesh network for the transmission of real-time communications (voice and data) utilizing the Android platform and applications. Deliver a small, weapon rail mounted, un-cooled long wave infrared detector system that provides snipers with high resolution thermal imagery for distances out to 1,800 meters. Deliver a miniature, highly maneuverable and rugged unmanned ground system capable of being controlled by an Android-based controller with a secure mobile ad-hoc network communications link. Deliver a high-power infrared light array for use on non-standard vehicles to help enable high risk driving in low-light conditions under night vision goggles. Develop and deliver a standoff concealed body worn contraband detector. Develop and deliver a fused thermal and image intensified clip-on small arms night vision weapons sight."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.100"
                                            },
                                            "Text": {
                                                "val": "Deliver a vertical take-off and landing small UAS with a secure mobile ad-hoc network data-link. Deliver a rapidly-deployable tethered aerial ISR system that is transported, launched, operated and recovered from a tactical all terrain vehicles. Deliver a low-profile two-way communications device that cannot be observed using visual inspection. Deliver spiral development of next generation tactical mesh network system that provides a self-healing, ad hoc mesh network for the transmission of real-time communications (voice and data) utilizing the Android platform and applications. Develop and deliver a remote audio collection system capable of operating in austere and outdoor environments. Develop and deliver a clip-on small arms illumination and pointing device that operates in both near and short wave infrared spectra."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING TECHNOLOGY DEVELOPMENT"
                                    },
                                    "Description": {
                                        "val": "The TTD Subgroup’s objective is to provide SOF, DoD, and the interagency community with an agile, rapid response, R&D process and SME resource for increasing readiness for tomorrow’s threats.  To meet this objective, the subgroup focuses on immersive simulations; augmented reality; advanced training content programs; rapid and adaptive learning environments; and mobile technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.850"
                                            },
                                            "Text": {
                                                "val": "Developed a PC-based simulation tool and realistic driving scenarios within the context of protective details. Developed a series of training videos that profiled ballistics and shooting skill effects. Developed regional and national scenarios for CBRN incident prevention and response training. Conducted an assessment study of existing homemade explosives (HME) training courses. Designed and developed a weapon training aid to improve trigger control."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.847"
                                            },
                                            "Text": {
                                                "val": "Design and develop a program required to implement and evaluate a training program that improves a soldier’s kinetic eye movement and target acquisition skills. Develop a simulated training environment for embassy security. Develop an instructor-led training program and educational resources for small unmanned aerial systems. Develop a distance learning training on the topic of sensitive site exploitation that is not specific to an area of operation. Develop and conduct operational testing of a parachute simulator and integrated head mounted displays. Develop and implement enhancements to the M134 Minigun training simulator system. Develop and update the Vehicle Inspection Guide for a domestic audience including private sector security."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.900"
                                            },
                                            "Text": {
                                                "val": "Design and develop a close target reconnaissance and physical surveillance course. Develop a course to enhance negotiations skills used during village stability operations. Develop mobile tablet capabilities and apps for village stability operations. Design, develop, and evaluate a system to enhance operator performance and baseline rehabilitative measures for treating Traumatic Brain Injury. Develop mobile resources for CBRN equipment. Design and develop a decision tool for mobile learning efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}