{
    "id": "7bd71ae1a3e65c01e32c08b2d1b3db4cc73657a6",
    "meta": {
        "filename": "dod-2014_RDTE_2014_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2014.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0607828J"
        },
        "ProgramElementTitle": {
            "val": "Joint Integration & Interoperability"
        },
        "R1LineItemNumber": {
            "val": "190"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "5.013"
            },
            "BudgetYearOne": {
                "val": "12.652"
            },
            "BudgetYearOneBase": {
                "val": "12.652"
            },
            "BudgetYearTwo": {
                "val": "12.895"
            },
            "BudgetYearThree": {
                "val": "12.982"
            },
            "BudgetYearFour": {
                "val": "13.020"
            },
            "BudgetYearFive": {
                "val": "13.231"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Integration & Interoperability (JI&I) Program Element underwrites the Department’s core joint Command and Control (C2) efforts for military needs development and validation, for development of associated Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, and Facilities (DOTMLPF), and for operational assessment of materiel solutions proposed and delivered by the Defense acquisition enterprise.  Funds from the JI&I Program are used to address joint capabilities including, but not limited to operational through tactical level joint integration of the following capabilities: Common Operational and Tactical Pictures; Combat Identification; Situational Awareness; Adaptive Planning and Execution (APEX); Interoperability among Service\/ Agency intelligence systems; Interoperable Joint Fires, Maneuver, and Intelligence; and Integrated Joint Battle Management Command and Control.\n\nActivities funded by the JI&I Program aim to:\n\n- Identify, and\/or develop mission capable solutions for COCOM integration and interoperability shortfalls with emphasis on non-materiel elements;\n- Assess operational suitability and sufficiency of materiel solutions identified by the Defense acquisition enterprise in response to validated joint C2 needs;\n- Provide Combatant Commanders with interoperable combat identification and situational awareness capabilities among United States Interagencies, and Allied and Coalition Forces in support of Overseas Contingency Operations;\n- Develop joint requirements supporting C2-intensive joint missions such as Joint Close Air Support and Joint Fires;\n- Develop joint integrated architectures that guide service capability mapping to achieve joint interoperability;\n- Establish fundamental joint data standards and cross domain solutions to facilitate future system integration and interoperability; and,\n- Undertake other activities to resolve emergent operational and tactical needs associated with joint C2."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "5.013"
                },
                "BudgetYearOne": {
                    "val": "4.997"
                },
                "BudgetYearOneBase": {
                    "val": "4.997"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "5.013"
                },
                "BudgetYearOne": {
                    "val": "12.652"
                },
                "BudgetYearOneBase": {
                    "val": "12.652"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.655"
                },
                "BudgetYearOneBase": {
                    "val": "7.655"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program requirements"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "7.655"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.655"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Additional resources allocated to support mission requirements that transitioned to the Joint Staff after U.S. Joint Forces Command disestablishment, and the re-establishment of the Joint Staff J6 Directorate \/ CIO."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P818"
                    },
                    "ProjectTitle": {
                        "val": "Joint Integration & Interoperability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "5.013"
                        },
                        "BudgetYearOne": {
                            "val": "12.652"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.652"
                        },
                        "BudgetYearTwo": {
                            "val": "12.895"
                        },
                        "BudgetYearThree": {
                            "val": "12.982"
                        },
                        "BudgetYearFour": {
                            "val": "13.020"
                        },
                        "BudgetYearFive": {
                            "val": "13.231"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integration & Interoperability (JI&I) Program Element underwrites the Department’s core joint Command and Control (C2) efforts for military needs development and validation, for development of associated Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, and Facilities (DOTMLPF), and for operational assessment of materiel solutions proposed and delivered by the Defense acquisition enterprise.  Funds from the JI&I Program are used to address joint capabilities including, but not limited to operational through tactical level joint integration of the following capabilities: Common Operational and Tactical Pictures; Combat Identification; Situational Awareness; Adaptive Planning and Execution (APEX); Interoperability among Service\/ Agency intelligence systems; Interoperable Joint Fires, Maneuver, and Intelligence; and Integrated Joint Battle Management Command and Control.\n\nActivities funded by the JI&I Program aim to:\n\n- Identify, and\/or develop mission capable solutions for COCOM integration and interoperability shortfalls with emphasis on non-materiel elements;\n- Assess operational suitability and sufficiency of materiel solutions identified by the Defense acquisition enterprise in response to validated joint C2 needs;\n- Provide Combatant Commanders with interoperable combat identification and situational awareness capabilities among United States Interagencies, and Allied and Coalition Forces in support of Overseas Contingency Operations;\n- Develop joint requirements supporting C2-intensive joint missions such as Joint Close Air Support and Joint Fires;\n- Develop joint integrated architectures that guide service capability mapping to achieve joint interoperability;\n- Establish fundamental joint data standards and cross domain solutions to facilitate future system integration and interoperability; and,\n- Undertake other activities to resolve emergent operational and tactical needs associated with joint C2."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Integration & Interoperability"
                                    },
                                    "Description": {
                                        "val": "Primary objective is the resolution of C2 warfighter requirements and interoperability shortfalls; development, oversight, and execution of the DoD C2 Strategic and Implementation Plan objectives for:\n1) Improved, integrated, interoperable, and networked joint force;\n2) Reduction in duplicative C2 systems\/programs across the DoD portfolio; and\n3) Improved decisions and recommendations regarding capability trade-off investment strategies and development efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.013"
                                            },
                                            "Text": {
                                                "val": "Lead the requirements definition process and implementation framework necessary to evolve the DoD Future Mission Network (FMN) \/ Mission Partner Environment (MPE) capability; follow-on to the Afghanistan Mission Network (AMN).  Provide oversight and management of integration activities in accordance with JROC-approved FMN \/ MPE implementation plan to address steady-state and contingency coalition information sharing needs and Combatant Command shortfalls.  Provide oversight and management of FY13 joint combat development projects and integration activities: joint C2 requirements definition and prioritization for the JROC, kinetic and non-kinetic (cyber) joint fires capabilities, mission thread architectures and analysis, enterprise data standards and services and operational assessments to optimize C2 portfolio capabilities. Provide a persistent joint environment for test and assessment to address COCOM issues in operational assessments\/venues.\n\nPerform C2 capability prioritization and sequencing via the USD(AT&L)-sponsored Joint C2 Sustainment and Modernization Plan process, with follow-on C2 capability production, integration, fielding and sustainment for FY13-15.  Perform the JROC-directed Operational Impact and Risk Assessment of Joint C2 capabilities based on COCOM and Service inputs to inform stakeholders of the current state of joint C2 with respect to the JROC’s “Do No Harm” mandate.  Sustain and utilize the Net-Enabled Requirements Identification Database (NRID) and the Decision Support Tool (DST) to provide accessibility and visibility into C2 capability needs (gaps, shortfall), defined requirements (old, new, emerging), and potential solutions for C2 stakeholders and decision-makers to consider. Develop JCIDS and requirements documents to sustain the Joint C2 family of programs and lead the way for future joint C2 capability development. Develop requirements for Future Mission Network (FMN) \/ Mission Partner Environment (MPE) capabilities and consider C2 Doctrine, Organization, Training, Leadership and Education, Personnel, Facilities, and Policy (DOT_LPF-P) solution tradeoffs and recommendations. Develop and\/or collaborate on Capability Definition Packages (CDPs) for Global Force Management Synchronization, Concept Development, and Joint Execution Mission Management.  Develop Capability Packages (CPs) for Adaptive Planning and Execution Force Projection, Future Mission Network (FMN) \/ Mission Partner Environment (MPE), and Unclassified Information Sharing Services.\n\nLead the configuration management of C2 Core Version 2.0 and facilitate C2 Core implementation through the Tactical Edge Data Solutions Joint Capability Technology Demonstration and piloting activities with the National Geospatial Agency and the Open Geospatial Consortium.  Support DoD CIO development of the DoD Data Framework and DoD adoption of the National Information Exchange Model (NIEM). Lead the NATO C3 Board Information Integration Services Capability Team to facilitate data sharing capabilities with NATO nations. Execute FY 2013 Authoritative Data Source (ADS) Annual Review Board in conjunction with the Joint C2 Sustainment and Modernization Plan process to synchronize data exposure with capability development.  Expand the C2 ADS management approach in coordination with all functional capability boards (FCBs.  Verify C2 ADS information in the DoD Enterprise ADS Registry and report ADS exposure and utilization metrics to ensure ADS exposures are meeting warfighter requirements.  Map ADS to Joint Mission Threads directly supporting warfighter requirements and analysis. Provide data & service strategy reviews and recommendations for ISPs\/IAPs, capabilities development documents, and guidance and policy documents to ensure programs are complying with warfighter requirements and policy.  Lead the C2 Data and Services Steering Committee to provide a formal process to establish C2 data sharing priorities and standards for C2 capabilities.  Maintain oversight of DOD's tactical information exchange standards.  Oversee refinement and implementation of the Interoperability Enhancement Process (IEP) to ensure data interoperability in the field.\n\nLead interoperability efforts across DOD and partner nations at operational and tactical level for mission partner operations, fire support, Combat Identification (CID), and Friendly Force Tracking (FFT) capabilities. Function as Secretariat for the Joint Requirements Oversight Council(JROC)-chartered, FOGO-level Joint Fire Support (JFS) and CID\/FFT Executive Steering Committees (ESCs)— which focuses Service and NATO\/coalition partners on joint and combined solutions to policy, interoperability, doctrine, and tactics, techniques, and procedural (TTP) issues and initiatives. Execute the Director, Joint Staff-approved Bold Quest 2013 assessment demonstration, including a Joint Operational Test for Mark XII Mode 5 Interoperability to support initial operational capability for US forces in 2014; and a long range air defense event to test the air-to-ground integration of Mode 5—meeting long-standing requests by the Navy and USAF. Expand the JROC-directed JFS Joint Mission Thread beyond the “execution phase” to the entire fires support process—increasing systems interoperability and fires execution with materiel and non-materiel initiatives (doctrine, training, TTP).  Execute the OPSDEPS\/Director JS J-6 approved Joint Terminal Attack Controller (JTAC), Forward Air Controller-Airborne (FAC-A), and Joint Fires Observer (JFO) Memorandums of Agreement—which standardize schoolhouse curriculums; training materials and equipment; simulation and simulators; and instructor requirements.  Conduct JFS ESC standardization team accreditation visits to US and partner nation schoolhouses to ensure MOA signatories are accomplishing schoolhouse training in compliance with the Memorandums—reporting results to the JFS ESC and FOGO-level Commander that include deviations from the MOAs; recommendations for improvement, and best practices. Pursue Digitally Aided Close Air Support (DACAS) implementation testing and documentation to provide the ability to digitally transmit instructions (9-line and digital target marking) to expedite attack execution and reduce the potential for friendly-fire by lessening the possibility for human translation error and increasing the opportunity for target confirmation between the JTAC and the attacking aircraft crew. Continue to support Combat Identification Server operational execution in CENTCOM theater of operations while transitioning to gaining Service.\n\nUpdate the C2OTM Reference Architecture and add additional analysis and architectures. Continue to analyze JCIDS Capability Documents, ISPs and TISPs. Review and analyze NR KPP architectures, KPPs, KSAs and capabilities for interoperability and integration. Provide NR KPP Waiver Recommendations based on GIG connection and operational \/ systems requirements analysis.  Maintain the Future Mission Network (FMN) \/ Mission Partner Environment (MPE) Integrated Architecture. Support C4\/CYBER FCB on JROC Interest issues with analysis and architectures. Provide additional functions for inclusion in the Joint Common System Function List (JCSFL). Provide analysis and architecture support to the Joint Aerial Layer Network initiative.  Develop the Joint Information Environment (JIE) ICD Architectures.  Analyze and provide recommendations for the JIE Reference and Solutions Architectures.  Support the Federation effort with capabilities requirements to proposed capabilities and capability gaps analysis using authoritative sources of information and data.  Develop Solutions architectures and perform analysis to determine capability development priorities, identify capability redundancies\/gaps, and identify critical Joint C2 interoperability opportunities and requirements.\n\nBegin development of six new Tier 1 JMTs based on JROC and FCB guidance and partnership opportunities. Support cross-DoD efforts to enhance the capability to collaborate on, leverage and improve developed and developing JMTs.  Support the management of the DACAS Change Control Engineering Change Proposal (ECP) implementation with Program Managers and Mission Partners.  Manage the Joint Fires Support JMT in support of the JROC mandated analyses, implementing the ECPs identified in the analysis conducted in FY-2012\/2013.  Provide JMT data via web-enabled portal capability providing operational context and mission-based data reuse for the testing, training, programming, program development, experimentation, and modeling and simulation communities of interest across DoD.\n\nProvide architecture and capability analysis support for joint Command & Control (C2) systems and Service systems joint integration in support of the Combat Capability Development. Provide architecture analysis and products in support of the development of C2 related ICDs (Initial Capabilities Documents), CDDs (Capability Development Documents), CPDs (Capability Production Documents), ISPs (Information Support Plans) and TISPs (Tailored Information Support Packages) for compliance with the JCIDS process.\n\nProvide the capability to support use of architecture data in Joint Staff and OSD capability analysis processes.  Provide and expand the development of web services and standardized portal interface for exposure and federation of Joint Mission Threads, C\/S\/A Architectures, and other authoritative sources of data. Provide an Integrated Dictionary of authoritative WMA architecture elements for reuse by programs and other capability developers.  Incorporate and align joint architecture development environment with data model and methodology standards in conjunction with OSD, Joint Staff, and Service and Combatant Command communities. The result of the enhanced Federation capabilities will be the increased efficiency of architecture development through discovery access and reuse and the increased effectiveness through the greater availability of authoritative products."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.652"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.652"
                                            },
                                            "Text": {
                                                "val": "Develop an integrated and prioritized C2 capabilities action plan to address C2 capability shortfalls for JS J6 endorsement and signature. Lead implementation efforts necessary to continue to evolve the DoD FMN \/ MPE capability IAW with JROCMs 081-12 and 026-13.  Develop a Joint C4I Partnership to establish and manage a predictable and operationally realistic environment for capability development, assessment, test, and certification of COCOM and JTF C4I systems. Assess and test systems providing capabilities to joint missions in the expected operational environment and verify interoperability earlier in the development cycle to enhance the effectiveness and efficiency of joint and coalition force C4I assessment, test and certification.  Provide real time support for urgent COCOM and coalition requirements, JCS exercises, contingencies and current ops. Additionally, continue to provide oversight and management of FY14 joint combat development projects and integration activities. Provide recommendations to inform JROC and DOD executive level C4\/Cyber capability trade-off, investment and divestiture decisions impacting FY16.  \n\nContinue the prioritization and sequencing of C2 capabilities via the USD(AT&L)-sponsored Joint C2 Sustainment and Modernization Plan process, with follow-on C2 capability production, integration, fielding and sustainment for FY14-16.  Continue to perform the Operational Impact and Risk Assessment of Joint C2 capabilities based on COCOM and Service inputs.  Direct engagement with Component materiel developers to shape solutions and ensure requirements traceability through product delivery.  Continue the sustainment and utilization of the NRID and DST to provide accessibility and visibility into C2 capability needs, defined requirements, and potential C2 solutions. Provide funding strategies to decision-making forums that support sustainment of current capabilities while continuing to migrate C2 to an agile, services-oriented environment. Continue to develop JCIDS and requirements documents to sustain the Joint C2 family of programs and lead the way for future joint C2 capability development. Continue to develop requirements for Future Mission Network (FMN) \/ Mission Partner Environment (MPE) capabilities and consider C2 DOT_LPF-P solution tradeoffs and recommendations.  Develop and\/or collaborate on CDPs for Unit Command and Control and access to Intelligence, Surveillance and Reconnaissance Collection Management information. Develop CPs for Global Force Management Synchronization, and Course of Action Development, and collaborate on the Command and Control Air Operation Services CP.  \n\nTransition the C2 Core data exchange standard to the National Information Exchange Model (NIEM) and stand up the NIEM Military Operations Domain. Provide training and support to NIEM implementation activities within the Warfighter Mission Area (WMA) to promote DoD and interagency interoperability.  Support DoD CIO efforts to refine and implement the DoD Data Framework and lead the implementation of the DoD Data Framework within the WMA. Continue to lead the NATO C3 Board Information Integration Services Capability Team and define a NATO Core Data Framework to facilitate data sharing capabilities with NATO nations.  Execute FY 2014 Authoritative Data Source (ADS) Annual Review Board in conjunction with the Joint C2 Sustainment and Modernization Plan process to synchronize data exposure with capability development.  Continue to verify C2 ADS information in the DoD Enterprise ADS Registry and report ADS exposure and utilization metrics.  Lead, facilitate, and\/or support NIEM and other relevant WMA Data Standard implementation and technical demonstrations\/pilots to enhance US and coalition data interoperability.  Continue providing data & service strategy reviews and recommendations for ISPs\/IAPs, capabilities development documents, and guidance and policy documents to ensure programs are complying with warfighter requirements and policy. Stand up the WMA Data and Services Steering Committee to provide a formal process to establish WMA data sharing priorities and standards for WMA capabilities.  Maintain oversight of DOD's tactical information exchange standards.\n\n\nContinue to lead interoperability efforts across DOD and partner nations at operational and tactical level for mission partner operations, fire support, Combat Identification (CID), and Friendly Force Tracking (FFT) capabilities. Continue to function as Secretariat for the JROC-chartered, FOGO-level Joint Fire Support (JFS) and CID\/FFT Executive Steering Committees (ESCs). Execute the JFS\/Joint Close Air Support (JCAS) and CID-FFT Action Plans to fulfill JFS and CID\/FFT responsibilities. Execute the Joint Staff-approved Bold Quest 2014 assessment demonstration.  Continue to expand the JROC-directed JFS Joint Mission Thread beyond the “execution phase” to the entire fires support process.  Continue to execute OPSDEPS\/Director JS J-6 approved Joint Terminal Attack Controller (JTAC), Forward Air Controller-Airborne (FAC-A), and Joint Fires Observer (JFO) Memorandums of Agreement.  Continue to conduct JFS ESC standardization team accreditation visits to US and partner nation schoolhouses to ensure MOA signatories are accomplishing schoolhouse training in compliance with the Memorandums.  Continue DACAS implementation testing and documentation to provide the ability to digitally transmit instructions to expedite attack execution and reduce the potential for friendly-fire.\n\nContinue to analyze NR KPP architectures and capabilities for interoperability and integration, and provide NR KPP Waiver Recommendations based on operational \/ systems requirements analysis.  Continue to maintain the Future Mission Network (FMN) \/ Mission Partner Environment (MPE) Integrated Architectures and Joint Information Environment Architectures.  Develop solutions architectures for the Warfighting Enterprise Architectures. Support C4\/CYBER FCB on JROC Interest issues with analysis and architectures. Provide additional functions for the Joint Common System Function List. Review emerging DoD policy addressing architectures and standards. Continue to support FCB architecture-based analysis requirements through expanding the architecture federation effort, to include the capability to provide discovery and reuse of capabilities requirements to proposed capabilities traceability and capability gaps analysis reports using authoritative sources of information and architecture data.\n\nContinue development of new Tier 1 JMTs based on JROC and FCB guidance and partnership opportunities. Identify future Joint Fires Support (JFS) Block ECPs. Provide JMT data via web-enabled portal capability providing operational context data reuse for the testing, training, programming, and program development.\n\nProvide support to the Joint Staff J6 Combat Capability Development Division (CCDD) by conducting architecture analysis and developing DoDAF products that support the Joint C2 requirements development process and the DoD Sustainment & Modernization Planning process (SMPP) to enable gap analysis and solution identification.  Provide Joint C2 architecture data via federated capability providing operational context and C2 mission-based data reuse for the testing, training, programming, program development, experimentation, and modeling and simulation communities of interest.\n\nContinue to expand the amount and quality of Warfighting Mission Area (WMA) architecture data available to support DoD CIO architecture requirements and Joint Staff capability analysis, test and evaluation, and modeling and simulation processes.  Improve capability for discovery, accessibility, and use\/re-use of WMA and Joint Information Environment architectures, architecture-based analysis reports and associated data.  Continue to expand the federated architecture environment to include Combatant Command, Service, and Agency (C\/S\/A) partner repositories of authoritative architecture information and data."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "• Develop coordinated joint C4 operational assessments, tests and evaluations to identify, prioritize and document interoperability deficiencies that produce Component plans and actions to reduce or eliminate identified deficiencies\n• Provide mission capable solutions for joint interoperability and integration capability shortfalls to influence and resource joint C2 solutions in the POM\n• Provide situational awareness and cooperative \/ non-cooperative identification capabilities that enable U.S., NATO \/ coalition warfighters to identify friendly, enemy and neutral forces for “shoot\/don’t shoot” decisions\n• Synchronize Service testing, acquisition and fielding of Mode 5 IFF capability, with an Initial Operating Capability (IOC) in 2014 and Full Operational Capability (FOC) in 2020\n• Complete Definition Package for Block 2 of Digitally Aided Close Air Support (DACAS) coordinated implementation in conjunction with participating Service programs of record\n• Conduct Accreditation Biennial Visits for 6 Joint Terminal Attack Controller (JTAC) and 2 Joint Fires Observer (JFO) Schoolhouses\n• Monitor compliance for Mode 5 IOC in FY14 and FOC in FY20 \n• Develop annual JROC approved plan to identify prioritized and synchronized capabilities sufficient for near-term development and fielding to warfighters  (12-18 month delivery)\n• Develop, as required, JROC requirements documentation (ICDs, CDDs, CPDs, CDPs, CONOPs, MOEs\/MOPs) sufficient for  agile\/flexible use by the acquisition community\n• Continue development of reusable architecture products to provide capability developers an upfront, operational\/systems view at the enterprise level to support of capability acquisition, requirements generation, development, and testing.\n• Establish common WMA data and service standards and facilitate access to authoritative data assets in order to provide the warfighter timely access to critical information for Joint, Interagency, and Multinational partners."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FFRDC Engineering & Techical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hampton Roads, VA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.190"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.190"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.190"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Contract Management Support Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various DoD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.214"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.782"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.782"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-09"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Contract Engineering and Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MAN-TECH"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hampton Roads, VA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.220"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FFRDC Engineering & Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Old Dominion University"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, VA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.180"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.180"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.180"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Contract Engineering and Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GTRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.720"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Contract Engineering and Technical Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Bold Quest"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.889"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.300"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Contract Management Support Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SADIE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DoD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}