{
    "id": "7f82b65ab89a291c75e345de08c84b4a46b53ecf",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602203F"
        },
        "ProgramElementTitle": {
            "val": "Aerospace Propulsion"
        },
        "R1LineItemNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "207.768"
            },
            "CurrentYear": {
                "val": "232.547"
            },
            "BudgetYearOne": {
                "val": "197.546"
            },
            "BudgetYearOneBase": {
                "val": "197.546"
            },
            "BudgetYearTwo": {
                "val": "173.232"
            },
            "BudgetYearThree": {
                "val": "179.038"
            },
            "BudgetYearFour": {
                "val": "181.468"
            },
            "BudgetYearFive": {
                "val": "183.558"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops propulsion and power technologies to achieve enabling and revolutionary aerospace technology capabilities. The program has six projects, each focusing on a technology area critical to the Air Force. The Advanced Propulsion Technology project develops high-speed air breathing propulsion engines to include combined cycle, ramjet, and hypersonic scramjet technologies to enable revolutionary propulsion capability for the Air Force. The Combustion and Mechanical Systems project evaluates lubricants and combustion concepts and technologies for new and existing engines. The Turbine Engine Technology project develops enabling capabilities to enhance performance and affordability of existing weapon systems and develops component technologies for ultra high pressure ratio, substantially improved durability, and adaptive cycle engine architecture to provide optimized performance, fuel efficiency, and life for widely varying mission needs. The Aerospace Power Technology project develops electrical power and thermal management technologies for military applications that are part of energy optimized aircraft development. The Rocket Propulsion Technology project develops advances in rocket propulsion technologies for space access, space maneuver, missiles, the sustainment of strategic systems, and tactical rockets. The Aerospace Fuel Technology project evaluates hydrocarbon-based fuels for legacy and advanced turbine engines, scramjets, pulse detonation, and combined-cycle engines. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "207.406"
                },
                "CurrentYear": {
                    "val": "232.547"
                },
                "BudgetYearOne": {
                    "val": "200.918"
                },
                "BudgetYearOneBase": {
                    "val": "200.918"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "207.768"
                },
                "CurrentYear": {
                    "val": "232.547"
                },
                "BudgetYearOne": {
                    "val": "197.546"
                },
                "BudgetYearOneBase": {
                    "val": "197.546"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.362"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.372"
                },
                "BudgetYearOneBase": {
                    "val": "-3.372"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.638"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.372"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.372"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY14 is due to higher DoD priorities.\n\nReceived reprogramming from PE 0601103F University Research Initiative for Adaptive Versatile Engine Technology (ADVENT) effort."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "623012"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Propulsion Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.009"
                        },
                        "CurrentYear": {
                            "val": "23.637"
                        },
                        "BudgetYearOne": {
                            "val": "22.304"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.304"
                        },
                        "BudgetYearTwo": {
                            "val": "21.383"
                        },
                        "BudgetYearThree": {
                            "val": "23.359"
                        },
                        "BudgetYearFour": {
                            "val": "26.020"
                        },
                        "BudgetYearFive": {
                            "val": "26.522"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops combined\/advanced cycle air breathing high-speed (up to Mach 4) and hypersonic (Mach 5 to 7) propulsion technologies to provide revolutionary propulsion options for the Air Force. These new engine technologies will enable future high-speed\/hypersonic weapons and aircraft concepts. The primary focus is on hydrocarbon-fueled engines capable of operating over a broad range of flight Mach numbers. Efforts include modeling, simulations, and proof of concept demonstrations of critical components; advanced component development; and ground-based demonstrations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Demonstrate Low Mach Scramjet Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced fuel-cooled scramjet engine technologies to support flight demonstration and enable the broad application of hypersonics to meet future warfighter needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.650"
                                            },
                                            "Text": {
                                                "val": "Developed and demonstrated advanced engine control systems and flight weight scramjet engine components. Developed and demonstrated closed loop engine control system with advanced instrumentation to increase scramjet engine operability at low scramjet Mach numbers. Conducted flight test using sounding rocket launch and successfully demonstrated transition from ramjet to scramjet."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.650"
                                            },
                                            "Text": {
                                                "val": "Complete development and demonstration of advanced engine control systems and flight weight scramjet engine components. Build upon prior ground and flight test data and experience to refine and demonstrate closed loop engine control system with advanced instrumentation to increase scramjet engine operability at low scramjet Mach numbers. Conduct direct connect testing of flight weight scramjet components for cold start systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Advance scramjet engine controls and cold start demonstration development transferred to PE 0603216F Aerospace Propulsion, project 635098 Advanced Aerospace Propulsion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Propulsion Technologies"
                                    },
                                    "Description": {
                                        "val": "Conduct assessments, technology design trades, and simulations to integrate combined cycle engines (CCEs) and air breathing hypersonic propulsion technologies into future systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.165"
                                            },
                                            "Text": {
                                                "val": "Conducted trade studies to determine military payoff and establish component technology goals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.120"
                                            },
                                            "Text": {
                                                "val": "Improve definition of component and engine performance objectives to enable development of affordable hypersonic flight demonstrators jointly with NASA and DARPA. Conduct development roadmapping."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Effort transitioned to PE 0602203F, Thrust 3, Hypersonic Scramjet Technologies, where component technologies will be integrated into scramjet engine subsystems for hypersonic systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hypersonic Scramjet Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop robust hydrocarbon fueled scramjet engine components and technologies to improve performance, operability, durability, and scalability for future platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.194"
                                            },
                                            "Text": {
                                                "val": "Developed advanced engine components to improve scramjet operating margin and to refine scramjet scaling laws for reusable applications. Developed techniques to decrease scramjet take-over from Mach 4.5 to Mach 3.5 to provide robust options for CCEs. Developed low internal drag flame stabilization devices and flight test engine components. Completed preliminary designs of heavy weight scramjet combustor in medium scale (ten times) scramjet engines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.867"
                                            },
                                            "Text": {
                                                "val": "Continue to develop advanced engine components to improve scramjet operating margin and to refine scramjet scaling laws for reusable applications. Continue to develop techniques to decrease scramjet take-over from Mach 4.5 to Mach 3.5 to provide robust options for CCEs. Continue to develop low internal drag flame stabilization devices and flight test engine components. Complete critical designs and initiate fabrication of scramjet combustors in medium scale (ten times) scramjet engines. Prepare for direct connect testing of medium scale (ten times) scramjet engines operating at Mach 3.5 to Mach 7 conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.304"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.304"
                                            },
                                            "Text": {
                                                "val": "Continue to develop advanced engine components to improve scramjet operating margin and to refine scramjet scaling laws for reusable applications.  Continue to develop techniques to decrease scramjet takeover from Mach 4.5 to Mach 3.5 to provide robust options for CCEs. Continue to develop low drag flame stabilization devices and flight test components.  Initiate direct testing of medium scale (ten times) scramjet engines operating at Mach 3.5 to Mach 7 conditions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "623048"
                    },
                    "ProjectTitle": {
                        "val": "Combustion and Mechanical Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.717"
                        },
                        "CurrentYear": {
                            "val": "15.874"
                        },
                        "BudgetYearOne": {
                            "val": "13.235"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.235"
                        },
                        "BudgetYearTwo": {
                            "val": "12.491"
                        },
                        "BudgetYearThree": {
                            "val": "12.527"
                        },
                        "BudgetYearFour": {
                            "val": "12.645"
                        },
                        "BudgetYearFive": {
                            "val": "12.886"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project evaluates lubricants, mechanical systems, and combustion concepts for advanced turbine engines, pulse detonation engines, and combined cycle engines. This project also develops technologies to increase turbine engine operational reliability, durability, mission flexibility, maintainability, and performance while reducing weight, fuel consumption, and cost of ownership. Applications include missiles, aircraft, and sustained high-speed vehicles. Analytical and experimental areas of emphasis include lubricants, bearings, mechanical systems diagnostics, mechanical systems prognostics, rotor dynamics, oil-less engine technology, optical diagnostics, fundamental combustion, detonations, combustors, and afterburners. Lubricants for these engines must be thermally stable, cost-effective, and operate over a broad range of conditions. Advanced combustion concepts must be cost-effective, durable, and reduce pollutant emissions. A portion of this project supports adaptive cycle technologies. This effort develops component technology for an adaptive cycle engine architecture that provides optimized performance\/fuel efficiency for widely varying mission needs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combustion Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, test, and evaluate revolutionary combustion and propulsion concepts for gas turbine, pulse detonation, and combined cycle engines for missiles, manned and unmanned systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.367"
                                            },
                                            "Text": {
                                                "val": "Evaluated alternative fuels in combustion systems at relevant engine conditions. Tested full-scale compact combustor concept relevant to highly efficient, embedded turbine engine goals. Demonstrated small-scale propulsion system operation using reduced-octane fuels. Employed new physical models in simulation tools. Investigate pressure gain combustion concepts for application to propulsion systems. Continued studies of pulse detonation engine-turbine interactions. Investigated feasibility of rotary detonation engines (RDE) and continuous detonation engines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.202"
                                            },
                                            "Text": {
                                                "val": "Develop new models for combustion processes at high pressure conditions. Test combustion system designs that produce low pollutant emissions. Test RDE concepts coupled with conventional turbomachinery.  Evaluate alternative fuels and their impact on engine performance and durability.  Test novel compact combustion systems at relevant operating conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.133"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.133"
                                            },
                                            "Text": {
                                                "val": "Implement new technologies to operate small-scale propulsion systems with reduced octane fuels.  Continue to develop new RDE concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostic Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate optical, electromechanical, and laser diagnostic tools and sensors for application to revolutionary propulsion technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.311"
                                            },
                                            "Text": {
                                                "val": "Applied line-of-sight measurement techniques for temperature and species to combustion systems in a relevant engine environment. Demonstrated simultaneous high-speed planar laser-induced fluorescence and particle-image velocimetry for measurements of species and velocity fields in practical combustion devices. Demonstrated tomographic reconstruction of reacting flowfields in relevant combustion systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.128"
                                            },
                                            "Text": {
                                                "val": "Apply advanced laser diagnostics and novel optics configurations to high pressure test cell environment. Demonstrate particle image velocimetry in high pressure combustion test apparatus. Investigate high-speed measurement techniques for combustion temperature and species."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.974"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.974"
                                            },
                                            "Text": {
                                                "val": "Develop high-speed laser systems to measure combustion species, temperature, and velocity.  Apply new diagnostics to combustion systems at relevant engine conditions.  Refine fiber optic methods for high-power laser diagnostics use."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lubricant Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, test, and qualify advanced turbine engine lubricants. Generate and maintain military specifications for aviation engine lubricants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.966"
                                            },
                                            "Text": {
                                                "val": "Demonstrated surface modifiers on full-scale lubrication system components to prevent formation of solid deposits that can cause clogging. Developed engine mechanical system health management control algorithms for active rotor thrust balancing. Developed suite of technologies for intelligent lube system prognostics and health monitoring, such as integrated debris capture devices, real-time oil debris monitoring, and vibration sensing. Developed lubrication system thermal management technologies for reduced heat generation and improved heat dissipation for efficient turbine engines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.181"
                                            },
                                            "Text": {
                                                "val": "Demonstrate lube system health management control algorithms with full-scale technology readiness level 5 test rig hardware.  Test enhanced ester oils in demonstrator turbine engines. Continue investigating advanced lube system thermal management technologies for fuel efficient turbine engines. Develop new oil traction models and validate experimentally."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.490"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.490"
                                            },
                                            "Text": {
                                                "val": "Finalize transition plans of enhanced ester oil to current and future engines.  Qualify additional enhanced ester oil candidates for field use.  Demonstrate advanced mechanical system health monitoring algorithms on full-scale demonstrator engine.  Continue investigating advanced lube system thermal management technologies for fuel efficient engines.  Incorporate new traction models into bearing heat generation models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bearing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and test advanced bearing material technology and bearing concepts for small, intermediate, and large-sized turbine engine applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.073"
                                            },
                                            "Text": {
                                                "val": "Conducted shakedown tests of active thrust balance rig. Developed and demonstrated robust thrust load sensing devices for highly loaded engine thrust bearings. Developed bearing spall debris monitoring model and limits and incorporated into thrust load control algorithm. Demonstrated oil debris monitoring technology fused with vibration sensing on seeded fault bearing rig tests. Developed new bearing heat generation models for engines and validated with full-scale bearing experimental performance data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.363"
                                            },
                                            "Text": {
                                                "val": "Conduct parametric active thrust control experiments to validate load control algorithms. Conduct seeded fault bearing tests to validate reliable active and autonomous thrust load control. Integrate active thrust control, vibration, and oil debris sensing for complete TRL 5 mechanical system health management system.  Coordinate plans for demonstrating active thrust control system in future TRL 6 engine demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.638"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.638"
                                            },
                                            "Text": {
                                                "val": "Conduct full-scale bearing tests in support of adaptive turbine engines.  Conduct foil bearing rig tests in support of expendable supersonic turbine engine follow-on development.  Develop improved bearing material life model.  Mature autonomous active thrust bearing system.  Finalize transition plans of hybrid ceramic\/metallic bearings into upgrades of current aircraft."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "623066"
                    },
                    "ProjectTitle": {
                        "val": "Turbine Engine Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "70.515"
                        },
                        "CurrentYear": {
                            "val": "102.188"
                        },
                        "BudgetYearOne": {
                            "val": "77.444"
                        },
                        "BudgetYearOneBase": {
                            "val": "77.444"
                        },
                        "BudgetYearTwo": {
                            "val": "52.595"
                        },
                        "BudgetYearThree": {
                            "val": "55.965"
                        },
                        "BudgetYearFour": {
                            "val": "52.887"
                        },
                        "BudgetYearFive": {
                            "val": "52.433"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technology to increase turbine engine operational reliability, durability, mission flexibility, and performance, while reducing weight, fuel consumption, and cost of ownership. Analytical and experimental areas of emphasis are fans and compressors, high temperature combustors, turbines, internal flow systems, controls, augmentor and exhaust systems, integrated power and thermal management systems, engine inlet integration, mechanical systems, adaptive cycle technologies, and structural design. This project develops component technology for an adaptive cycle engine architecture that provides optimized performance\/fuel efficiency for widely varying mission needs. This project supports joint Department of Defense, agency, and industry efforts to focus turbine propulsion technology on national needs. The program plan is relevant across capability areas for global responsive strike, tactical and global mobility, responsive space lift, and persistent intelligence, surveillance, and reconnaissance (ISR)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Turbofan\/Turbojet Engine Core Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop core turbofan\/turbojet engine components (i.e., compressors, combustors, and turbines) for fighters, bombers, sustained supersonic\/hypersonic cruise vehicles, and transports."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "41.133"
                                            },
                                            "Text": {
                                                "val": "Developed modeling and simulation rules and tools for advanced components including advanced interactive cost analysis tools for adaptive core components and unsteady aerodynamics\/aeromechanics models. Conducted bench and rig tests to validate unsteady aerodynamics\/aeromechanics models. Continued rig testing adaptive cycle features, an efficient compressor, an efficient turbine, and an efficient exhaust system. Developed and applied advanced modeling and simulation rules and tools to initiate definition and design of efficient, very high pressure ratio core component technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.578"
                                            },
                                            "Text": {
                                                "val": "Continue to develop modeling and simulation tools for advanced components including coupled aerothermal models and turbine durability design. Continue to conduct bench and rig test using surface mapping thin film temperature gauges. Develop high resolution non-contact stress measurement systems for high frequency response measurement. Demonstrate engine efficiency improvements from active clearance and flow control. Conduct rig testing of high-power low-emission combustion. Develop improved compressor aerodynamic design tools to extend engine operability and efficiency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.125"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.125"
                                            },
                                            "Text": {
                                                "val": "Continue developing modeling and simulation tools for advanced components including coupled aerothermal models; highly loaded, low emissions combustion systems; and turbine durability designs.  Perform structural assessment research of combustor and turbine components operating in a realistic engine environment.  Continue to develop improved compressor aerodynamic design tools to extend engine operability and efficiency.  Initiate conceptual design of efficient, very high pressure ratio core component technologies.  Decrease in FY 2014 due completion ADVENT."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Turbofan\/Turbojet Engine Fan, Low Pressure Turbine, and Integration Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop turbofan\/turbojet engine components (i.e., fans, nozzles, etc.) used in engines for fighters, bombers, sustained supersonic strike and hypersonic cruise vehicles, and transports."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.323"
                                            },
                                            "Text": {
                                                "val": "Developed modeling and simulation rules and tools for advanced components including: advanced interactive cost analysis tools for adaptive engine components; unsteady aerodynamics and aeromechanics models; augmentor combustion processes; and probability-based cooled turbine airfoil high cycle fatigue prediction methods. Conducted bench and rig tests to validate unsteady aerodynamics\/aeromechanics models and probabilistic cooled turbine airfoil high cycle fatigue prediction methods. Developed and validated test protocols and improved augmentor rig test capabilities. Continued rig testing of advanced fan design, advanced low pressure turbine design, and lightweight, simple, low-observable compatible inlet and exhaust systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.672"
                                            },
                                            "Text": {
                                                "val": "Develop modeling and simulation tools including methods to predict behavior of serpentine inlets and nozzles. Demonstrate methods to detect\/predict incipient bearing damage to ensure engine operation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.177"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.177"
                                            },
                                            "Text": {
                                                "val": "Continue to develop modeling and simulation tools including methods to predict behavior of serpentine inlets and nozzles.  Develop modeling and simulation tools to predict fan\/inlet interaction for both podded and embedded propulsion systems.  Develop a probabilistic ignition prediction tool for advanced augmentor design.  Develop models to validate function and durability of high temperature electronics for engine control."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile and Remotely Piloted Aircraft Engine Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop limited life engine components for missile and remotely piloted aircraft (RPA) applications, including long-range supersonic and hypersonic vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.400"
                                            },
                                            "Text": {
                                                "val": "Developed and applied advanced modeling and simulation rules and tools for ceramic material small turbine blades, variable area turbines, and integration\/performance of lubeless bearings. Developed and evaluated components to increase pressure ratio by 50% in this size class with minimum efficiency loss."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.993"
                                            },
                                            "Text": {
                                                "val": "Develop and apply advanced modeling and simulation tools for variable cycle component design, advanced cooling concepts, compact augmentors, and composite structures. Demonstrate advanced designs in rig testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.900"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and apply advanced modeling and simulation tools for variable cycle component design, advanced cooling concepts, compact augmentors, and composite structures.  Continue to demonstrate advanced designs in rig testing.  Develop and validate a test protocol for small engine augmentor designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Turboshaft\/Turboprop and Small Turbofan Engine Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop components for turboshaft\/turboprop and small turbofan engines for trainers, rotorcraft, special operations aircraft, and theater transports."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.659"
                                            },
                                            "Text": {
                                                "val": "Developed and applied advanced modeling and simulation rules and tools for emissions and noise to decrease detection. Developed and evaluated components to increase thrust-to-weight ratio and to decrease specific fuel consumption, production cost, and development cost."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.545"
                                            },
                                            "Text": {
                                                "val": "Develop and apply advanced modeling and simulation tools for advanced cooling concepts, high efficiency gearboxes, and high performance airfoils. Develop advanced vibration and temperature sensors for use in demonstration of engine durability requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.563"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.563"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and apply advanced modeling and simulation tools for advanced cooling concepts, high efficiency gearboxes, and high performance airfoils.  Continue to develop advanced vibration and temperature sensors for use in demonstration of engine durability requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Turbine Engine Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop high performance, durable components which enable adaptive turbine engine technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Initiated multiple analyses and trade studies required to finalize adaptive engine conceptual designs.  The adaptive engine conceptual design goals include 25% reduction in specific fuel consumption and 10% increase in thrust within the weight and unit cost constraints of state-of-the-art fifth generation fighter class engines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "47.400"
                                            },
                                            "Text": {
                                                "val": "Complete adapative engine conceptual designs meeting goals to reduce 25% reduction in specific fuel consumption and 10% increase in thrust over fifth generation fighter class engines with comparable weight and unit cost.  Initiate preliminary designs addressing extensive performance, operability, maintainability, and prognostic health management requirements.  Design and conduct ground rig tests to validate preliminary design technologies and reduce risk for several parts of adaptive engines such as adaptive fans, high pressure compressors, combustors, high and low pressure turbines, mechanical system components, controls and accessories, thermal management subsystems, and three-stream compatible afterburner\/exhaust systems.  Conduct ground rig testing of at least two unique adaptive fan concepts.  Complete the design, procurement, and assembly of hardware for ground rig tests and initiate ground rig tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.679"
                                            },
                                            "Text": {
                                                "val": "Complete detailed design of at least two unique adaptive fan concepts and initiate fabrication of components for ground engine testing.  Continue to conduct ground rig tests to validate preliminary design technologies and reduce risk for several parts adaptive engines.  Transition effort from development to demonstration of parts of adaptive engines."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "623145"
                    },
                    "ProjectTitle": {
                        "val": "Aerospace Power Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "32.066"
                        },
                        "CurrentYear": {
                            "val": "30.061"
                        },
                        "BudgetYearOne": {
                            "val": "26.587"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.587"
                        },
                        "BudgetYearTwo": {
                            "val": "28.717"
                        },
                        "BudgetYearThree": {
                            "val": "29.453"
                        },
                        "BudgetYearFour": {
                            "val": "28.127"
                        },
                        "BudgetYearFive": {
                            "val": "28.679"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops electrical and thermal management technologies for military aerospace applications. Power component technologies are developed to increase reliability, maintainability, commonality, affordability, and supportability of aircraft and flight line equipment. Research is conducted in energy storage and hybrid power system technologies to enable special purpose applications. Electrical power and thermal management technologies enable future military megawatt level power and thermal management needs. This project supports development of electrical power and thermal management component and systems suitable for applications to legacy and future aircraft platforms including strike and mobility concepts. Lightweight power systems suitable for other aerospace applications are also developed."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Power System Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop electrical power and thermal management component and subsystem technologies with low volume displacement for delivery of high power for manned and unmanned systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.258"
                                            },
                                            "Text": {
                                                "val": "Performed tip-to-tail modeling and simulation to identify solutions for platform level power and thermal management needs of next generation military air platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.805"
                                            },
                                            "Text": {
                                                "val": "Complete critical design review of Integrated Vehicle Energy Technology (INVENT) effort to develop adaptive power and thermal management subsystems for next generation military air platforms.  Initiate platform tip-to-tail modeling and simulation energy optimization for potential INVENT integration into current and future fifth generation fighter class aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.587"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.587"
                                            },
                                            "Text": {
                                                "val": "Initiate testing of adaptive power and thermal management subsystems hardware for next generation air platforms in conjunction with continued platform level tip-to-tail modeling and simulation energy optimization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Special Purpose Application Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for special purpose applications, including hybrid electrical power, thermal management systems, and energy conversion\/storage components and subsystems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.808"
                                            },
                                            "Text": {
                                                "val": "Developed fully ruggedized hybrid power subsystems and energy harvesting components. Performed flight tests of these subsystems to demonstrate achievement of power and energy density goals for special purpose applications. Explored technology set for development of power systems for micro air vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.256"
                                            },
                                            "Text": {
                                                "val": "Complete power generation and management advanced technology demonstration to transition to Air Force customer, Air Force Special Operations Command (AFSOC), to provide enhanced capability and endurance for battlefield airmen.  This effort completion and transition incorporates and leverages components developed in prior year activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624847"
                    },
                    "ProjectTitle": {
                        "val": "Rocket Propulsion Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.331"
                        },
                        "CurrentYear": {
                            "val": "55.293"
                        },
                        "BudgetYearOne": {
                            "val": "52.651"
                        },
                        "BudgetYearOneBase": {
                            "val": "52.651"
                        },
                        "BudgetYearTwo": {
                            "val": "52.904"
                        },
                        "BudgetYearThree": {
                            "val": "52.570"
                        },
                        "BudgetYearFour": {
                            "val": "56.535"
                        },
                        "BudgetYearFive": {
                            "val": "57.680"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops rocket propulsion technologies for space access, space maneuver, the sustainment of strategic systems (including solid boost\/missile propulsion, post boost control, aging and surveillance efforts), and tactical missiles. Analytical and experimental areas of emphasis are propellants, propellant management, combustion, rocket material applications, technology for sustainment of strategic systems, and innovative space propulsion concepts. Technologies of interest will improve reliability, performance, survivability, affordability, and environmental compatibility of these systems. Technologies are developed to reduce the weight and cost of components using new materials and improved designs and manufacturing techniques. All efforts in this project contribute to the sustainment of the rocket propulsion industry, providing rocket propulsion technology for the entire DoD. Technologies developed under this program enable capabilities of interest to both DoD and NASA. Efforts include modeling and simulation, proof of concept tests of critical components, advanced component development, and ground-based tests. Aging and surveillance efforts could reduce lifetime prediction uncertainties for individual motors by 50%, enabling motor replacement for cause."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fuel Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, characterize, and test advanced hydrocarbons, energetics, solid propellants, and monopropellants to increase space launch payload capability and refine new synthesis methods."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.943"
                                            },
                                            "Text": {
                                                "val": "Analyzed and tested potential hydrocarbon fuel additives to improve performance of kerosene.  Evaluated scaled-up propellants in advanced combustion devices to determine materials compatibility and performance to include supporting large-scale motor tests.  Explored and developed advanced ionic liquids including synthesis and characterization.  Evaluated suitability for ionic liquid propellants for missile defense  interceptor and spacecraft propulsion demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.035"
                                            },
                                            "Text": {
                                                "val": "Analyze and test new candidates for potential hydrocarbon fuel additives to improve performance of kerosene.  Continue synthesis and downselect process and scale-up of promising high energy-density materials candidates.  Continue to develop methods and additives to reduce fuel coking in rocket engine environments.  Evaluate candidate propellants in advanced combustion devices. Develop and characterize next generation ionic liquids for use in spacecraft and missile defense applications.  Develop scale-up capability for advanced solid propellant ingredients."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.156"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.156"
                                            },
                                            "Text": {
                                                "val": "Evaluate methods for removing components from fuels that adversely affect fuel coking in rocket engine environments.  Evaluate scaled-up propellants in advanced combustion devices to determine materials compatibility and performance to include supporting large-scale motor tests.  Continue development and characterization of next generation ionic liquid propellants for use in spacecraft and missile defense applications.  Complete scale-up capability for advanced solid propellant ingredients.  Evaluate and modify polymeric systems for use in rocket applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Liquid Engine Combustion Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced liquid engine combustion technology for improved performance, while preserving chamber lifetime and reliability needs for engine uses in heavy lift space vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.387"
                                            },
                                            "Text": {
                                                "val": "Evaluated injector performance to ensure chamber\/injector compatibility and prevent damage to engines using sub-scale ground engine demo.  Validated study results in more realistic rocket-chamber conditions and transitioned predictive tools to industry.  Started modification of test cell to allow hot-firing of combustion stability characterizing rig.  Characterized differences between different kerosone rocket fuel batches which impact their coking behavior in a rocket engine.  Evaluated novel nozzle cooling channels for use with hydrocarbon fuels in the high heat flux test rig."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.174"
                                            },
                                            "Text": {
                                                "val": "Begin efforts looking at multi-injector designs and control effectors.  Feed advanced combustion device technology into a hydrocarbon boost demo and to various contractor designs and continue additional analysis on changing designs and concepts.  Develop improved understanding of fundamental combustion and fluid flow\/heat transfer processes leading to new methodologies for thermal management, scaling, and combustion instabilities in hydrocarbon fueled liquid rocket engines, reducing the need for conducting large numbers of costly full-scale component and engine tests.  Evaluate novel nozzle cooling channels for use with hydrocarbon fuels in the high heat flux test rig.  Conduct validation and verification of advanced modeling and simulation capabilities.  Develop understanding of kerosene production to determine what components affect fuel coking and should be removed from the fuel during the production process.  Complete modification of test cell and conduct first hot-fire tests of combustion stability rig."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.709"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.709"
                                            },
                                            "Text": {
                                                "val": "Begin evaluation of injector concepts in hot fire conditions.  Continue efforts looking at multi-injector designs and control effectors.  Complete transition of candidate injector technologies to contractor for use in Hydrocarbon Boost (HCB), a rocket engine ground demonstration.  Continue hot fire tests in combustion stability rig and feed data to HCB to influence supporting design efforts.  Continue characterization of novel cooling channels and transfer info to HCB to influence rocket engine thrust chamber design.  Continue developing understanding of kerosene production, what components affect fuel coking and should be removed from the fuel during the production process.  Continue to evaluate and develop advanced material solutions for high temperature components in rocket engines."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Material Applications"
                                    },
                                    "Description": {
                                        "val": "Develop advanced material applications for lightweight components and material property enhancements for current and future rocket propulsion systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.722"
                                            },
                                            "Text": {
                                                "val": "Developed new material formulations that better address the challenges inside solid rockets.  Continued to characterize and finalize processing parameters of new reinforced high temperature polymers and scale-up processing of carbon-carbon materials.  Refined formulations of polymers for use in various liquid rocket engine components.  Continued to characterize and understand the mechanisms behind a new class of hydrophobic and oleophobic materials exploring various transition opportunities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Support transition efforts of advanced polymers to operational missile systems. Down select to single method of material deposition, characterize and document for follow-on development and future potential acquisition programs. Finish nano-material activities and document."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Liquid Engine Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced liquid engine technologies for improved performance, while increasing life and reliability needs for engine uses in expendable and reusable launch vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.300"
                                            },
                                            "Text": {
                                                "val": "Completed development of engine health monitoring technologies supporting the hydrocarbon boost technology development effort.  Completed development of advanced hydrocarbon engine technologies using fuels other than kerosene, including Methane."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.872"
                                            },
                                            "Text": {
                                                "val": "Develop enabling hydrocarbon boost technology for future spacelift concepts and continue risk reduction activities for the development of hydrocarbon boost technologies.  Develop and demonstrate in-house, moderate scale liquid rocket component testing capability.  Complete gas phase and super critical phase testing capability and begin experiments, which is also work supporting risk reduction in hydrocarbon boost.  Develop high performance compact liquid rocket engine technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.623"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.623"
                                            },
                                            "Text": {
                                                "val": "Continue to develop enabling hydrocarbon boost technology for future spacelift concepts and continue risk reduction activities for the development of hydrocarbon boost technologies (subscale turbopump assembly, thrust chamber assembly.  Continue to develop and demonstrate in-house, moderate scale liquid rocket component testing capability-complete hot fire capability to support risk reduction in hydrocarbon boost technology.  Continue to develop high performance compact liquid rocket engine technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "On-Orbit Propulsion Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop solar electric, solar thermal, chemical, and advanced propulsion technologies for station-keeping, repositioning, and orbit transfer for satellites and satellite constellations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.651"
                                            },
                                            "Text": {
                                                "val": "Characterized advanced plasma thrusters for microsatellite propulsion systems.  Conducted scale-up of advanced monopropellants and evaluated advanced ignition schemes and chamber concepts.  Assessed advanced chemical propulsion technology developments for satellite thrusters and development components.  Developed advanced multi-mode chemical-electric propulsion concepts for satellites and continued component developments.  Developed next generation high power electric spacecraft propulsion.  Performed advanced modeling and simulation tool development to improve design and analysis tools for a wide range of spacecraft propulsion concepts\/technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.330"
                                            },
                                            "Text": {
                                                "val": "Conduct scale-up of advanced monopropellants and evaluate advanced ignition schemes and chamber concepts.  Continue development of next generation high power electric spacecraft propulsion.  Continue advanced modeling and simulation tool developments to improve design and analysis tools for a wide range of spacecraft propulsion concepts\/technologies.  Begin development of new bi-propellant thruster technologies to take advantage of new non-toxic liquid propellants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.409"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.409"
                                            },
                                            "Text": {
                                                "val": "Conduct scale-up of advanced monopropellants and evaluate advanced ignition schemes and chamber concepts.  Continue development of next generation high power electric spacecraft propulsion.  Continue advanced modeling and simulation tool developments to improve design and analysis tools for a wide range of spacecraft propulsion concepts\/technologies, incorporating multi-scale\/multi-physics.  Conduct experiments to understand the physics behind the wide range of spacecraft propulsion concepts\/technologies and accurately model the physics.  Begin transition of new thruster modeling framework to spacecraft industry for use in future designs.  Explore and develop new generation of chemical spacecraft thruster technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Access and Strike Applications"
                                    },
                                    "Description": {
                                        "val": "Develop missile propulsion and boost technologies for space access and strike applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.884"
                                            },
                                            "Text": {
                                                "val": "Tested components as part of risk reduction efforts for future missile propulsion demonstration.  Developed advanced tactical propulsion technologies.  Continued development and evaluation of next generation of updated, physics-based modeling, simulation, and analysis tools for missile propulsion components and applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.476"
                                            },
                                            "Text": {
                                                "val": "Develop advanced tactical propulsion technologies.  Continue development and evaluation of next generation of updated, physics-based modeling, simulation, and analysis tools for missile propulsion components and applications.  Develop advanced component technologies for missile propulsion applications for strategic and strike systems helping to ensure their long-term sustainment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.739"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.739"
                                            },
                                            "Text": {
                                                "val": "Continue to develop advanced tactical propulsion. Continue development and evaluation of next generation of updated, physics-based modeling, simulation, and analysis tools for missile propulsion components and applications.  Continue to develop advanced component technologies for missile propulsion applications for strategic and strike systems helping to ensure their long-term sustainment.  Complete propellant development efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ballistic Missile Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop missile propulsion technologies and aging and surveillance technologies for ballistic missiles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.444"
                                            },
                                            "Text": {
                                                "val": "Conducted sub-scale testing of existing and advanced sensors to be attached to solid rocket motors and tools that can integrate sensor data into existing aging and surveillance tool suite.  Integrated advanced aging and surveillance technologies into demonstrations to validate and verify efforts to reduce uncertainties and accurately model motor behavior.  Applied next generation of chemical and aging mechanism modeling, simulation, and analysis tools, sensor schemes and tools, and non-destructive analysis tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.406"
                                            },
                                            "Text": {
                                                "val": "Conduct sub-scale testing of existing and advanced sensors to be attached to solid rocket motors and tools that can integrate sensor data into existing aging and surveillance tool suite.  Integrate advanced aging and surveillance technologies into demonstrations to validate and verify efforts to reduce uncertainties and accurately model motor behavior.  Continue to apply next generation of chemical and aging mechanism modeling, simulation, and analysis tools, sensor schemes and tools, and non-destructive analysis tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.015"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.015"
                                            },
                                            "Text": {
                                                "val": "Conduct sub-scale testing of existing and advanced sensors to be attached to solid rocket motors and tools that can integrate sensor data into existing aging and surveillance tool suite.  Continue integration of advanced aging and surveillance technologies into demonstrations to validate and verify efforts to reduce uncertainties and accurately model motor behavior.  Apply next generation of chemical and aging mechanism modeling, simulation, and analysis tools, sensor schemes and tools, and non-destructive analysis tools.  Complete data management system used to track and correlate aging and surveillance data for individual missiles."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625330"
                    },
                    "ProjectTitle": {
                        "val": "Aerospace Fuel Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.130"
                        },
                        "CurrentYear": {
                            "val": "5.494"
                        },
                        "BudgetYearOne": {
                            "val": "5.325"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.325"
                        },
                        "BudgetYearTwo": {
                            "val": "5.142"
                        },
                        "BudgetYearThree": {
                            "val": "5.164"
                        },
                        "BudgetYearFour": {
                            "val": "5.254"
                        },
                        "BudgetYearFive": {
                            "val": "5.358"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project evaluates hydrocarbon-based fuels for legacy and advanced turbine engines, scramjets, pulse detonation and combined cycle engines. This project also considers fuel related concepts that can increase turbine engine operational reliability, durability, mission flexibility, energy efficiency, and performance while reducing weight, fuel consumption, and cost of ownership. Applications include missiles, aircraft, sustained high-speed vehicles, and responsive space launch. Analytical and experimental areas of emphasis include evaluations of fuel properties and characteristics of alternative fuels developed from unconventional sources (such as coal, natural gas, biomass, and combinations thereof), unique\/alternate fuels and components used in integrated thermal and energy management systems including high heat sink fuel capability, fuels logistics and associated vulnerabilities, and combustion diagnostics and engine emissions measurements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Alternative Fuels"
                                    },
                                    "Description": {
                                        "val": "Conduct evaluations and perform technical assessments of alternative hydrocarbon fuels derived from coal, natural gas, and biomass for use in legacy and advanced aerospace systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.042"
                                            },
                                            "Text": {
                                                "val": "Developed link between fully-synthetic fuel composition and basic physical properties and rig test performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation of industry-submitted alternative fuel samples.  Tri-service coordinated efforts focus on hydrocarbon composition, jet-in-diesel performance, bulk modulus, and stability during long-term military storage\/handling."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.372"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.372"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation of cellulosic aviation biofuels, focusing on potential fuels capable of being used at a 100% pure state rather than blends."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Thermal and Energy Management"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced components and conduct performance assessments of advanced aircraft integrated thermal and energy management systems for engines and aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.088"
                                            },
                                            "Text": {
                                                "val": "Assessed advanced catalyst approaches to enhancing heat sink in hydrocarbon-based endothermic fuels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Text": {
                                                "val": "Evaluate alternative fuel compositions to increase life and heat sink in hydrocarbon-based endothermic fuels, using reduced-scale rigs to simulate engine-scale fuel system conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.045"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.045"
                                            },
                                            "Text": {
                                                "val": "Develop advanced producible endothermic fuel composition with enhanced heat sink and life to support medium-scale scramjet engine demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuel Logistics"
                                    },
                                    "Description": {
                                        "val": "Study and evaluate low-cost approaches to reduce fuel logistics footprint to reduce cost. Study fuel logistics vulnerabilities and develop detection and mitigation technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Developed biological growth mitigation approaches for commercial jet fuels in support of Air Force effort to implement commercial off-the-shelf jet fuels. Evaluated approaches for portable hydrogen generation to support emergency field power generation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Assess impact of conversion to commercial jet fuel (without military jet fuel additives) on biological growth in base fuel systems.  Evaluate cross-section of Jet A fuels using advanced instrumentation to develop chemical composition information to link to fuel properties and performance to support Jet A conversion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.958"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.958"
                                            },
                                            "Text": {
                                                "val": "Develop composition-to-performance link and models for Jet A fuels for physical properties."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Emissions"
                                    },
                                    "Description": {
                                        "val": "Develop and test advanced emissions diagnostic techniques for airbreathing propulsion systems. Conduct evaluations of the combustion and emissions characteristics of aviation fuels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Implemented advanced particulate diagnostics in high-pressure combustor test rig. Assessed emissions from fully-synthetic fuels relative to JP-8 and JP-8\/synthetic blends."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.894"
                                            },
                                            "Text": {
                                                "val": "Develop methodology to assess operability of fuels in high pressure combustor rig."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.950"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.950"
                                            },
                                            "Text": {
                                                "val": "Evaluate combustor operability of narrow-boiling and high\/low cetane alternative fuels as well as fully-synthetic fuels."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}