{
    "id": "7fd1d966a414cc183b9ab752ac4456ca3581cd2e",
    "meta": {
        "filename": "dod-2014_RDTE_2014_NAVY_BA1_3_RDTE_MasterJustificationBook_Navy_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Navy_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605873M"
        },
        "ProgramElementTitle": {
            "val": "Marine Corps Program Wide Supt"
        },
        "R1LineItemNumber": {
            "val": "155"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "26.303"
            },
            "CurrentYear": {
                "val": "18.490"
            },
            "BudgetYearOne": {
                "val": "24.082"
            },
            "BudgetYearOneBase": {
                "val": "24.082"
            },
            "BudgetYearTwo": {
                "val": "23.716"
            },
            "BudgetYearThree": {
                "val": "24.824"
            },
            "BudgetYearFour": {
                "val": "25.997"
            },
            "BudgetYearFive": {
                "val": "26.486"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) provides the analytical foundation for the Marine Corps Studies System (MCSS), including mandated Mission Area Analyses and Cost and Operational Effectiveness Analyses. The MCSS is the front end of the Marine Corps' acquisition system.  This PE also supports the material acquisition process as follows: managing the Marine Corps Operational Test and Evaluations (OT&E); providing Chem Bio Consequence Management of capabilites for Weapons of Mass Destruction (WMD) incident response forces; and conducting Phase A activities to investigate potential material solutions that validate needs, program costs, business decisions, and prevent undue delays in pursuing priority requirements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.538"
                },
                "CurrentYear": {
                    "val": "18.490"
                },
                "BudgetYearOne": {
                    "val": "19.453"
                },
                "BudgetYearOneBase": {
                    "val": "19.453"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "26.303"
                },
                "CurrentYear": {
                    "val": "18.490"
                },
                "BudgetYearOne": {
                    "val": "24.082"
                },
                "BudgetYearOneBase": {
                    "val": "24.082"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.765"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.629"
                },
                "BudgetYearOneBase": {
                    "val": "4.629"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.264"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.499"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.667"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.667"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.038"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.038"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY14 increase in funding supports the MCOTEA Enhancement and reflects compliance with OFPP Policy Letter 11-01 by preserving inherently governmental and critical OT&E capability."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0030"
                    },
                    "ProjectTitle": {
                        "val": "Studies & Analysis\/MC"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.457"
                        },
                        "CurrentYear": {
                            "val": "5.487"
                        },
                        "BudgetYearOne": {
                            "val": "6.057"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.057"
                        },
                        "BudgetYearTwo": {
                            "val": "6.672"
                        },
                        "BudgetYearThree": {
                            "val": "7.313"
                        },
                        "BudgetYearFour": {
                            "val": "7.991"
                        },
                        "BudgetYearFive": {
                            "val": "8.134"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Marine Corps Studies System (MCSS) provides oversight on all matters pertaining to studies and operations anaylsis, to include the Quarterly Call for Studies. This includes the nomination process, approval and prioritization, respository maintenance, and announcement of approved studies for execution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Studies & Analysis\/MC"
                                    },
                                    "Description": {
                                        "val": "As established and directed under Marine Corps Order 3902.1D, the Marine Corps Studies System (MCSS),assigned solely to Operations Analysis Division (OAD), Marine Corps Combat Development Command, provides research and analyses to ensure a greater understanding of issues and alternatives concerning organizations, tactics, doctrine, policies, force plans, strategies, procedures, intelligence, weapon selection, systems' programs and resource allocation. In the MCSS, these topics are treated in both the Service and Joint contexts. Using the MCSS, the Marine Corps nominates, approves, commences, manages and distributes the resultant analytical products. MCSS study and analysis nominations are evaluated and selected on a quarterly basis. Research conducted produces comprehensive and integrated analyses aligned to Senior Leadership's requirements and decision timelines.  A 'call' for studies occurs quarterly and is targeted to a particular audience that understands USMC current and future mission requirements and the need for the comprehensive analyses that meets the Commandant's Strategic Goals, saves lives, and utilizes funds efficiently."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.457"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "* Naval Engineering Capacity to Support Marine Corps Operations: Research quantified the current capacity and requirements of Naval engineering support to Marine Air Ground Task Force (MAGTF) operations along with future capacity requirements through 2025.  Identified the complementary capabilities, gaps, and perceived redundancies of Naval engineering capacity to support current Marine Corps operations through 2025 and provided alternative solutions that shape Naval engineering capacity to support MAGTF operations from the present state through 2025.\n\n* Electronic Warfare Manpower Capability Analysis: Analyzed Electronic Warfare (EW) manpower, force structure, and training for both officer and enlisted Military Occupatiuonal Specialties (MOSs) to recommend the best alternatives for the distributed capabilities envisioned in the MAGTF Electronic Warfare Concept of Operations, to include: how to maintain aviation EW expertise within the MAGTF with elimination of the Electronic Countermeasures Officer (ECMO) MOS with the VMAQ squadrons; identify need to modify existing MOSs or creating new ones; assess the mix of officer and enlisted billets within the force structure across EW-related MOSs, and recommend force structure changes to VMU squadrons, providing a viable transition plan prior to VMAQ deactivation.\n\n* Marine Corps Expeditionary Energy Modeling and Simulation Analysis Support: This effort entails the development of a comprehensive Modeling and Simulation framework to support the goals of the USMC Expeditionary Energy Strategy, mapping to the priorities set by the Expeditionary Energy Water Waste (E2W2) Capabilities Based Assessment\/Initial Capabilities Document (CBA\/ICD), and future Program Objective Memoranda (POM) investment plan.\n\n* Deployment to Dwell Measurement Study: Provides the Commandant of the Marine Corps an accurate tool for measuring deployment-to-dwell ratios for USMC aviation units and aides in the determination of force allocations in response to requests for USMC forces by the Joint Staff and the Secretary of Defense. This tool would be useful to the Deputy Commandant (DC) for Aviation; DC Manpower and Reserve Affairs; DC Plans, Policies and Operations; DC Installations and Logistics; DC Programs and Resources; Commander, US Marine Corps Forces Command; Commander, US Marine Corps Forces Pacific Command and Commander, US Marine Corps Forces Reserve Command. Results would likely be briefed to the Marine Air Board and Commandant's Executive Offsite.  \n\n* Prepositioning Capabilities Based Assessment (CBA) (PHASE I): Phase co-sponsored by Combat Development and Integration, Seabasing Integration Division (CD&I, SID) and PP&O, Expeditionary Policies Branch (POE) identifies USMC capabilities and gaps for ashore and afloat prepositioning. Conducts a prepositioning CBA to develop a balanced prepositioning strategy that integrates maritime, ashore, CONUS, and OCONUS prepositioning capabilities for deployment and employment of scalable Naval Forces in support of projected COCOM requirements.\n\n* Joint Advanced Weapons Sensor System (JAWSS): In conjunction with Naval Surface Warfare Center Dahlgren, develop capabilities that would enable the Joint Integrated Product Team (JIPT) to identify critical technologies for future semi-autonomous weapons and sensor systems. With Modeling and Simulation (M&S) support the JIPT will be able to model the effects of conceptual weapons and sensor systems interaction with mature systems based on mission profiles and physical parameters.   \n\n* Force Structure Review Group (FSRG) Force Reduction Analysis: Thoroughly analyzes the Marine Corps' FSRG concentration on blueprinting an analytical framework to support future FSRG processes and events.\n\n* Support Combat Development and Intergration (CD&I) Analysis of Alternatives (AoA) for the Amphibious Combat Vehicle (ACV): Work with CD&I Analysis on acceptable data subrogation of the 4 task Vehicle-Weapon-Ammunition Pairings conducting accuracy analysis; document accuracy analysis; conduct Lethality & Effectiveness Analysis for 5 Targets.\n\n* COMBAT XXI: A high-resolution analytic combat simulation that has been co-developed by Marine Corps Combat Development Center (MCCDC) and White Sands Missile Range (TRAC-WSMR). The combined arms simulation represents individual entities (i.e., vehicles, aircraft, riflemen, etc.) at the tactical-level of operations up to reinforced battalion sized units. COMBAT XXI offers the capabilities of modeling amphibious operations and supporting detailed sensor-to-shooter analyses to include direct and indirect fires as well as critical Command, Control, Communications, and Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) links. Capability has been demonstrated by TRAC in several studies (e.g., JLTV AoA, GCV AoA) and recently by OAD in support of the Amphibious Combat Vehicle (ACV) Systems Engineering OPT. The Operations Analysis Division (OAD) has been tasked to conduct the ACV AoA, and COMBAT XXI will be one of the primary tools supporting the analysis. This will require extensive modification of existing scenarios and the development of at least one new scenario. Work will also serve to promote the special relationship between Naval Surface Warfare Center - Dahlgren Division (NSWCDD) and MCCDC as co-developers of the analysis.\n\n* Anti-Armor Mix Analyis: Determines what anti-armor capabilities are required in the Ground Combat Element (GCE) and the infantry battalion; determines if the current doctrine (Heavy Anti-tank Weapon [HAW], Medium Anti-tank Weapon [MAW], and Light Anti-tank Weapon [LAW]) sufficiently addresses the current and future threat and; identifies the current mix of the Marine Corps' anti-armor systems, and the most efficient and\/or cost-effective mix.\n\n* Cannon Cluster Munitions Capability Gap and Requirements Analysis: Effort leverages the data that compared the current M483A1\/M864 lethality models with the updated M795 High Explosive (HE) and M549A1 Rocket Assisted Projectile (RAP) lethality models. Phase I will be co-sponsored by Combat Development and Integration, Seabasing Integration Division (CD&I, SID) and PP&O, Expeditionary Policies Branch (POE) to identify USMC capabilities and gaps for ashore and afloat prepositioning. Phase II will be co-sponsored as appropriate by USMC and USN.\n\n* Synthetic Theater Operations Research Model (STORM): STORM emerging as important campaign-level analysis model for Joint Analysis community. Attrition Calibration\/Combat Sample Generator (ATCAL\/COSAGE). Design and implement improvements to the COSAGE model improving overall representation of ground combat in joint, combined arms environment.\n\n* Attrition Calibration\/Combat Sample Generator (ATCAL\/COSAGE): Design and implement improvements to the COSAGE model improving overall representation of ground combat in joint, combined arms environment. \n\n* Force Mobility Analysis Support Tool (FMAST V): Commandant chartered a Force Structure Review Group (FSRG) to examine organization, training, and equipping issues associated with task force organization in global security arena. \n\n* Improvised Explosive Device (IED) Detection and Prevention Tool (IDAPT): Develop a multi-attribute decision model to evaluate mixes of infantry anti-armor weapons for both state-on-state warfare (typified by a significant armored threat) and hybrid conflicts (typified by a negligible armored threat).\n\n* The Ground Based Air Defense (GBAD) Weapon System Validation Analysis: Low altitude air defense capability for MAGTF, replacing the Stinger Missile System and capable of neutralizing UAVs with a secondary capability against cruise missiles (CMs) and manned rotary and fixed wing aircraft.  \n\n* Persistent Intelligence, Surveillance, and Reconnaissance Sensing Investment\/Divestment Strategy (PISR): Facilitate the ongoing PISR and follow-on requirements documentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.487"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In Progress: Research and analysis studies based on USMC requirements and directed by Assistant Commandant, Marine Corps. Initiate the high priority studies and analyses projects approved in the FY2012 - FY2013 Marine Corps Studies System Master Plan (MCSSMP).\n\n* Prepositioning Capabilities Based Assessment Phase II: Conducting a prepositioning Capabilities Based Assessment (CBA) to develop a balanced prepositioning strategy that integrates maritime, ashore, CONUS, and OCONUS prepositioning capabilities for deployment and employment of scalable Naval Forces in support of projected COCOM requirements. \n\n* Amphibious Combat Vehicle Analysis of Alternatives (AoA) Plan: The AoA conducted per study guidance issued by OSD,CAPE on 19 September 2011. Evaluates operational effectiveness, cost, and risks of the proposed ACV platforms in filling the capability gaps identified in ACV ICD. Highlights relationships of life-cycle costs, risks, and performance for each alternative and produces comprehensive and substantiated results for comparing alternatives. \n\n* Ground\/Air Task Oriented Radar (G\/ATOR) Key Performance Parameter Validation Analysis: Address gaps in the AN\/TPS-80 G\/ATOR mobile radar system. Analyze results of fusing 2 programs: the Multi-Role Radar System (MRRS), and Ground Weapons Locator Radar (GWLR) requirements. \n\n* Naval Surface Fire Support: Analyze potential naval weapons such as the Extended Range Guided Munitions System, an anti-armor version of the Tomahawk cruise missile, and a naval version of the Army Tactical Missile System impact on significant capabilities to joint fire support. The extended ranges of these weapons will reach beyond the traditional or doctrinal Amphibious Operating Area across the boundaries of the Joint Force Land Component Commander.\n\n* Amphibious Shipping Availability Risk Assessment: Maturing Marine Corps and amphibious capabilities to the operating demands of 21st century warfighting by research and analysis of the threats it will likely face. While future threats are inherently unpredictable, some emerging trends are clearly discernable.\n\n* Multi-Functional Operations Center (MFOC) Study: Determine impact of internal fluctuations in MACCS systems' (particularly CAC2S, GATOR, CTN, and GBAD) functionality, AC2 CONOPs, Tactics, Techniques, and Procedures (TTPs), and Ground Combat Element and Logistics Combat Element missions, organizations, systems, CONOPs, Tactics delivery schedule that would impact the assumptions used to create the supporting DODAF architecture products.  \n\n* Depot Level Maintenance in Enabling Marine Corps Warfighting Capabilities (Phase III): Develops a standard scientific and quantifiable methodology applied periodically via a modeling tool, to collect and analyze depot maintenance requirements, production and cost data and assess the benefits of depot maintenance within the context of deployable operational force modules directly relatable to Marine Corps Title X and MCSCP requirements. The information should be focused on needs specific to the Marine Corps operational capability. This study should encompass the Marine Corps Ground Equipment Set which is made up of approximately 300 principle end items (PEI).  \n\n* Occupational Field 59XX Avaiation Command and Control (C2) Electronics Maintenance Manpower and Personnel Assessment: Review options to mitigate any manpower shortfalls through: changes in T\/O structure; re-alignment of MOS tasks; and recommendations for compensated or uncompensated MOS structure changes. The study evaluates, reviews and allocates current tables of organization (T\/O) structure with proposed AC2 Family of Systems (FoS) approved acquisition objectives (AAO). \n\n* The following research and analysis requirements are under development with sponsorship:\n\n    A.  ANALYSIS OF TACTICAL MILITARY SOURCE OPERATIONS IN SUPPORT OF OND\/OEF (HQMC, IOC)\n    B.  ASSESSING THE EFFECTIVENESS OF THE MARINE CORPS MARTIAL ARTS PROGRAM ON UNIT PERFORMANCE (CG,TECOM)\n    C.  CONNECTOR CAPABILITIES STUDY (DC, CDI)\n    D.  MAGTF AIR COMMAND AND CONTROL \/ RANGE ALTITUDE REQUIREMENT STUDY (DC, CDI)\n    E.  MPC REQUIREMENTS SENSITIVITY ANALYSIS (DC, CDI)\n    F.  MTVR TRAILER MODULAR DESIGN CONCEPT ANALYSIS (DC, CDI)\n    G.  OPTIMIZATION OF COMMUNICATION NODES IN REGIONAL COMMAND SOUTH WEST (HQMC, MCIOC)\n    H.  RIGHT SIZING THE MARINE CORPS' MANPOWER COSTS (DC, MRA)\n    I.  VMU AND MAGTF ELECTRONIC WARFARE (DC, AVN)\n    J.  USMC ENGAGEMENT STRATEGY WITH MOROCCO (USAFRICOM) \n    K.  TANGIBLE RESULTS OF USMC PHASE ZERO ACTIVITIES (CG, II MEF)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.057"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.057"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue efforts such as: Joint External Analysis Analytical Support Contract; Synthetic Theater Operations Research Model (STORM); Planned Attrition Calibration\/Combat Sample Generator (PACCAL\/COSAGE); Force Mobility Analysis Support Tool (FMAST V); COMBAT XXI: MCCDC Behavior Development and Technical Support; and Persistent Intelligence, Surveillance, and Reconnaissance Sensing Investment\/Divestment Strategy (PISR). Support studies and analyses approved for execution in annual Marine Corps Studies System Master Plan (MCSSMP) includes: mandated Mission Area Analyses (MAAs), Milestone A, and Pre-Milestone A (Conceptual) Analysis of Alternatives (AoAs), technology assessments, force structure analysis, weapons systems analysis, concept development and analysis, logistics, feasibility and cost benefits, training assessments, and scenario development. Support Marine Corps Logistics, the Expeditionary Force Development System (EFDS), and Combat Development Process (CDP). Mission Area Analyses (MAA) provides quantitative and qualitative information utilized by decision makers to initiate improvements in operational concepts, doctrine, force structure, education, training, and procurement."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Provide analytical documentation and support to decision makers for resolution of current and future issues identified by operating forces. Utilize Marine Corps University and Naval Post Graduate School to conduct studies and analysis projects in basic and applied research and advanced technology development. Provide funds to the Naval Sea Systems Command (NAVSEA) for direct support, technical analyses, and liaison services to assure a sound bridge between the Marine Corps' role in defining Expeditionary Warfare Specialist (EXW)\/Seabasing requirements and the SEA 05 role for Future Concepts and Ships Designs for amphibious ships\/aircraft, Maritime Prepositioning Force (Future)(MPF (F)), High Speed Connectors, and related systems. Space and Naval Warfare Systems Center (SPAWAR) funded to support Naval Assessment Program to modify and upgrade all DoN war fighting, crisis response and support capabilities and vulnerabilities and provide baseline of future capabilities. Baseline analysis supports Mission Capability Packages (MCPs), Investment Strategy, Joint Capability Areas (JCAs), and the Naval Strategic Plan providing the DoN assessments for future force development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0033"
                    },
                    "ProjectTitle": {
                        "val": "OT&E Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "7.789"
                        },
                        "CurrentYear": {
                            "val": "8.378"
                        },
                        "BudgetYearOne": {
                            "val": "11.720"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.720"
                        },
                        "BudgetYearTwo": {
                            "val": "12.021"
                        },
                        "BudgetYearThree": {
                            "val": "12.291"
                        },
                        "BudgetYearFour": {
                            "val": "12.570"
                        },
                        "BudgetYearFive": {
                            "val": "12.820"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Marine Corps Operational Test and Evaluation Activity (MCOTEA) supports the material acquisition process by managing the Marine Corps Operational Test (OT) programs for Acquisition Categories (ACAT) I through ACAT IV (less OT of manned aircraft) and performs other functions that may be directed by the Commandant of the Marine Corps. The primary purpose of Operational Test and Evaluation (OT&E) is to provide information to the Milestone Decision Authority (MDA) regarding the Operational Effectiveness (OE) and Operational Suitability (OS) of the system addressed at a decision point. MCOTEA must ensure that the Marines in the Operating Forces receive the very best possible equipment and support. MCOTEA must also ensure each system proposed for acquisition is tested adequately, evaluated objectively and reported independently.\n\nMarine Corps Operational Test and Evaluation Activity (MCOTEA) is the only unit that provides the Marine Corps with required operational test and evaluation (OT&E) capability, ensuring the Marine Corps is compliant with laws and regulations, and ensuring that training and equipment are operationally effective, relevant, and suitable. Additionally, MCOTEA's early involvement, coordination, and oversight in developmental testing and evaluation of new combat and combat support systems ensures that our Marines are the best trained, and have the best equipment, with the lowest test costs for taxpayers. Finally, MCOTEA's support of rapid acquisitions ensures that Marines in the fight are supported with the newest and most advanced equipment and that the Marine Corps is compliant with regulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MCOTEA"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.279"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "MCOTEA evaluated, quantified, and reported the operational effectiveness, suitability, and survivability of acquisitions to meet warfighter capabilities and will be providing Milestone Decision Authority (MDAs) (a comprehensive understanding of operational risk associated with ACAT programs). Competed an internal realignment of non-core to core in order to achieve compliance with Office of Federal Procurement Policy (OFPP) Policy Letter 11-01."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.378"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "MCOTEA will be evaluating, quantifiying, and reporting the operational effectiveness, suitability, and survivability of planned acquisitions to meet warfighter capabilities and will be providing Milestone Decision Authority (MDAs) (a comprehensive understanding of operational risk associated with ACAT programs)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.555"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.555"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "MCOTEA will evaluate, quantifiy, and report the operational effectiveness, suitability, and survivability of planned acquisitions to meet warfighter capabilities and will be providing Milestone Decision Authority (MDAs) (a comprehensive understanding of operational risk associated with ACAT programs)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MCOTEA ENHANCEMENT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.510"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implemented internal professional staff test and evaluation capability upgrades with advanced training in special testing methodologies. This increases the critical in-house capability to determine unique testing sciences and evaluation methodolgies needed for efficacy in tests and evaluations of urgent in-theater capabilites. Some examples are specialized day and night optics technologies; and specialized electronic tests for communications and computer applications in command and control areas. MCOTEA's support of rapid acquisitions ensures that Marines in the fight are supported with the newest and most advanced equipment and that the Marine Corps is compliant with regulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.165"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.165"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enhancement reflects compliance with Office of Federal Procurement (OFPP) Policy Letter 11-01 by preserving inherently governmental and critical Operational Test & Evaluation (OT&E) capability. This enhancement also captures a significant portion of direct OT&E costs which were previously reflected in program exhibits. As a result, program offices will avoid a significant portion of these direct OT&E costs through the FYDP."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2330"
                    },
                    "ProjectTitle": {
                        "val": "Chem Bio Consequence Mgmt"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "7.795"
                        },
                        "CurrentYear": {
                            "val": "1.064"
                        },
                        "BudgetYearOne": {
                            "val": "2.660"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.660"
                        },
                        "BudgetYearTwo": {
                            "val": "1.292"
                        },
                        "BudgetYearThree": {
                            "val": "1.423"
                        },
                        "BudgetYearFour": {
                            "val": "1.568"
                        },
                        "BudgetYearFive": {
                            "val": "1.595"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Family of Incident Response Systems (FIRS) consists of equipment, systems, and services designed to provide Weapons of Mass Destruction (WMD) incident response forces the capabilities needed to effectively respond to a terrorist attack using Chemical, Biological, Radiological, Nuclear, and High-Yield Explosives (CBRNE). FIRS meets the mission requirements for the detection; mass casualty decontamination; force protection; responder inter-agency interoperability; C4I; urban search and rescue; medical and general support requirements needed by these forces to mitigate the effects of a CBRNE terrorist attack. FIRS relies primarily on Commercial Off-The-Shelf\/Non-Developmental Items (COTS\/NDI) equipment and systems that meet the particular mission requirements of Consequence Management (CM). Nuclear, Biological, and Chemical (NBC) systems are adopted if they meet the CM mission requirements. FIRS R&D effort allows the program to keep abreast of emerging technologies in the commercial sector and address operational capability gaps that cannot be met by commercial items."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "FIRS: Reconnaissance Mission Area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.780"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FIRS: Reconnaissance Mission Area accomplishments include: 1) completed the development and testing of the Chemical Biological Incident Response Force (CBIRF) Standoff Chemical Agent Detector (SCAD); 2) began to field test the person portable Gas Chromatograph Mass Spectrometer (GC\/MS)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.511"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FIRS: Reconnaissance Mission Area includes: 1) complete field testing the person portable GC\/MS; 2) begin to field test the orthogonal detector."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.121"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.121"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FIRS: Reconnaissance Mission Area includes plans to begin testing next generation area detection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4I Mission Area"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.059"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.059"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FIRS: C4I Mission Area will begin upgrading the Unified Command Suite to Variant 2."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIRS: Force Protection Mission Area"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.015"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FIRS: Force Protection Mission Area included: 1) completed testing and certification of the next generation Improved Chemical Garment NFPA Class 2; 2) completed the testing of a new breathable lightweight chemical biological protective undergarment to NFPA Class 3; 3) completed testing of the universal hose connection between the M53 mask and COTS existing commercial Powered Air Purifying Respirators; 4) began development of a new positive\/negative pressure adaptable mask (XM55)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.553"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FIRS: Force Protection Mission Area includes: 1) complete the development of the new positive\/negative pressure adaptable mask (XM55); 2) begin testing new chemical, biological glove."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FIRS: Force Protection Mission Area includes: 1) begin the testing of the new positive\/negative pressure adaptable mask (XM55); 2) begin the testing of commercially available Self-Contained Breathing Apparatus (SCBA); 3) begin testing of new NFPA Class 1 ensemble; 4) complete testing of new chemical, biological glove."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2930"
                    },
                    "ProjectTitle": {
                        "val": "Phase 0 Activities"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.262"
                        },
                        "CurrentYear": {
                            "val": "3.561"
                        },
                        "BudgetYearOne": {
                            "val": "3.645"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.645"
                        },
                        "BudgetYearTwo": {
                            "val": "3.731"
                        },
                        "BudgetYearThree": {
                            "val": "3.797"
                        },
                        "BudgetYearFour": {
                            "val": "3.868"
                        },
                        "BudgetYearFive": {
                            "val": "3.937"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Phase A (previously known as Phase 0) Activities consist of a series of interrelated activities of the acquisition process designed to investigate potential material solutions to validate needs, estimate program costs, support sound business decisions, correct inherent disconnects between the Programming, Planning, Budgeting and Execution (PPBE) cycle, the Combat Development and Acquisition Management Systems, and prevent undue delays in pursuing priority requirements. The process supports Commanding General (CG), MCCDC and Commander, Marine Corps Systems Command (COMMARCORSYSCOM) by providing funding to priority programs, thus allowing for the examination of concepts and alternatives to support an orderly transition from requirements to initiatives and initiatives to funded programs. This will permit the POM process to focus on activities of evaluating, prioritizing and integrating rather than defining and resolving raw, immature requirements.  \n\nPhase A activities \"jump start\" high priority programs of the acquisition process. Furthermore, since 70% of a program's life cycle cost is determined during Phase A, this initiative puts resources to work where the return on investment is the greatest. Typical studies conducted on Phase A activities include, but are not limited to Market Surveys, Business Case Analysis (BCA), Cost as an Independent Variable (CAIV) analysis, Life Cycle Cost Estimates, Cost Comparison Analysis, Acquisition Strategies, and Trade-off Analysis in lieu of an Analysis of Alternatives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "*Phase A Activities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.262"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Phase A Activities - Initiated, assisted and completed Phase A activities of high priority programs during their concept refinement and in some cases their technology development phases in the areas of Business Case Analysis, Trade Studies, Economic Analysis, Life Cycle Cost Estimates and Market Research Studies in support of the following efforts: Networking On-The-Move, Targeting Studies and Analysis, Tank Reset and Sustainment, AAVC7, Autonomic Logistics, Visual Info Systems and Medium Tactical Replacement Vehicle configuration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.561"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Phase A Activities - Initiate, assist and complete Phase A activities of high priority programs during their concept refinement and in some cases their technology development phases in the areas of Business Case Analysis, Trade Studies, Economic Analysis, Life Cycle Cost Estimates and Market Research Studies in support of, but not limited to, the following efforts: Combat Operations Center (COC) and COC Green Initiatives, Networking On-The-Move, Low Altitude Air Defense Integrated Picture, Data Fusion and Dissemination, HMMWV Survivability, Logistics Support Tools, Next Generation Automated Test System, and Command and Control Airborne."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.645"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.645"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Phase A Activities - Initiate, assist and complete Phase A activities of high priority programs during their concept refinement and in some cases their technology development phase in the areas of Business Case Analysis, Trade Studies, Economic Analysis, Life Cycle Cost Estimates and Market Research Studies in support of, but not limited to, the following efforts: Remote Video Viewing; Ground Force Robotics; Electronics Maintenance Support; Alternative Armor for Joint Weight Tactical Vehicle and Medium Fleet Transport; and Joint Battle Command and Control."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}