{
    "id": "800fc9a1d89b1993a09dce4e2da6b4104da05edf",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602623A"
        },
        "ProgramElementTitle": {
            "val": "JOINT SERVICE SMALL ARMS PROGRAM"
        },
        "R1LineItemNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.010"
            },
            "CurrentYear": {
                "val": "7.169"
            },
            "BudgetYearOne": {
                "val": "7.818"
            },
            "BudgetYearOneBase": {
                "val": "7.818"
            },
            "BudgetYearTwo": {
                "val": "8.969"
            },
            "BudgetYearThree": {
                "val": "9.114"
            },
            "BudgetYearFour": {
                "val": "9.267"
            },
            "BudgetYearFive": {
                "val": "9.434"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates designs and evaluates individual and crew-served weapon technologies that enhance the fighting capabilities and survivability of the dismounted Warfighter in support of all the Services. All work is done under the Joint Service Small Arms Program (JSSAP) (Project H21) and are based upon the Joint Service Small Arms Master Plan (JSSAMP) and the Joint Capabilities Integration Development System's Small Arms Analyses.\n \nWork in this PE is related to, and fully coordinated with, efforts in PE 061102A (Defense Research Sciences),PE 0602624A (Weapons and Munitions Technology), PE 0603607A (Joint Service Small Arms Program), and PE 0603827A (Soldier Systems-Advanced Development).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.   \n \nThis program is managed by the US Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ in collaboration with the Army Research Laboratory (ARL) at Aberdeen proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.231"
                },
                "CurrentYear": {
                    "val": "7.169"
                },
                "BudgetYearOne": {
                    "val": "7.818"
                },
                "BudgetYearOneBase": {
                    "val": "7.818"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.010"
                },
                "CurrentYear": {
                    "val": "7.169"
                },
                "BudgetYearOne": {
                    "val": "7.818"
                },
                "BudgetYearOneBase": {
                    "val": "7.818"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.221"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.221"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H21"
                    },
                    "ProjectTitle": {
                        "val": "JT SVC SA PROG (JSSAP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.010"
                        },
                        "CurrentYear": {
                            "val": "7.169"
                        },
                        "BudgetYearOne": {
                            "val": "7.818"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.818"
                        },
                        "BudgetYearTwo": {
                            "val": "8.969"
                        },
                        "BudgetYearThree": {
                            "val": "9.114"
                        },
                        "BudgetYearFour": {
                            "val": "9.267"
                        },
                        "BudgetYearFive": {
                            "val": "9.434"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates designs and evaluates individual and crew-served weapon component technologies that enable increased lethality for survivability of the dismounted Warfighter in all the Services. All efforts are based upon the Joint Service Small Arms Master Plan (JSSAMP) and the Joint Capabilities Integration Development System's Small Arms Analyses.\n\nEfforts in this program element support the Soldier Science and Technology portfolio\n\nWork in this project is related to, and fully coordinated with, efforts in PE 0602624A (Weapons and Munitions Technology) and PE 0603607A (Joint Service Small Arms Program) and PE 0602786A (Warfighter Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Small Unit (Squad) Small Arms Technology Concepts"
                                    },
                                    "Description": {
                                        "val": "This effort was originally titled JSSAP Mini Grand Challenge.  It addresses future small arms technology investments including new materials, high power energy sources, miniaturization techniques, and reduction of weapon moving components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.545"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated, designed and developed the next generation (2016 and beyond) small arms weapons platforms; investigated critical technologies and concepts that could be integrated into weapons system platforms to provide the Warfighter the next generation new small arms capabilities; conducted experiments to mature small arms component technologies in target engagement, target effectiveness, and power and energy requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.801"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate new small arm concepts and systems proposed to enable Small Unit operations; fund research to decrease time to complete mission objective and double the maximum effective range of current individual and crew served small arm systems as defined by the Small Arms Capabilities Based Assessment; analyze new concepts through modeling and simulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Text": {
                                                "val": "Will continue to design and conduct experiments of a universal projectile concept to validate modeling and simulation of projectile aerodynamics, launch survivability and suitability to military environments; investigate gun barrel stabilization technologies to validate effectiveness of maximum range increases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Material and Process Technology"
                                    },
                                    "Description": {
                                        "val": "This effort addresses state of the art material substrates and surface coatings to improve reliability, reduce maintenance and improve weapon diagnostics through embedded technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.244"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed a detailed investigation of these new materials and techniques as applied to current and new weapon systems; matured past investments in lubricous weapon coatings, shot counters and other indicators to increase weapon life, improve durability and reduce weight."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.368"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate available state-of-the-art coatings materials and processes and the potential synergistic effects to weapon applications; design and conduct experiments at component level to determine validity of technology to small arms applications; use modeling and simulation to validate analytical predictions; formulate concept and application studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.068"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.068"
                                            },
                                            "Text": {
                                                "val": "Will develop and analyze custom phosphors for providing day\/night capable tracer material; validate phosphor characteristics (excitation and emission energies) to enhance focus light back to the shooter;mature coatings for corrosion resistant applications on ammunition and weapons;conduct experiments through suppressor development designs to decrease peak temperatures and increase reliability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Business Innovative Research\/Small Business Technology Transfer Program"
                                    },
                                    "Description": {
                                        "val": "Small Business Innovative Research\/Small Business Technology Transfer Program"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.221"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Business Innovative Research\/Small Business Technology Transfer Program"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}