{
    "id": "8261afec51a7eeba15b7a1c397f516670ef883ad",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603711D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Robotics Program\/Autonomous Systems"
        },
        "R1LineItemNumber": {
            "val": "49"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "9.481"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This program ends in FY 2012."
        },
        "ProgramElementMissionDescription": {
            "val": "This program supported the technology development activities of the Joint Ground Robotics Enterprise (JGRE) with a focus on the development of subsystems and components, and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in simulated environments.  Projects delivered advanced technology with direct relevance to enhancing warfighters' capabilities that have been identified during operational assessments and field feedback of current unmanned systems.  By exercising its oversight role through a Technology Advisory Board, O-6 Council and Senior Steering Group (Flag level), Joint Ground Robotics applied this program to enable coordination between the Services and places emphasis on interoperability and commonality among unmanned ground systems.  The primary purpose of this program supported efforts to overcome technology barriers in the thrust areas of unmanned ground system technologies to include Autonomous and Tactical Behaviors, Manipulation Technologies, Collaborative Operations, Interoperability, Man-portable Unmanned Ground Systems, and Technology Transition\/Transformation.  Development and integration of technologies within the thrust areas of unmanned ground system technologies expedited technology transition from the laboratory to operational use.  The technologies are generally at Technology Readiness Levels (TRL) of three or four with the intent to mature them through JGRE efforts to TRL six."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.516"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.481"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.035"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.032"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P710"
                    },
                    "ProjectTitle": {
                        "val": "Joint Robotics Program\/Autonomous Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.481"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Joint Robotics Program\/Autonomous Systems program supported the technology development activities of the Joint Ground Robotics Enterprise (JGRE) with a focus on the development of subsystems and components, and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in simulated environments.  Projects delivered advanced technology with direct relevance to enhancing war fighters' capabilities that have been identified during operational assessments and field feedback of current unmanned systems.  By exercising its oversight role through a Technology Advisory Board, O-6 Council and Senior Steering Group (Flag level), Joint Ground Robotics applied this program to enable coordination between the Services and places emphasis on interoperability and commonality among unmanned ground systems.  The primary purpose of this program supported efforts to overcome technology barriers in the thrust areas of unmanned ground system technologies to include Autonomous and Tactical Behaviors, Manipulation Technologies, Collaborative Operations, Interoperability, Man-portable Unmanned Ground Systems, and Technology Transition\/Transformation.  Development and integration of technologies within the thrust areas of unmanned ground system technologies expedited technology transition from the laboratory to operational use.  The technologies are generally at Technology Readiness Levels (TRL) of three or four with the intent to mature them through JGRE efforts to TRL six."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Command, Communication & Control"
                                    },
                                    "Description": {
                                        "val": "Development of data delivery, control and display, or task execution technologies enhanced unmanned ground vehicle operations, reduced operator loads and improved effectiveness.  Development and integration of communication, mission planning, human-robot interface technologies, and advanced intelligence capabilities supported robotic operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.113"
                                            },
                                            "Text": {
                                                "val": "1)  Natural Human Robot Interface.\n     -  Tracked technologies were combined with state-variable information describing the mission to determine the proper supporting behavior for the robot under the current conditions, somewhat analogous to the synergistic interaction of a hunter and a bird-dog.\n     -  A non-obtrusive human-robot interface was developed that allowed the Warfighter to employ the same equipment currently used to communicate with other Warfighters in order to interact with the Unmanned Ground Vehicles to supervise or modify its behavior if needed, thus obviating the need for a dedicated Operator Control Unit.\n2)  Distributed Control & Data for Small Unmanned Ground Vehicles.\n      -  Investigated and developed distributed control system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts continuing based on FY 2012 funding.\n\n1)  Natural Human Robot Interface.\n     -  Platform demonstrations and final report will be completed.\n2)  Distributed Control & Data for Small Unmanned Ground Vehicles.\n     -  Technology Demonstration and assessments will be performed to examine technology in operational environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Interoperability"
                                    },
                                    "Description": {
                                        "val": "Promoted and guided technology development to meet joint requirements and promoted ground as well as air unmanned systems interoperability.  Supported the bridging of currently incompatible robots and controllers from various manufacturers, using different communications channels and hardware.  Optimized best features of prior\/ongoing research efforts into a maturing, standardized system that was easily ported to robotic platforms used throughout the Department of Defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Interoperability Profiles - effort continued based on FY 2011 funding.\n      -  Extended Interoperability Profile, Version 0 to autonomous systems, specifically those with Applique Kits."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Interoperability Profiles - effort continuing based on no-cost period of performance extension.\n      -  Develop testing capability\/environment associated with the  Interoperability Profiles for autonomous systems. \n      -  Verified test environment\/procedures, an Applique Kit prototype solution was provided and tested."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manipulation"
                                    },
                                    "Description": {
                                        "val": "Incorporation of new or existing technologies enabled a greater range of robotic manipulation, supported the development of mobile manipulation, and improved manipulator performance.  Development of these technologies enabled unmanned systems to conduct highly dexterous tasks that today are accomplished manually, but currently place war fighters in extremely vulnerable and dangerous situations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.715"
                                            },
                                            "Text": {
                                                "val": "1)  Highly Dexterous Manipulators for Explosive Ordnance Disposal Robots.\n      -  Developed and completed integration of Haptic feedback.\n      -  System integration (arm, end effector interface and end effector) and system testing was performed.\n      -  Received dexterous hardware support.\n2)  Modular Point to Manipulate.\n      -  Integrated hardware onto representative Explosive Ordnance Detection Unmanned Ground Vehicles in a modular way that does not rely heavily on precise, manipulator-specific calibration or hard-coded algorithms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission\/Platform Specific"
                                    },
                                    "Description": {
                                        "val": "Development of a technology addressed the requirements of a particular mission or integrated with a specific platform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.615"
                                            },
                                            "Text": {
                                                "val": "Counter Tunnel Exploitation\/Mapping.\n      -  Developed Autonomy Architecture.\n      -  Developed 3D Mapping Capability.\n      -  Integrated first generation Sensor Suite. \n      -  Miniaturized Sensor Suite.\n      -  Conducted experiments of the Bore Hole Apparatus and the Snakebot."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Counter Tunnel Exploitation\/Mapping - effort continuing based on FY 2012 funding.\n      -  Integrate sensor suite onto the platform.\n      -  Conduct user assessment of the system.\n      -  Finalize report on system progress and development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navigation"
                                    },
                                    "Description": {
                                        "val": "Development of reliable motion planning, path planning, obstacle detection\/obstacle avoidance, characterization, and decision analysis capabilities based on the perceived environment and specific missions outlined for the robot."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.415"
                                            },
                                            "Text": {
                                                "val": "Autonomous Mobility Applique System Joint Capability Technology Demonstration.\n      -  Provided scalable autonomy in a single material solution agnostic of vehicle platform.\n      -  Comprised of two kits: (1) an Autonomy Kit and (2) a By-wire kit. The Autonomy Kit included the intelligence, sensing, and control capabilities necessary for semi-autonomous behaviors.\n      -  Enabled scalable autonomy through incorporation of a flexible open framework with defined interfaces. \n      -  Provided an A kit that provided scalable autonomy and was transferable between platforms with minimum modification and configuration enabling a single point solution for existing manned vehicle fleet."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Outreach & Harmonization"
                                    },
                                    "Description": {
                                        "val": "Promoted and guided technology development and demonstration through joint requirements with DoD entities, United States government agencies and other civilian organizations that promoted the proliferation of ground robotic vehicle capability understanding."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.465"
                                            },
                                            "Text": {
                                                "val": "1)  University Support and Outreach. \n      -  Supported and funded both the intelligent ground vehicle competition sponsored by association for unmanned vehicle systems international and the senior capstone program at the United States Air Force Academy.\n2)  Cost Benefit Analysis.\n      -  Determined the appropriate mission areas for the Cost Benefit Analysis.\n      -  Developed a framework for estimating the potential integration of robotic systems.\n      -  Analyzed the cost-effectiveness and the net benefit of the potential robotic solutions in the selected areas of the framework.\n3)  Test & Evaluation (T&E).\n      -  Data gathering efforts determined the current capabilities and capability gaps for T&E with regards to UGVs. \n      -  Developed methodology to fill the T&E gaps.\n      -  Implemented test procedures to fill the gaps identified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Perception"
                                    },
                                    "Description": {
                                        "val": "Development of post-processing software technologies (proprioceptive and\/or exetroceptive) enhanced unmanned ground vehicle perception capabilities for navigation, manipulation, and general unmanned ground vehicle situational awareness in a wide range of environments and conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.292"
                                            },
                                            "Text": {
                                                "val": "1)  Adverse Environment Obstacle Detection.\n     -  Preliminary analysis determined the prime areas of competence of candidate sensor solutions, and the combination of sensors most promising for a set of representative Unmanned Ground Vehicle (UGV) scenarios.\n2)  Real Time Radio Modeling.\n     -  Integrated with Building Properties into the model.\n     -  Integrated Building Properties with Tank-Automotive Research Development Center Image Generator .    \n     -  Integrated Building Properties with Tank-Automotive Research Development Center Unmanned Ground Vehicle.\n     -  Development of Urban Canyon Models.\n     -  Built Clearing\/Urban Canyon Comparison Analysis.\n     -  Development of rain, snow, wind, and smoke models.\n3)  3D Mapping for Off Road Terrain.\n     -  Applied proven 2D mapping capabilities to 3D sensors.\n     -  Tested at both day and night in indoor environments with some clutter and in outdoor, non-planar surfaces.\n4)  Negative Obstacle Detection.\n     -  Analyzed the perception requirements for negative obstacle detection conducted to include.\n     -  Conducted survey and analysis of existing solutions.\n     -  Developed reference design.\n     -  Tested and simulated reference design.\n5)  Enhanced Traversability Analysis for Small Unmanned Ground Vehicles.\n     -  Fused newly available small, multi-return, 3D lidar data with camera imagery.\n     -  Built upon current methods for traversability analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts continuing based on FY 2012 funding.\n\n1)  Adverse Environment Obstacle Detection.\n     -  Develop the final system involving multi-sensor solutions for obstacle detection in adverse environments.\n2)  Real Time Radio Modeling.\n     -  Development of rain, snow, wind, and smoke models.\n     -  Integration with Tank-Automotive Research Development Center Image Generator.     \n     -  Integration with  Tank-Automotive Research Development Center Unmanned Ground Vehicle.\n     -  Weather Comparisons Analysis.\n3)  3D Mapping for Off Road Terrain.\n     -  Develop prototype.\n     -  Optimize software off-road terrain.\n     -  Develop software solutions to output 3D maps to 3D visualization software.\n4)  Negative Obstacle Detection (NOD).\n     -  Continue to refine design.\n     -  Implement design in hardware.\n     -  Modify existing sensors suites to meet NOD issues.\n     -  Develop data fusion and algorithms for the sensors.\n     -  Test design on a midsized UGV over a wide variety of terrains, negative obstacles types and sizes, and vehicle speeds.\n5)  Enhanced Traversability Analysis for Small Unmanned Ground Vehicles.\n     -  Apply the new sensor data to vegetation classification and 3D geometry of the terrain.\n     -  Conduct tests on various small UGV configurations to track robustness and portability to varying platform types."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vision\/Sensors"
                                    },
                                    "Description": {
                                        "val": "Development of technologies (hardware and software) enhanced unmanned ground vehicle sensory (visual, audible and\/or tactile) capabilities for navigation, manipulation, and general unmanned ground vehicle situational awareness in a wide range of environments and conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.866"
                                            },
                                            "Text": {
                                                "val": "Three-dimensional (3D) Improvised Explosive Device Sweep Detection\n         - Conducted initial trajectory planning work using Commercial Off The Shelf \/ Government Off The Shelf simulation tools using 3D sensor data from a man-transportable UGV in a relevant environment within the simulator as well as a kinematically and dynamically correct model of the manipulator and base platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "3D Improvised Explosive Device Sweep Detection - effort continuing based on FY 2012 funding.\n       -  Transition algorithms to real hardware (platform, manipulator, and sensors) .\n       -  Develop and capture test plans and performance metrics.\n       -  Conduct a Human Robot Interface study and design will be conducted and implemented for this specific application."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "(BA4) PE 0603709D8Z"
                                    },
                                    "Title": {
                                        "val": "Joint Robotics Program"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.932"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA5) PE 0604709D8Z"
                                    },
                                    "Title": {
                                        "val": "Joint Robotics Program"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.705"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1.  Technologies funded & developed were reviewed by Capabilitiy Area focused working groups to determine progress, transition plans, and relevance of each project.\n2.  Project plans were submitted, evaluated and analyzed by the Joint Robotics Ground Enterprises management and technical staff for risk and progress.\n3.  Project progressed toward goals and milestones and were assessed during mid-year and end-of-year reviews.\n4.  Technologies developed by the Joint Robotics Ground Enterprises (JGRE) were tracked and documented using the DOD Technology Readiness Level (TRL) scale for developing TRL three or four technologies to TRL six and adhering to the integrated baselines with regard to cost and schedule."
                        }
                    }
                }
            ]
        }
    }
}