{
    "id": "8800f9518166f02f20b250a3911c8450ccac8f9d",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA5A_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604290A"
        },
        "ProgramElementTitle": {
            "val": "Mid-tier Networking Vehicular Radio (MNVR)"
        },
        "R1LineItemNumber": {
            "val": "81"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "47.000"
            },
            "CurrentYear": {
                "val": "12.636"
            },
            "BudgetYearOne": {
                "val": "23.341"
            },
            "BudgetYearOneBase": {
                "val": "23.341"
            },
            "BudgetYearTwo": {
                "val": "9.897"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2014 Base funding supports program management office and system security certification activities to execute a Non-Developmental Item (NDI) strategy for a Mid-Tier Networking Vehicular capability.\n\nFY2012 Congressional Add of $47.000 million released to PM MNVR upon receipt of funds in August 2012."
        },
        "ProgramElementMissionDescription": {
            "val": "The Mid-tier Networking Vehicular Radio (MNVR) encourages an industry solution for a multi-channel vehicular radio which will host Joint Tactical Networking Center (JTNC) waveforms, addressing the Army's requirement for Mid-Tier Wideband Networking (MWN) capabilities to support the Warfighter by providing an extension of data services from the upper tactical network at brigade and battalion to the lower tactical network at company and platoon echelon platforms.\n\nThe Mid-tier Networking Vehicular Radio (MNVR) is a Non-Developmental Item (NDI) Initiative that equips the joint military with a multiple channel, Type-1 classification radio providing data communication service capabilities for mobile and fixed forces supporting mission planning, Command and Control (C2), and situational awareness from brigade to platoon levels. The advanced network waveforms provide rapid distribution of data and imagery with increased information assurance protection and automatic routing across complex terrain and under adverse weather conditions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "12.636"
                },
                "BudgetYearOne": {
                    "val": "29.341"
                },
                "BudgetYearOneBase": {
                    "val": "29.341"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "47.000"
                },
                "CurrentYear": {
                    "val": "12.636"
                },
                "BudgetYearOne": {
                    "val": "23.341"
                },
                "BudgetYearOneBase": {
                    "val": "23.341"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "47.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-6.000"
                },
                "BudgetYearOneBase": {
                    "val": "-6.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "47.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-6.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DW1"
                    },
                    "ProjectTitle": {
                        "val": "MID-TIER WIDEBAND NETWORKING VEHICULAR RADIO MNVR"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "47.000"
                        },
                        "CurrentYear": {
                            "val": "12.636"
                        },
                        "BudgetYearOne": {
                            "val": "23.341"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.341"
                        },
                        "BudgetYearTwo": {
                            "val": "9.897"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Mid-tier Networking Vehicular Radio (MNVR) encourages an industry solution for a multi-channel vehicular radio which will host Joint Tactical Networking Center (JTNC) networking waveforms, addressing the Army's requirement for Mid-Tier Wideband Networking (MWN) capabilities to support the Warfighter by providing an extension of data services from the upper tactical network at brigade and battalion to the lower tactical network at company and platoon echelon platforms. The MNVR provides the Army with the Multi-tier Wideband Networking (MWN) waveform capability with a dynamic, scalable, on the move (OTM) network architecture, connecting the Warfighter to the Mission Command (MC) Network and enhances capability to exchange voice and data simultaneously via the desired government owned Mobile Ad-hoc Networking (MANET) Wideband Networking Waveform (WNW) faster than current systems and at a lower cost solution than MNVR's predecessor, the Ground Mobile Radio (GMR)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Mid-tier Networking Vehicular Radio (MNVR) encourages an industry solution for a multi-channel vehicular radio which will host Joint Tactical Networking Center (JTNC) networking waveforms, addressing the Army's requirement for Mid-Tier Wideband Networking (MWN) capabilities to support the Warfighter by providing an extension of data services from the upper tactical network at brigade and battalion to the lower tactical network at company and platoon echelon platforms.\n\nThe Mid-tier Networking Vehicular Radio (MNVR) is a Non-Developmental Item (NDI) Initiative that equips the joint military with a multiple channel, Type-1 classification radio providing data communication service capabilities for mobile and fixed forces supporting mission planning, Command and Control (C2), and situational awareness from brigade to platoon levels. The advanced network waveforms provide rapid distribution of data and imagery with increased information assurance protection and automatic routing across complex terrain and under adverse weather conditions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mid-Tier Networking Vehicular Radio (MNVR) Program"
                                    },
                                    "Description": {
                                        "val": "RDTE Funding supports Program Office and contract development.  Supports efforts to evaluate Source Selection and Platform Integration and Test of industry solutions for a Non-Developmental Item (NDI) solution support for Joint Tactical Networking Center (JTNC) waveforms and user operational requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2012 Funding supports Program Office establishment and award of competitive FFP two-year IDIQ contract in May 2013 to manufacture and deliver MNVR units to Army Capability Set 14\/15 brigades. Supports program management, vehicular platform integration, and customer test activities to execute a Non-Developmental Item (NDI) strategy for a mid-tier networking vehicular capability, including vendor Manufacturing Readiness Assessments, Government Lab Test, and Source Selection Performance Demonstration (SSPD) for contract evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.636"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2013 Funding supports program management activities to execute a Non-Developmental Item (NDI) strategy for a mid-tier networking vehicular capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.341"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.341"
                                            },
                                            "Text": {
                                                "val": "FY 2014 Funding supports program management and system security certification activities to execute a Non-Developmental Item (NDI) strategy for a mid-tier networking vehicular capability, including National Security Agency (NSA) certification, Department of Defense Information Assurance Certification and Accreditation Process (DIACAP) assessment, Counter Remote Control Radio Electronic Warfare (CREW) testing, System Threat Assessment Report (STAR), and Public Key Infrastructure (PKI) certification."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B51001"
                                    },
                                    "Title": {
                                        "val": "Mid-Tier Networking Vehicular Radio (MNVR)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "86.219"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.200"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.200"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "83.700"
                                        },
                                        "BudgetYearThree": {
                                            "val": "83.700"
                                        },
                                        "BudgetYearFour": {
                                            "val": "83.700"
                                        },
                                        "BudgetYearFive": {
                                            "val": "86.616"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The Mid-tier Networking Vehicular Radio (MNVR) is a Non Developmental Item (NDI) Initiative that equips the joint military with a multiple channel, Type 1 classification radio providing data communication service capabilities for mobile and fixed forces supporting mission planning, Command and Control (C2), and situational awareness from brigade to platoon levels. The advanced network waveforms provide rapid distribution of data and imagery with increased information assurance protection and automatic routing across complex terrain and under adverse weather conditions."
                        },
                        "AcquisitionStrategy": {
                            "val": "The MNVR encourages an industry solution for a multi-channel vehicular radio which will host Joint Tactical Networking Center (JTNC) networking waveforms, addressing the Army's requirement for Mid-Tier Wideband Networking (MWN) capabilities. MNVR provides an extension of data services from the upper tactical network at brigade and battalion to the lower tactical network at company and platoon echelon platforms.\n\nPM MNVR Phase One is the procurement of the MNVR Directed Requirement Non-Developmental Item (NDI) Solution resulting in a Competitive, Single-Award, Indefinite Delivery, Indefinite Quantity (IDIQ) Firm-Fixed Price (FFP) contract award with a two-year production period, planned for June 2013.\n\nPM MNVR Phase Two is the procurement of the MNVR Program of Record (PoR) Non-Developmental Item (NDI) Solution resulting in a Competitive, Multiple-Award, Indefinite Delivery, Indefinite Quantity (IDIQ) Firm-Fixed Price (FFP) contract award that will qualify two vendors for competitive Delivery Orders, with a five-year production period."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Proving Ground"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "24.272"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.100"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.941"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.941"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "5.912"
                                                    },
                                                    "TotalCost": {
                                                        "val": "51.225"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Development Analysis and Product Source Selection"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Proving Ground"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "12.298"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.590"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.590"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.250"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.138"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Systems Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Proving Ground"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.430"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.536"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.810"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.810"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.735"
                                                    },
                                                    "TotalCost": {
                                                        "val": "28.511"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Directed Requirement (DR) Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Directed Requirement Delivery Order 1 Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Material Development Decision (MDD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Directed Requirement Order 1 Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DR Initial Operational Test and Evaluation (IOT&E)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Operating Capability (IOC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Program of Record (PoR) Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}