{
    "id": "88a8b52fa1935e9d6fdba57e6226ac28e63e2e8d",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0606301D8Z"
        },
        "ProgramElementTitle": {
            "val": "Aviation Safety Technologies"
        },
        "R1LineItemNumber": {
            "val": "166"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "18.172"
            },
            "PriorYear": {
                "val": "6.877"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Develop and test promising aviation safety technologies.  This funding supports Secretary Gates’ direction to achieve a 75% reduction in accidents and supports the Defense Safety Oversight Council's (DSOC) pursuit of aviation safety technologies, as endorsed in the Secretary’s May 30, 2007 memorandum, “Zero Preventable Mishaps.”  In FY 09, there were 29 Class A aviation accidents with 18 destroyed aircraft and 28 fatalities. Mid-air collisions are currently the #2 cause of fatalities in fighter\/attack aircraft.\n\nThe DSOC used a data-driven approach to identify and evaluate the most effective hardware and software technologies to be implemented to reduce preventable aviation mishaps. The DSOC task force surveyed existing programs and provided an assessment of the viability and advisability of future resource investments. These investments will fund hardware and software technology to prevent helicopters and fighter aircraft mishaps.\n\nSpecifically, this effort will develop and flight test an Automatic Air Collision Avoidance System (AACAS) suitable for use in the dynamic, fighter air-to-air training environment.  This effort completes the design and flight test of an automatic air collision avoidance system in an F-16 test-bed, with applicability to all modern fighters and potentially UASs.\n\nFrom FY 06 to FY 10 a team of automatic collision avoidance experts from AFRL, NASA, and Lockheed-Martin Aeronautics developed and flight tested the Automatic Ground Collision Avoidance System (AGCAS).  Following a highly successful flight test, this system is now undergoing operational integration in the F-16, F-22, and F-35 and is projected to prevent over 150 Class A mishaps over the lifespan of these aircraft, saving the Department over $10B in replacement costs.  In FY 10 this same team began design work on the AACAS.   Design efforts are on track with simulation testing scheduled for early FY 11. Collision avoidance was recommended for funding in FY 2010.  In FY 11 continuation of algorithm development and begin simulator testing.   In FY12, completion of simulator and flight testing."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.879"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.877"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.002"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.002"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "901"
                    },
                    "ProjectTitle": {
                        "val": "Aviation Safety Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.172"
                        },
                        "PriorYear": {
                            "val": "6.877"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This funding supports Secretary Gates direction to achieve a 75% reduction in accidents and supports the Defense Safety Oversight Council's (DSOC) pursuit of aviation safety technologies.  The Guidance for the Development of the Force (GDF) directs DoD Components to pursue accident reduction and prevention initiatives that emphasize safety in the workplace and hold leaders accountable for their safety programs. In FY 2008, there were 89 Class A aviation accidents with 61 destroyed aircraft and 32 fatalities.  The aviation accidents cost the Department over $2.9 billion with indirect costs approximately four times that amount.  \n\nThe DSOC used a data-driven approach to identify and evaluate the most effective hardware and software technologies to be implemented to reduce preventable aviation mishaps.  The DSOC task force surveyed existing programs and provided an assessment of the viability and advisability of future resource investments.  These investments will fund hardware and software technology to prevent helicopters and fighter aircraft mishaps.  \n\nAutomatic Collision Avoidance Technologies (ACAT) has been developed by the Air Force to prevent the most prevalent causes of fighter\/attack mishap fatalities and destroyed aircraft. An Automatic Ground Collision Avoidance (Auto-GCAS) component of ACAT has matured and is ready for fleet integration. FY 2010-FY 2012 money was used to leverage the successes of ACAT by furthering  the development of Auto-ACAS, while retaining scarce technical expertise and flight test resources currently in use.  As an unintended side benefit, Auto-ACAS may also hold a key to Unoccupied Aerial Vehicle access to the National Airspace.\n\nThe Secretary stated that we can not and should not tolerate the injuries, costs, and capability losses from preventable accidents."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aviation Safety Technologies"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.877"
                                            },
                                            "Text": {
                                                "val": "• Completed algorithm development and began simulations.\n• Completed simulations and ground testing and advanced to F-16 flight test."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "• Class A aviation accident rates. Number of Class A aviation accidents, (resulting in damages of $2 million or more; aircraft destroyed; and\/or fatality or permanent\ndisability), per 100,000 flying hours.\n• Number of destroyed aircraft.\n• Number of aviation fatalities.\t\n• A 75% reduction goal was assessed against a FY 2002 baseline."
                        }
                    }
                }
            ]
        }
    }
}