{
    "id": "89fb8499c98b362a2e27b7dd929b7e68ebce7490",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OTE_RDTE_JustificationBook_Operational_Test_and_Evaluation,_Defense_PB_2014.zzz_unzipped_RDTE_JustificationBook_Operational_Test_and_Evaluation,_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Operational Test and Evaluation, Defense",
        "appropriation_code": "0460",
        "appropriation_name": "Operational Test and Evaluation, Defense"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605118OTE"
        },
        "ProgramElementTitle": {
            "val": "Operational Test and Evaluation"
        },
        "R1LineItemNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "AppropriationCode": {
            "val": "0460"
        },
        "AppropriationName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "62.444"
            },
            "CurrentYear": {
                "val": "72.501"
            },
            "BudgetYearOne": {
                "val": "75.720"
            },
            "BudgetYearOneBase": {
                "val": "75.720"
            },
            "BudgetYearTwo": {
                "val": "78.743"
            },
            "BudgetYearThree": {
                "val": "82.453"
            },
            "BudgetYearFour": {
                "val": "84.882"
            },
            "BudgetYearFive": {
                "val": "94.299"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Director of Operational Test and Evaluation (DOT&E) was created by Congress in 1983.  The Director is responsible under Title 10 for policy and procedures for all aspects of Operational Test and Evaluation (OT&E) within the Department of Defense (DoD).  Particular focus is given to OT&E that supports major weapon system production decisions for acquisition programs included on the Office of Secretary of Defense Test and Evaluation Oversight List that is prepared and approved annually.  Generally, there are about 300 programs on the oversight list including all Major Defense Acquisition Programs (MDAP) and Major Automated Information Systems (MAIS).  MDAPs may not proceed beyond low-rate initial production (BLRIP) until OT&E of the program is complete.  DOT&E is involved early in the planning phase of each program to ensure adequate testing is planned and executed.  Key elements of DOT&E's oversight authority include: \n\n-\tThe approval of component Test and Evaluation Master Plans (TEMPS).\n-\tThe approval of component OT&E Test Plans (TPs).\n-\tOversight of Military Department preparation and conduct of field operational tests; analysis and evaluation of the resultant test data; the assessment of the adequacy of the executed test and evaluation programs; and assessment of the operational effectiveness and suitability of the weapon systems.\n-\tReporting results of OT&E that supports BLRIP decisions to the Secretary of Defense and Congress, as well as providing an annual report summarizing all OT&E activities and the adequacy of test resources within DoD during the previous fiscal year.\n\nDOT&E also oversees and resources OT&E community efforts to plan and execute joint operational evaluations of information assurance and interoperability of fielded systems and networks during major Combatant Command (CCMD) and Service exercises, and reports the trends and findings in the annual report. \n\nThis Program Element includes funds to obtain Federally Funded Research and Development Center (FFRDC) support in performing the described tasks, travel funds to carry out oversight of the OT&E program, funds for Service teams performing information assurance and interoperability assessments during exercises, and contractor support related to the conduct of operational test and evaluation and exercise assessments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "60.444"
                },
                "CurrentYear": {
                    "val": "72.501"
                },
                "BudgetYearOne": {
                    "val": "73.546"
                },
                "BudgetYearOneBase": {
                    "val": "73.546"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "62.444"
                },
                "CurrentYear": {
                    "val": "72.501"
                },
                "BudgetYearOne": {
                    "val": "75.720"
                },
                "BudgetYearOneBase": {
                    "val": "75.720"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.174"
                },
                "BudgetYearOneBase": {
                    "val": "2.174"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Enhancements for Cyber Range"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.200"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.200"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Progam Realignment\/Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.026"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.026"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "As a result of the Department's recognition of the importance of enhanced cyber assessment capabilities, additional resources were added in fiscal year 2014.\nProgram Realignment made in support of an administrative contract ($1.225) and other programmatic adjustments (-$1.251)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0605118OTE"
                    },
                    "ProjectTitle": {
                        "val": "OT&E"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "62.444"
                        },
                        "CurrentYear": {
                            "val": "72.501"
                        },
                        "BudgetYearOne": {
                            "val": "75.720"
                        },
                        "BudgetYearOneBase": {
                            "val": "75.720"
                        },
                        "BudgetYearTwo": {
                            "val": "78.743"
                        },
                        "BudgetYearThree": {
                            "val": "82.453"
                        },
                        "BudgetYearFour": {
                            "val": "84.882"
                        },
                        "BudgetYearFive": {
                            "val": "94.299"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Director of Operational Test and Evaluation (DOT&E) is responsible under Title 10 for policy and procedures for all aspects of operational test and evaluation within the Department of Defense (DoD).  Particular focus is given to OT&E that supports major weapon system production decisions for acquisition programs included on the Office of Secretary of Defense Test and Evaluation Oversight List that is prepared and approved annually.  Generally, there are over 300 programs on the oversight list including all Major Defense Acquisition Programs (MDAP) and Major Automated Information Systems (MAIS).  MDAPs may not proceed beyond low-rate initial production (BLRIP) until OT&E of the program is complete.  DOT&E is involved early in the planning phase of each program to ensure adequate testing is planned and executed.  Key elements of DOT&E's oversight authority include: \n\n-\tThe approval of component test and evaluation master plans (TEMPs)\/ Test and Evaluation Strategies.\n-\tThe approval of component OT&E Test Plans (TPs).\n-\tOversight of Military Department preparation and conduct of field operational tests; analysis and evaluation of the resultant test data; the assessment of the adequacy of the executed test and evaluation programs; and assessment of the operational effectiveness and suitability of the weapon systems.\n-\tReporting of results of OT&E that supports BLRIP decisions to the Secretary of Defense and Congress, as well as providing an annual report summarizing all OT&E activities and the adequacy of test resources within DoD during the previous fiscal year.\n\nDOT&E also oversees and resources OT&E community efforts to plan and execute joint operational evaluations of information assurance and interoperability of fielded systems and networks during major Combatant Command (CCMD) and Service exercises, and reports the trends and findings in the annual DOT&E report. \n\nThis Program Element includes funds to obtain Federally Funded Research and Development Center (FFRDC) support in performing the described tasks, travel funds to carry out oversight of the OT&E program and administration support services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "62.444"
                                            },
                                            "Text": {
                                                "val": "Operational Test and Evaluation Oversight\n\nThis effort is in direct support of the Director’s Title 10 responsibilities and is a continuing effort.  Funding for FY 2012  provided Operational Test and Evaluation inputs for Test and Evaluation Master Plans, Test Plans, System Acquisition Reports, Operational Assessment Reports, and Defense Acquisition Executive Summary Reports for those programs designated for oversight by DOT&E and OUSD(AT&L).  Key elements of DOT&E oversight authority are identified in Calendar Year 2012 Office of the Secretary of Defense Test and Evaluation Oversight List.  \n\nInformation Assurance (IA) and Interoperability (IOP) Evaluations\n\nDOT&E oversaw and resourced 16 CCMD level and 6 Service level IA and\/or IOP assessments in FY12.  Four other approved assessments were cancelled due to scheduling issues or changes to the scope of the exercise.  Of the 22 assessments executed in FY12, three were conducted of units deployed to theaters of operations, resulting in enhancements to their network defense postures.  Warfighter responses to computer network attack (ability to protect, detect, react, and restore) were captured in all IA assessments and several included the portrayal of advanced cyber threats.  A more rigorous process, including expanded research requirements and linkage to mission threads, was instituted for IOP assessments.  Fiscal year 2012 IA and IOP evaluations included trend analyses across prior year results, both within and across CCMDs.  Critical findings were transmitted to Service and DoD leadership for their awareness and remediation actions, as appropriate.  DOT&E initiated efforts to support implementation on the CJCS EXORD as part of the assessment planning process, including development of threat assessments of the advanced cyber adversary and alignment Red Teams with these threat assessments.  A DOT&E issue paper to the FY13 program review resulted in additional funds for enhanced threat assessments and Red Team portrayal (FY13-FY17).  The Joint Information Operations Range (JIOR) supported three assessment events for added operational realism, and planning is underway to expand JIOR support to future exercise assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "72.501"
                                            },
                                            "Text": {
                                                "val": "Operational Test and Evaluation Oversight\n\nThis effort is in direct support of the Director’s Title 10 responsibilities and is a continuing effort.  Funding for FY 2013 will provide Operational Test and Evaluation inputs for Test and Evaluation Master Plans, Test Plans, System Acquisition Reports, Operational Assessment Reports, and Defense Acquisition Executive Summary Reports for those programs designated for oversight by DOT&E and OUSD(AT&L).  Key elements of DOT&E oversight authority are identified in Calendar Year 2013 Office of the Secretary of Defense Test and Evaluation Oversight List.  \n\nInformation Assurance (IA) and Interoperability (IOP) Evaluations\n\n\tDOT&E will oversee and resource approximately 11 CCMD level and 4 Service level IA and IOP assessments in FY 2013.  Full assessment of warfighter responses to computer network attack (ability to protect, detect, react, and restore) will be captured in all IA assessment events.  The portrayal of selected advanced-cyber threats, in accordance with the CJCS Red Team EXORD, and the focused assessment of critical mission accomplishment in representative threat environments is a primary objective for most IA and IOP evaluations in FY13.  In partnership with US Cyber Command, DoD Red Team capabilities will be enhanced to reflect DIA assessments, and application of these teams will be synchronized across assessment priorities.  Assessment support to units deployed to warfighting theaters of operation will continue as needed.  Fiscal year 2013 IA and IOP evaluations will include trend analyses across prior year results, both within and across CCMDs.  Critical findings will be transmitted to Service and DoD leadership for their awareness and remediation actions, as appropriate.  The Joint Information Operations Range (JIOR) will support events across multiple CCMDs for added threat realism and required security during exercise assessments.  New resources and emphasis will be added in FY13 as a result of a successful issue paper for enhanced cyber assessment capabilities.  Enhancements will include expanded threat assessments of the advanced cyber adversary, more representative portrayal of the cyber adversary by Red Teams, and improvements to the JIOR that will support more operationally realistic and threat representative assessment and training events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "75.720"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "75.720"
                                            },
                                            "Text": {
                                                "val": "Operational Test and Evaluation Oversight\n\nThis effort is in direct support of the Director’s Title 10 responsibilities and is a continuing effort.  Funding for FY 2014 will provide Operational Test and Evaluation inputs for Test and Evaluation Master Plans, Test Plans, System Acquisition Reports, Operational Assessment Reports, and Defense Acquisition Executive Summary Reports for those programs designated for oversight by DOT&E and OUSD(AT&L).  Key elements of DOT&E oversight authority are identified in Calendar Year 2014 Office of the Secretary of Defense Test and Evaluation Oversight List.  \n\nInformation Assurance (IA) and Interoperability (IOP) Evaluations\n\nDOT&E will oversee and resource approximately 15 CCMD level IA and IOP assessments in FY 2014.  Full assessment of warfighter responses to computer network attack (ability to protect, detect, react, and restore) will be captured in all IA events.  Portrayal of advanced-cyber threats will be part of all assessments.  In accordance with the CJCS Red Team EXORD, and assessments will focus on the accomplishment of critical operational mission in representative threat environments consistent with the scope and purpose of the specific exercise.  In partnership with US Cyber Command, DoD Red Team capabilities will be enhanced to reflect DIA cyber threat assessments, and application of these teams will be synchronized across Cyber Command and DOT&E priorities.  Assessment support to units deploying to theaters of operation will continue as needed.  Fiscal year 2014 IA and IOP evaluations will include trend analyses across prior year results, both within and across CCMDs.  Critical findings will be transmitted to Service and DoD leadership for their awareness and remediation actions, as appropriate.  The Joint Information Operations Range and other cyber range assets with Red Teams portraying advanced cyber adversaries will support the majority of CCMD exercises for added threat realism and required security."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance Measure:  Percentage of required operational test planning documents, assessments, and reports applicable to acquisition programs on the OSD Test and Evaluation Oversight List and other special interest programs\/legacy systems that are completed and delivered to the appropriate decision makers on time.\n\nActual Performance and Goals:\n\nOperational Test and Evaluation           FY 2012 (Actual)        FY  2013 (Goal)       FY 2014 (Goal)        \nOn-Time Completion Rate                                     95%                       96%                       97%             \n\nThe on-time completion rate was computed on the basis of the number of required products that were submitted within established time standards relative to the total number of such products that fell due during the fiscal year.  Products included in the measure include beyond low-rate initial production reports, Test Plans, and Test and Evaluation Master Plans for operational test and evaluation oversight as well as assessment plans, “quick look” reports, and final reports for the information assurance and interoperability testing associated with scheduled test events.  DOT&E plans to maintain its on-time completion rates for FY 2013 and FY 2014 through continued management emphasis on timely delivery of required products to customer activities."
                        }
                    }
                }
            ]
        }
    }
}