{
    "id": "8ab5e3a988ad404bd17b66cc04d1e61265da11b7",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA3_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603728A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology Demonstrations"
        },
        "R1LineItemNumber": {
            "val": "51"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "15.247"
            },
            "CurrentYear": {
                "val": "13.626"
            },
            "BudgetYearOne": {
                "val": "11.745"
            },
            "BudgetYearOneBase": {
                "val": "11.745"
            },
            "BudgetYearTwo": {
                "val": "12.537"
            },
            "BudgetYearThree": {
                "val": "12.147"
            },
            "BudgetYearFour": {
                "val": "12.212"
            },
            "BudgetYearFive": {
                "val": "12.446"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 funding realigned to higher priority area."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates technologies that assist Army installations in becoming environmentally compatible without compromising readiness or training critical to the success of the future force.  Project 002 demonstrates tools and methods for compliance with environmental laws by control, treatment, and disposal of hazardous waste products; and conservation of natural and cultural resources while providing a realistic environment for mission activities. Project 025 demonstrates pollution prevention tools and methods to minimize the Army's use and generation of toxic chemicals and hazardous wastes.  Project 03E focuses on restoration of sites contaminated with toxic and\/or hazardous materials (such as unexploded ordnance) resulting from Army operations. This program demonstrates technological feasibility, assesses the technology as well as its producibility, and transitions mature technologies from the laboratory to the user.  Technologies developed by this program element improve the ability of the Army to achieve environmental restoration and compliance at its installations, at active\/ inactive ranges and other training lands, and at its rework as well as production facilities.  Technologies demonstrated focus on reducing the cost of treating hazardous effluents and remediating Army sites contaminated by hazardous\/toxic material.    \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nThis program is fully coordinated and complementary to PE 0602720A (Environmental Quality Technology).\n\nWork in this PE is performed by the US Army Engineer Research and Development Center, Vicksburg, MS, and the US Army Research, Development, and Engineering Command, Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "15.934"
                },
                "CurrentYear": {
                    "val": "13.626"
                },
                "BudgetYearOne": {
                    "val": "13.299"
                },
                "BudgetYearOneBase": {
                    "val": "13.299"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.247"
                },
                "CurrentYear": {
                    "val": "13.626"
                },
                "BudgetYearOne": {
                    "val": "11.745"
                },
                "BudgetYearOneBase": {
                    "val": "11.745"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.687"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.554"
                },
                "BudgetYearOneBase": {
                    "val": "-1.554"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.383"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.304"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.554"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.554"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Compliance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.597"
                        },
                        "CurrentYear": {
                            "val": "2.314"
                        },
                        "BudgetYearOne": {
                            "val": "1.923"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.923"
                        },
                        "BudgetYearTwo": {
                            "val": "2.407"
                        },
                        "BudgetYearThree": {
                            "val": "1.901"
                        },
                        "BudgetYearFour": {
                            "val": "1.864"
                        },
                        "BudgetYearFive": {
                            "val": "1.897"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates technologies transitioned from PE 0602720A (Environmental Quality Technology), Projects 048 and 896, that assist Army installations in achieving environmental compliance.  These technologies reduce the cost of treating hazardous effluents from Army installations, including forward operating bases, to satisfy increasingly stringent waste, wastewater and air pollutant discharge requirements.  Army facilities are subject to fines and facility shutdowns for violation of federal, state, and local environmental regulations.  This technology is essential to control and reduce the generation of waste to satisfy hazardous waste reduction goals and to avoid future environmental costs as well as liabilities to the Army.  Efforts under this project enable the Army to reduce environmental constraints at installations while complying with the myriad of federal, state, and host country environmental regulations and policy.  Technologies demonstrated also reduce the cost of resolving training noise compliance issues for the Army, avoid reductions in availability of training facilities, and sustain the viability of testing and training ranges as well as protect the critical resources, i.e., land, air, and waters of the Army.  \n\nWork in this project supports the Army S&T Innovation Enablers (formerly Enduring Technologies) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy, and supports the Army Strategy for the Environment.  \n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands"
                                    },
                                    "Description": {
                                        "val": "This effort provides ecosystem vulnerability assessment and ecosystem analysis, monitoring, modeling and mitigation technologies to support sustainable use of the Army's ranges and lands.  This effort demonstrates environmentally safe and cost effective technologies to manage and reduce the increase in noise and pollution concerns associated with training ranges.  In FY13-14 this effort supports Technology Enabled Capability Demonstration (TECD) 4a Sustainability\/Logistics Basing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.597"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated a cell-based, field portable sensor design for real time analysis to detect and quantify or evaluate toxicity of water; matured noise assessment models corrected to adequately reflect discrete noise events, local community response to training noise metrics, and continuous noise mapping software to ensure compliance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.314"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete development, demonstration and validation of a field portable sensor for detection of hazardous and toxic compounds in water including heavy metals, perclorate and general toxicity; complete development, testing and demonstration of smart cell sensors for intracellular markers of toxicity and stress, interdigitated electrode arrays (IdEA) for measuring cell membrane integrity, and biomarker detection systems for sensing extracellular signs of damage; test and validate results using real world field samples for incorporation into final portable sensor hardware component and system design specifications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.923"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.923"
                                            },
                                            "Text": {
                                                "val": "Will evaluate emerging biofiltration technologies applicable to gray water treatment at contingency bases based on technology performance, efficiency, and robustness; develop full scale design specifications for a robust gray water pretreatment component technology based on biofiltration evaluation; develop detailed technology test plan in coordination with Army Test and Evaluation Command, US Army Public Health Command, and US Army Tank Automotive Research, Development and Engineering Center; mature a dynamic simulation model which integrates the complex adaptive system algorithms representing the dynamic operating systems of a contingency base that transitions Virtual Forward Operating Base (VFOB) research from PE 0602720 to TECD 4a Sustainability\/Logistics Basing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "025"
                    },
                    "ProjectTitle": {
                        "val": "Pollution Prevention Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.599"
                        },
                        "CurrentYear": {
                            "val": "3.720"
                        },
                        "BudgetYearOne": {
                            "val": "3.022"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.022"
                        },
                        "BudgetYearTwo": {
                            "val": "3.450"
                        },
                        "BudgetYearThree": {
                            "val": "3.606"
                        },
                        "BudgetYearFour": {
                            "val": "3.668"
                        },
                        "BudgetYearFive": {
                            "val": "3.734"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates pollution prevention advanced technologies required for sustainable operation of Army weapon systems, to include compliance with regulations mandated by federal, state, and local environmental and health laws.  Technology thrusts under this project include demonstration of advanced technologies to enable sustainment of propellant, explosive and pyrotechnic production and maintenance facilities and training ranges through elimination or significant reduction of environmental impacts.  These technologies will ensure that advanced energetic materials required for future force's high performance munitions are developed that meet weapons lethality and survivability goals and that are compliant with environmental and health laws.  Technology thrusts also include demonstration of technologies for reductions of waste streams at base camps and toxic metal reductions from surface finishing processes.  \n\nWork in this project supports the Army S&T Innovation Enablers (formerly Enduring Technologies) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nThe project is fully coordinated and complementary to PE 0602720A, Project 895.  This project transitions technologies developed under that PE.\n\nWork in this project is performed by the Research, Development, and Engineering Command Army Research Laboratory, Aberdeen Proving Ground, MD, the Armaments Research, Development, and Engineering Center, Picatinny Arsenal, NJ,  the Aviation and Missile Research, Development, and Engineering Center, Redstone Arsenal, AL , the Natick Soldier Research, Development and Engineering Center, Natick, MA (NSRDEC), and the Tank Automotive Research, Development and Engineering Center (TARDEC), Warren, MI in conjunction with the Army Public Health Command, Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pollution Prevention Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates pollution prevention advanced technologies required to sustain operation of Army weapons systems to comply with state, federal, and local environmental and health laws and regulations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.599"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Rocket and Missile Propellants: finalized design of flight-scale hardware and prepare to conduct flight performance evaluation; Conventional Ammunition: refined and optimized compositions in a relevant end item; Pyrotechnics: integrated flare, delay and signal formulations into system prototypes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.720"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Rocket and Missile Propellants: qualify and test lead-free propellant in 2.75-inch Hydra rocket system; Conventional Ammunition: initiate insensitive munitions testing on environmentally benign formulation in relevant end item; Pyrotechnics: integrate high nitrogen materials into pyrotechnic signal prototypes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.022"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.022"
                                            },
                                            "Text": {
                                                "val": "Conventional Ammunition: will conduct large-scale performance and insensitive munitions testing on environmentally benign formulation in relevant end item; Pyrotechnics: will integrate chromate-free delay composition into relevant end item; Toxic Metal Reduction: will demonstrate alternatives to chromic acid anodizing for common aircraft substrates; Zero Footprint Camp: will select and mature high-payoff approaches for reducing fresh water demand and wastewater generation in contingency bases."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "03E"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Restoration Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.051"
                        },
                        "CurrentYear": {
                            "val": "7.592"
                        },
                        "BudgetYearOne": {
                            "val": "6.800"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.800"
                        },
                        "BudgetYearTwo": {
                            "val": "6.680"
                        },
                        "BudgetYearThree": {
                            "val": "6.640"
                        },
                        "BudgetYearFour": {
                            "val": "6.680"
                        },
                        "BudgetYearFive": {
                            "val": "6.815"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates technologies transitioned from PE 0602720A (Environmental Quality Technology), Projects 835 and 896 that improve the Army's ability to achieve cost-effective environmental restoration and management of contamination resulting from Army training or operations at its installations, active and inactive ranges, its rework and production facilities, in operations and on the battlefield.  Advanced development activities address the management\/mitigation of materials released to the natural environment and residual environmental effects of military training and operations.  The emphasis of this effort includes restoration of legacy materials, e.g., traditional explosives energetics, and unexploded ordinance; management of new materials, e.g., nanomaterials and emerging contaminants; and mitigation of residual impacts from implementation of sustainable technologies and processes.  Technologies matured within this project enable the Army to cost effectively address current and future environmental liabilities resulting from the use of militarily relevant materials in the environment and implementation of the new family of sustainable technologies for energy production.  Current and planned efforts enable the Army to efficiently characterize, evaluate, assess, and remediate soil and water at installations, ranges, facilities, and during operations in the face of changing weather and climatic conditions.  Efforts also identify ways to economically comply with the myriad of federal, state, and host country regulations dealing with contaminated soil and water.  A key aspect of this work is the enhancement of risk assessment and life cycle analysis techniques that can more accurately display the environmental liabilities associated with fielding new systems and technologies.  This program includes pilot scale field studies to establish technological feasibility and assess performance and productivity of the risk assessment techniques.  \n\nWork in this project supports the Army S&T Innovation Enablers (formerly Enduring Technologies) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ordnance Mitigation and Management (Previously titled - Unexploded Ordnance (UXO))"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates an active range ordnance impact assessment and positioning system in relevant environments and provides technologies for automated unexploded ordnance (UXO) removal. This effort also develops real time detection and discrimination methodologies for unique and emerging UXO."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.196"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated the active range ordnance impact assessment and positioning system in a relevant environment; continued development of real time detection and discrimination methodologies for unique and emerging UXO."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.406"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature emergent technology in smart sensors and real time assessment of UXO discrimination for enhanced range maintenance, sustainability and construction support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Will mature a networked semi- to-fully-autonomous mobile platform with the operational capability to mitigate hazardous UXOs on military ranges."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hazard Assessment for Military Materials (Previously titled - Hazard\/Risk Assessment Tools for Toxicity of Munitions Constituents (MCs))"
                                    },
                                    "Description": {
                                        "val": "This effort develops tools to assess hazard and risk of munitions constituents. The tools provide rapid screening assessments of existing and future militarily relevant compounds and allow for improved predictive risk assessment and provide environmental life cycle assessment capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.192"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided a beta-version of computational tool for predictive toxicology for user review that implements ab initio quantum chemical and molecular dynamics approaches to aid in the prediction of sorption properties of MCs and emerging contaminants; matured and demonstrated tools for rapid, standardized, and quantitative measurement of effects and toxicity from current MCs using toxicogenomics and computational biology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.306"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide novel screening assays for neurotoxicity and reproductive toxicity, and predictive models integrated with toxicology and genomic screening protocols; continue to mature the computational tool for rapid and reliable forensic and predictive assessment of munitions constituents, providing risk evaluation capability designed to meet Army needs for proactive land management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.863"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.863"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate a toolkit with optimized sensor technologies for rapid and reliable data collection providing real time analysis for contamination within an operational environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technologies for Sustainable and Green Operations and Acquisition (Previously titled - Green Remediation Technologies)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and matures technologies to control contaminant transport in environmental media on Army lands and mission spaces as well as assesses and demonstrates novel detection, remediation and mitigation capabilities for existing and  emerging contaminants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.663"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed and matured bioreactor technologies for control of contaminant transport in soil on training ranges; assessed and demonstrate novel detection capabilities for depleted Uranium on Army lands."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.941"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determine effectiveness of green remediation technologies on munitions constituents and select appropriate field sites for validation; predict the effects of landscape contouring and identify optimal placement of treatment systems to ensure the selection of efficient and cost-effective treatment designs; incorporate terrestrial animal uptake values, contaminant flow in food webs, as well as the effects of stabilization and removal activities on uptake and toxicity of depleted Uranium in ecological risk assessment models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.287"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.287"
                                            },
                                            "Text": {
                                                "val": "Will mature technologies that will provide an integrated approach to contamination management in range and installation design; complete development of methods for the cost effective and environmentally protective management and\/or removal of small (size of the granular media or smaller) metallic Depleted Uranium and residues from affected soils and sands; initiate development of a virtual model for wastewater treatment of munitions production water and investigate new technologies for improved water quality of surface water and wetlands impacted by development and use of new munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Risk Prediction and Decision Technologies (Previously titled - Risk Prediction and Mitigation Technologies)"
                                    },
                                    "Description": {
                                        "val": "This effort develops and demonstrates capabilities to anticipate and adapt to multiple environmental related stressors to Army lands and mission space and provides capability to incorporate science-based environmental life-cycle into acquisition decision."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.939"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature a decision framework and screening assessment tool to evaluate multi-stressor climatic change impacts to vulnerable Army installations based on mission critical criterion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.150"
                                            },
                                            "Text": {
                                                "val": "Will complete and apply climate models under site level simulation frameworks to validate web-based visualization tools that provide a framework for assessing multi-stressor impacts due to predictive climatic changes; demonstrate appropriate protocols for generating\/parameterizing environmental risk data and parameterization for modifying existing life-cycle analysis of munitions constituents."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}