{
    "id": "8b79f6c5f6e785ce82ecc12a853ee9c150f5904d",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0208006F"
        },
        "ProgramElementTitle": {
            "val": "Mission Planning Systems"
        },
        "R1LineItemNumber": {
            "val": "167"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "61.207"
            },
            "CurrentYear": {
                "val": "69.377"
            },
            "BudgetYearOne": {
                "val": "62.605"
            },
            "BudgetYearOneBase": {
                "val": "62.605"
            },
            "BudgetYearTwo": {
                "val": "86.628"
            },
            "BudgetYearThree": {
                "val": "86.700"
            },
            "BudgetYearFour": {
                "val": "78.456"
            },
            "BudgetYearFive": {
                "val": "79.010"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Mission planning involves the creation of a flight plan based on threats, targets, terrain, weather, aircraft performance capability, and configuration.  It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie.  The planner must have the ability to plan weapons, cargo, passenger, and\/or fuel delivery, calculate fuel requirements, and assess the route based on known enemy threat location and type.  Mission planners must be able to optimize and de-conflict flight routes with other aircraft; review, print, and brief the mission plan; and download pertinent flight information to on-board aircraft avionics.\n\nThe Mission Planning Systems (MPS) program is a collaborative program with the Army and Navy to leverage technical solutions and business practices for all Department of Defense (DoD) platforms.  It provides automated mission planning tools and support for fixed and rotary wing aircraft and guided munitions.  It replaced two closed architecture legacy mission planning systems (Unix-based MPS (Unix-MPS) and the PC-based Portable Flight Planning Software (PFPS)), with a single multi-service open architecture system more commonly referred to as the Joint Mission Planning System (JMPS).  MPS will compress the mission planning cycle by providing an improved integrated planning environment, reducing the time required to respond to changing situations and urgent needs such as striking time sensitive\/critical targets and conducting combat search and rescue.  The MPS development program will migrate a variety of Air Force aircraft, weapons, and airdrop payload systems from legacy mission planners to MPS.  These systems include, but are not limited to the: A-10, B-1B, C-5, C-17, C-130, E-3, E-8, F-15, F-16, F-22A, RC-135, HH-60, and their associated weapons (e.g. Small Diameter Bomb (SDB), Joint Direct Attack Munitions (JDAM), Joint Air-to-Surface Standoff Munitions (JASSM), etc.) and airdrop payloads.  In addition, basic MPS products have the potential to support all DoD fixed-wing and rotary-wing aircraft and will be shared with other AF programs, as well as the Army and Navy.  MPS will deliver significant benefits to command and control performance by enhancing information superiority for the warfighter and by providing unique capabilities in support of both precision engagement and dominant maneuver.  To meet the unique needs of Air Mobility Command (AMC), the Mobility Air Force Automated Flight Planning Service (MAFPS) component of MPS will provide a centralized\/net-centric global mobility mission flight planning capability. This service will provide significant fuel savings through automated flight route optimization utilizing aircraft performance, air traffic management, weather, and other data.  Additionally, elements of Mission Planning Systems will be utilized to continue the development of a Joint Precision Airdrop System (JPADS) in conjunction with the Army.\n\nThe JPADS System of Systems (SoS) capability provides a planning and execution capability for DoD airdrop requirements. It is the primary airdrop mission planning and execution system for all ballistic airdrop mission, as well as precision guided airdrops that are required when the mission profile or surface-to-air threat assessment warrants a high-altitude and\/or standoff precision delivery.  JPADS enables high-altitude, precise airdrop delivery to forward ground forces, mitigating surface-to-air threats, reducing risk of Improvised Explosive Device (IED), and insurgent attack on ground convoys. JPADS allows the warfighter to consider weather, terrain, aircraft capabilities, threat, etc. to accurately deliver payloads to keep the warfighter supplied and in the fight.\n\nThis program is in Budget Activity 7, Operational System Development, which includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "63.009"
                },
                "CurrentYear": {
                    "val": "69.377"
                },
                "BudgetYearOne": {
                    "val": "70.332"
                },
                "BudgetYearOneBase": {
                    "val": "70.332"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "61.207"
                },
                "CurrentYear": {
                    "val": "69.377"
                },
                "BudgetYearOne": {
                    "val": "62.605"
                },
                "BudgetYearOneBase": {
                    "val": "62.605"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.802"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-7.727"
                },
                "BudgetYearOneBase": {
                    "val": "-7.727"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.802"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-7.727"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.727"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2014 increased by $4.200M for development of Mobility Air Forces (MAF) Automated Flight Planning Service (MAFPS).\n\nFY2014 decreased by $11.927M for higher Air Force priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "673858"
                    },
                    "ProjectTitle": {
                        "val": "Mission Planning Systems (MPS) Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.198"
                        },
                        "CurrentYear": {
                            "val": "6.405"
                        },
                        "BudgetYearOne": {
                            "val": "0.277"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.277"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project 673858 was renamed Mission Planning Systems Development from Mission Planning Systems in FY13."
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission planning involves the creation of a flight plan based on threats, targets, terrain, weather, aircraft performance capability and configuration. It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie. The planner must have the ability to plan weapon, cargo, passenger, and\/or fuel delivery, calculate fuel requirement and assess the route based on known enemy threat location and type. Mission planners must be able to optimize and de-conflict flight routes with other aircraft; review, print and brief the plan; and download pertinent flight information to on-board aircraft avionics.\n\nThis project provides for the continuous improvement of mission planning software capabilities that cut across all platforms and systems. It allows for the investigation of new technologies and products that have the potential for improving mission planning systems. This includes the continuous upgrading of the MPS framework. The framework is the underlying baseline for all mission planning systems. It will require continuous upgrades to: 1) reduce timelines for route planning; 2) transmit near real-time intelligence data to the platforms; 3) increase the accuracy of the mapping products; 4) provide a Windows-based, commercial off the shelf-based, user friendly product; and 5) retain compatibility with platform changes to avionics and operational flight programs. Development and modernization activities within this project are as follows:\n\na. MPS Increment IV: Continues development activities to complete the initial migration of designated Increment IV platforms (from the Combat Air Forces (CAF) and Mobility Air Forces (MAF--includes Special Mission Air Combat Command (SMACC) aircraft) to the new MPS planning capability. This includes the F-22 Mission Planning Environment (MPE) which will support new capabilities for weapons integration, sensor updates, and avionics changes integrated on board the aircraft. Planned updates include transitioning selected platform to the Windows 7 operating system. Additionally, the development effort will also address new and emerging Operational Flight Program (OFP)-generated requirements as identified by the operational users. Maintenance and common component updates will be completed as required.\n\nb. MPS Modernization: Continues the modernization of overarching technologies (including the framework) to support development of Mission Planning Environments (MPEs) for various CAF and MAF platforms. Development funding for these modernization efforts will move to project 675380 in FY14.\n\nc. CAF MPE Modernization: This effort will modernize CAF MPEs originally developed and delivered under MPS Increments II & IV. The modernization effort will provide new and improved mission planning capability for individual OFP requirements, such as new weapons, avionics upgrades, communications systems, etc. The OFPs requiring MPE updates under the CAF Modernization effort include but are not limited to those for A-10 (Suites 8, 9, 10, 11, 12), B-1B (Sustainment Blocks (SB) 15, 16, 16a, 17 and 18), and F-15 (Suites 7, 8, 9, and 10). CAF modernization also includes updates to mission planning capabilities supporting associated weapons, including Small Diameter Bomb (SDB), Joint Direct Attack Munitions (JDAM) and the Joint Air-to-Surface Standoff Missile (JASSM). Finally, CAF modernization will address required improvements to CAF related MPE Common Components (CCs), including Precision-Guided Munitions Planning System (PGMPS), Electronic Warfare CC (EWCC), etc. Development funding for these modernization efforts will move to project 675380 in FY14.\n\nd. MAF MPE Modernization: This effort modifies the common MAF MPE developed and deployed during previous mission planning increments. The modernization activities will provide new and improved mission planning capabilities for the MAF fleet as required to meet evolving OFPs, fuel efficiency, and Global Planning netcentric requirements such as avionics upgrades, communication systems, interfaces with command and control systems, new chute data, etc. for various MAF platforms. The MPE updates under the MAF Modernization effort include but are not limited to those for Air Mobility Command--C-5, C-17, C-27, C-130s (multiple variants), KC-10, KC-46, and KC-135 and Special Mission Air Combat Command--E-3, E-8, E-4, HH-60, and RC-135. MAF modernization will also address required improvements to and integration of MAF related MPE CCs, including the Communications, Navigation Surveillance\/Air Traffic Management (CNS\/ATM) CC, Consolidated Airdrop Tool (CAT), Aeronautical Advisory and Notices to Airmen Tool (AANT), and Air Refueling Tool (ART) CC, etc. Development funding for these modernization efforts will move to project 675380 in FY14.\n\ne. Test, Training and Certification: Continues all MPS-related integration, test, and certification activities for CAF and MAF platforms. Funding for these support efforts will be programmed with their associated project\/program in FY14 and the outyears.\n\nf. Operational and Technical Support: Continues all program office management operations and support activities to ensure the timely delivery of mission planning systems to the warfighter. \n\nThis program is in Budget Activity 7, Operational System Development, budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production, and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MPS Increment IV"
                                    },
                                    "Description": {
                                        "val": "Continues contractor-executed software development and test activities required to migrate selected CAF and MAF platforms to the new MPS Increment IV mission planning capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.940"
                                            },
                                            "Text": {
                                                "val": "Continued development of the unique planning component portion of MPEs for the F-22 and A-10.  Initial development of F-22 MPE includes migration to the Windows 7 Operating System as well as Link-16 enhancements, the Global Pilot Vehicle Interface, Combat Identification, and Electronic Protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.909"
                                            },
                                            "Text": {
                                                "val": "Completes development and contractor testing of unique planning component of the MPE for F-22 and A-10."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.261"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.261"
                                            },
                                            "Text": {
                                                "val": "Will complete operational testing of OFP-driven updates (e.g. Global Pilot Vehicle Interface, Windows 7 operating environment, Link 16, Combat ID) for the F-22 MPE."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management Administration"
                                    },
                                    "Description": {
                                        "val": "Continues all program management office technical and administrative activities and operations necessary to support development and fielding of all MPS capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.258"
                                            },
                                            "Text": {
                                                "val": "Provided ongoing program support to the various efforts within Project 673858, MPS Development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.496"
                                            },
                                            "Text": {
                                                "val": "Provides ongoing program support to the various efforts within Project 673858, MPS Development"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.016"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.016"
                                            },
                                            "Text": {
                                                "val": "Provides ongoing program support to the various efforts within Project 673858, MPS Development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "MPS development utilizes an evolutionary acquisition approach to develop and deliver an interoperable, network-centric, mission planning system tailored for numerous Air Force platforms using competition and multiple contract vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Prior to FY12, Systems Engineering and Integration, Framework, and Common Component costs were funded in project 673858.  Beginning in FY12, projects 675302 and 675380 will also fund these costs."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Mission Planning Enterprise Contract II"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.707"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.605"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.180"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.180"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.191"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.937"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.031"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.031"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "A-10 Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Organic"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Prior to FY12, all support costs were funded in project 673858.   Beginning in FY12, projects 675302 and 675380 will also fund these costs."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Engineering Institute ( SEI)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SEI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pittsburgh, PA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.019"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.011"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tecolote (Cost Estimating)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tecolote Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.022"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Prior to FY12, all test and evaluation costs were funded in project 673858.  Beginning in FY12, projects 675302 and 675380 will also fund these costs."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Responsible Test Organization (RTO)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "46TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB, FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.390"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.195"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.022"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.022"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Certification and Accreditation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Indian Head, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.017"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.007"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Type I Training"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Ogden Air Logistics Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.269"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.103"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.024"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.024"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Field Representative Hardware"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.026"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.062"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.004"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.004"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Prior to FY12, all management services costs were funded in project 673858. Beginning in FY12, projects 675302 and 675380 will also fund these costs."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FFRDC Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mitre Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.181"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.222"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.007"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.007"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.048"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.241"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.009"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.009"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_673858_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "F-22 Inc 3.2A v12.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "A-10 Suite 7B Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Program Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675302"
                    },
                    "ProjectTitle": {
                        "val": "Precision Aerial Delivery Systems (PADS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.361"
                        },
                        "CurrentYear": {
                            "val": "5.546"
                        },
                        "BudgetYearOne": {
                            "val": "3.299"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.299"
                        },
                        "BudgetYearTwo": {
                            "val": "7.059"
                        },
                        "BudgetYearThree": {
                            "val": "12.126"
                        },
                        "BudgetYearFour": {
                            "val": "12.904"
                        },
                        "BudgetYearFive": {
                            "val": "14.235"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project 675302 was renamed Precision Aerial Delivery Systems (PADS) from Mobility Air Forces (MAF) Planning Systems in FY13."
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission planning involves the creation of a flight plan based on multiple inputs including threats, targets, terrain, weather, aircraft performance capability, and configuration. It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie. The planner must have the ability to plan weapon, cargo, passenger, and\/or fuel delivery, calculate fuel requirement and assess the route based on known enemy threat location and type. Mission planners must be able to optimize and de-conflict flight routes with other aircraft; review, print and brief the plan; download pertinent flight information to on-board aircraft avionics; and, conduct dynamic\/in-flight replanning as applicable.  This project continues the development of a Joint Precision Airdrop System-Mission Planner (JPADS-MP) in conjunction with the Army.  The JPADS System of Systems (SoS) capability provides a planning and execution capability for DoD airdrop requirements. It is the primary airdrop mission planning and execution system for all ballistic airdrop mission as well as precision guided airdrops that are required when the mission profile or surface-to-air threat assessment warrants a high-altitude and\/or standoff precision delivery.  JPADS enables high-altitude, precise airdrop delivery to forward ground forces, mitigating surface-to-air threats, reducing risk of Improvised Explosive Device (IED) & insurgent attack on ground convoys. JPADS allows the warfighter to consider weather, terrain, aircraft capabilities, threat, etc. to accurately deliver payloads to keep the warfighter supplied and in the fight.\n\nThe Joint Precision Airdrop System-Mission Planner (JPADS-MP) program of record (PoR), of which the Consolidated Airdrop Tool (CAT) software is a key deliverable, continues development of CAT to provide precision and conventional airdrop capability for AF and other services (e.g the Army, etc).  Future releases of CAT software concentrate on increasing the accuracy of airdrop mission planning by improving aircraft, payload, and chute specific calculations along with weather analysis visualization tools specifically adapted for airdrop.  In addition, the AFRL led Precision Airdrop (PAD) Flagship Capability Concept (FCC) effort will transition capabilities to the JPADS-MP PoR, specifically into various CAT software release deliverables. The PAD FCC is charged with updating airdrop platforms and airdrop related systems to improve accuracy across all airdrop mission types.\n \na.  CAT 2.x includes but is not limited to Digital Terrain Data (DTED), Wireless Gate Release (WGRS), and aircraft specific Monte Carlo solutions.  CAT v3.x includes but is not limited to updates to the operating systems and standard desktop configuration (SDC), refactor of the weather component known as WinPADS, replaces the Local Area Prediction System (LAPS), and Airdrop Damage Estimate (ADE) capabilities.  CAT 3.x also transitions and supports the AFRL PADS FCC capability of bundle tracking.\n\nb.  CAT 4.x includes but is not limited to OS\/SDC updates, migration to JMPS, combination airdrop and new map projections including polar stereographic.  CAT v5.x includes but is not limited to approach headings for guided systems, secondary cargo airdrop release, and transitions AFRL PADS FCC forced exit and humanitarian airdrop capabilities.  CAT v6.x includes but is not limited to new chute configurations and aerial guidance units, updates ballistics data and dispersion models and transitions AFRL PADS FCC Light Detection and Ranging (LIDAR) and RADAR sensing capabilities for real-time weather.  CAT v7.x includes but is not limited to OS\/SDC updates, force deployment, and transitions AFRL PADS FCC human effectiveness capabilities.\n\nThis program is in Budget Activity 7, Operational System Development, which includes development efforts to upgrade systems that have been fielded or have received approval for full rate production, and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JPADS Development"
                                    },
                                    "Description": {
                                        "val": "Continue development of a JPADS capability for precise, high altitude delivery of material to forward ground forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.702"
                                            },
                                            "Text": {
                                                "val": "Continued development of a JPADS capability for precise, high altitude delivery of material to forward ground forces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.909"
                                            },
                                            "Text": {
                                                "val": "CAT v3.x effort will: 1) Modify the airdrop software for the integration of new solution to replace the antiquated \"black box\" module Local Analysis and Prediction System (LAPS) for improved localized weather modeling; 2) develop aircraft\/chute system specific calculations for increased accuracy; 3) develop capability for airdrop software to ingest updates to payload ballistic data; 4) develop capability to display location of dropped bundles real-time on the mission computer; and 5) make necessary updates in the software to accommodate new mission computers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.725"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.725"
                                            },
                                            "Text": {
                                                "val": "CAT v3.x will develop and integrate weather forecast and analysis tools customized for precision airdrop, and integrate Airdrop Damage Estimate (ADE) tool for improved planning.  Efforts also include revising the work-flow of the software and maximizing automation in order to simplify mission execution for the aircrew. CAT v4.x development activities expand precision airdrop capabilities for accurate calculating leaflet dispersion and developing calculations and capabilities for combination airdrop for personnel and heavy equipment in a single pass.  Efforts also include the migration of airdrop software to a JMPS framework."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management Administration"
                                    },
                                    "Description": {
                                        "val": "Ongoing program support for various efforts within Project 675302, Precision Aerial Delivery Systems (PADS).  All FY11 and prior year program support resided in Project 675838, MPS Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.659"
                                            },
                                            "Text": {
                                                "val": "Provided ongoing program support for various efforts within Project 675302, Precision Aerial Delivery Systems (PADS)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.637"
                                            },
                                            "Text": {
                                                "val": "Provides ongoing program support for various efforts within Project 675302, Precision Aerial Delivery Systems (PADS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.574"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.574"
                                            },
                                            "Text": {
                                                "val": "Provides ongoing program support for various efforts within Project 675302, Precision Aerial Delivery Systems (PADS)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA07: Line Item # 833170"
                                    },
                                    "Title": {
                                        "val": "Mission Planning Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.709"
                                        },
                                        "CurrentYear": {
                                            "val": "8.487"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.525"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.525"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.175"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.348"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.525"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.696"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "PADS utilizes an evolutionary acquisition approach to develop and deliver an interoperable, network-centric, mission planning system tailored for numerous Air Force platforms using competition and multiple contract vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Systems Engineering and Integration costs were programmed in project 673858 prior to FY12."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DITCO IV Contract"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TYBRIN"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Walton Beach, FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.566"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.897"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.561"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.561"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.749"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.471"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.690"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.690"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Engineering Institute (SEI)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SEI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pittsburgh, PA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.014"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.012"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.012"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tecolote (Cost Estimating)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tecolote Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.028"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.024"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.024"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Test and Evaluation costs were programmed in project 673858 prior to FY12."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Responsible Test Organization (RTO)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "46TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB, FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.215"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.287"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Certification and Accreditation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Indian Head, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.010"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.011"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.010"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.010"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Type I Training"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Ogden Air Logistics Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.148"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.151"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.133"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.133"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Field Representative Hardware"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.014"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.092"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.081"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.081"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Management Services costs were programmed in project 673858 prior to FY12."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FFRDC Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.285"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.243"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.243"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.659"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.310"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.295"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.295"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_675302_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v2.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v2.2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v3.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v3.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v3.2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v4.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v5.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v6.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v7.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Program Office Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675380"
                    },
                    "ProjectTitle": {
                        "val": "Mission Planning Systems (MPS) Modernization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "49.648"
                        },
                        "CurrentYear": {
                            "val": "57.426"
                        },
                        "BudgetYearOne": {
                            "val": "59.029"
                        },
                        "BudgetYearOneBase": {
                            "val": "59.029"
                        },
                        "BudgetYearTwo": {
                            "val": "79.569"
                        },
                        "BudgetYearThree": {
                            "val": "74.574"
                        },
                        "BudgetYearFour": {
                            "val": "65.552"
                        },
                        "BudgetYearFive": {
                            "val": "64.775"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project 675380 was renamed Mission Planning Systems (MPS) Modernization from Combat Air Forces (CAF) Planning Systems in FY13.\n\nAll MPS Modernization efforts will be centralized in project 675380 starting in FY14, including efforts previously found in project 673858."
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission planning involves the creation of a flight plan based on threats, targets, terrain, weather, aircraft performance capability and configuration.  It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie.  The planner must have the ability to plan weapons, cargo, passenger, and\/or fuel delivery, calculate fuel requirement, and assess the route based on known enemy threat location and type.  Mission planners must be able to optimize and de-conflict flight routes with other aircraft, review, print and brief the plan; and download pertinent flight information to on-board aircraft avionics.  This project focuses on modernizing MPS to support Combat Air Forces (CAF) and Mobility Air Forces (MAF), including the development, test and sustainment of Mission Planning Environments (MPEs) to support the A-10, B-1B, C-5, C-17, C- 27, C-130, E-3, E-8, F-15, F-16, F-22A, KC-10, KC-46, KC-135, RC-135, other platforms, and all common component (CCs)software tools  currently approved as necessary for mission requirements.  Activities also include studies and analysis to support both current program planning and execution and future program planning.  MPS modernization efforts are as follows:\n\na. MPS Increment IV Development: This effort continues update\/development activities for platforms that previously transitioned to MPS (e.g. F-15, F-16, A-10, B-1B, and F-22A Increment 3.2A) to provide capabilities in accordance with the Increment IV Capability Development Document (CDD). In addition, it also upgrades several common components (CCs) that are utilized on a variety of CAF platforms. Starting in FY13, all MPS Increment IV Development efforts will reside in Project 673858, Mission Planning Systems (MPS) development.\n\nb. CAF MPE Modernization: These efforts modernize CAF MPEs that were developed and delivered under MPS Increments II and IV. The modernization effort will provide new and improved mission planning capability for individual Operational Flight Program (OFP) requirements, such as new weapons, avionics upgrades, communications systems, etc. The OFPs requiring MPE updates under the CAF modernization effort in Fiscal Years 2011 through 2017 include but are not limited to those for A-10 (Suites 8, 9, 10, 11, and 12), B-1B (Sustainment Blocks 15, 16, 16a, 17 and 18), F-15 (Suites 7, 8, 9, and 10), F-16 Block 30 (System Capability Upgrade [SCU] 8, 9, and 10), F-16 Block 40\/50 (M6.1, M6.5, M7.1, and M8.0) and F-22 (Increments 3.2B, 3.2C, and 4.0). CAF modernization also includes updates to mission planning capabilities supporting associated weapons, including small diameter bomb (SDB-II), joint direct attack munitions (JDAM) and the Joint air-to-surface standoff missile (JASSM). Finally, CAF modernization will address required improvements to CAF related MPE CCs, including Precision-Guided Munitions Planning System (PGMPS), Electronic Warfare CC (EWCC), etc.\n\n(Starting in FY14, CAF MPE Modernization is broken out into specific platforms as per the following.)\n\n1) F-15 Modernization:  This modernization program consists of multiple software development efforts driven by OFPs updates for F-15 Suites 7, 8, and 9.  Suite 7 MPE capabilities include, but are not limited to, Digital Transfer Device (DTD) improvements, updates for new features in weapons such as Joint Direct Attack Munition (JDAM), Small Diameter Bomb (SDB), AIM-9X, AIM-120D, and Network Enable Weapon support elements (e.g. key handling, weapon data link, and Link 16).  It will also include enhancements to the synthetic aperture radar planning tool (SAR-PT) and the global area reference tool as well as radar modernization updates (e.g. combat identification, radar planning tool enhancements).  Development efforts for F-15 Suite 8 include, but are not limited to, integration of B61 Life Extension Program, feature updates for several weapons, and the expansion of Link-16 messages sets.  F-15 Suite 9 MPE updates will include a variety of updates and enhancements for weapons and aircraft systems.\n\n2) F-16 Block 30 Modernization:  The F-16 Block 30 modernization effort will support new aircraft capabilities established in OFPs for the SCU8, SCU9, and SCU10.  The effort will also migrate the F-16 Block 30 Mission Planning Environment (MPE) to the Windows 7 operating system and the current version of the MPS Framework.  SCU8 system capabilities include the addition of Helmet Mounted Integrated Targeting (HMIT), Small Diameter Bomb (SDB), the AIM-120D missile variant and Center Display Unit (CDU) Integration.  SCU9 capabilities include finishing HMIT and CDU integrations, support of Threat Symbology\/Correlation (TS\/C) file import (commonality with F-16 Block 40\/50) and the addition of the Laser JDAM.\n\n3) F-16 Block 40\/50 Modernization:  The F-16 Block 40\/50 modernization efforts will provide the capability within the MPE to plan\/utilize a number or OFP-driven capabilities in the platform.  These capabilities include, but are not limited to, integrating the universal armament interface (UAI) with the most recent version of precision guided munitions planning software (PGMPS) to give the platform the ability to plan missions for any type of network enabled weapon (NEW).  It will also provide for UAI compliance with the small diameter bomb (SDB; GBU-39) and the laser joint direct attack munition (LJDAM; GBU-54).  The modernization effort will also provide for the use of the advanced identification friend or foe (AIFF) Mode 5 capability in the F-16 Blk 40\/50.  AIFF will allow use of enhanced authentication and verification of friendly signals, through the incorporation of cryptographically secured signals.  It will also introduce Automatic Dependent Surveillance-Broadcast (ADS-B) technology and facilitate compliance with standards for the Next Generation Air Transportation System (NextGen).  The development effort will also migrate the F-16 Block 40\/50 MPE to the Windows 7 operating environment\n\n4) F-22 Modernization:  F-22 OFP-driven enhancements include, but are not limited to the addition of improved capabilities for the AIM-9X and AIM-120D, the incorporation of additional electronic protection tasks, the small diameter bomb target list manager, combat identification improvements, installation of the auto ground collision avoidance system, and incorporation of the synthetic aperture radar planning tool.  Additionally, other new and emerging OFP-generated requirements will be addressed as identified by the operational user(s).  Other common component updates will also be completed as required.\n\n5) B-1 Modernization:  The B-1 Modernization program includes OFP-driven software updates for Releases 7.0, 8.0, and 9.0.  It will incrementally update the platform MPE and provide for integration with the Reliability and Maintainability Improvement Program (RMIP)\/Inertial Navigation System Replacement (INSR), Laptop Computer Targeting Pod Phase 2 (LCTP), Integrated Battle Station elements (including Fully Integrated Data Link\/Visual Situation Display Upgrade (VSDU)), Central Integrated Test System Upgrade (CITS), and related follow on enhancements.  Additionally it will migrate the B-1 MPE to the Windows 7 operating system and convert the B-1 Unit Planning Component (UPC) Visual Basic (VB) code to C# .NET.\n\n6) A-10 Modernization:  The A-10 effort will continue to support aircraft OFP-driven capability enhancement for Suite 7B and Suite 8.  Suite 7B capabilities include, but are not limited to, JPEG 2000 Maps, Situational Awareness Data Link (SADL) Crypto Upgrade, Electronic Warfare Threat Table Correlation, pre-planning combat search and rescue parameters and helmet mounted cueing system updates.  Suite 8 capabilities include, but are not limited to, the addition of Mode 5 IFF, Combat Survivor Evader Locator (CSEL), Laser JDAM (Joint Direct Attack Munition), AGM-65L (Laser Code Entry), advanced targeting pod mission planning settings, and combat search and rescue post mission enhancements. The modernization effort will also migrate the A-10 Mission Planning Environment (MPE) to the Windows 7 operating system and the current version of the MPS framework.\n\nc. MAF MPE Modernization: This effort modifies the common MAF MPE developed and deployed during previous mission planning increments. The modernization activities will provide new and improved mission planning capabilities for the MAF fleet as required to meet evolving OFP, fuel efficiency, and global planning netcentric requirements such as avionics upgrades, communication systems, interfaces with command and control systems, new chute types, etc. for various MAF platforms. The MPE updates under the MAF Modernization effort include but are not limited to those for Air Mobility Command--C-5, C-17, C-27, C-130s (multiple variants), KC-10, KC-46, and KC-135 and Special Mission Air Combat Command--E-3, E-8, E-4, HH-60, and RC-135. MAF modernization will also address required improvements to and integration of MAF related MPE CCs, including the Communications, Navigation Surveillance\/Air Traffic Management (CNS\/ATM) CC, Aeronautical Advisory and Notices to Airmen Tool (AANT), and Air Refueling Tool (ART) CC, etc. This effort also provides the capability to use the new Digital Aeronautical Information File (DAFIF) web services-based data structure being produced by NGA in this timeframe.\n\n1) ACC Special Missions Modernization: The ACC Special Mission Modernization Program includes development and testing of mission planning software for the E-3\/E-8 (v2.0, 3.0, and 3.1), RC-135 (v3.0), and EC-130 (v1.0) platforms. The main purpose of the E-3\/E-8 v2.0 software is to provide Windows 7 capability to maintain SDC compliance. The purpose of the E-3\/E-8 v3.0 development effort is to add requested enhancements, while v3.1 will deliver software that is fully compatible with the E-3 DRAGON avionics upgrade, including CNS\/ATM certification. RC-135 v3.0 will include compatibility with potential aircraft avionics upgrades and maintain SDC and Windows compliance. EC-130 v1.0 will be the platform's first release on the JMPS software. Work will also commence on the Phase 2 program for these aircraft.\n\n2) MAF MPS Modernization (AMC Transition): This effort modifies the common MAF MPE developed and deployed during previous mission planning increments. It will provide new and improved mission planning capabilities for the MAF fleet (e.g. C-5, C-130, KC-10, etc.) as required to meet OFP, fuel efficiency, and global planning net-centric requirements. It includes enhanced capabilities to accommodate avionics upgrades, improved communications systems, interfaces with command and control systems, new chutes, etc. for various MAF platforms. Development efforts also include integrating improvements to MAF related Common Components (CCs). Examples of these CCs include the Communication, Navigation, Surveillance\/Air Traffic Management (CNS\/ATM) CC, Consolidated Airdrop Tool (CAT), Aeronautical Advisory and Notices to Airmen Tool (AANT), and Air Refueling Tool (ART). This effort also provides the capability to use the new Digital Aeronautical Information File (DAFIF) services-based data structure being produced by NGA.\n\nd.  Mobility Air Force Automated Flight Planning Service (MAFPS):  This effort includes development of a centralized\/net-centric global mobility flight planning capability, which will provide significant fuel savings through automated flight route, airspeed, and altitude optimization utilizing aircraft performance, air traffic management, weather, and other data.\n\ne. Test, Training and Certification: Continues all MPS-related integration, test, and certification activities for all CAF and MAF platforms.\n\nf. Program Support: Continues all program office management operations and support activities to ensure the timely delivery of mission planning systems to the warfighter.\n \nThis program is in Budget Activity 7, Operational System Development, which includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and, anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "F-15 Modernization"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded F-15 MPEs to enable efficient use of new and improved capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.407"
                                            },
                                            "Text": {
                                                "val": "Completed testing and fielding of v3.0, which improves Digital Transfer Device performance and Weapons updates for new features, and v3.1, which adds the Image Capture Tool & LOS Planning Tool, changes to Common Components, and Updates to support Radar Modernization.   Started development of v3.2, which integrates the Small Diameter Bomb II including Network Enable Weapons support elements, and ACC driven enhancements to planning tools.  Starting development of v4.0, which integrates B61 Life Extension Program support, weapons updates, and expansion of Link-16 message sets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.295"
                                            },
                                            "Text": {
                                                "val": "Continue development of v3.2 and v4.0, which include B61-LEP and additional OFP requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.762"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.762"
                                            },
                                            "Text": {
                                                "val": "Will complete development and testing (DT\/OT) of SDB II improvements. Will continue development of radar and other weapon updates (e.g. B61 LEP, key data loading). Will initiate development of OFP-driven updates for F-15 Suite 9."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-16 Block 30 Modernization"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded F-16 Block 30 MPEs to enable efficient use of new and improved capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.276"
                                            },
                                            "Text": {
                                                "val": "Completed development, flight test release and formal qualification testing of the SCU8 MPE, which adds Helmet Mounted Integrated Targeting (HMIT), Small Diameter Bomb (SDB), and the AIM-120D missile variant.  Completed initial design activities for SCU9, which finishes HMIT integration, support of Threat Symbology\/Correlation (TS\/C) File import, and the addition of Laser JDAM."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.973"
                                            },
                                            "Text": {
                                                "val": "Complete software development\/testing to migrate F-16 SCU8 to Windows 7 operating environment.  Initiate development of F-16 SCU9 updates to incorporate Laser JDAM, threat symbology\/correlation, and other capabilities.  Initiate requirements planning and definitization for F-16 SCU10 updates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.881"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.881"
                                            },
                                            "Text": {
                                                "val": "Will complete development and testing of F-16 SCU9 updates (e.g. Laser JDAM, threat symbology\/correlation). Will initiate requirements definitization\/planning and initial design activities for F-16 SCU10 updates."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-16 Block 40\/50 Modernization"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded F-16 Block 40\/50 MPEs to enable efficient use of new and improved capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.818"
                                            },
                                            "Text": {
                                                "val": "Completed the development of M6.1\/M6.1+, which includes the Universal Armament Interface (UAI), Network Enabled Weapons (NEW), and Advanced Identification Friend or Foe (AIFF) Mode 5. Begins M7.1+ development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.221"
                                            },
                                            "Text": {
                                                "val": "Continues the development of M6.5\/M6.5+, which implements UAI Mission Planning 1 (MP1) completion, Weapons Data Link, and Common Weapons Employment Zone (CWEZ) Updates, will commence in support of that OFP. M7.1+ will continue development throughout FY13 and will include Mission Plannable Declutter, Pattern Management for UAI, and CWEZ."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.151"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.151"
                                            },
                                            "Text": {
                                                "val": "Will near completion of development of M6.5\/M6.5+. The M7.1+ will continue development throughout FY14. Capabilities include, but are not limited to, UAI MP2 Completion, Weapons Data Link, and Common Weapons Employment Zone updates."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-22 Modernization"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded F-22 MPEs to enable efficient use of new and improved capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.085"
                                            },
                                            "Text": {
                                                "val": "Started F-22 JMPS modernization effort with start of v13.0 development. Version 13.0 adds the AIM-9X\/AIM-120D capabilities, Electronic Protection Tasks, and the SDB Target List Manager."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.305"
                                            },
                                            "Text": {
                                                "val": "Initiate MPE integration and transition to Framework 1.5.1.x.  Conduct Preliminary Design Reviews and developer evaluations in support of v13.0 development and user enhancements to tools, Framework, and common component updates.  Implement correction of v12.0 deficiencies identified during Government testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.236"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.236"
                                            },
                                            "Text": {
                                                "val": "Will continue development of v13.0.  Capabilities for v13.0 include, but are not limited to, addition of AIM-9X and AIM-120D, incorporation of additional Electronic Protection Tasks, Small Diameter Bomb Target List Manager, Combat Identification improvements, and installation of Auto Ground Collision Avoidance System and the Synthetic Aperture Radar Planning Tool."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "A-10 Modernization"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded A-10 MPEs to enable efficient use of new and improved capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.541"
                                            },
                                            "Text": {
                                                "val": "Continued development and evaluation of A-10 Suite 7B, which includes JPEG 2000 Maps, upgrades Situational Awareness Data Link (SADL) Crypto, and implements Electronic Warfare Threat Table Correlation, pre-planning Combat Search and Rescue parameters and Helmet Mounted Cueing System updates. Completed A-10 Suite 7B development and operational testing (DT\/OT)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.599"
                                            },
                                            "Text": {
                                                "val": "Continue A-10 Suite 8 development.  Capabilities include, but are not limited to, the addition of Mode 5 IFF, CSEL (Combat Survivor Evader Locator), Laser JDAM (Joint Direct Attack Munition), AGM-65L (Laser Code Entry), Advanced Targeting Pod Mission Planning Settings, and CSAR Post Mission Enhancements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.697"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.697"
                                            },
                                            "Text": {
                                                "val": "Will complete A-10 Suite 8 DT\/OT. Will initiate initial design reviews for A-10 Suite 9."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "B-1 Modernization"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded B-1 MPEs to enable efficient use of new and improved capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.803"
                                            },
                                            "Text": {
                                                "val": "Continued development of B-1 Release 7.0 (which provides mission planning collaboration capability, migration to Windows 7, conversion of B-1 UPC Visual Basic code to C-Sharp, Merge RMIP\/INSR and LCTP Phase 2) will support Software Block (SB) 15 and 16 requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.837"
                                            },
                                            "Text": {
                                                "val": "Completes B-1 Release 7.0 FQT and associated activities to field for support of SB16. Conducting initial design reviews and Full Qualification Testing (FQT) for Rel 8.0 (which will update de-clutter configuration tool and defensive threat rings) to support SB 16A requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.573"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.573"
                                            },
                                            "Text": {
                                                "val": "Will complete operational test (OT) and field Release 8.0. Will conduct initial design reviews for Rel 9.0 which will update FIDL\/VSDU displays and provide for the initialization of ARC 210 radio with Beyond Line Of Site (BLOS) capabilities to support SB 17 requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MAF MPS Modernization (AMC Transition)"
                                    },
                                    "Description": {
                                        "val": "Efforts include the start and continuation of activities for the modernization of the MAF MPE to include C-5, C-17, C-130s, C-27, KC-10, KC-135, and KC-46 platforms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.157"
                                            },
                                            "Text": {
                                                "val": "Conduct development and test activities of Framework 1.5.300 to support MAF MPS modernization requirements.  Ensure legacy capabililties for various tools are supported in the JMPS program.  Such tools include, but are not limited to, the Drop Zone\/Landing Zone (DZLZ) database manager and Enterprise Administration and Synchronization Environment (EASE)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.694"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.694"
                                            },
                                            "Text": {
                                                "val": "Efforts will include the following: Development and integration of Global Mobility JMPS UPC\/MPE releases; development, integration, and test of the Air Refueling Tool CC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ACC Special Missions Modernization"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded mission planning software environments for the E-3, E-8, E-4, EC-130, and RC-135."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.636"
                                            },
                                            "Text": {
                                                "val": "Continued development of E-3\/E-8 MPE to transition software to latest SDC\/Win 7 configuration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.092"
                                            },
                                            "Text": {
                                                "val": "Development of software for E-3\/E-8, RC-135, and EC-130H to ensure SDC currency and upgrade capabilities based on aircraft platform OFP requirements.  These include the Communication, Navigation, Surveillance\/Air Traffic Management (CNS\/ATM) CC, cockpit upgrades, communication presets, mission\/navagation database format changes, and FPM\/TOLD updates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.622"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.622"
                                            },
                                            "Text": {
                                                "val": "Will develop software for E-3\/E-8, RC-135, and EC-130H to ensure SDC currency and to upgrade capabilities based on aircraft platform OFP requirements.  These include the Communication, Navigation, Surveillance\/Air Traffic Management (CNS\/ATM) CC, cockpit upgrades, communication presets, mission\/navagation database format changes, and FPM\/TOLD updates. These software updates will include compatibility with potential aircraft avionics upgrades and maintain SDC and Windows compliance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MAF Automated Flight Planning Service (MAFPS)"
                                    },
                                    "Description": {
                                        "val": "Develops a centralized\/net-centric global mobility flight planning capability, which will provide significant fuel savings through automated flight route, airspeed, and altitude optimization utilizing aircraft performance, air traffic management, weather, and other data."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "Will continue ongoing development efforts to update MAF MPE.  Includes integration with MAF related CCs such as the Communication, Navigation, Surveillance\/Air Traffic Management (CNS\/ATM) CC, Aeronautical Advisory and Notices to Airmen Tool (AANT), and Air Refueling Tool (ART) CC.  Prior to FY2014, MAFPS efforts were funded solely by AMC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management Administration"
                                    },
                                    "Description": {
                                        "val": "Ongoing program support to the various efforts within Project 675380, MPS Modernization.  Prior to FY12, all Mission Planning Systems (MPS) program support resided in Project 675838, MPS Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.082"
                                            },
                                            "Text": {
                                                "val": "Provided program support for the various efforts within Project 675380, MPS Modernization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.947"
                                            },
                                            "Text": {
                                                "val": "Continues ongoing program support to various efforts within Project 675380, MPS Modernization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.213"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.213"
                                            },
                                            "Text": {
                                                "val": "Will continue ongoing program support to the various efforts within Project 675380, MPS Modernization."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA07: Line Item # 833170"
                                    },
                                    "Title": {
                                        "val": "Mission Planning Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.820"
                                        },
                                        "CurrentYear": {
                                            "val": "6.808"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.678"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.678"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.011"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.761"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.127"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.291"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Mission Planning Systems (MPS) Modernization utilizes an evolutionary acquisition approach to develop and deliver an interoperable, network-centric, mission planning system tailored for numerous Air Force platforms using competition and multiple contract vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Systems Engineering and Integration, Framework, and Common Components costs were programmed in project 673858, MPS Development, prior to FY12."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Mission Planning Enterprise Contract II"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "20.992"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "21.473"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-16 Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Organic"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.726"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.769"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.108"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.108"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "A-10 Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Organic"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.042"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.380"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.380"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EC-130H Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Organic"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Robins AFB, GA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.554"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.290"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.470"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.470"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.743"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.593"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.784"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.784"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Framework"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Herndon, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.133"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.474"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.603"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.603"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Common Components"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.561"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.444"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.781"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.781"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Support costs were programmed in project 673858, MPS Development, prior to FY12."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Engineering Institute (SEI)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SEI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pittsburgh, PA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.191"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.130"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.147"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.147"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tecolote (Cost Estimating)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tecolote Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.275"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.264"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Test and Evaluation costs were programmed in project 673858, MPS Development, prior to FY12."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Responsible Test Organization (RTO)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "46TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB, FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.919"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.329"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.856"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.856"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Certification and Accreditation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Indian Head, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.128"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.088"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.109"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.109"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Type I Training"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Ogden Air Logistics Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.015"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.230"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.509"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.509"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Field Representative Hardware"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.195"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.747"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.916"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.916"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Management Services costs were programmed in project 673858, MPS Development, prior to FY12."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FFRDC Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.659"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.662"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.017"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.017"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.957"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.891"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.749"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.749"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_675380_0.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_675380_1.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "F-15 v3.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15 v3.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 30 SCU 8 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 30 SCU 9 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 30 SCU 10 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 40\/50 M6.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 40\/50 M6.5 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 40\/50 M7.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-22 v13.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "A-10 Suite 8 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "A-10 Suite 9 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "A-10 Suite 10 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 6 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 7 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 8 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 9 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 10 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMC Modernization C-5 AMP Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMC Modernization Tankers Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMC Modernization Airdrop Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC E-3 \/ E-8 Release 2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC E-3 \/ E-8 Release 3 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC RC-135 Release 3 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC E-3 \/ E-8 Release 3.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SM-ACC EC-130H Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MAFPS Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MAFPS Release 2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Program Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}