{
    "id": "8c31797651e4c5bfcb9659754f1d93828abf171e",
    "meta": {
        "filename": "dod-2014_RDTE_2014_SOCOM_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.zzz_unzipped_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160483BB"
        },
        "ProgramElementTitle": {
            "val": "Maritime Systems"
        },
        "R1LineItemNumber": {
            "val": "271"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "73.568"
            },
            "PriorYear": {
                "val": "66.657"
            },
            "CurrentYear": {
                "val": "26.405"
            },
            "BudgetYearOne": {
                "val": "18.325"
            },
            "BudgetYearOneBase": {
                "val": "18.325"
            },
            "BudgetYearTwo": {
                "val": "43.795"
            },
            "BudgetYearThree": {
                "val": "15.931"
            },
            "BudgetYearFour": {
                "val": "2.343"
            },
            "BudgetYearFive": {
                "val": "2.375"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning in FY 2014 Special Operations Forces (SOF) Underwater Systems represents the approved consolidation of SOF Surface Craft, Program Element (PE)1160484BB and SOF Underwater Systems, PE 1160483BB.  The consolidated PE 1160483BB has been renamed Maritime Systems."
        },
        "ProgramElementMissionDescription": {
            "val": "This consolidated PE provides for engineering & manufacturing development and operational development of SOF Surface and Undersea Mobility platforms.  This program element also provides for pre-acquisition activities to quickly respond to new requirements for SOF surface and undersea mobility, looking at multiple alternatives to include cross-platform technical solutions, service common solutions, commercial off the shelf technologies and new development efforts.  \n\nThe Underwater Systems project provides for engineering and manufacturing development and operational systems development of combat underwater submersibles and underwater support systems and equipment.  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to respond to emergent requirements.  These submersibles, systems, and equipment are used by SOF in the conduct of infiltration\/extraction, hydrographic\/inland reconnaissance, beach obstacle clearance, underwater ship attack, and other missions.  The capabilities of the submersible systems and unique equipment provides small, highly trained forces the ability to successfully engage the enemy and conduct clandestine operations associated with SOF maritime missions.\n\nThe Surface Craft project provides for engineering & manufacturing development and operational systems development of light, medium, and heavy surface combatant craft and selected items of specialized equipment to meet the unique requirements of SOF.  This project element also provides for pre-acquisition activities (materiel solutions analysis, advanced component development & prototypes) to quickly respond to new requirements for surface craft and equipment, such as the light and heavy combatant crafts that are currently being studied in the Joint Capabilities Integration and Development System process.  The craft capabilities and unique equipment provide small, highly trained forces the ability to successfully engage the enemy and conduct operations associated with SOF maritime missions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "68.424"
                },
                "CurrentYear": {
                    "val": "26.405"
                },
                "BudgetYearOne": {
                    "val": "67.308"
                },
                "BudgetYearOneBase": {
                    "val": "67.308"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "66.657"
                },
                "CurrentYear": {
                    "val": "26.405"
                },
                "BudgetYearOne": {
                    "val": "18.325"
                },
                "BudgetYearOneBase": {
                    "val": "18.325"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.767"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-48.983"
                },
                "BudgetYearOneBase": {
                    "val": "-48.983"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.767"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-48.983"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-48.983"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:   \n\nFY 2012:  Decrease of -$1.767 million due to a transfer of funds to Small Business Innovative Research Program.\n\nFY 2013:  None.\n\nFY 2014:  Net decrease of -$48.983 million is due a program increase to support the Next Generation Forward Looking Infrared Radar and Next Generation Surface System ($.520 million), the approved SOF Surface Craft PE consolidation ($10.572 million), a reprogramming to support higher command priorities (-$26.018 million) , and a reduction to support higher Departmental priorities (-34.057 million).\n\nSchedule:  Delays in Shallow Water Combat Submersible Block 1 design challenges by prime contractor resulted in schedule slip. Delays in Dry Combat Submersibles due to competing priorities.\n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S0417"
                    },
                    "ProjectTitle": {
                        "val": "Underwater Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "73.568"
                        },
                        "PriorYear": {
                            "val": "66.657"
                        },
                        "CurrentYear": {
                            "val": "26.405"
                        },
                        "BudgetYearOne": {
                            "val": "13.738"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.738"
                        },
                        "BudgetYearTwo": {
                            "val": "33.401"
                        },
                        "BudgetYearThree": {
                            "val": "11.021"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "224.790"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for engineering and manufacturing development and operational systems development of small combat underwater submersibles and underwater support systems and equipment.  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to respond to emergent requirements.  These submersibles, systems, and equipment are used by Special Operations Forces (SOF) in the conduct of infiltration\/extraction, hydrographic\/inland reconnaissance, beach obstacle clearance, underwater ship attack, and other missions.  The capabilities of the submersible systems and unique equipment provides small, highly trained forces the ability to successfully engage the enemy and conduct clandestine operations associated with SOF maritime missions.  Sub-projects include:   \n\n•   Combat Submersibles:  Includes incorporating obsolescence solutions and conducting product improvement efforts for the in-service SEAL Delivery Vehicle MK 8 and conducting technology development and engineering and manufacturing development for the follow-on combat submersibles such as the various types of shallow water combat submersibles.  The shallow water combat submersibles use an evolutionary acquisition approach to develop a family of submersibles, to include a new wet submersible capable of operating from existing Dry Deck Shelters, and more capable wet and\/or dry submersibles that will operate from future large submarine shelters\/systems and\/or surface ships.  The combat submersible sub-project leverages existing SEAL Delivery Vehicle components, develops new state-of-the-art components where appropriate, and leases or purchases commercial-off-the-shelf components and vehicles for test and evaluation and operational assessment.\n\n•   Underwater Support Systems and Equipment:  Includes conducting product improvement efforts for in-service submarine support systems such as the Dry Deck Shelters, unmanned underwater vehicles such as the Semi-autonomous Hydrographic Reconnaissance Vehicle, and diver equipment such as the Hydrographic Mapping Unit, Non-gasoline Burning Outboard Engines and Diver Propulsion Devices.   Also provides for technology development and engineering and manufacturing development, and studies and analysis for follow-on underwater systems and support equipment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Shallow Water Combat Submersible (Block I)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.052"
                                            },
                                            "Text": {
                                                "val": "Completed Integrated Baseline Review and Preliminary Design Review.  Entered detailed design phase."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.989"
                                            },
                                            "Text": {
                                                "val": "Complete contractor quality assurance, acceptance and system build up test.  Continue test and evaluation of SWCS Block I and begin contractor verification trials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.844"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.844"
                                            },
                                            "Text": {
                                                "val": "Completes developmental testing and Engineering Development Model (EDM) manufacturing and enters into the system-level developmental testing program phase.  EDM vehicle delivery and acceptance will occur before the end of FY 2014."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Combat Submersibles"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "51.645"
                                            },
                                            "Text": {
                                                "val": "Procured government furnished equipment and continued commercial submersible prototyping efforts for advanced technology demonstrator User Operational Evaluations System (UOES) #2.  Commenced and completed Phase I, Concept Design Studies for additional prototyping efforts for UOES #3.  The project was initiated as part of Congressional Adds: Alternative SOF Submersible Concept Design Study in Program Element 1160483BB."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.234"
                                            },
                                            "Text": {
                                                "val": "Continue commercial submersible prototype efforts, including the construction of UOES #2 and potential design and construction of additional advanced technology demonstrator prototypes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.894"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.894"
                                            },
                                            "Text": {
                                                "val": "Continues to design, construct, and test commercial prototype submersibles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Combat Submersible Medium (DCSM)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.028"
                                            },
                                            "Text": {
                                                "val": "Perform studies and analysis to prepare for the commencement of a DCSM acquisition program at Milestone B based on results of user operational evaluation projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Deck Shelter"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.960"
                                            },
                                            "Text": {
                                                "val": "Conducted Analysis of Alternatives for next generation shelter to accommodate family of combat submersibles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.154"
                                            },
                                            "Text": {
                                                "val": "Continue Analysis of Alternatives for next generation shelter and evaluate SOF Underwater Systems mobility needs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC1"
                                    },
                                    "Title": {
                                        "val": "Underwater Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.379"
                                        },
                                        "CurrentYear": {
                                            "val": "23.037"
                                        },
                                        "BudgetYearOne": {
                                            "val": "37.439"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "37.439"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "30.543"
                                        },
                                        "BudgetYearThree": {
                                            "val": "56.817"
                                        },
                                        "BudgetYearFour": {
                                            "val": "50.038"
                                        },
                                        "BudgetYearFive": {
                                            "val": "51.419"
                                        },
                                        "CostToComplete": {
                                            "val": "188.817"
                                        },
                                        "TotalCost": {
                                            "val": "255.672"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "•   Combat Submersibles:  Shallow Water Combat Submersible Block I used full and open competition, with a down-select to a single contractor.  Broad Agency Announcements were issued for Dry Combat Submersible multiple design efforts with follow-on prototyping.  Additionally, existing contracts are utilized where appropriate for various component development and prototypes. \n\n•   Dry Deck Shelter analysis of alternatives will perform some in-house work, other government agency support or existing contracts.\n\n•   Underwater Support Systems and Equipment:  Existing contracts are utilized where appropriate, and various new contracts are awarded as necessary."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Shallow Water Combat Submersible (SWCS) (Block I)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Teledyne Brown Engineering"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "27.398"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.739"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.549"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.424"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.424"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "41.110"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Combat Submersibles"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamic-Electric Boat"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Groton, CT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.235"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "27.707"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.144"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.533"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.533"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "23.552"
                                                    },
                                                    "TotalCost": {
                                                        "val": "68.171"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Combat Submersibles"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Submergence Group"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chester, CT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "22.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.777"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.777"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.477"
                                                    },
                                                    "TargetValue": {
                                                        "val": "22.700"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Combat Submersibles Medium"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CostToComplete": {
                                                        "val": "5.491"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.491"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "27.970"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "27.970"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SWCS (Block I)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC and NAVSEA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Panama City, FL and Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.876"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.289"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.365"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Combat Submersibles"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVSEA:  Crane \/ ARL-Pennstate Batelle"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Panama City, FL \/ Washington DC, ARL-Pennstate Bat"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.321"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.321"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Deck Shelter"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various \/ RAND"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.497"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.721"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.917"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.135"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Combat Submersible Medium"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVSEA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Panama City, FL and Washington DC"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.322"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.322"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SWCS (Block I)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC, NAVSEA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Panama City, FL\/Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.486"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.529"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.522"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.967"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.967"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.549"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.053"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Combat Submersible"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVSEA \/ CRANE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Panama City, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.992"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.084"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.084"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "12.078"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.154"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SWCS (Block I)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC\/NAVSEA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Panama City, FL\/Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.435"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.495"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.926"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.453"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.453"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.252"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.561"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Combat Submersible"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SRA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "MacDill AFB, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.350"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.238"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.965"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.053"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Deck Shelter"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVSEA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.239"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.439"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Combat Submersible Medium"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.668"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.500"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.168"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Shallow Water Combat Submersible (Block I)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone B"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering & Manufacturing Development (Block I)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test (Block I)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Test (Block 1)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Combat Submersibles"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Analysis, Component Development and Prototypes"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Deck Shelter"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Analysis of Alternatives for Next Generation Shelter"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Combat Submersible Medium"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering Analysis and Program Planning"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone B"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S1684"
                    },
                    "ProjectTitle": {
                        "val": "Surface Craft"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "4.587"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.587"
                        },
                        "BudgetYearTwo": {
                            "val": "10.394"
                        },
                        "BudgetYearThree": {
                            "val": "4.910"
                        },
                        "BudgetYearFour": {
                            "val": "2.343"
                        },
                        "BudgetYearFive": {
                            "val": "2.375"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for engineering and manufacturing development, and operational systems development of light, medium, and heavy surface combatant craft and selected items of specialized equipment to meet the unique requirements of Special Operations Forces (SOF).  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to quickly respond to new requirements for surface craft and equipment, such as the light and heavy combatant crafts that are currently being studied in the Joint Capabilities Integration Development System process.  The craft capabilities and unique equipment provide small, highly trained forces the ability to successfully engage the enemy and conduct clandestine operations associated with SOF maritime missions.  Sub-projects include: \n\nThe Combatant Craft Medium (CCM) sub-project provides a family of next generation combatant craft to replace the current rigid inflatable boat (RIB) and the MKV.  One version of these craft will be a reconfigurable, multi-mission surface tactical mobility craft with a primary mission of insertion and extraction of SOF in a medium threat environment.  It will incorporate additional performance capabilities above current platform capabilities such as shock mitigation, low observability, improved maneuverability and SOF warfighting capabilities required to operate in future threat environments.  Other variants of craft will be developed to support foreign security assistance missions and operations in low or permissive threat environments.  These variants are dependent on the threat environment, training requirement, or mission.\n\nThe Combatant Craft Heavy (CCH) sub-project represents a family of solutions that will provide engineering support for design and specification of a development combatant craft for movement and maneuver of  SOF personnel.  Requirements include maneuverability, reduced detectability with enhanced shock mitigation, and human systems integration.  Potential solution for Combatant Craft Heavy is the Sea, Air, and Land Teams Insertion, Observation and Neutralization (SEALION) that was developed as an advanced technology prototype by the United States Navy and may be modified and tested for transition to SOF operations.  Additional studies may be performed to support analysis of SOF-peculiar needs for an Afloat Staging Base to command, control, sustain, launch and recover Joint SOF.\n\nThe Next Generation Combat Craft Forward Looking Infrared Radar (CCFLIR) sub-project provides SOF with daylight, high resolution, and additional spectrum imaging capabilities to augment existing optical and radar sensors.  Technology insertion is needed to enhance the detection, recognition, identification, and tracking of small and near surface targets and ships.  This program is an FY 2014 new start.\n\nThe Next Generation Surface Systems (NGSRF) sub-project provides a rapid response capability to support SOF Combatant Craft Systems and subsystems.  The NGSRF will explore solutions to support emerging requirements in support of SOF exercises and training for future missions.  It provides technology refresh efforts to correct system deficiencies, improve asset life, and enhance mission capability through the means of feasibility studies, analyses of alternatives, pre-developmental risk reduction, and engineering analyses.  Demonstrations and modifications may be made to support emerging capability enhancements such as but not limited to, weapons mounts, sensors, enhanced communications and navigation subsystems, and other minor modifications to craft in support of future missions.  Solutions may be commercial-off-the-shelf (COTS) solutions, other agency solutions or new solutions.  This program is an FY 2014 new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combatant Craft Medium (CCM)"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.317"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.317"
                                            },
                                            "Text": {
                                                "val": "Integrate newest weapon and sensor technologies into the CCM craft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Heavy (CCH)"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Continue studies with craft design, development, and testing, which may include modifications to existing Sealion craft and weapons integration onto platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Combatant Craft Forward Looking Infrared Radar (CCFLIR)"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Initiate plans to develop, test, and evaluate COTS solution for next generation CCFLIR systems, and incorporate technology refresh into exisiting system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Surface System (NGSRF)"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.320"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.320"
                                            },
                                            "Text": {
                                                "val": "Initiate studies and advanced technology development, conduct risk reduction activities, and refine requirements and potential solutions for next generation of combatant craft systems and subsystems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC"
                                    },
                                    "Title": {
                                        "val": "SOF Combatant Craft"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "35.053"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "35.053"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "54.212"
                                        },
                                        "BudgetYearThree": {
                                            "val": "44.071"
                                        },
                                        "BudgetYearFour": {
                                            "val": "26.686"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.292"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "Combatant Craft Medium acquisition strategy is a competition using a two-phase source selection process.  Phase I involved a Small Business Set-Aside competition for two companies to design, build and deliver test articles.  Phase II will select a single company to provide a fully integrated baseline craft system for test and evaluation with options for production, engineering support and contractor logistic support.  Acquisition strategies for other craft may be based on the rapid acquisition of available non-developmental commercial-off-the-shelf (COTS)\/government-off-the-shelf craft.   \n\nCombatant Craft Heavy acquisition strategy is to complete the initial planning and studies for the craft, which will be performed in-house with some support from other government agencies or existing contract services.  \n\nNext Generation Surface Systems and Subsystems to include the Combatant Craft Forward Looking Infrared Radar will explore the spectrum of acquisition strategies depending on selection of COTS solutions, modification of existing systems, or new competitive acquisitions."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Combatant Craft Medium (CCM)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "USMI\/OIW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Gulfport MS\/Clackamas, OR"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.232"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.232"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "12.032"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.264"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Combatant Craft Heavy (CCH)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.750"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.750"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.748"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.498"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Next Generation FLIR"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.299"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.499"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Next Generation Surface Systems"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.220"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.220"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.751"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.971"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Combatant Craft Medium (CCM)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.747"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.747"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.00"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".747"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Combatant Craft Medium (CCM)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.338"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.338"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.00"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.338"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Combatant Craft Medium (CCM)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Crane, IN"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".150"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Combatant Craft Medium (CCM)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Global Battlestaff & Program Support"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "MacDill AFB, FL"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.850"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.850"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": ".850"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Next Generation Surface Systems"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.300"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.400"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Combatant Craft Medium"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test\/Operational Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Low Rate Initial Production"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Initial Operational Capability"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Heavy"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Risk Reduction Activities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation FLIR"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Risk Reduction Activities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Surface Systems"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Risk Reduction Activities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}