{
    "id": "905db4e9cd370419cfdd4bd6bdbff7336ffea623",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602784A"
        },
        "ProgramElementTitle": {
            "val": "MILITARY ENGINEERING TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "75.465"
            },
            "CurrentYear": {
                "val": "70.693"
            },
            "BudgetYearOne": {
                "val": "70.064"
            },
            "BudgetYearOneBase": {
                "val": "70.064"
            },
            "BudgetYearTwo": {
                "val": "73.011"
            },
            "BudgetYearThree": {
                "val": "72.148"
            },
            "BudgetYearFour": {
                "val": "72.900"
            },
            "BudgetYearFive": {
                "val": "74.673"
            }
        },
        "ProgramElementNote": {
            "val": "Not applicable for this item"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates, evaluates, and advances technologies, techniques and tools for depiction and representation of the physical and human environment for use in military operations; for characterizing geospatial, atmospheric and weather conditions and impacts on systems and military missions; for conducting mobility, counter-mobility, survivability and force protection; and for enabling secure, sustainable, energy efficient facilities.  Research focuses on special requirements for battlefield visualization, tactical decision aids, weather intelligence products, and capabilities to exploit space assets.  Projects 855 and H71 support the materiel development, testing, and operations communities in evaluating the impacts of weather, terrain, and atmospheric obscurants on military materiel and operations. Project T40 advances technologies for adaptive and expedient force protection across the range of military operations (includes Deployable Force Protection).  This project also designs and evaluates software and hardware to identify and mitigate positive and negative ground obstacles; characterizes austere navigation environments and designs\/evaluates materiel solutions including rapidly emplacable bridging, ground stabilization and breakwater structures; and builds and uses modeling and simulation tools to advance understanding of the interactions of weapons\/munitions and novel defeat methodologies with buildings, shelters, bunkers, berms and bridges.  Project T41 investigates and evaluates application of technologies to enable garrison\/post commanders to plan, monitor and operate facilities more efficiently, cost-effectively, securely and sustainably; and creates tools (including advanced models and simulation) that provide a framework for making trades and decisions.  Project T42 develops and validates models and simulations to understand the impacts of the physical environment on the performance of forces, ground and air vehicles, and sensors; as well as the impact of natural and man-made changes in the environment on military operations.  Project T45 investigates and evaluates materials, components and systems that have potential to reduce energy losses in buildings and shelters; and potential to detect and mitigate consequences of contaminants such as bacteria and molds in air handling equipment and building materials.  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nResearch is transitioned to PE 0603734A (Military Engineering Advanced Technology) and PE 0603125A (Combating Terrorism, Technology Development).  \n\nWork in this PE is led, managed or performed by the U.S. Army Engineer Research and Development Center, Vicksburg, MS, and the Army Research Laboratory, Aberdeen Proving Ground, MD. Deployable force protection activities are coordinated with research, development and engineering centers and laboratories across the US Army, Navy and Air Force."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "80.190"
                },
                "CurrentYear": {
                    "val": "70.693"
                },
                "BudgetYearOne": {
                    "val": "66.914"
                },
                "BudgetYearOneBase": {
                    "val": "66.914"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "75.465"
                },
                "CurrentYear": {
                    "val": "70.693"
                },
                "BudgetYearOne": {
                    "val": "70.064"
                },
                "BudgetYearOneBase": {
                    "val": "70.064"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.725"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.150"
                },
                "BudgetYearOneBase": {
                    "val": "3.150"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-3.691"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.034"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.150"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.150"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "855"
                    },
                    "ProjectTitle": {
                        "val": "Topographical, Image Intel & Space"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.165"
                        },
                        "CurrentYear": {
                            "val": "15.486"
                        },
                        "BudgetYearOne": {
                            "val": "17.747"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.747"
                        },
                        "BudgetYearTwo": {
                            "val": "18.589"
                        },
                        "BudgetYearThree": {
                            "val": "19.151"
                        },
                        "BudgetYearFour": {
                            "val": "20.021"
                        },
                        "BudgetYearFive": {
                            "val": "20.845"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and advances capabilities for collection, processing, and creation of data and information depicting physical and human terrain, environmental conditions, and relationships in time and space; for digital map creation, transmission, and dissemination; and for map-based analytics for planning, decision making and execution.  This project uses non-traditional methods that exploit existing open source text, multi-media and cartographic materials addressing social, cultural and economic geography to advance the capability to produce and transmit high fidelity digital maps depicting the physical terrain, human terrain and environmental conditions. This project also develops software tools and methods for map-based analytics that allow deeper insights into the effects of the physical terrain, human terrain and environmental conditions on military operations, to include tactics and effects upon equipment and Soldier's performance.  The Army is defining and implementing the Army Geospatial Enterprise (AGE). The AGE provides map and geospatial data, information and software services seamlessly to the total force. This project explores and advances components and methods that optimize the utility of the AGE to the total Army.\n\nWork in this project supports the Army S&T Command, Control, Communications and Intelligence (C3I) Portfolio.\n\nWork in this project complements efforts in PE 0602784A, Project H71.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nThe work in this project is performed by the U.S. Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Terrain Analysis for Signal and Sensor Phenomenology"
                                    },
                                    "Description": {
                                        "val": "This effort develops means to create, structure, and represent detailed data, information and effects of the physical and human terrain on military ground operations.  The research focuses on tactical, rather than national or commercial, remote sensing of physical terrain data to achieve the fidelity required for current and future operations.  Research includes methods for radical, effective active remote sensing to 'tag' features, items and people of interest; these capabilities are based upon full waveform light detection and ranging (LiDAR) sensor systems and an array of other sensor phenomenology for optimal data detection, identification and classification."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.808"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed data collection and processing algorithms for novel and advanced full waveform Geiger-mode light detection and ranging (LIDAR) data output for improved terrain analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evolve an Army Geospatial Enterprise capability supporting mission and battle command functions and processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.751"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.751"
                                            },
                                            "Text": {
                                                "val": "Will investigate LiDAR detectable, engineered optical materials to perform adversary tagging, physical location, disturbance, and tracking for area and point operations; investigate uncertainties associated with bio-affected sensors and sensing modalities (i.e., time-varying, and terrain-varying conditions) to enhance capabilities for target of interest identification in high clutter environments; develop geospatial display layers for digital maps that depict sensor performance and associated sensor uncertainties."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Imagery and GeoData Sciences"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops human terrain, environment, and analysis to support the Warfighter. It further advances map creation and content through non-traditional methods that exploit existing open source text, multi-media and cartographic materials addressing social, cultural and economic geography."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.846"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed new feature extraction workflows that combine multi-source high-resolution imagery with elevation data to address tactical data gaps; provided capability to evolve and transition an Army Geospatial Enterprise supporting mission and battle command functions and processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.220"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Apply and evaluate non-traditional mapping methods to representative data holdings for Afghanistan and Pacific Command (PACOM) for verification and improvements; design and evaluate utility of socio-cultural Wiki in unclassified and secret modes to take advantage of existing open source materials addressing social, cultural and economic geography."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.976"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.976"
                                            },
                                            "Text": {
                                                "val": "Will continue development of remote sensing capabilities to support multi-agency efforts in remote illicit crop monitoring; develop and integrate cultural mapping into military geospatial narratives; develop visualization and analysis tools for user generated content and volunteered geographic information to support ongoing collaboration with partner Commands."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Reasoning"
                                    },
                                    "Description": {
                                        "val": "This effort develops and evaluates software analysis tools and methods to provide impact and context of the effects of the physical terrain, human terrain and environmental conditions on military operations.  This analysis examines and models these effects upon unit tactics, equipment and Soldiers' performance.  In FY14 this effort supports Technology Enabled Capability Demonstrations 3a, Surprise\/Tactical Intelligence Mission Command, and 3b, Surprise\/Tactical Intelligence Actionable Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.007"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed rapid, field-accessible terrain analysis tools for urban and complex environments; developed urban and complex environment sensor placement decision support tools; created an integrated game-board of landscapes and relationships supporting Intelligence Preperation of the Battlefield (IPB) for Civil Military Operations (CMO)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.528"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and implement a web presence, compliant with Defense Information Systems Agency, and enterprise for open analytics supporting Army, USMC and Combatant Command (COCOM) Mission Partners addressing the span of counter-insurgency (COIN) and capacity building missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.663"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.663"
                                            },
                                            "Text": {
                                                "val": "Will develop geospatial operational risk zone analytics based on insurgent activity, terrain attributes, mission, and environmental influences; incorporate real-time feedback on integrated sensor performance and effectiveness for enhanced mission planning."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial and Temporal Information Structure and Framework"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates geospatial data and information architecture to ensure content and representation of data and actionable geospatial information for operational decision making. Success in meeting these objectives advances the Army's ability to network the force to achieve information dominance.  In FY14 this effort supports Technology Enabled Capability Demonstrations 3a, Surprise\/Tactical Intelligence Mission Command, and 3b, Surprise\/Tactical Intelligence Actionable Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.115"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed feature linkage tools to identify common features across databases, opposing force movement index-based on suppression and interdiction capabilities, and data mining algorithms to support detection of important events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.988"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop a more structured analysis and decision framework capable of describing causal relationships and the effects of operational decisions in security and sustainment operations; develop new feature extraction methodologies and techniques that combine multi-source high-resolution imagery with elevation data to address tactical data gaps; evolve and transition an Army Geospatial Enterprise capability supporting mission and battle command functions and processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.373"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.373"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to integrate geo-environmental and socio-cultural information at the tactical edge; generate geospatial information that defines aggregate constructs of spatial and structural data key to Civil Military Operations (CMO); identify and build relational networks to define the interactive complexity between geospatial structures and actor\/event and outcome dynamics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geo-Enabled Mission Command Enterprise"
                                    },
                                    "Description": {
                                        "val": "This effort explores and advances components and methods that optimize the utility of the Army Geospatial Enterprise (AGE) to the total Army.  In FY14 this effort supports Technology Enhanced Capability Demonstration 4b, Sustainability Logistics Transportation and Distribution Management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.389"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop a geospatial architecture allowing input of user-generated content into the information system to enhance the decision-making battle command process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.984"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.984"
                                            },
                                            "Text": {
                                                "val": "Will design and develop the framework for a common, scalable architecture to deploy geospatial, geo-environmental, and social cultural data, in the form of analytics and tools through the Army Geospatial Enterprise; conduct research and experiments to develop standoff detection and early warning capability of threats to critical infrastructure in extreme environments by innovative fiber optic sensing technology; define and establish technology and processes supporting the Army Geospatial Enterprise for sharing and transforming geospatial products between and among the defined Computing Environments that make up the Common Operating Environment; design and develop optimized processes, methods, and infrastructure to enable the reduction of cycle-time and manpower requirements required for the analysis, exploitation, and visualization of geospatial data."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H71"
                    },
                    "ProjectTitle": {
                        "val": "Meteorological Research For Battle Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.127"
                        },
                        "CurrentYear": {
                            "val": "6.298"
                        },
                        "BudgetYearOne": {
                            "val": "6.361"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.361"
                        },
                        "BudgetYearTwo": {
                            "val": "6.441"
                        },
                        "BudgetYearThree": {
                            "val": "6.468"
                        },
                        "BudgetYearFour": {
                            "val": "6.492"
                        },
                        "BudgetYearFive": {
                            "val": "6.609"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops tactical weather and atmospheric effects\/impacts algorithms for their integration into battlefield information products.  Efforts include high-resolution, local assessments and forecasts of meteorological conditions in near real time including effects of urban and mountainous terrain; analytical tools to assess the impact of the atmosphere to optimize system performance and operations planning and advanced atmospheric sensing applications to characterize and mitigate wind and turbulence in complex terrain.  It provides detailed model applications for various effects of the atmosphere on electro-optical and acoustic target detection, location, and identification.  This project develops both physics-based decision aids and rule-based decision support systems for assessing the impacts of weather\/atmosphere across a spectrum of friendly and threat weapons systems, sensors, platforms, and operations.  Information can be applied to mission planning and execution, battlefield visualization, reconnaissance surveillance and target acquisition, route planning to maximize stealth and efficiency, web enabled tactical decision aids, and also modeling of environmental impacts for combat simulations and war games.  \n\nThis project supports the Army S&T Command, Control, Communications and Intelligence (C3I) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThis work transitions technologies to the Department of Defense weather and operations modeling community, the US Air Force Weather Agency to improve their operational weather support to the Army PM-MaTIC (PM-Meteorological and Target Identification Capabilities) and Marine Corps Systems Command (MCSC) for field artillery systems, the Project Manager, Distributed Common Ground System-Army (DCGS-A), the Joint Improvised Explosive Device (IED) Defeat Organization, the Program Executive Office Aviation, and Tactical Airspace Integration System (TIAS).\n\nWork in this project is performed by the Army Research Laboratory located at Adelphi, MD and White Sands Missile Range, NM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Atmospheric Modeling"
                                    },
                                    "Description": {
                                        "val": "This effort develops high resolution, short-range forecasting and high resolution atmospheric modeling capabilities for mountainous, urban and forest complex terrain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.390"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed computational optimization methods for the Atmospheric Boundary Layer Environment (ABLE) model using advances in high performance computing to produce a very high resolution meteorological model for use in urban and complex terrain; and improved the WRE-N model at kilometer and sub-kilometer scales validated with the data resulted from the model accuracy assessment studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.460"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Verify the improved ABLE model against measurements to quantify its performance and accuracy in extreme terrain applications;  develop the best set of physics parameterizations and nest configurations for sub-kilometer Weather Research and Forecasting (WRF) model-based Weather Running Estimate-Nowcast (WRE-N) to improve the spatial detail and accuracy of the ABLE complex terrain model and reduce the latency of perishable environmental data used in actionable weather impact decision aids; develop modeling and post-processing techniques to enhance meteorological accuracy for artillery applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.530"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.530"
                                            },
                                            "Text": {
                                                "val": "Will investigate and verify ABLE modeled microscale wind, temperature, and moisture dynamics for more realistic and accurate prediction of derived features such as turbulence, jets, convective eddies and gusts; investigate and verify the sub-kilometer WRE-N (with tailored 4-D Data Assimilation) for complex terrain and implement version to supply data for actionable weather impact decision aids; evaluate modeling post-processing methods for enhancement of meteorological accuracy for artillery applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atmospheric Diagnostics"
                                    },
                                    "Description": {
                                        "val": "This effort develops diagnostic technologies and methods to improve the acquisition of environmental data such as temperature, humidity, wind speed and direction for use in decision aids that enhance and protect autonomous and semi-autonomous systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.891"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed weather effects application models for the improved design of emerging technologies such as Terahertz spectroscopy and imaging systems, continuous solid state high energy laser weapons, and passive short wave infrared imaging systems; and developed analysis tools to fuse thermal and infrared polarimetric images, so as to achieve increased target detection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.942"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate electro-optic\/acoustic atmospheric remote sensing techniques for the improved detection of adverse environmental conditions affecting Army operations for force protection and improved target detection, localization, and classification; evaluate the utility of next generation (dual-band) infrared polarimetric imaging systems for use on the battlefield for increased target detection, classification, and identification; collect and analyze signatures from international infrasound events\/experiments for improved situational awareness and force protection for Military Intelligence and Army Operations; will develop web services and mobile applications to enhance and share weather impact and Atmospheric Impacts Routing (AIR) weather information to Army air system and ground systems and personnel."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.939"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.939"
                                            },
                                            "Text": {
                                                "val": "Will investigate and evaluate electromagnetic, intelligent optical and acoustic remote sensing techniques and sensor performance models for the detection of adverse environmental conditions, individual targets and local and regional events to support Army Operations and Military Intelligence; develop anomaly image quality metrics for detecting areas of interest within optical images; investigate and evaluate a prototype dynamic passive optics aperture system that exploits the latest improved theory of short exposure imaging through optical turbulence for its ability to reduce short exposure turbulence blur as it captures images;  investigate mobile handheld technology applications that determine atmospheric impacts on Soldiers and autonomous systems to enhance mission effectiveness at the lowest echelons."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atmospheric Prediction for Local Areas"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates software models and sensors to improve local characterization and prediction of atmospheric conditions in urban and complex terrain by directly integrating boundary layer meteorological (MET) measurements into high resolution models and decision aids and verifies these improvements with field measurements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.846"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated real time networked environmental sensors and produce optimized sensor placement recommendations from the Local Rapid Evaluation of Atmospheric Conditions (L-REAC) system; and complete accuracy studies of coupled microscale wind model with Weather Running Estimate-Nowcast (WRE-N) for transition to DCGS-A."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.896"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop microscale and fine resolution mesoscale model capabilities for analysis and short term forecasting for target areas to enhance mission performance; develop initial application of ensemble model  probabilistic forecast grids for weather Nowcasts and decision support tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.892"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.892"
                                            },
                                            "Text": {
                                                "val": "Will investigate techniques for integrating probabilistic forecast grids into weather impacts decision support tools; research, develop, and verify impact magnitude gradation enhancements to decision support tools to improve the characterization of local atmospheric impacts on operations and  couple meteorological data with aerosol sampling data to support source identification of aerosol particles."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T40"
                    },
                    "ProjectTitle": {
                        "val": "Mob\/Wpns Eff Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.408"
                        },
                        "CurrentYear": {
                            "val": "34.166"
                        },
                        "BudgetYearOne": {
                            "val": "31.214"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.214"
                        },
                        "BudgetYearTwo": {
                            "val": "31.043"
                        },
                        "BudgetYearThree": {
                            "val": "30.574"
                        },
                        "BudgetYearFour": {
                            "val": "30.249"
                        },
                        "BudgetYearFive": {
                            "val": "30.721"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, evaluates, and creates technologies for adaptive and expedient force protection across the range of military operations; for force projection and maneuver, including austere port entry and overcoming battlespace gaps (such as cliffs, ravines, mudflats, shallow rivers, and other natural obstacles) through prediction, definition, avoidance, or defeat of the gaps; for scalable weapons effects; and for high-resolution representation of near-surface terrain and environment for use with sensor models for things such as target detection and unmanned ground systems (UGS) navigation.  This research further provides physics-based representations of ground vehicle mobility, obstacle and barrier placement, survivability, and weapons effects in complex and urban terrain modeling and simulation.  Work in this project increases the survivability of critical assets from conventional, unconventional, and emerging weapons attacks and enables  maneuver support of deployed forces, while reducing their logistical footprint. This project supports Deployable force protection (DFP) efforts for overcoming critical capability gaps for protecting troops operating at smaller bases that are remote or integrated in with local communities.      \n\nWork in this project supports the Army S&T Ground, and Command, Control, Communications and Intelligence (C3I), and Soldier Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS. Deployable force protection activities are coordinated with research, development and engineering centers and laboratories across the US Army, Navy and Air Force."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive Protection"
                                    },
                                    "Description": {
                                        "val": "This effort develops new analytical techniques, advanced materials, and integrated protection systems to support the protection of critical assets on the battlefield.  In FY12-14 this effort supports Technology Enabled Capability Demonstration 1c, Occupant Centric Platform, and in FY13-14 this effort supports Technology Enabled Capability Demonstration 1a, Force Protection Basing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.436"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated and validated novel layered protective systems to include overhead protection from direct and indirect fire that must defeat multiple threats; matured the numerical modeling capability of ground vehicle protective schemes against surface and buried threats by improving coupling between the blast events, vehicles, and occupants.  This work is performed in collaboration with PE 0603005A\/221 and activities in PE 0602618A and PE 0602105A."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.623"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide force protection and assessment technologies for structures located in contingency-based environments for 300 to 6000 person camps; design comprehensive model of improvised explosive device (IED) detonation in soils to accurately predict blast pressure and fragmentation of IEDs on ground vehicle systems over a wide range of operational environments; begin effort to defeat complex attacks (multiple weapons and multiple hits) for enhanced 360 degree hemispherical protection of fixed, semi-mobile\/mobile forces in a theater of operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.600"
                                            },
                                            "Text": {
                                                "val": "Will develop capability to plan and construct a protected Combat Outpost (COP) or Patrol Base (PB) in 30 days with integrated protective construction, sensing and active defense capabilities; develop a baseline COP construction handbook and decision support tools for planning of overall basing architecture that integrates force protection and basing functions; develop planning tools for the complete lifecycle of the COP; complete development of modeling and simulation capabilities for comprehensive mine and improvised explosive device (IED) blast loads for vehicle occupant threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Austere Entry and Maneuver"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and creates tools and technologies that address theater access, tactical logistics resupply, and tactical maneuver of small units  In FY13-14 this effort supports Technology Enabled Capability Demonstration 2a, Overburdened Physical Burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.932"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and began development of a sea-land intermodal mobility bridge for ship to shore transit of heavy military equipment and ground vehicles as well as heavy-lift expedient landing platforms and surfaces for aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.543"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Create physics-based, multi-scale wave, current, and water-depth forecasting capability; create algorithms to predict the impact of the environment on the transport of military equipment and personnel into austere entry points; investigate use of new sensor systems to measure current and sub-surface conditions that directly affect operations for determining throughput capability at austere entry points given the infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.564"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.564"
                                            },
                                            "Text": {
                                                "val": "Will develop the capability to numerically simulate complex, impulsive, fixed and moving infrasonic sources for regional assessment of strategic targets; create a high-performance computational testbed (CTB) for dismounted operations including simulations of potential offloading platforms as well as soldiers in the 9-man squad; provide a rapid remote port assessment capability for improving Force Projection in expeditionary environments; provide improved bridging materiel solutions for spanning gaps (wet or dry) that can impede critical operations; develop advanced force projection technologies for landing zones and port construction in areas of Anti-Access\/Area Denied."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scalable Weapons Effects"
                                    },
                                    "Description": {
                                        "val": "This effort provides a prediction capability for effects from scalable, selectable, and adaptive weapons that can destroy target function and\/or neutralize attributes while limiting damage to surrounding structures\/personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.779"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated the performance of the shoulder launched wall breaching system against multiple targets.  This work will be performed in collaboration with PE 0602618A\/H80, PE 0602105A\/H84, PE 0602624A\/H18\/AH28, PE0603004A\/232, PE 06022303A\/214."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.959"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begin to create an integrated modeling and simulation capability to predict the penetration and damage effects from threat weapons. This will enable the capability to perform design analysis of new weapon systems for attack of deep buried hardened structures and assessment of current and future force protection technologies. This work is performed in collaboration with PE 0602618A\/H80, PE 0602105A\/H84, PE 0602624A\/H18\/AH28, PE0603004A\/232, PE 06022303A\/214."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Impacts on Sensor Performance"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and creates physics-based, multiscale numerical models of the geo-environment and synthetic environments representing geo-environment impacts on various sensor modalities and systems.  These enable such things as development of sensors and sensor algorithms for object or target detection, for sensor-target pairing, and for intelligent autonomous navigation and tactical behaviors in unmanned ground systems.  This effort further investigates, designs, and creates non-line-of-sight and beyond- line-of-sight sensing in remote areas, including optimizing coupling of sensors to soil for understanding surface and subsurface activities. This effort supports persistent surveillance and detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.019"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided high fidelity models to predict and improve the performance of current and future force sensor systems operating in multiple sensor modalities within complex geo-environmental settings; completed new perception algorithms of terrain to enable adaptive tactical behavior technologies for unmanned ground vehicles; investigated technologies and methods leading to use of sensors above the soil surface with equivalent sensitivity as buried sensors thus allowing for adaptive use in variable environments; researched methodologies for characterizing sensor performance in areas where there is limited ground truth data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.014"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advance target detection of non-line-of-sight sensor system in soil resulting in reduced installation time as well as improved detection for persistent surveillance capabilities in dense vegetation and turbulent maritime environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will provide system performance optimization of linear sensors for austere deployment environments; develop a sensor model response for tracking of human and vehicular stimuli with 3-dimensional seismic source models; develop high fidelity excitation models of these linear sensors; quantify coupling scenarios for unique geo-environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NORAD-NORTHCOM Surveillance Research"
                                    },
                                    "Description": {
                                        "val": "This effort develops a physics-based, multi-scaled numerical testbed that provides an enriched virtual environment for evaluating, fusing, and simulating the interaction of local sensors with environmental factors; this effort would also develop high fidelity models to predict and improve performance of current and future force sensor systems for surface, near-surface, and sub-surface target detection within complex geo-environmental settings (solar, weather, soil, vegetation, clutter, etc.)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.012"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Will continue additional experiments of integrated technologies and sensor fusion capabilities to characterize tunnel features; will develop a physics-based, multi-scaled numerical testbed that provides an enriched virtual environment for evaluating, fusing, and simulating the interaction of local sensors with environmental factors to provide the ability to detect, deny, and aggressively alert Warfighters to clandestine subsurface approaches."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deployable Force Protection"
                                    },
                                    "Description": {
                                        "val": "This effort researches, designs, and creates rapidly deployable detection, assessment, passive protection and active defensive technology-enabled capabilities to meet critical capability gaps for troops operating remotely at smaller bases or integrated with local communities. The needs at these smaller bases (less than 300 persons, not all U.S. troops) are unique based on constraints in transportability, manpower, organic resources, lack of hardening of structures, resupply, and training for example. Moreover, lack of interoperability and scaleability consume manpower and take away from time needed to perform missions. Threats include bases being overrun by hostiles; direct fire; rockets, artillery and mortars; and improvised explosive devices. Force protection challenges at these remote, smaller bases include providing increased standoff detection, blast and ballistic protection, and kinetic technologies subject to the constraints mentioned above. This work is coordinated with PE 0603784A\/T08, PE 0603125A\/DF5, PE 0603313A\/G03 and PE 0602786A. Work is performed by Army, Navy and Air Force labs and centers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.248"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed research to address high priority capability gaps in force protection needs for smaller bases operating in remote areas or integrated with local communities; continued research on previously selected passive protection technologies that included perimeter protection, overhead protection, and mortar pits; improved the design of sensor systems to be low logistics; created algorithms for better identifying\/assessing hostile intent from sensor readings; designed and began development of an integrated system architecture for interoperability between disparate sensors; designed and began development of an integrated simulation tool for technology exploration and to provide decision support for identifying system improvements.  This work is done in collaboration with PE 0603784A, PE 0603125A, PE 0603313A and PE 0602786A.  This work is performed in PE 0602784\/T41 in FY 11."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.962"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop significantly improved materials and system designs for rapidly erectable, or constructed, personnel protective systems to decrease logistics (e.g., weight, set up time), increase transportability, and increase protection levels for the next-generation systems; research and develop low-logistics, on-demand structural components for exterior and interior protection of existing structures; integrate and evaluate capabilities to detect, particularly via non-line-of-sight, accurately locate, and suppress hostiles across a range of environments; identify extensions for integrated simulation tool and decision support tools for identifying system improvements; continue research on previously selected technologies for improved detection and assessment of threat, passive protection against enemy threats, and active defense to improve design and performance based on user assessment and feedback."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.900"
                                            },
                                            "Text": {
                                                "val": "Will continue research and development on selected materials and system designs for rapidly erectable or constructed personnel protective systems to decrease logistics (e.g., weight, set up time), increase transportability, and increase protection levels for the next-generation systems; develop non-lethal stand-off enforcement technologies and conduct analysis to assess suitability for employment at small base entry control points; will develop second-generation, low-logistics structural components for exterior and interior protection of indigenous structures; continue research and development on promising technologies and systems approaches that detect, assess, and accurately locate threats in non-line-of sight and complex environments and will decrease size, weight, and power requirements. User assessment and feedback gathered from deployable force protection experiments will be used to improve technical performance, logistics, and user factors associated with deployable force protection for the activities described above."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials Modeling"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and leverages physics-based computational models and laboratory experiments to understand the relationships between the chemical and micro-structural composition of material and performance characteristics when used in protecting facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.982"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to develop foundational knowledge of nano- and macro-scale physical, chemical, and mechanical properties of materials for improved performance through computational modeling and laboratory experimental research with focus  on composite and bio-inspired materials with exceptional properties such as tensile strength and resistance to cracking and penetration.  This work is a continuation of work performed in 0602784\/T41 in FY 11, Materials Modeling and is coordinated with ongoing activities in PE 0602720A\/835, Nanotechnology - Environmental Effects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.065"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Create initial integrated modeling capability for the investigation, design, and advancement of experimental materials and properties for achievement of improved strength and durability at the nano-composite scale (1 to 100nm). This work is coordinated with ongoing activities in PE 0602720A\/835, Nanotechnology - Environmental Effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.150"
                                            },
                                            "Text": {
                                                "val": "Will create a first version of a computational testbed to simulate materials at the nanometer scale using a combination of the Discrete Element Method coupled with continuum analyses."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T41"
                    },
                    "ProjectTitle": {
                        "val": "Mil Facilities Eng Tec"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.375"
                        },
                        "CurrentYear": {
                            "val": "6.433"
                        },
                        "BudgetYearOne": {
                            "val": "6.366"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.366"
                        },
                        "BudgetYearTwo": {
                            "val": "7.484"
                        },
                        "BudgetYearThree": {
                            "val": "6.566"
                        },
                        "BudgetYearFour": {
                            "val": "6.694"
                        },
                        "BudgetYearFive": {
                            "val": "6.800"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and evaluates technologies and techniques to ensure sustainable, cost efficient and effective facilities and to achieve resilient and sustainable installation and base operations.  The project focuses on facilities and operations technologies directly supporting training, readiness, force projection, force protection, homeland security, and forward base operations.  Facility enhancement technologies contribute to cost reductions in the Army facility life cycle process (infrastructure planning, assessment, design, construction, revitalization, sustainment, and disposal), and the supporting installation operations.  This work improves the ability of installations to support forces to meet transformation goals, improves designs for close battle training facilities, and enhances security of Soldiers, families, and civilians.  Technologies evolving from this work include integrated planning and design tools for US facilities and forward bases, models predicting water dispersed contaminant effects on facilities and occupants; sustainable facility and base management; collaborative decision support tools; and advanced materials.  In addition, technologies from this work will support analysis of socio-cultural and facility issues in forward base operations, including urban environments.  \n\nWork in this project supports the Army S&T Innovation Enablers (formerly Enduring Technologies) and Command, Control, Communications and Intelligence (C3I) Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-functional materials in support of Defeat of Emerging Adaptive Threats (DEFEAT)"
                                    },
                                    "Description": {
                                        "val": "This effort assesses and develops self healing technologies for building materials; evaluates protective systems; and assesses the use of novel materials in multi-functional structural protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.931"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed laboratory assessment of material self healing technologies and optimal design methods for composite plates; integrate use of novel materials into multi-functional structural protection systems.  These products  transitioned to PE  0603734A project T08 supporting Army Technology Objective DEFEAT."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive and Resilient Installations"
                                    },
                                    "Description": {
                                        "val": "This effort develops sustainable, cost efficient and effective facilities; and provides technologies and techniques for achieving resilient and sustainable installation and base operations.  In FY13-14 this effort supports Technology Enabled Capability Demonstration 4a Sustainability\/Logistics – Basing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.463"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and developed a computational framework for expanding to net-centric regional management of facilities with emerging resiliency concepts; designed computer models to facilitate assessment of forward operating base operations to increase effectiveness and efficiency.  This effort is coordinated with efforts in PE 0602720A\/T48 and PE 0602786A\/VT4 and VT5."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and validate algorithms and models that represent the complex adaptive systems for energy, water, waste, and protection impacting forward operating base operations; initiate development of interface component models for water, solid waste, and green house gas and integrate them into the net-zero energy (NZE) framework to produce a capability for Installations and regional scale analysis and optimization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.408"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.408"
                                            },
                                            "Text": {
                                                "val": "Will continue development and begin to integrate sustainment, restoration and modernization decision models to support planning and analysis of high performance buildings; complete development and validation of adaptive system algorithms and relationships, and models for power, water, waste and protection to reflect the dynamics at forward operating bases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Social\/Cultural Behavior"
                                    },
                                    "Description": {
                                        "val": "This effort provides technologies which support analysis of socio-cultural and facility issues in forward base operations, including urban environments.  Technology development efforts will include means to identify dynamic signatures, or indicators, in the socio-cultural realm to assist in estimating or predicting behavioral response to operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extended the development of dynamic socio-cultural models for estimating host population response to military operations; developed information framework linking socio-cultural data to Army tasks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.033"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide computer-aided analysis and reasoning tools and ability to model, simulate and forecast socio-cultural issues and needs; predict the perceptions and actions and reactions of indigenous population groups in relation to on-going or planned military operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.958"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.958"
                                            },
                                            "Text": {
                                                "val": "Will complete development of analytical models that advise the commander on likely socio-cultural consequences of planned military courses of action impacting indigenous population; provide the commander a computer aided methodology to identify insights into socio-cultural issues, needs, and likely perceptions to planned unit actions and tasks in the commander's area of responsibility."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T42"
                    },
                    "ProjectTitle": {
                        "val": "Terrestrial Science Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.210"
                        },
                        "CurrentYear": {
                            "val": "5.101"
                        },
                        "BudgetYearOne": {
                            "val": "5.142"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.142"
                        },
                        "BudgetYearTwo": {
                            "val": "5.190"
                        },
                        "BudgetYearThree": {
                            "val": "5.167"
                        },
                        "BudgetYearFour": {
                            "val": "5.167"
                        },
                        "BudgetYearFive": {
                            "val": "5.362"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and evaluates the condition and changes to the physical environment brought about by natural and manmade causes, especially those affecting military operations. Further, the investigations identify and quantify the physical environment's effect on personnel, platforms, sensors, and systems in order to develop improved tactics, techniques, procedures, and plans that ensure information superiority, situational awareness, and force projection. To achieve this, both empirical and theoretical approaches seek to forecast terrain properties and processes through various modeling approaches, and link them to planning and decision aids forming new capabilities for the Army.   \n\nWork in this project supports the Army S&T Command, Control, Communications and Intelligence (C3I) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Analysis for Signal & Signature Phenomenology (Previously titled - Terrain State)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates the dynamics of electromagnetic, acoustic, and seismic signatures in response to changing terrain state and complex terrain features and geometry.  It also improves numerical modeling of key terrain properties and exploits them for tactical advantage in terms of mission planning and tactical decision aids.  The goal is to provide Soldiers with an accurate and timely understanding of the battlefield environment's effect on their intended operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.006"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Incorporated an optimal sensor placement and selection model including stationary and moving surveillance platforms into the Environmental Awareness for Sensor and Emitter Employment (EASEE) model supporting integration of many different sensors in the battlespace; developed a framework to achieve effective persistent monitoring of targets of interest, ground and airborne, providing timely knowledge of multi-modality sensor performance in dynamic complex weather-affected terrain and adverse weather conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.053"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop a sensor to provide the passive, standoff capability to remotely assess soil state as a function of land use\/condition providing measures of bulk density, mineralogy and soil texture applicable to mobility, targeting, and cultural assessments; investigate combined terrain-atmosphere modeling and image analysis techniques to remotely establish aircraft landing potential in denied areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.433"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.433"
                                            },
                                            "Text": {
                                                "val": "Will develop and integrate into the sensor mission planning tool Environmental Awareness for Sensor and Emitter Employment (EASEE) terrain and weather influences and model predictions for radar and radio frequency modalities;  develop and integrate functionality for providing multi-modal propagation predictions for multiple moving platforms; develop an automated remote sensing capability to provide tactical commanders a repeatable assessment of mountainous snowpack extent and snowpack total water storage to inform mission planning decision making social-cultural mission impacts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Reasoning (Previously titled - Signature Physics)"
                                    },
                                    "Description": {
                                        "val": "This effort integrates terrain knowledge and the dynamic effects of weather and mission to provide geospatial reasoning solutions to the Soldier.  The understanding gained and products developed improve the ability to predict signature (emitter) behavior and sensor performance in complex operational environments, and support materiel development, sensor performance products for tactical decision-making, and visualization for mission command."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.204"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and developed random sampling approaches for uncertainties across multiple sensing modalities and established quantifiable approaches for the value of increased terrain and weather resolution on signal propagation predictive skill; developed an adequate definition of the soil biology as a function of prevailing conditions, such as soil-water potential and temperature that can be predicted or measured using stand-off techniques supporting emerging developments of bio-inspired persistent standoff sensing capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop mission planning tools for combat outpost applications incorporating infrared, visible, and radar multi-modal terrain signature models incorporating weather impacts;  develop and evaluate methods for enhanced bio-sensing surveillance capability applying sensor-vegetation characterization and quantification for bio-affected sensor performance mission planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.709"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.709"
                                            },
                                            "Text": {
                                                "val": "Will complete decision support tool for combat outpost applications optimizing human and physical terrain surveillance by matching sensor modalities to mission, terrain complexity, and predicted weather effects; investigate and mature components of a sensor coverage and management framework for integrating ground and air surveillance assets based upon site specific terrain and weather conditions; investigate sensor modalities and develop software to perform rapid, stand-off assessments of austere entry locations by remotely assessing terrain condition (soil physical properties) and integrating weather effects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T45"
                    },
                    "ProjectTitle": {
                        "val": "Energy Tec Apl Mil Fac"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.180"
                        },
                        "CurrentYear": {
                            "val": "3.209"
                        },
                        "BudgetYearOne": {
                            "val": "3.234"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.234"
                        },
                        "BudgetYearTwo": {
                            "val": "4.264"
                        },
                        "BudgetYearThree": {
                            "val": "4.222"
                        },
                        "BudgetYearFour": {
                            "val": "4.277"
                        },
                        "BudgetYearFive": {
                            "val": "4.336"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and evaluates technologies necessary for secure, energy efficient, sustainable military installations, emphasizing energy and utility systems protection in response to evolving needs.  Energy technologies and processes are also applied to the Army's industrial base to maintain its cost-effective readiness for munitions production, training, and in the theater of operations to reduce logistical footprint.  This effort provides technologies to protect facility indoor air quality from contaminants such as mold, bacteria and viruses in work and living spaces as well as develops methods to optimize sustainable energy generation and use including integration of renewable energy resources and approaches for the reduction of carbon footprint.   In addition, technologies from this work provide a better understanding of critical infrastructure interdependencies.  \n\nWork in this project supports the Army S&T Innovation Enablers (formerly Enduring Technologies) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive and Resilient Installations"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops technologies necessary for energy efficient and sustainable military installations, emphasizing energy and utility systems.  In FY13-14 this effort supports Technology Enabled Capability Demonstration 4a, Sustainability\/Logistics - Basing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.180"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured operational user assessment of installations energy systems with a decision support concept; began design on a model for assessment and mitigation of energy losses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.209"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate thermal models and long term thermal performance prediction of phase change materials and emerging materials for mitigation of energy losses in building envelopes; provide to installation planners an operational user assessment decision support tool capability for integrated energy analysis and optimization in support of Net Zero Energy Installations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.234"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.234"
                                            },
                                            "Text": {
                                                "val": "Will continue development and begin integration of sustainment, restoration and modernization decision models that maximize effectiveness of facility retrofits, specifically for energy performance; validate multi-dimensional models and algorithms using emerging building envelope materials to reduce energy losses and transition innovative concepts for application of advanced technology to meet mandated energy reduction goals."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}