{
    "id": "90e93a7adf94520b51baba1798945cd7dabcf49d",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DARPA_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0602383E"
        },
        "ProgramElementTitle": {
            "val": "BIOLOGICAL WARFARE DEFENSE"
        },
        "R1LineItemNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "30.844"
            },
            "CurrentYear": {
                "val": "19.236"
            },
            "BudgetYearOne": {
                "val": "24.537"
            },
            "BudgetYearOneBase": {
                "val": "24.537"
            },
            "BudgetYearTwo": {
                "val": "28.825"
            },
            "BudgetYearThree": {
                "val": "28.810"
            },
            "BudgetYearFour": {
                "val": "38.747"
            },
            "BudgetYearFive": {
                "val": "28.206"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "DARPA's Biological Warfare Defense project is budgeted in the Applied Research Budget Activity because its focus is on the underlying technologies associated with pathogen detection, prevention, treatment and remediation.  This project funds programs supporting revolutionary new approaches to biological warfare (BW) defense and is synergistic with efforts of other Government organizations.\n\nEfforts to counter the BW threat include countermeasures to stop pathophysiologic consequences of biological or chemical attack, host immune response enhancers, medical diagnostics for the most virulent pathogens and their molecular mechanisms, collection of atmospheric trace constituents to support chemical mapping, tactical and strategic biological and chemical sensors, and integrated defensive systems.  This program also includes development of a unique set of platform technologies and medical countermeasures synthesis that will dramatically decrease the timeline from military threat detection to countermeasure availability."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.421"
                },
                "CurrentYear": {
                    "val": "19.236"
                },
                "BudgetYearOne": {
                    "val": "27.008"
                },
                "BudgetYearOneBase": {
                    "val": "27.008"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "30.844"
                },
                "CurrentYear": {
                    "val": "19.236"
                },
                "BudgetYearOne": {
                    "val": "24.537"
                },
                "BudgetYearOneBase": {
                    "val": "24.537"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.423"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.471"
                },
                "BudgetYearOneBase": {
                    "val": "-2.471"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.252"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.829"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.471"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.471"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012:  Increase reflects an internal below threshold reprogramming offset by the SBIR\/STTR transfer. \nFY 2014:  Decrease reflects minor repricing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BW-01"
                    },
                    "ProjectTitle": {
                        "val": "BIOLOGICAL WARFARE DEFENSE"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.844"
                        },
                        "CurrentYear": {
                            "val": "19.236"
                        },
                        "BudgetYearOne": {
                            "val": "24.537"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.537"
                        },
                        "BudgetYearTwo": {
                            "val": "28.825"
                        },
                        "BudgetYearThree": {
                            "val": "28.810"
                        },
                        "BudgetYearFour": {
                            "val": "38.747"
                        },
                        "BudgetYearFive": {
                            "val": "28.206"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DARPA's Biological Warfare Defense project is budgeted in the Applied Research Budget Activity because its focus is on the underlying technologies associated with pathogen detection, prevention, treatment and remediation.  This project funds programs supporting revolutionary new approaches to biological warfare (BW) defense and is synergistic with efforts of other Government organizations.\n\nEfforts to counter the BW threat include countermeasures to stop pathophysiologic consequences of biological or chemical attack, host immune response enhancers, medical diagnostics for the most virulent pathogens and their molecular mechanisms, collection of atmospheric trace constituents to support chemical mapping, tactical and strategic biological and chemical sensors, and integrated defensive systems.  This program also includes development of a unique set of platform technologies and medical countermeasures synthesis that will dramatically decrease the timeline from military threat detection to countermeasure availability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical Countermeasures"
                                    },
                                    "Description": {
                                        "val": "To further develop an expedited medical countermeasure capability, emerging technologies will be integrated to address the safety and efficacy considerations in the risk\/benefit package necessary to successfully counter naturally emerging or engineered biological warfare threats and new emerging infectious threats.  These technologies will also be focused on reduction of time, risk, and cost associated with new therapeutic development.  For example, this program will develop in vitro tissue constructs (IVTC) that will emulate human response to therapeutic compounds, thereby significantly reducing the cost and time for evaluating safety and efficacy of therapeutics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.342"
                                            },
                                            "Text": {
                                                "val": "-  Began development of in vitro tissue constructs (IVTC) that mimic the functions of human physiological systems. \n-  Designed a modular platform able to sustain and monitor IVTC function.\n-  Began development of algorithms that will use the data obtained from the IVTC to predict drug or vaccine health effects in humans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.236"
                                            },
                                            "Text": {
                                                "val": "-  Assemble two or more IVTCs to recapitulate the function of intact human physiological systems. \n-  Demonstrate a modular platform able to sustain the integrated IVTCs for 1 week.\n-  Demonstrate that the integrated IVTCs respond and react to test compounds in a manner that corresponds to the known effects of those compounds on human physiological systems.\n-  Demonstrate that the modular platform can be used to predict the kinetics of metabolism and elimination that the test compounds are known to exhibit in human physiological systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.537"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.537"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate an expanded set of IVTCs able to reproduce the function of four human physiological systems.\n-  Design and build additional modules that are compatible with the expanded set of IVTCs and enable the platform to sustain the integrated IVTCs for 2 weeks. \n-  Demonstrate that the expanded set of IVTCs individually respond and react to test compounds in a manner consistent with the known effects of those compounds on the corresponding human tissues.\n-  Demonstrate that a modular arrangement of the expanded set of IVTCs can be used to predict the kinetics of metabolism and elimination that the test compounds are known to exhibit in human physiological systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unconventional Therapeutics"
                                    },
                                    "Description": {
                                        "val": "This thrust developed unique and unconventional approaches to ensure that soldiers are protected against a wide variety of naturally occurring, indigenous or engineered threats.  Emphasis was placed on discovery and development of technologies that allow a rapid response (within weeks) to unanticipated threats, whether naturally encountered emerging diseases or agents from intentional attack, to significantly decrease the time needed to produce candidate vaccine.  Additionally, new technologies were developed to allow the rapid, cost-effective manufacture of complex therapeutic proteins such as monoclonal antibodies and vaccine antigens; these technologies reduced the time for biologics manufacture from years (or even decades) to only weeks.  Select efforts funded under Unconventional Therapeutics transferred to the Medical Program Element 0602115E, in FY 2012."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed final proof-of-concept demonstrations to produce 1kg of a recombinant H1N1 vaccine candidate protein using large-scale plant-based manufacturing capabilities. \n-  Continued the evaluation of the immunogenicity and efficacy in pre-clinical animal studies of recombinant H1N1 vaccine candidate proteins produced in the large-scale proof-of-concept demonstration runs using large-scale plant-based manufacturing capabilities.\n-  Continued to demonstrate the flexibility and versatility of the plant-expressed protein platform to express human butyrylcholinesterase with pharmacokinetics and enzyme activity levels comparable to human plasma derived butyrylcholinesterase.\n-  Continued first-in-human FDA-approved Phase I human clinical trial to evaluate the safety (primary endpoint) and immunogenicity (secondary endpoint) of a plant-derived recombinant H1N1 vaccine candidate protein combined with a novel adjuvant. \n-  Continued the development of vaccine candidates that have enhanced immunogenicity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chemical Reconnaissance"
                                    },
                                    "Description": {
                                        "val": "The Chemical Reconnaissance program enabled exhaustive, accurate, and economical collection of atmospheric trace constituents to support chemical mapping of urban and military environments.  The system demonstrated materials, packaging, and extraction technologies that sample atmospheric impurities with concentrations ranging from 50 parts per trillion to 50 parts per million by volume, from 100 liter-atmospheres of gas, in less than five minutes.  The analysis system integrated high-resolution separation and spectroscopic techniques with automated analysis software to enable identification and ranking (by concentration) of all components present in complex gas mixtures.  Reproducible analysis of atmospheric samples using sophisticated analytical technology yielded data for baseline conditions, natural variability, and permit detections of nefarious anomalies associated with production, movement, and storage of weapons, even under shifting backgrounds driven by meteorological and seasonal events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.502"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated prototype automated analysis system with high fidelity and accuracy at high sample rate.\n-  Designed and validated a bench top system to analyze a large number of samples at low cost.\n-  Expanded field testing of sampling technology prototypes with transition partners.\n-  Delivered ruggedized sampling technology prototypes and media validated against operation in various climates and CONOPs.\n-  Integrated sample media processing with automated laboratory analysis system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}