{
    "id": "9842a8d2e9bb66c042f3e04ef4ca801735aaa89c",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602618A"
        },
        "ProgramElementTitle": {
            "val": "BALLISTICS TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "60.507"
            },
            "CurrentYear": {
                "val": "60.823"
            },
            "BudgetYearOne": {
                "val": "68.300"
            },
            "BudgetYearOneBase": {
                "val": "68.300"
            },
            "BudgetYearTwo": {
                "val": "68.298"
            },
            "BudgetYearThree": {
                "val": "74.953"
            },
            "BudgetYearFour": {
                "val": "74.166"
            },
            "BudgetYearFive": {
                "val": "75.429"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 funding increased for Vulnerability Assessment of Current Technologies"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates and evaluates materials and ballistic technologies required for armaments and armor that will enable enhanced lethality and survivability.  Project H80 focuses on applied research of lightweight armors and protective structures for the Soldier and vehicles; kinetic energy active protection;  crew and components protection from ballistic shock and mine-blast; insensitive propellants\/munitions formulations; novel multi-function warhead concepts; affordable precision munitions design; and physics-based techniques, methodologies, and models to analyze combat effectiveness of current and emerging technologies for improved lethality and survivability. Project H75 completed in FY11.    \n\nWork in this PE complements and is fully coordinated with efforts in PE 0602105A (Materials Technology), PE 0602120A (Sensors and Electronic Survivability), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602716A (Human Factors Engineering), PE 0603004A (Weapons and Munitions Advanced Technology), and PE 0603005A (Combat Vehicle Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "59.121"
                },
                "CurrentYear": {
                    "val": "60.823"
                },
                "BudgetYearOne": {
                    "val": "60.568"
                },
                "BudgetYearOneBase": {
                    "val": "60.568"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "60.507"
                },
                "CurrentYear": {
                    "val": "60.823"
                },
                "BudgetYearOne": {
                    "val": "68.300"
                },
                "BudgetYearOneBase": {
                    "val": "68.300"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.386"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.732"
                },
                "BudgetYearOneBase": {
                    "val": "7.732"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.266"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.880"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "7.732"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.732"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H80"
                    },
                    "ProjectTitle": {
                        "val": "Survivability And Lethality Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "60.507"
                        },
                        "CurrentYear": {
                            "val": "60.823"
                        },
                        "BudgetYearOne": {
                            "val": "68.300"
                        },
                        "BudgetYearOneBase": {
                            "val": "68.300"
                        },
                        "BudgetYearTwo": {
                            "val": "68.298"
                        },
                        "BudgetYearThree": {
                            "val": "74.953"
                        },
                        "BudgetYearFour": {
                            "val": "74.166"
                        },
                        "BudgetYearFive": {
                            "val": "75.429"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates materials and design for armor\/anti-armor formulations that provide advanced protection through tailored terminal ballistic mechanisms.  Specific technology thrusts include: lightweight armors and protective structures; crew and component protection from ballistic shock and\/or mine-blast; insensitive high energy propellants\/munitions to increase lethality and reduce propellant\/munitions vulnerability to attack; novel kinetic energy (KE) penetrator concepts to maintain\/improve lethality; novel multi-function warhead concepts to enable defeat of a full-spectrum of targets (anti-armor, bunker, helicopter, troops); and physics-based techniques, methodologies, and models to analyze combat effectiveness of current and emerging technologies for improved lethality and survivability.   \n\nThis project sustains Army science and technology efforts supporting the Ground and Soldier portfolio.\n\nWork in this PE makes extensive use of high performance computing (HPC) and experimental validation and builds on research transitioned from PE 0601102A (Defense Research Sciences), project H42 (Materials and Mechanics) and project H43 (Ballistics); and utilizes emerging materials from PE 0602105A (Materials Technology) and applies it to specific Army platforms and the individual Soldier applications.  The work complements and is fully coordinated with efforts in PE 0602303 (Missile Technology), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602786A (Warfighter Technology), PE 63125A (Combating Terrorism-Technology Development), PE 0603001A (Warfighter Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle Advanced Technology), PE 063313 (Missile and Rocket Advanced Technology), and PE 0708045A (Manufacturing Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Structural Armor"
                                    },
                                    "Description": {
                                        "val": "This effort conducts applied research to design advanced lightweight structural armor technologies, such as ceramic, metallic, transparent, and electromagnetic, for transition to current and future tactical as well as combat vehicle designers. The goal is to provide designs that reduce weight while improving ballistic protection and affording multifunctional capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.071"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated third generation structural armor performance incorporating most promising ceramic-composite and encapsulated ceramic materials technologies; evaluated novel mechanisms against objective level future threats and transition validated concepts to the United States Army Tank Automotive Research, Development and Engineering Center (TARDEC) (PE 0602601A\/project C05); used modeling and simulation coupled with experimentation to validate emerging ballistic defeat mechanisms that couple structural materials with energy absorbing mechanisms against future threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.560"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimize weight and validate FY12 encapsulated and laminate ceramic armor technologies for future vehicle platforms; use HPC modeling and simulation tools coupled with experiments to validate emerging passive material concepts and investigate threat defeat mechanisms that provide higher mass efficiency against more aggressive KE threats expected to proliferate during the next decade."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mine Blast Protection"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs tools, techniques, and technologies for protection against mine\/IED blast threats, ballistic shock mitigation, and fuel\/ammunition fires to enable survivability of current and future platforms and the dismounted Soldier."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.638"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Incorporated computationally representative energy absorbing seats and local soil characteristics into models and simulations of full scale blast events in order to refine simulations for system design optimization by TARDEC in PE 0603005A; and experimentally validated the simulated results for mine blast events using data from live fire test events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct characterization and model development of vehicular hull structural welds while providing further refinement of soil models for incorporation into simulations of full scale blast events; and continue investigations of novel energy absorbing seat materials, restraints and structural designs with refined simulations for system design optimization by TARDEC in PE 0603005A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Underbody Blast & Occupant Protection"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs tools, techniques, and technologies for protection against mine\/IED blast threats, ballistic shock mitigation, and fuel\/ammunition fires to enable survivability of current and future platforms."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.188"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.188"
                                            },
                                            "Text": {
                                                "val": "Will introduce advanced modeling tools developed under the Ballistic and Blast Loading Highly Scalable Software Institute to develop strongly hardened hull designs.   Will mature long-stroke technology and multi-directional seating mechanisms to further enhance interior protection along with an appropriate sensor suite for pre-activation of active seat or exterior hull mechanisms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Hyper-Accuracy Munition Technologies (formerly Enabling Precision Munitions)"
                                    },
                                    "Description": {
                                        "val": "This effort designs advanced components\/sub-systems to enable a broad spectrum of future affordable direct and indirect fire precision munitions. The focus is on a multi-disciplinary approach to munition systems design by coupling physics-based models of interior ballistics, launch dynamics, flight mechanics, and high-gravitational force guidance, navigation, and control (GN&C) technologies. The goal is smaller, cheaper and lighter munition components enabling low-collateral-damage precision munitions for future asymmetric operations in military operations on urban terrain (MOUT)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.833"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Combined reduced state GN&C methods, robust actuators novel guidance technologies, with understanding of interior and exterior ballistics to computationally and experimentally validate accuracy improvements for direct fire individual soldier and weapons platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.588"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experimentally validate highly maneuverable direct and indirect fire munition concepts to extend range and increase terminal effects by continuing applied research of components for novel actuation concepts, low cost guidance technologies, smart structures, and develop coupled physics-based models to computationally support munition designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.988"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.988"
                                            },
                                            "Text": {
                                                "val": "Will implement new derived optimal terminal homing guidance laws and flight control algorithms in simulation code; will conduct parametric studies across a range of attack angles to quantify resulting control effectiveness to more cost effectively and accurately hit targets; will perform lab, wind tunnel and soft launch experiments to investigate lifting surface control mechanisms and lateral & axial thrusters especially at high angles of attack."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Disruptive Energetics and Propulsion Technologies (formerly Energetic Materials)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, evaluates, selects, and models propulsion and energetic materials and technologies to validate novel energetic materials concepts (such as nano-structural and insensitive) that exploit managed energy release required for improving the effectiveness and reducing the vulnerability of future gun\/missile systems and warheads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.727"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated ability to characterize energetic materials through multiscale modeling and simulation; provided understanding of energetic material properties to synthesizers and formulators; supported hypergolic propulsion demonstration at the U. S. Army Aviation and Missile Research Development and Engineering Center (AMRDEC) through insertion of green energetics into effort; and investigated solid rocket throttleable propulsion for extending missile range."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Employ validated multi-scale models to conceive new energetic material compounds; design and improve affordable propellant coatings to manage temperature sensitivity and enhance insensitive munitions qualities; and develop and apply advanced, reacting-flow, multiphase, computational fluid dynamics methods incorporating advanced bi-propellant (liquids and solids) chemistry for future missile applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.475"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.475"
                                            },
                                            "Text": {
                                                "val": "Will synthesize two new energetic compounds (binder and explosive) that exhibit increased energy compared to current CHNO compounds; will experimentally quantify their performance with a small scale technique that cost effectively requires only grams (compared to current kilogram technique); will evaluate propellant improvements for small arms ammunition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lethal and Scalable Effects Technologies (formerly Advanced Munitions and Lethality Technologies)"
                                    },
                                    "Description": {
                                        "val": "This effort identifies and models preferred options to reduce energy\/mass required to defeat emerging armor threats and to provide multi-purpose capabilities for revolutionary future lethality. In addition, this effort investigates technology options for scaling warhead lethality to enhance urban Warfighting capabilities including control of collateral damage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.094"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Identified next level in lethality scalability, which expands past blast and fragmentation munitions and offers potential to concepts that defeat a range of threats with a single munition (i.e. collapse calibers); and conducted applied research and prove novel lethal mechanisms for defeat of expanding target set, which includes vehicles, buildings and Soldiers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.449"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advance FY12 scalable lethality concepts that defeat a range of threats with a single munition; and develop small and medium caliber penetrator technologies and concepts to improve the performance of armor-piercing rounds against heavy body armors, lightweight vehicle armors, and against high-obliquity urban targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.849"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.849"
                                            },
                                            "Text": {
                                                "val": "Will conduct proof of principle experiments for man portable weapons that validate capability to perforate wall targets including double reinforced concrete and adobe; will experimentally investigate and quantify performance improvements of chemical energy weapons when nano-crystalline materials (e.g., copper and tungsten) are used;.will conceptualize variations in novel penetrator deployment schemes and conduct laboratory experiments to understand how deployment variations affect lethality performance; and will incorporate an optimized multi-component\/jacketed shearing composite penetrator into a large caliber cartridge to examine its lethality."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability\/Lethality Analyses"
                                    },
                                    "Description": {
                                        "val": "This effort devises state-of-the-art survivability\/lethality\/vulnerability methodologies to dynamically model the interaction of conventional ballistic threats against future weapon systems. In FY13-14 this effort supports Technology Enabled Capability Demonstration 1.b, Force Protection-Soldier and Small Unit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.319"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed new methodologies for assessing soldier\/platform occupant injury probabilities in support of efforts to develop a new military specific anthropomorphic test device (Warrior Injury Assessment Manikin, WIAMan); conducted advanced experimentation and simulation to improve biofidelic characterization and injury correlation of helmet back face deformation; incorporated an enhanced shot-line viewer, virtual components, active protection systems and multiple threat functionalities to Modular UNIX-based Vulnerability Estimation Suite (MUVES) 3."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.373"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improve vulnerability analysis methodologies for injury criteria and injury assessment to address crew protection and survivability for mine blast threats (WIAMan); and prepare for FY14 validation and verification of the MUVES 3 ballistic vulnerability and lethality code."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.041"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.041"
                                            },
                                            "Text": {
                                                "val": "Will develop new methodologies to characterize Personnel Protective Equipment armor back face deformation and assess the associated injury incapacitation probabilities for soldiers; perform improvements to tools, techniques, and methodologies for ballistic survivability\/lethality analysis to ensure analysis tools are relevant and credible for developmental and modernized Army systems; and conduct validation and verification of the MUVES 3 ballistic vulnerability and lethality code."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Threat Armor Formulations and Designs"
                                    },
                                    "Description": {
                                        "val": "This effort devises and matures multi-threat hybrid armor technologies incorporating both active and passive mechanisms for ground vehicle systems that are effective against future conventional weapons and evolving improvised threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.556"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Downselected the most promising multi-threat armor concepts and transition technology to TARDEC (PE 0602601A\/project C05) for maturation; investigated advanced reactive and electromagnetic physics for defeat of multiple threat types to include development of algorithms that capture the symbiotic relationships between the mechanisms; developed multi-disciplinary physics-based modeling tools that connect impacts on personal protection technologies to Soldier biologic insult and damage; and developed experimentally validated constitutive material mechanics models that capture high-rate human tissue mechanics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.962"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determine physics mechanisms to explore potential efficiencies against very large improvised threats and investigate fusion of best mechanisms with known technologies for conventional threat defeat; validate and exercise algorithms that capture the multi-physics aspects of the determined mechanisms and begin transition to TARDEC (PE 0602601A\/Project C05) technologies for defeat of very large improvised threats; and develop physics-based high-resolution anatomic computational model for the human legs and spine that accurately predicts critical injury mechanisms that may result from vehicular underbelly blast and other accelerative loading utilizing emerging data from the anthropomorphic Test Device (WIAMan) development effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.071"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.071"
                                            },
                                            "Text": {
                                                "val": "Will develop ceramic laminate technology,  large improvised threat protection, second generation multi-threat protection and support transition to the United States Army Tank Automotive Research, Development and Engineering Center (TARDEC) (PE 0602601A\/project C05);  Will use modeling and simulation coupled with experimentation to explore encapsulated ceramic mechanisms capable of defeating more advanced KE threats and begin exploration and concept development of novel adaptive protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ballistic and Blast Protection for Dismounted Soldiers"
                                    },
                                    "Description": {
                                        "val": "This effort develops unique physics based models to understand the deflection and stress wave interactions with the human during the complex target interactions between threats and personal protective equipment (PPE).  Use of this knowledge framework to develop low TRL PPE concepts  that are informed by the human effects during impact and blast events."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.108"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.108"
                                            },
                                            "Text": {
                                                "val": "Will develop techniques for understanding the response of biologic materials at high rates of loading that cause severe deformation and failure.  Explore low TRL concepts for personnel protection equipment (PPE) that are based on computational simulations of the interaction of humans with the dynamic threat\/PPE impact."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Penetrator Lethality Applied Research"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates effects of velocity and novel penetrator designs for future lethality applications across the spectrum of targets to include vehicles, buildings, and personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Proved benefit of novel penetrator technology at both ordnance and hyper-velocities and transition technology approaches to the Armament and Aviation and Missile RDECs for both gun and missile application; and validated concepts that overcome current propulsion technology limitation of muzzle pressure that enables use of next generation propellants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.864"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determine penetration efficiency of full scale novel penetrators; perform modeling and simulation to define a guided projectile with novel lethal mechanisms and conduct experiments that validate concept projectile(s) can withstand launch environment; conduct lethality analysis (probability of kill given a hit) of novel concepts across the velocity spectrum; and investigate light weight composite sabot technology for rifled barreled guns."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.847"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.847"
                                            },
                                            "Text": {
                                                "val": "Will conduct lethality analysis (probability of kill given a target hit) across the velocity spectrum for novel penetrator concepts; will conceptualize variations in novel penetrator deployment schemes and conduct laboratory experiments to understand how deployment variations affect lethality performance; will incorporate an optimized multi-component\/jacketed shearing composite penetrator into a large caliber cartridge to examine its lethality."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Lethality Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on development of advanced lethal mechanisms, improved accuracy approaches, and leverages state-of-the-art materials to enable a single small arms cartridge for defeat of hard and soft targets and enable the defeat of combatants in defilade out to 2km"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.994"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.994"
                                            },
                                            "Text": {
                                                "val": "Will investigate alternate approaches to increase long range precision and improve probability of incapacitation for sniper and small arms applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warrior Injury Assessment Manikin (WIAMan)"
                                    },
                                    "Description": {
                                        "val": "This work develops an improved prototype blast test manikin, data acquisition system, and injury prediction methods and tools that incorporate new medical research and which provides an improved capability to measure and predict skeletal injuries for vehicle occupants during under-body blast events.  (This work effort was formerly described under the Survivability\/Lethality Analyses bullet.)"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.239"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.239"
                                            },
                                            "Text": {
                                                "val": "Will complete technical data package for the design concept for a first generation, prototype WIAMan; will award contract for fabrication of the first generation prototype WIAMan and initiate manufacturing and component testing; will  initiate development of new methods for injury prediction and spin-out knowledge to benefit on-going Live Fire Test & Evaluation programs; will define concept for WIAMan data acquisition system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vulnerability Assessment of Current Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort applies state-of-the-art vulnerability assessment methodology across a broad spectrum of threats to selected emerging technologies in order to ascertain their potential robustness when implemented in Army systems.   Research performed will support the both development of tools required to perform the assessments and conduct of selected assessments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Will identify target set of current and emerging technologies based upon Army plans; will identify spectrum of threats for technologies identified; will develop and apply vulnerability assessment tools to be developmental technologies before they are implemented in Army systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}