{
    "id": "9b6c7dafeba6e6494c50c856bfa590a5a3d417d1",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA3_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603710A"
        },
        "ProgramElementTitle": {
            "val": "NIGHT VISION ADVANCED TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "41.283"
            },
            "CurrentYear": {
                "val": "37.217"
            },
            "BudgetYearOne": {
                "val": "36.407"
            },
            "BudgetYearOneBase": {
                "val": "36.407"
            },
            "BudgetYearTwo": {
                "val": "42.338"
            },
            "BudgetYearThree": {
                "val": "39.761"
            },
            "BudgetYearFour": {
                "val": "41.069"
            },
            "BudgetYearFive": {
                "val": "41.588"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates sensor technologies that increase Warfighter survivability and lethality by providing sensor capabilities to acquire and engage targets at longer ranges in complex environments and operational conditions (e.g. day\/night, obscured, smoke, adverse weather). Project K70 pursues technologies that improve the Soldier's ability to see at night, provide rapid wide area search, multispectral aided target detection (AiTD), and enable passive long range target identification (ID beyond threat detection) in both an air and ground test-beds. Project K86 matures and evaluates sensors and algorithms designed to detect targets (vehicles and personnel) in camouflage, concealment and deception from airborne platforms, and provides pilotage and situational awareness imagery to multiple pilots\/crew members independently for enhanced crew\/aircraft operations in day\/night\/adverse weather conditions.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nWork in this PE is fully coordinated with efforts in PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (Electronic Warfare Technology), PE 0602709A (Night Vision and Electro-Optics Technology), PE 0602712A (Countermine Systems), PE 0603001A (Warfighter Advanced Technology), PE 0603003A (Aviation Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603606A (Landmine Warfare and Barrier Advanced Technology), PE 0603774A (Night Vision Systems Advanced Development) and PE 0604710A (Night Vision Systems Engineering Development).   \n\nWork in this PE is performed by the Army Research, Development and Engineering Command (RDECOM)\/Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "42.348"
                },
                "CurrentYear": {
                    "val": "37.217"
                },
                "BudgetYearOne": {
                    "val": "39.257"
                },
                "BudgetYearOneBase": {
                    "val": "39.257"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "41.283"
                },
                "CurrentYear": {
                    "val": "37.217"
                },
                "BudgetYearOne": {
                    "val": "36.407"
                },
                "BudgetYearOneBase": {
                    "val": "36.407"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.065"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.850"
                },
                "BudgetYearOneBase": {
                    "val": "-2.850"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.065"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.850"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.850"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "K70"
                    },
                    "ProjectTitle": {
                        "val": "Night Vision Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.067"
                        },
                        "CurrentYear": {
                            "val": "21.760"
                        },
                        "BudgetYearOne": {
                            "val": "20.401"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.401"
                        },
                        "BudgetYearTwo": {
                            "val": "25.508"
                        },
                        "BudgetYearThree": {
                            "val": "22.577"
                        },
                        "BudgetYearFour": {
                            "val": "23.581"
                        },
                        "BudgetYearFive": {
                            "val": "23.951"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates high-performance integrated sensor\/multi-sensor technologies to increase target detection range, extend target identification range, and reduce target acquisition (TA) timelines for dismounted Soldiers and tactical vehicles against threats that are beyond today's detection ranges or are partially obscured by terrain, weather or other features.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Ground, Air and Soldier Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development and Engineering Command (RDECOM)\/Communications-Electronics Research, Development, and Engineering Center (CERDEC) \/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Weapon Sight Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops, integrates and demonstrates critical components for the next generation of weapon sight systems for mounted and dismounted Soldier use to provide improved actionable intelligence and the tools to assist in recognizing and identifying friend or foe.  In FY12-14 this effort supports TECD 3.a: Surprise\/Tactical Intelligence Mission Command and 2.a: Overburdened Physical Burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.520"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed Counter Surveillance System (CSS) brassboard integration; demonstrated and conducted user evaluation then transitioned CSS technology to Program Manager-Soldier Sensors and Lasers (PM-SSL) and PM-Stryker; completed weapon sight brassboard integration; demonstrated and conducted user evaluations of the weapon sight technology then transitioned the technology to PM-SSL."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and demonstrate Optical Augmentation (OA) hardware; complete final weapon sight integration and ruggedization for testing and evaluation; demonstrate sensor fusion integration between ultra violet (UV) and virtual pointer (VP) hardware and weapon sights for greatly enhanced target handoff during both day and night operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.102"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.102"
                                            },
                                            "Text": {
                                                "val": "Will integrate and evaluate an integrated sensor fusion kit (combines situational awareness and target handoff) and existing fielded equipment and improve algorithms to reduce false alarms for an affordable UV\/virtual pointer and hand-held targeting technology; leverage and integrate latest generation of high performance focal plane arrays (FPAs), displays, advanced optics, direction finding and wireless data component technologies for lighter weight, lower power, clip-on weapon sight with improved range performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Urban Sensor Suite"
                                    },
                                    "Description": {
                                        "val": "This effort develops and integrates 360 degree closed hatch vision capability with real time acoustic and non-real time on-the-move (OTM) moving target indicator (MTI) threat detection and cueing sensors and algorithms, high resolution interrogation sensors (for slew to cue identification), improved resolution driving sensors and high bandwidth video capture capabilities in urban operations for improved survivability, lethality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.719"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated advanced crew stations with the state of the art electro-optic indirect vision systems (high resolution threat interrogation and driving sensors, autonomous threat detection and cueing, and digital video recording and displays); completed maturation of products to include: sensor interface for target handoff and pointing to\/from dismounted Soldiers, high resolution forward looking infrared, image intensified and visual sensors, threat cueing sensors and algorithms for weapons fire detection\/location; developed signal processing algorithms for pixel level sensor fusion and information fusion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate, mature and optimize hardware designs which provide high resolution persistent surveillance imagery with picture in picture capability in order to identify specific areas of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Ground Persistent Surveillance and Targeting"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates high-performance integrated sensor\/multi-sensor technologies to increase local situational awareness and target discrimination capabilities and reduce target acquisition (TA) timelines for dismounted Soldiers, combat vehicles, tactical robots, ground and urban sensors against threats that are beyond today's ranges or discrimination capabilities or are partially obscured by terrain. In FY14 this effort supports TECD 1.a: Force Protection - Basing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.888"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiated development of higher performance, lower cost advanced sensor technology and incorporated new sensors into manned and unmanned vehicles, as well as Soldier borne applications, to acquire targets at extreme ranges while reducing the size and power needs to the platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.916"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature large format high definition infrared (IR) focal plane arrays (FPAs) and model their range and resolution performance; evaluate low cost 3 vs. 4 axis stabilization systems required to operate system at 4km-5km; mature components and construct brassboard system to demonstrate radar\/IR\/laser Slew-to-Cue in an operational environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.108"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.108"
                                            },
                                            "Text": {
                                                "val": "Will increase sensor resolution with large format FPAs and improve active illumination coverage to demonstrate long range, rapid and positive target recognition; improve gimbal performance through a combination of mechanical and electrical techniques to provide stabilized imagery for the sensor surveillance suite; demonstrate improved Moving Target Indicator (MTI) software capable of human and small unmanned aerial vehicle (SUAV) target recognition with improved system performance by leveraging laser range finder, cross-cueing with radars and advanced real-time signal processing of IR imagery."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Sensors for Precision"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies that allow combat vehicle commanders and crewmen to detect more rapidly, identify and geo-locate threat targets to enable fire control for platform weaponry. The effort leverages advance IR imaging technology, 3-D imaging sensor techniques, and precise far target location technology to increase target detection range, extended target and reduce target acquisition timelines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.940"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured a 3-D sensor suite with precise target acquisition technology (target identification and location); demonstrated and validated the performance of precision sensors for combat vehicle target acquisition sighting and fire control system for demonstration onboard a Heavy Brigade Combat Team (HBCT) vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.207"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate, optimize, evaluate and demonstrate in a relevant environment, an affordable, high definition (HD), forward looking infrared (FLIR), multi-purpose sensor for high resolution target discrimination and identification of personnel and weapon\/non-weapon scenarios providing a potential upgrade in a commander's independent thermal viewer form factor; mature algorithms and validate multi-purpose sensor performance for hostile fire detection and situational awareness applications; integrate the multi-purpose HD FLIR with an ultra-violet (UV) pointer for day\/night targeting handoff between mounted and dismounted personnel enabling cooperative engagement for a user evaluation in a relative environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.191"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.191"
                                            },
                                            "Text": {
                                                "val": "Will integrate Next Generation, high definition component technologies to rapidly detect and identify (ID) threats while on-the-move for vehicle sights; demonstrate flash detection capability coupled with acoustics for cueing and bullet tracking; develop hardware and software for detection and negation of sniper optics."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K86"
                    },
                    "ProjectTitle": {
                        "val": "Night Vision, Abn Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.216"
                        },
                        "CurrentYear": {
                            "val": "15.457"
                        },
                        "BudgetYearOne": {
                            "val": "16.006"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.006"
                        },
                        "BudgetYearTwo": {
                            "val": "16.830"
                        },
                        "BudgetYearThree": {
                            "val": "17.184"
                        },
                        "BudgetYearFour": {
                            "val": "17.488"
                        },
                        "BudgetYearFive": {
                            "val": "17.637"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates intelligence, surveillance, reconnaissance, targeting and pilotage technologies in support of the Army's aviation and networked systems. This effort focuses on improved reconnaissance, surveillance and target acquisition and night pilotage sensors, high-resolution heads-up displays, sensor fusion, and aided target recognition (AiTR) capabilities for Army vertical lift aircraft and utility helicopters and unmanned aerial systems (UAS). UAS payload efforts mature and demonstrate small, lightweight, modular, payloads (electro-optical\/infrared, laser radar, designator) to support target detection, identification, location, tracking and targeting of tactical targets for the Brigade Combat Team.  \n\nThe project supports Army science and technology efforts for the Air and Command, Control, Communications and Intelligence portfolios.  \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by the Army Research, Development and Engineering Command (RDECOM)\/Communications-Electronics Research, Development, and Engineering Center (CERDEC) \/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA.  Work in this project is fully coordinated with efforts in PE 0603003A (Aviation Advanced Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airborne Unmanned Persistent Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates day and night persistent surveillance imaging and enhanced reconnaissance, surveillance and target acquisition (RSTA) capabilities from a single payload on the Grey Eagle Unmanned Aerial System (UAS). Technology developed will be applied to smaller\/lighter UASs as miniaturized large format sensors mature.  In FY14 this effort supports TECD 3.b: Actionable Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.416"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated enhanced capabilities (high definition sensors and dual color infrared (midwave\/longwave (MW\/LW)) into a high definition demonstrator; completed intelligent data compression subsystem to provide persistent wide-area activity monitoring, personnel\/vehicle tracking, and enhanced RSTA capabilities to include high resolution target search; completed and demonstrated the 3rd generation focal plane array turret to provide the optimal infrared imaging band for prevailing battlefield conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.464"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct flight test and demonstration of enhanced RSTA and targeting capabilities with a high definition, dual-band infrared focal plane array-based turret; collect airborne imagery to support development of processing subsystem; train, test and optimize the image exploitation subsystem for persistent wide area activity monitoring."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.730"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.730"
                                            },
                                            "Text": {
                                                "val": "Will complete system flight testing; mature Step-Stare capability, demonstrating local-area persistent surveillance for small unit situational awareness; demonstrate automated target cueing, vehicle and dismount tracking, image mosaicing and mapping, and provide imagery and target report products to the small unit network as part of the TEC-D; demonstrate HD dual band 720 pixel format MWIR and LWIR imagery to determine best band for battlefield conditions and improved performance in adverse weather."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Definition Aviation Displays"
                                    },
                                    "Description": {
                                        "val": "This effort develops and demonstrates an advanced monocular, see-through, high definition, digital, helmet mounted display (HMD) to replace Apache's analog, cathode ray tube-based integrated helmet and display sight system (IHADSS) and provides a baseline for future aviation HMDs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured the capabilities of waveguide display optics technology; expanded field-of-view and resolution through innovative optical designs, materials and advanced display technologies; began to integrate and demonstrate the system (conduct laboratory and engineering flight tests)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.993"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete fabrication of initial engineering prototype displays with advanced monocular optics and low power miniature liquid crystal displays; demonstrate and assess key head-borne ergonomic parameters such as size and weight, center of gravity, display brightness\/contrast and resolution; integrate with HGU-56P helmet; conduct laboratory performance characterization and fabricate five system demonstrators for flight testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.919"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.919"
                                            },
                                            "Text": {
                                                "val": "Will complete fabrication of wide field of view system demonstrators; conduct laboratory performance characterization of complete HMD system and aero-medical human factors conformance; finalize platform integration activities; conduct ground and flight test demonstrations and user evaluation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multifunction Imagers for Rotary Wing"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates an economical sensor capability by developing multifunction sensor modules for increased performance of pilotage capability in a degraded visual environment at lower total life cycle cost than separate sensor systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.357"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.357"
                                            },
                                            "Text": {
                                                "val": "Will develop a dual-speed 60\/1000 Hz readout integrated circuit that enables a single infrared (IR) sensor to provide simultaneous day\/night imagery for applications such as pilotage; integrate the dual-purpose IR sensor into a multifunction sensor module with other low-light night vision technology to provide a multi-spectral capability; conduct trade studies to optimize sensor placement for multiple applications performance over the entire flight envelope, including degraded visual environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}