{
    "id": "9e27e4e845af602540c74c143210b00176431daa",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602307A"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED WEAPONS TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.392"
            },
            "CurrentYear": {
                "val": "25.999"
            },
            "BudgetYearOne": {
                "val": "26.162"
            },
            "BudgetYearOneBase": {
                "val": "26.162"
            },
            "BudgetYearTwo": {
                "val": "28.376"
            },
            "BudgetYearThree": {
                "val": "29.537"
            },
            "BudgetYearFour": {
                "val": "28.914"
            },
            "BudgetYearFive": {
                "val": "29.339"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 increase for high efficiency laser effort."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates enabling technologies for High Energy Laser (HEL) weapons.  Project 042 develops component technologies such as efficient, high energy, solid state lasers, advanced beam control components, and lethality \/ effectiveness measurements that enable better models and simulations for future HEL weapon designs. \n  \nWork in this project is related to, and fully complements, efforts in PE 0602890F (HEL Research) and PE 0603924F (HEL Advanced Technology Program), PE 0605605A (DoD High Energy Laser Systems Test Facility (HELSTF)), PE 0602120A (Sensors and Electronic Survivability), and PE 0603004A (Weapons and Munitions Advanced Technology) Project L96, and is coordinated with PE 0603005A (Combat Vehicle and Automotive Advanced Technology) Project 441.     \n  \nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan and the Army Modernization Strategy.   \n  \nWork is performed by the U.S. Army Space and Missile Defense Command (SMDC), in Huntsville, AL, the U.S. Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC) in Huntsville, AL, and the High Energy Laser Systems Test Facility, at White Sands Missile Range, NM."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.002"
                },
                "CurrentYear": {
                    "val": "25.999"
                },
                "BudgetYearOne": {
                    "val": "22.862"
                },
                "BudgetYearOneBase": {
                    "val": "22.862"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.392"
                },
                "CurrentYear": {
                    "val": "25.999"
                },
                "BudgetYearOne": {
                    "val": "26.162"
                },
                "BudgetYearOneBase": {
                    "val": "26.162"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.610"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.300"
                },
                "BudgetYearOneBase": {
                    "val": "3.300"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.610"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.300"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.300"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "042"
                    },
                    "ProjectTitle": {
                        "val": "HIGH ENERGY LASER TECHNOLOGY"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.392"
                        },
                        "CurrentYear": {
                            "val": "25.999"
                        },
                        "BudgetYearOne": {
                            "val": "26.162"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.162"
                        },
                        "BudgetYearTwo": {
                            "val": "28.376"
                        },
                        "BudgetYearThree": {
                            "val": "29.537"
                        },
                        "BudgetYearFour": {
                            "val": "28.914"
                        },
                        "BudgetYearFive": {
                            "val": "29.339"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates and develops advanced technologies for High Energy Laser (HEL) weapon systems to enable more efficient lasers with greater power output. This includes technologies to support development of alternate laser sources; precision optical pointing and tracking components; adaptive optics to overcome laser degradation due to atmospheric effects; and thermal management systems to remove excess heat.  In addition, this effort conducts laser lethality demonstrations and analysis against a variety of targets and investigates the impact of low-cost laser countermeasures.  Solid State Laser (SSL) efforts continue to leverage other funds provided by the HEL Joint Technology Office (JTO), the Air Force, and the Navy to develop multiple technical approaches that reduce program risk and maintain competition. \n\nThis project supports Army science and technology efforts in the Ground Portfolio.  \n \nWork in this project is related to, and fully coordinated with, efforts in PE 0602890F (HEL Research) and PE 0603924F (HEL Advanced Technology Program), PE 0605605A (DoD High Energy Laser Systems Test Facility (HELSTF)), PE 0602120A (Sensors and Electronic Survivability), PE 0603004A (Weapons and Munitions Advanced Technology) Project L96, and to PE 0603005A (Combat Vehicle and Automotive Advanced Technology) Project 441.   \n \nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan and the Army Modernization Strategy.  \n \nWork is performed by the U.S. Army Space and Missile Defense Command (SMDC), in Huntsville, AL, the U.S. Aviation and Missile Research, Development, and Engineering Center (AMRDEC) in Huntsville, AL, and the HELSTF at White Sands Missile Range, NM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Solid State Laser (SSL) Effects"
                                    },
                                    "Description": {
                                        "val": "This effort provides the underlying data required to support system engineering designs, lethality analysis, and modeling and simulation (M&S) tools for laser weapon systems.  Beginning in FY13, this effort includes the operation of the Solid State Laser Testbed (SSLT), a 100kW class laser testbed located at the HELSTF for conducting SSL effects experiments in an open air environment. Beginning in FY13, multiple SSLT related project tasks were reorganized and are now captured in this planned program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.738"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued static and dynamic evaluations at various power levels up to 100kW using the SSL at the HELSTF against Rockets, Artillery, and Mortars (RAM) and Unmanned Aerial Systems (UAS) targets in conjunction with the other Services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.934"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct static and dynamic experiments using the SSLT infrastructure to investigate SSL performance against RAM, UAS, and other selected targets; and use data from experiments to validate M&S codes to predict SSL weapon system effectiveness in operational scenarios."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.978"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.978"
                                            },
                                            "Text": {
                                                "val": "Will return SSLT laser and clean room to fully operational standards to complete transfer of SSLT operations and maintenance responsibility to White Sands Missile Range (WSMR) HELSTF; will continue static and dynamic experiments to investigate performance of the SSLT against Man Portable Air Defense Systems (MANPADS) and use data collected from experiments to refine and validate M&S codes to predict SSL weapon system effectiveness against MANPADS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Beam Control Component Development"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies to enable lighter, more agile beam control systems that are robust enough to be used in Army ground platforms. This work is done in collaboration with the HEL JTO and other Services. Beginning in FY13, support activities were redistributed across all planned programs rather than solely captured in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.751"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Coated optics, began assembly, and conducted laboratory demonstrations of a lightweight beam director with the performance characteristics required for a tactical HEL weapon system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.184"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to mature components of a light weight beam director, including a shared aperture system and beam control algorithms to support the ability to precisely point a HEL through a beam control system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.267"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.267"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate performance of an off-axis light weight beam director and use data to update and validate models for component maturity; complete development of the aperture sharing element of the light weight beam director and demonstrate the jitter performance and track stability required for a mobile HEL weapon system; begin the integration of an Adaptive Optics (AO) system that will allow for improved beam propagation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Efficiency Laser Development"
                                    },
                                    "Description": {
                                        "val": "This effort develops component technologies that lead to increased SSL wall-plug efficiencies, which will lead to reductions in size and weight for multiple subsystems that greatly improve the ability to integrate SSL systems onto mobile Army weapon platforms. This work is done in collaboration with the HEL JTO and other Services. Selected laser design will be fabricated and integrated with the High Energy Laser Mobile Demonstrator (HEL MD) developed in 0603006A, Project L96."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.089"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed the design and risk reduction of the 25 kW high efficiency approaches, to include fabrication, integration, and evaluation of laser assemblies at 5 kW and 15 kW; completed the interim design of the 25 kW laboratory devices; completed the conceptual design of the 100 kW class device, to include thermal management techniques; and leveraged small business innovation research efforts to complete eye-safe laser component demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.947"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In concert with the HEL JTO and the other services, evaluate and select one or more high efficiency laser approaches to mature the design, determine interface specifications, purchase hardware items, and begin assembly of a 25-50kW class robust electric laser that is compatible with the mobile beam control system and vehicle payload weight and volume constraints; conduct experiments as components mature to validate performance and efficiency specifications; evaluate high efficiency laser technology approaches for ruggedness, reliability, and affordability; and investigate methods for using high efficiency lasers against sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.667"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.667"
                                            },
                                            "Text": {
                                                "val": "Will complete environmental testing on fiber laser subcomponents to support the rugged 50kW efficient laser critical design and conduct subscale experiments and analysis to ensure it will be compatible with the HEL MD ruggedness, reliability, and affordability factors; complete high efficient laser component design requirements and risk reduction testing of the rugged fiber laser amplifier, fiber array holder, and the Multi-Layer Dielectric (MLD) grating and holder; complete the rugged fiber laser component development and begin the purchase of long lead items for laser fabrication, such as high efficient laser diode pumps, efficient high power ytterbium doped fibers, and laser control electronics; and complete the design and fabrication of the rugged, high power beam combination optical element."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HEL Research and Development Laboratory"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing in-house expertise through SSL assessments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.814"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted modeling and simulation studies to characterize and optimize HEL system and component performance; and enhanced state-of-the-art reflectance measurement capability and continued collecting reflectance data of threat targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.934"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct experiments using Adaptive Optics (AO) components to develop and validate algorithms for correction of atmospheric distortions to improve effective range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "Will complete the analysis of an Adaptive Optics (AO) system and transition the hardware and algorithms to the light weight beam director effort for integrated tactical performance assessments; begin performance demonstrations using hardware and algorithms for correcting laser propagation in deep turbulence; begin development of an all weather tracker that is compatible with a laser weapon system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}