{
    "id": "a317ba341b3a198f0d66919527c0e42561cdebe8",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DHRA_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2014.zzz_unzipped_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "DoD Human Resources Activity",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603769SE"
        },
        "ProgramElementTitle": {
            "val": "Distributed Learning Advanced Technology Development (ADL)"
        },
        "R1LineItemNumber": {
            "val": "61"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "DoD Human Resources Activity"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "13.915"
            },
            "PriorYear": {
                "val": "13.133"
            },
            "CurrentYear": {
                "val": "12.195"
            },
            "BudgetYearOne": {
                "val": "12.116"
            },
            "BudgetYearOneBase": {
                "val": "12.116"
            },
            "BudgetYearTwo": {
                "val": "12.090"
            },
            "BudgetYearThree": {
                "val": "12.303"
            },
            "BudgetYearFour": {
                "val": "12.303"
            },
            "BudgetYearFive": {
                "val": "12.303"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the Under Secretary of Defense for Personnel and Readiness (USD (P&R)).\n\nThe Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the Under Secretary of Defense for Personnel and Readiness (USD (P&R)). Advanced Distributed Learning (ADL) Initiative: \n\nThis program develops the technologies to make learning and performance support available to service members, anytime, anywhere. The ADL Initiative concept enables the ability to migrate online learning content to multiple hardware and software applications using the Sharable Content Object Reference Model (SCORM®) standard. It has become the defacto standard and is moving through international bodies for global accreditation; its use is mandatory throughout the Department of Defense (DoD) through (Instruction1322.26). The program develops and maintains US and international partnerships with public education, vocational training, and lifelong learning programs. Policy oversight is managed by the Office of the Deputy Assistant Secretary of Defense\/Readiness (Training Readiness and Strategy). Current research is on an advanced concept for the purpose of development of a Personal Learning Assistant (PLA) that will provide training and learning to promote adaptability and agility in the workforce with the capability to tailor and adapt instructional material to fit the learners’ strength and weaknesses, learning style, and level of proficiency."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.579"
                },
                "CurrentYear": {
                    "val": "12.195"
                },
                "BudgetYearOne": {
                    "val": "12.116"
                },
                "BudgetYearOneBase": {
                    "val": "12.116"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.133"
                },
                "CurrentYear": {
                    "val": "12.195"
                },
                "BudgetYearOne": {
                    "val": "12.116"
                },
                "BudgetYearOneBase": {
                    "val": "12.116"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.446"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.446"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "Project 1"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Distributed Learning"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.915"
                        },
                        "PriorYear": {
                            "val": "13.133"
                        },
                        "CurrentYear": {
                            "val": "12.195"
                        },
                        "BudgetYearOne": {
                            "val": "12.116"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.116"
                        },
                        "BudgetYearTwo": {
                            "val": "12.090"
                        },
                        "BudgetYearThree": {
                            "val": "12.303"
                        },
                        "BudgetYearFour": {
                            "val": "12.303"
                        },
                        "BudgetYearFive": {
                            "val": "12.303"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the Under Secretary of Defense for Personnel and Readiness (USD (P&R)).\n\nAdvanced Distributed Learning (ADL) Initiative: This program develops the technologies to make learning and performance support available to service members, anytime, anywhere. The ADL concept enables the ability to migrate online learning content to multiple hardware and software applications using the Sharable Content Object Reference Model (SCORM®) standard. It has become the defacto standard and is moving through international bodies for global accreditation; its use is mandatory throughout the Department of Defense (DoD) through (Instruction1322.26). The program develops and maintains US and international partnerships with public education, vocational training, and lifelong learning programs. Policy oversight is managed by the Office of the Deputy Assistant Secretary of Defense\/Readiness (Training Readiness and Strategy). Current research is on an advanced concept for the purpose of development of a Personal Learning Assistant (PLA) that will provide training and learning to promote adaptability and agility in the workforce with the capability to tailor and adapt instructional material to fit the learners’ strength and weaknesses, learning style, and level of proficiency."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Distributed Learning"
                                    },
                                    "Description": {
                                        "val": "The Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the\nUnder Secretary of Defense for Personnel and Readiness (USD (P&R)). HSPD-12 requires rapid electronic authentication for all\nGovernment employees, uniformed individuals and contractors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.133"
                                            },
                                            "Text": {
                                                "val": "• Publish research articles in leading professional journals on the effectiveness of online learning compared to classroom training;\n• Research new learning technologies for possible integration into DoD educational and training programs to include the ergonomic integration of less-invasive, human-computer devices within a training environment and structured learning content schemas and transformation technologies that can modularize content, enhance semantic understanding, and improve the prospects for reuse;\n• Test advanced instructional methods using intelligent tutors for training;\n• Establish advanced concept research and prototypes for the Next Generation SCORM standard."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.195"
                                            },
                                            "Text": {
                                                "val": "• Research new learning technologies for possible integration into DoD educational and training programs to include innovative methodologies and approaches to using Social Networking for solving problems in collaborative, disparate environments in a manner that improves learning outcomes and demonstrate the application of the spacing effect using current mobile technologies to reinforce learning and improve long-term retention.\n• Continue to test advanced instructional methods for intelligent tutors for training;\n• Continue research on advanced concept research on the next generation learning environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.116"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.116"
                                            },
                                            "Text": {
                                                "val": "• Continue to publish research articles in leading professional journals on the effectiveness of online learning compared to classroom training;\n• Continue to research new learning technologies for possible integration into DoD educational and training programs to include persistent, open independent Learner Models with reasoning capability that incorporate new methods of machine learning, common sense reasoning, cognitive modeling, and\/or artificial intelligence, the use of intelligent systems designed to increase both cognitive adaptability and emotional resiliency and domain independent intelligent system design.\n• Continue to test advanced instructional methods using intelligent tutors for training;\n• Continue research on advanced concept research on the next generation learning environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Required."
                        },
                        "PerformanceMetrics": {
                            "val": "In FY2013, conduct research for the purpose of exploring the application of new and emerging educational and training technologies for development of a capability by which learners have access to effective, personalized learning content and\/or job performance aids that are presented in a format suitable for their preferences and can be accessed from multiple devices\/platforms.  Prototype an Intelligent Tutor to assess the validity, scalability, exportability and affordability of DARPA’s “Education Dominance” program incorporating the processes utilized for Education Dominance and generalize them into mathematics to be applied to DoDEA schools curriculum with the intent to determine the utilization of this technology across DoD and as a step toward the more comprehensive PLA. Metrics include, but are not limited to; Scalability, Generalizability, and Affordability as defined below:\n• Scalability – Usable across the Department of Defense (DoD) and other federal agencies.\n• Generalizability – Built on a framework that can be used as a basis to provide this capability for any topic.\n• Affordability – Reasonably priced solution to enable wide spread use."
                        }
                    }
                }
            ]
        }
    }
}