{
    "id": "ad9f86149d922310fa0eb973fa4e2370e58da4cf",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DARPA_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602304E"
        },
        "ProgramElementTitle": {
            "val": "COGNITIVE COMPUTING SYSTEMS"
        },
        "R1LineItemNumber": {
            "val": "15"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "46.020"
            },
            "CurrentYear": {
                "val": "30.424"
            },
            "BudgetYearOne": {
                "val": "16.330"
            },
            "BudgetYearOneBase": {
                "val": "16.330"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Cognitive Computing Systems program element is budgeted in the Applied Research budget activity because it is developing the next revolution in computing and information processing technology that will enable computational systems to have reasoning and learning capabilities and levels of autonomy far beyond those of today's systems.  The ability to reason, learn and adapt will raise computing to new levels of capability and powerful new applications. \n\nThe Cognitive Computing project will develop core technologies that enable computing systems to learn, reason and apply knowledge gained through experience, and respond intelligently to things that have not been previously encountered.  These technologies will lead to systems demonstrating increased self-reliance, self-adaptive reconfiguration, intelligent negotiation, cooperative behavior and survivability with reduced human intervention.\n\nThe Collective Cognitive Systems and Interfaces project will dramatically improve warfighter and commander effectiveness and productivity using advanced cognitive approaches that enable faster, better informed, and more highly coordinated actions than those of our enemies.  This will be accomplished by developing revolutionary methods that increase our information processing capabilities, enhance our situational awareness, and enable more cohesive group action by our forces.  Critical technical areas addressed in this project include automated coordinated decision support, information sharing, and ensured communications."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.365"
                },
                "CurrentYear": {
                    "val": "30.424"
                },
                "BudgetYearOne": {
                    "val": "24.405"
                },
                "BudgetYearOneBase": {
                    "val": "24.405"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "46.020"
                },
                "CurrentYear": {
                    "val": "30.424"
                },
                "BudgetYearOne": {
                    "val": "16.330"
                },
                "BudgetYearOneBase": {
                    "val": "16.330"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.345"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-8.075"
                },
                "BudgetYearOneBase": {
                    "val": "-8.075"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.345"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-8.075"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.075"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012:  Decrease reflects reductions for the SBIR\/STTR transfer and internal below threshold reprogrammings.\nFY 2014:  Decrease reflects completion of the Transformative Apps and Autonomous Robotic Manipulation Programs in FY 2014."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "COG-02"
                    },
                    "ProjectTitle": {
                        "val": "COGNITIVE COMPUTING"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.360"
                        },
                        "CurrentYear": {
                            "val": "9.542"
                        },
                        "BudgetYearOne": {
                            "val": "3.503"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.503"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cognitive Computing project will develop core technologies that enable computing and autonomy systems to learn and apply knowledge gained through experience.  These technologies will lead to systems with increased self-reliance and the capacity to operate with reduced programmer and operator intervention.  In resource-limited settings, these capabilities will make the difference between mission success and mission degradation or failure, increase safety by allowing warfighters to operate systems from greater standoff distances, and reduce staffing requirements by providing greater autonomy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous Robotic Manipulation (ARM)"
                                    },
                                    "Description": {
                                        "val": "The Autonomous Robotic Manipulation (ARM) program is developing advanced robotic technologies that will enable autonomous (unmanned) mobile platforms to manipulate objects without human control or intervention.  A key objective is intelligent control of manipulators to independently perform subtasks over a broad range of domains of interest to the warfighter, thereby reducing operator workload, time on target, training time, bandwidth, and hardware complexity.  Current manipulation systems have many limitations.  For example, while they perform well in certain mission environments, they have yet to demonstrate proficiency and flexibility across multiple mission environments; they require burdensome human interaction and the full attention of the operator; and the time required to complete tasks generally exceeds military users' desires.  ARM will create manipulators with a high degree of autonomy capable of serving multiple military purposes across a wide variety of application domains including, but not limited to, counter-improvised explosive device, countermine, search and rescue, weapons support, checkpoint and access control, explosive ordnance disposal, and combat casualty care (including battlefield extraction).  ARM will enable autonomous manipulation systems to surpass the performance level of remote manipulation systems that are controlled directly by a human operator."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.360"
                                            },
                                            "Text": {
                                                "val": "-  Developed a bi-manual manipulator platform by adding a second arm to the existing manipulator system, and demonstrated operation within a larger workspace and handling of articulated objects such as pliers and scissors.\n-  Developed algorithms that enable head tracking of the task objects to accelerate completion time and increase robustness to change."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.542"
                                            },
                                            "Text": {
                                                "val": "-  Develop and demonstrate algorithms for autonomous grasping of complex objects, such as the handle of an impact driver.\n-  Develop and demonstrate algorithms for autonomous bimanual manipulation, such as zipping open a satchel bag and extracting an object."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.503"
                                            },
                                            "Text": {
                                                "val": "-  Develop robust algorithms that locate and identify objects in various real-world scenarios.\n-  Evaluate all performer autonomous algorithms through a series of experiments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "COG-03"
                    },
                    "ProjectTitle": {
                        "val": "COLLECTIVE COGNITIVE SYSTEMS AND INTERFACES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.660"
                        },
                        "CurrentYear": {
                            "val": "20.882"
                        },
                        "BudgetYearOne": {
                            "val": "12.827"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.827"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Collective Cognitive Systems and Interfaces project will dramatically improve warfighter and commander effectiveness and productivity using advanced cognitive approaches that enable faster, better informed, and more highly coordinated actions than those of our enemies.  This will be accomplished by developing revolutionary methods that increase our information processing capabilities, enhance our situational awareness, and enable more cohesive group action by our forces.  Critical technical areas addressed in this project include automated decision support, information sharing, ensured communications, and advanced informatics.  The suite of programs under this project will significantly advance the military's ability to successfully deal with complex situations in operational environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Transformative Apps"
                                    },
                                    "Description": {
                                        "val": "Transformative Apps is creating the information infrastructure required to enable mission support and tactical applications (apps) to meet the efficiency, security, and availability requirements for use on mobile military networks.  Of particular importance is development of a new data synchronization architecture between the handhelds and the backend computing\/storage nodes.  Additionally, appropriate middleware services and libraries are being developed to facilitate shared capabilities such as map viewing, apps management, and collection of logs, usage statistics, and user feedback.  Apps, together with handhelds and networks, are tested in different training environments as well as in deployed environments.  Performance and usage are carefully tracked and user feedback collected to guide rapid enhancement of apps.  The effort is creating a military apps development community by reaching out to non-traditional performers and will explore new models for software acquisition based on end-user empowerment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.471"
                                            },
                                            "Text": {
                                                "val": "-  Expanded operational trial in theater to 2,300 users with operational requests for more units.\n-  Conducted evaluation with secure network infrastructure and demonstrated interoperability with military-grade encryption.\n-  Enhanced middleware and services for apps.\n-  Demonstrated apps code screening and vetting processes.\n-  Developed tools enabling non-experts to create apps on smartphone platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.882"
                                            },
                                            "Text": {
                                                "val": "-  Integrate and test with military tactical radio networks.\n-  Demonstrate interoperability with Army systems on mounted platforms.\n-  Develop the apps certification process and deploy to Army users.\n-  Expand apps library and initiate transition to program of record."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.827"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.827"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate full interoperability across dismounted, mounted, and tactical ops center users.\n-  Demonstrate training app suite for CONUS users.\n-  Enhance situational awareness apps for use in CONUS exercises."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Detection and Computational Analysis of Psychological Signals (DCAPS) - Medical"
                                    },
                                    "Description": {
                                        "val": "The Detection and Computational Analysis of Psychological Signals (DCAPS) program is developing automated information systems that identify group and individual trends indicative of post-traumatic stress disorder (PTSD) and traumatic brain injury (TBI) and anomaly detection algorithms that identify emerging physical and psychological crises.  These will complement commercial offerings that have not focused on issues specific to the warfighter.  DCAPS recognizes that security and privacy are critical to user acceptance and Health Insurance Portability and Accountability Act compliance and so incorporates strong authentication and other security mechanisms as needed to protect patient data.  The program is also developing partnerships with key DoD organizations working in this area, including the Defense Centers of Excellence for Psychological Health and Traumatic Brain Injury, the Defense Medical Research and Development Program, the Army Telemedicine & Advanced Technologies Research Center, and the National Center for TeleHealth and Technology.  This effort is funded in PE 0602115E, Biomedical Technology beginning in FY 2013."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.189"
                                            },
                                            "Text": {
                                                "val": "-  Completed development of a mobile device psychological health application with integrated privacy safeguards.\n-  Developed additional psychological telehealth applications that integrate multiple psychological health indicators such as so-called \"honest signals\".\n-  Developed plans for user trials of mobile psychological health and telehealth applications in coordination with transition partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Graph Understanding and Analysis for Rapid Detection - Deployed On the Ground (GUARD DOG)"
                                    },
                                    "Description": {
                                        "val": "The Graph Understanding and Analysis for Rapid Detection - Deployed On the Ground (GUARD DOG) program developed an integrated system to provide real-time data collection and analysis of patrol-based civilian interviews and field observations to facilitate understanding of the local and regional political, social, economic, and infrastructure situation in which U.S. forces are deployed.  GUARD DOG consisted of two segments: a handheld\/portable digital assistant to support dismounted soldiers patrolling neighborhoods and villages; and a laptop\/desktop computer system that integrates data from multiple patrols and supports battalion\/brigade-level analysts.  GUARD DOG provided automated support for the collect-update-analyze-prioritize process by supporting data collection and advanced analytics to evaluate the current local\/regional situation, identify gaps in the knowledge base, and generate information requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Enhanced algorithms to address uncertain and dynamic data.\n-  Expanded architecture to support multiple distributed users, as well as disconnected operations.\n-  Evaluated system on real-world data and problems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}