{
    "id": "b5cbca95278b1070ede054def33e62c6fb8a5b1f",
    "meta": {
        "filename": "dod-2014_RDTE_2014_SOCOM_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.zzz_unzipped_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160479BB"
        },
        "ProgramElementTitle": {
            "val": "SOF Visual Augmentation, Lasers and Sensor Systems"
        },
        "R1LineItemNumber": {
            "val": "267"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "11.249"
            },
            "PriorYear": {
                "val": "2.711"
            },
            "CurrentYear": {
                "val": "4.448"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.00"
            },
            "TotalCost": {
                "val": "18.408"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning in FY 2014, this Program Element (PE) 1160479BB, SOF Visual Augmentation, Lasers and Sensor Systems has been consolidated into SOCOM PE 1160431BB, Warrior Systems."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides for development, testing, and integration of specialized visual augmentation, laser and sensor systems equipment to meet the unique requirements of Special Operations Forces (SOF).  Specialized equipment will permit small, highly trained forces to conduct required operations across the entire spectrum of conflict.  These operations are generally conducted in harsh environments, for unspecified periods and in locations requiring small unit autonomy.  SOF must infiltrate by land, sea, and air to conduct unconventional warfare, direct action, or deep reconnaissance operations in denied areas against insurgent units, terrorists, or highly sophisticated threat forces.  The requirement to operate in denied areas controlled by a sophisticated threat mandates that SOF systems remain technologically superior to enemy threats to ensure mission success."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.000"
                },
                "CurrentYear": {
                    "val": "4.448"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.711"
                },
                "CurrentYear": {
                    "val": "4.448"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.289"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.212"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.077"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Funding:   \n \nFY 2012:  Net decrease of -$0.289 million is due to reprogramming to higher command priorities (-$0.212 million) and Small Business Innovation Research transfer (-$0.077 million).\n\nFY 2013:  None.\n\nFY 2014:  None.\n\nSchedule:  None.  \n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S395"
                    },
                    "ProjectTitle": {
                        "val": "SOF Visual Augmentation, Lasers and Sensor Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.249"
                        },
                        "PriorYear": {
                            "val": "2.711"
                        },
                        "CurrentYear": {
                            "val": "4.448"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.00"
                        },
                        "TotalCost": {
                            "val": "18.408"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for development, testing and integration of specialized visual augmentation, laser and sensor system equipment to meet the unique requirements of Special Operations Forces(SOF).  Specialized equipment will permit small, highly trained forces to conduct required operations within harsh environments, for unspecified periods and in locations requiring small unit autonomy. SOF must infiltrate by land, sea, and air to conduct unconventional warfare, direct action, or deep reconnaissance operations in denied areas against insurgent units, terrorist, or highly sophisticated threat mandates that SOF systems remain technologically superior to enemy threats to ensure mission success.\n\nVisual Augmentation Systems (VAS).  This program develops, buys prototypes, and supports fielding of operator-borne combat optics for SOF.  These devices provide the SOF operator the ability to maneuver, conduct fire control operations, and perform surveillance and reconnaissance.  Research and Development efforts will develop, test, and evaluate prototype systems of the next generation Fusion system.\n\nThese Visual Augmentation Systems will provide an all-weather, low-light capability for SOF personnel by employing a Block approach.  This Block approach produces a family of VAS systems which will utilize a variety of different sensor technologies to satisfy the capabilities defined by individual Block requirement.  Some examples of the types of sensor technologies that these systems may utilize include:  Image Intensification, Thermal, Short Wave Infrared (SWIR) and\/or multi-spectral.  To date the Target Engagement Portfolio has utilized several Block system approaches that have been fielded by the VAS program.  These VAS programs will be a developmental effort to produce and field the next generation systems for SOF personnel.  Some of the capability shortfalls identified by the SOF community are the following: (1) ability to detect, classify, and engage targets out to 800 m without the use of an infra-red illuminator; (2) ability to determine wind speed at ranges out to 500 m or greater and (3) ability to observe bullet trace at ranges of 800 m or greater.\n\nVisual Augmentation Systems Weapons Accessories (VASWA).  This program effort enhances all SOF weapons, both individual and crew served, by leveraging the latest technological advances in optional accessories (up to 30 different functions \/ capabilities) such as combat optics, aiming laser modules, visible lights, and close quarters battle sights.  Miniature Day-Night Sight (MDNS) for crew-served weapons enhances all SOF Weapons by leveraging existing image intensification and thermal technology to improve combat effectiveness for all crew-served weapon systems.  Development efforts include test and evaluation of the Advanced Target Pointer Illuminator Aiming Laser (ATPIAL) hardening to withstand the live-fire shock profiles for the Combat Assault Rifle (CAR), VAS and clandestine pointer.  Leveraging extensive modeling and simulation efforts executed by National Labs.  Also, competitively award RDT&E contracts to select vendors in order to develop clandestine operator-borne visual augmentation devices.  These accessories greatly improve the combat effectiveness of the weapon systems and the survivability of the SOF operator."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "VAS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.711"
                                            },
                                            "Text": {
                                                "val": "Initiated the development of the next generation of operator-borne visual augmentation devices to improve situational awareness, sharing of data\/images and target acquisition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.448"
                                            },
                                            "Text": {
                                                "val": "Continue the development of the next generation of operator-borne visual augmentation devices to improve situational awareness, sharing of data\/images and target acquisition. The primary capability shortfalls addressed include the following under all lighting conditions:  (1) Ability to detect, classify, and engage targets out to 800 m without the use of an infra-red illuminator; (2) Ability to determine wind speed at ranges out to 500 m or greater; and (3) Ability to observe bullet trace at ranges of 800 m or greater."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC1"
                                    },
                                    "Title": {
                                        "val": "VISUAL AUGMENTATION, LASERS AND SENSOR SYSTEMS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.142"
                                        },
                                        "CurrentYear": {
                                            "val": "34.028"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "50.062"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "VAS utilizes FY 2012 and FY 2013 RDT&E funds to develop prototypes for the SOF next generation operator-borne visual augmentation devices.  These developmental efforts will leverage Science and Technology projects conducted to date and lead to the development of prototype systems for SOF to evaluate and an Indefinite Delivery Indefinite Quantity production contract in FY 2014 and FY 2015 to support SOF procurement of the production version of the next generation operator-borne visual augmentation devices."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "VAS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Joint Special Operations Program Office"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Crane, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.015"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.453"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-06"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Sensors and Lasers"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.844"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "VAS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Joint Special Operations Program Office"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Crane, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.211"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.995"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "HQ USSOCOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tampa, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.390"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Visual Augmentation System Binocular\/Monocular"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Development of the Next Generation Operator-borne Combat Optics"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Integration and Testing of the Next Generation Operator-borne Combat Optics"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Development of the Next Generation Visual Augmentation Device for Target Engagement Systems"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Integration and Testing of the Next Generation Visual Augmentation Device for Target Engagement Systems"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}