{
    "id": "b887dce7eea16776a91d50b4ddaedd957eccb128",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DHRA_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2014.zzz_unzipped_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "DoD Human Resources Activity",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605803SE"
        },
        "ProgramElementTitle": {
            "val": "R&D in Support of DOD Enlistment, Testing and Evaluation"
        },
        "R1LineItemNumber": {
            "val": "161"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "DoD Human Resources Activity"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "64.408"
            },
            "PriorYear": {
                "val": "50.143"
            },
            "CurrentYear": {
                "val": "16.364"
            },
            "BudgetYearOne": {
                "val": "6.908"
            },
            "BudgetYearOneBase": {
                "val": "6.908"
            },
            "BudgetYearTwo": {
                "val": "6.195"
            },
            "BudgetYearThree": {
                "val": "5.788"
            },
            "BudgetYearFour": {
                "val": "6.066"
            },
            "BudgetYearFive": {
                "val": "6.066"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the Under Secretary of Defense for Personnel and Readiness (USD (P&R)).  This PE includes application of R&D to expedite prototype development and mission support efforts to sustain and\/or modernize operations required for general RDT&E.\n\nProject 1:  Joint Service Training & Readiness System Development.  This program transfers to OUSD (P&R) in FY 2013. \n\nProject 2:  The Defense Training Resources Analysis.  This program transfers to OUSD (P&R) in FY 2013.\n\nProject 3:  DoD Enlistment Processing and Testing. The project administers testing programs, which enable the Armed Services to select highly qualified military recruits. The DoD uses a single test, the Armed Services Vocational Aptitude Battery (ASVAB), to determine eligibility of military applicants and to report recruit quality data to Congress. High quality recruits are obtained from administering the ASVAB annually to approximately 600,000 applicants for Military Service as part of the DoD Enlistment Testing program, and to 1 million students in the DoD Student Testing program. Each Service also uses ASVAB test forms developed in this program as part of their in-service testing programs. New ASVAB test forms and related support materials are implemented approximately every four years. This allows DoD to make measurement improvements as well as decrease the likelihood of test compromise. Ongoing RDT&E efforts include development and evaluation of procedures which (1) reduce or eliminate threats to the validity of the ASVAB test scores generated; (2) improve the efficiency of the test development, calibration, and validation process; and (3) improve selection and classification decisions made by each Service through more effective use of test score information. In addition, periodic assessments are required to provide DoD manpower planners and Congress with information on aptitude trends in the population from which recruits are drawn.\n\nProject 4:   Federal Voting Assistance Program.  Given the agile planning and deployment flexibilities required in as dynamic a RDT&E environment as internet voting, the FY 2013 execution plan will be significantly influenced by the results of the FY2011 and FY2012 research, development, and evaluation results.  However, current plans are to initiate the first two phases of the internet voting demonstration competition challenge:\n\no  Phase I of Internet Voting Competition Challenge:  In the first phase submissions will focus on defining security, reliability, usability, and accountability requirements for internet voting systems. Submissions will be open to the public, and will be open to public critique. FVAP will review those submissions and critiques, and then consolidate them into a single set of requirements for Phase II. \n\no  Phase II of Internet Voting Competition Challenge:  In this phase, submission will provide high level designs and detailed hardware and software architectures, along with procedures necessary for secure operation. Submissions will be sufficiently detailed so that a reasonably skilled information technologist could implement the system to allow for broader peer review.  However, many details such as user interfaces and database layouts will be likely be undefined. As with the first phase, submissions will be open for critique. In this phase critiques will focus on identifying areas where designs do not meet the requirements defined in the first phase. The result may be modification of architectures to incorporate ideas from several teams. At the conclusion of this phase, the Department will narrow down the set of acceptable architectures. \n\no  RDT&E funding for the internet voting program is discontinued in FY 2014 until the Election Assistance Commission (EAC) and the National Institute of Standards and Technology (NIST) have established the measurements and standards against which internet voting can be evaluated.  \n\nProject 5: Civilian HR automation enhancements planned for FY 2012 and FY 2013 are focused on software development to support the Department’s civilian workforce, including readiness requirements for the development of automation for an expeditionary civilian workforce; an SES-focused performance management system; development of interfaces with the Defense Civilian Personnel Data System (DCPDS) and other civilian HR systems to fully expand the Enterprise Staffing Solution; development of DCPDS interfaces with Office of Personnel Management (OPM) initiative mandates for HR Line of Business (LoB), electronic Official Personnel Folder, Retirement Systems Modernization implementation, and HR Line of Business. DoD is one of five designated Shared Service Centers in the federal government focused on providing standard services across agency lines, gaining potential significant business and cost-saving benefits. DoD is considered a leader in this initiative. Continues the conversion of employees back to other personnel systems as mandated in NDAA 2010 and designs new flexibilities to include, but not limited to the establishment of policies and procedures for a new Performance Management System, a redesigned hiring process adhering to veterans’ preference requirements, a “Department of Defense Civilian Workforce Incentive fund”, and a Mandatory Training and Retraining Program for Supervisors. DCPDS is the Department’s enterprise civilian HR system that has provided the savings originally projected in the achievement of full operational capability in 2002 and which has continued to operate as the DoD system serving over 800,000 employee records. Additional initiatives to sustain the Department’s lead in automated systems to include, expansion of employee self service functionality, and systems to support civilian HR requirements of the intelligence and National Guard communities. All enhancements will support the Department’s focus on the further consolidation of civilian HR operations to a single operational site, with linkage to Component operations worldwide.\n\nProject 6:  The integrated DoD SAPR Data Collection and Reporting System (Defense Sexual Assault Incident Database (DSAID)) must accommodate a variety of uses, including the tracking of sexual assault victim support services, support SAPR program administration, program reporting requirements, and data analysis. In order to facilitate analysis at the OSD level, the System should be able to easily export data for analysis in computerized statistical applications, such as Statistical Package for the Social Sciences (SPSS). Service field-level users may use the system to track support to victims of sexual assault throughout the lifecycle of that support requirement and to facilitate sexual assault case transfer between SARCs and Services. Service headquarters-level users will use the system to support program planning, analysis, and management. DoD SAPR Office (SAPRO) users and Service headquarters-level users will access the system to produce mandated and requested reports, monitor program effectiveness and support cohort and trend analysis. The Defense Sexual Assault Incident Database (DSAID) will support SAPR programs for all active duty and Reserve personnel, including National Guard (NG) Service members when on active duty or when performing active service and inactive duty training (as defined in Section (101)(d)(3) of Chapter 47 of title 10, United States Code) with the ability to expand to cover other DoD personnel as required. Additionally, system implementation at the state level will provide a new capability to manage SAPR programs for National Guard personnel under Title 32 USC.  Implementation of this capability will be based on a state NG structure grouped according to state and subdivided into sexual assaults from the separate Army and Air National Guard.  Full Deployment and Delivery (FDD) is scheduled for Q4 FY2012 as a result additional RDT&E funding will not be required after FY2012.\n\nProject 7:  Defense Manpower Data Center (DMDC) acts as the authoritative source for identity and personnel information for the DoD Net Centric Enterprise Computing vision of the Department of Defense’s Global Information Grid (GIG 2.0). Based on the DEERS identities, DMDC provides the key attribute service for the Department of Defense (DoD) Identity and Access Management (IdAM) Capability. The Enterprise Identity Attribute Service (EIAS) supports IdAM through the distribution of DoD person and personnel attributes to applications and services in a controlled, consistent, and secure manner to support ABAC decisions. The controlled, authoritative information provided via EIAS can be used to confirm an individual’s identity, affiliation to the DoD, clearance, pay grade\/rank, organization and occupation series for an authorization decision. A key attribute for decision makers is organization. The Global Force Management Data Initiative (GFM_DI) provides the unique organization identifier (OUID) in the EIAS payload. To meet the DoD demand for the OUID, DMDC working with J8 and the Service\/Agencies has to 1) establish the linkage between a person (EDI_PI) and the OUID, 2) provide the OUID attribute in the EIAS payload for access decisions, and 3) standardize the organizational attributes required to make access decisions.\n\n Project 8:  The Neo Tracking System (NTS) \/ Emergency Tracking Accountability System (ETAS) is a certified and accredited DoD automated system that accounts for, and sustains visibility of noncombatant evacuees during a NEO under the authority of DODD 1000.25, DoD Personnel Identity Protection (PIP) Program. NTS is currently being used in the USAFRICOM, USCENTCOM, USEUCOM, USSOUTHCOM, and USPACOM AORs. The ETAS component is the CONUS domestic version of NTS and is for use by USNORTHCOM during disasters in the CONUS whether natural, accidental, or acts of terrorism. The primary purpose of the NTS\/ETAS is to provide individual accountability of the evacuee by creating and maintaining a database of evacuees assembled during an evacuation operation and subsequently tracking the evacuees' movement throughout the evacuation process.\n\nProject 9:  The Synchronized Pre-deployment and Operational Tracker Enterprise Suite (SPOT-ES) is the Department of Defense (DoD) system of record for accountability and visibility of contracts and contractor personnel authorized to operate in a contingency operation.  SPOT-ES provides web based tracking and visibility into contract services, personnel and equipment locations; provides a common operational picture for Combatant Commanders; enhances the analytical tools to accurately plan for the quantity of contracted support required for future contingency operations; and collects accurate data for the OMB-directed quarterly census of all contractors supporting contingency operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.686"
                },
                "CurrentYear": {
                    "val": "16.364"
                },
                "BudgetYearOne": {
                    "val": "6.908"
                },
                "BudgetYearOneBase": {
                    "val": "6.908"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "50.143"
                },
                "CurrentYear": {
                    "val": "16.364"
                },
                "BudgetYearOne": {
                    "val": "6.908"
                },
                "BudgetYearOneBase": {
                    "val": "6.908"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.457"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.457"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013, Project 1, Joint Service Training & Readiness System Development , and Project 2, Defense Training Resource Analysis was transfered to Washington Headquarter Services for proper execution.\nProject 9, Synchronized Pre-deployment & Operational Tracker enterprise Suite (SPOT), was transfered to DHRA from DLA\/BTA for proper execution."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "Project 1"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Training & Readiness System Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.264"
                        },
                        "PriorYear": {
                            "val": "4.165"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Service programs were established by the Secretary of Defense to improve the training and readiness of the Active and Reserve Components. This project expedites the prototype development of new training and readiness technologies and Joint Service training and readiness systems, which improve the training and readiness effectiveness and enhance the performance of the military forces. It also facilitates the sharing of training and readiness information, while allowing for the transfer of emerging and innovative technologies among the Services and private sector. Efforts have included: development of mission essential tasks; design, development, and implementation of performance metrics, data, and methodologies for the Joint Assessment and Enabling Capability to guide Training Transformation and support the Department’s balanced scorecard and Defense Readiness Reporting System; identified and defined joint urban training requirements, identified methods to conduct effective joint training, and determined best means to develop simulations, military construction, and other urban training facilities that meet Service, joint, and fiscal demands and requirements; developed joint training regimen requirements and investments ranging from the joint strategic level down to the joint tactical level for joint asymmetric warfare; and developed a joint stability and support operations training roadmap and investment plan for operations other than war including peace enforcement, peacekeeping, and humanitarian assistance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Service Training & Readiness System Development"
                                    },
                                    "Description": {
                                        "val": "Joint Service Training & Readiness System Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.165"
                                            },
                                            "Text": {
                                                "val": "• Provide an assessment and forecast of DOD logistics and material readiness in light of significant programmatic and operational impacts that have occurred and will occur over the next five to ten years.  \n• Continue to assess the current state of logistics\/material readiness in the Department and track the performance of various logistical and material processes in DoD.\n• Continue to support prototype development, assessment and application of DoD’s Knowledge Management Systems and Ports.\n• Analyze estimated rates of personnel instability among unit leadership. \n• Identify primary underlying causes of instability and assess potential effects of policies to mitigate instability\n• Continue to develop Virtual Worlds (VW) technology to support Department of Defense (DoD) training.\n• Provide a VW Framework (VWF) which includes an overarching architecture encompassing a number of VW applications, as well as a VW Roadmap and Governance process to implement the VWF. \n• Continue to develop strategies to combat “Stress on the Force”\n• Continue to assess the ongoing requirement for Civil Affairs forces an compare the requirements to the planned future capability and offer recommendations on how to address potential training shortfalls."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Program will transfered to Washington Headquarter Services."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NOT REQUIRED."
                        },
                        "PerformanceMetrics": {
                            "val": "Each project contained within this program contains specific metrics to determine progress towards completion.  Metrics for all include completed and documented analysis provided by the performer. The completion date for that analysis varies with each project. In addition, to that analysis, each effort contains a roadmap addressing the best use of the findings throughout the department. If the results of the analysis show benefit to the Department, those findings are included in policy, doctrine, tactics and procedures."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 2"
                    },
                    "ProjectTitle": {
                        "val": "Defense Training Resource Analysis"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.403"
                        },
                        "PriorYear": {
                            "val": "3.319"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports DHRA and DoD training managers (OSD, Joint Staff, Unified Commands, and the Services) in promoting more efficient and effective use of training resources, increasing the effectiveness of military training, and enhancing the readiness and performance of the military forces. Projects analyze the contributions to readiness of various training techniques and programs and use the results to expedite new training concepts and procedures that increase unit effectiveness or decrease costs. Emphasis is placed on developing analytical tools and systematic methodologies to improve training resource allocations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Training Resource Analysis"
                                    },
                                    "Description": {
                                        "val": "Defense Training Resource Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.319"
                                            },
                                            "Text": {
                                                "val": "• Determine the feasibility of the Regional Integrated Training Environment (RITE) concept prior to moving forward with a formal strategic communications and education effort and determine best approach for concept implementation.\n• Informed the decision to continue the outreach and implementation efforts.\n• Continue to examine how and why the management of war wounded has changed over time and the historic background how the federal government arrived at the current set of policies and possible changes for the future.\n• Continue to develop reserve component readiness mobilization strategies.\n• Analyze training requirements for DoD Counterinsurgency implementation plans\n• Provide senior decision makers access to the readiness data for Non-Standard forces (Ad Hoc\/In-Lieu-Of) prior to their deployment by developing a roadmap and implementation plan to make certain that Non-Standard Forces are assessed in the Defense Readiness reporting System (DRRS) in compliance with Guidance for Employment of the Force (GEF).\n• Continue to evaluate and develop potential improvements in the Request for Forces (RFF) process as part of the Global Force Management (GFM) system and identify the Defenses Readiness Reporting System (DRRS) could inform the GFM process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Program will transfered to Washington Headquarter Services"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NOT REQUIRED."
                        },
                        "PerformanceMetrics": {
                            "val": "Each project contained within this program contains specific metrics to determine progress towards completion.  Metrics for all include completed and documented analysis provided by the performer. The completion date for that analysis varies with each project. In addition, to that analysis, each effort contains a roadmap addressing the best use of the findings throughout the department. If the results of the analysis show benefit to the Department, those findings are included in policy, doctrine, tactics and procedures."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 3"
                    },
                    "ProjectTitle": {
                        "val": "DoD Enlistment Processing & Testing"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.077"
                        },
                        "PriorYear": {
                            "val": "2.035"
                        },
                        "CurrentYear": {
                            "val": "1.054"
                        },
                        "BudgetYearOne": {
                            "val": "0.381"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.381"
                        },
                        "BudgetYearTwo": {
                            "val": "0.807"
                        },
                        "BudgetYearThree": {
                            "val": "1.235"
                        },
                        "BudgetYearFour": {
                            "val": "1.261"
                        },
                        "BudgetYearFive": {
                            "val": "1.261"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The primary mission of DoD Enlistment Processing and Testing is to test and implement more accurate methods of assessing aptitudes required for military enlistment, success in training, and performance on the job. Also, it includes implementing methods that are useful in the identification of persons with the high aptitudes required by today’s smaller and technically more demanding military."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD Enlistment Processing & Testing"
                                    },
                                    "Description": {
                                        "val": "DoD Enlistment Processing & Testing"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.035"
                                            },
                                            "Text": {
                                                "val": "DoD Enlistment Testing Program (ETP):\n• Implement procedures for the detection of test compromise\n• Review and improve the test development process, particularly item writing and development\n• Collect data on new measures that could potentially be added to the ASVAB\n• Continue a research line on the use of multidimensional Computerized Adaptive Testing (CAT) item selection and scoring procedures\n• Evaluate the use of internet-based testing as a replacement for other types of testing \nDoD Student Testing Program (STP):\n• Collect data and conduct item level analyses of the Find Your Interests inventory\n• Conduct evaluations of the use of proctored internet-based CAT-ASVAB in the nation’s high schools and community colleges"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.054"
                                            },
                                            "Text": {
                                                "val": "DoD Enlistment Testing Program (ETP):\n• Finalize and implement new procedures for test development\n• Continue a research line on the use of multidimensional Computerized Adaptive Testing (CAT) item selection and scoring procedures\n• Continue research on revisions to ASVAB content\nDoD Student Testing Program (STP):\n• Evaluate methods to convert all STP to CAT\n• Continue to evaluate the use of internet-based CAT-ASVAB in the CEP"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.381"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.381"
                                            },
                                            "Text": {
                                                "val": "•Continue the research effort on new measures\/new content that could potentially be added to the ASVAB"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NOT REQUIRED."
                        },
                        "PerformanceMetrics": {
                            "val": "Each project contained within this program contains specific metrics to determine progress towards completion.  Metrics for all include completed and documented analysis provided by the performer. The completion date for that analysis varies with each project. In addition, to that analysis, each effort contains a roadmap addressing the best use of the findings throughout the department. If the results of the analysis show benefit to the Department, those findings are included in policy, doctrine, tactics and procedures."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 4"
                    },
                    "ProjectTitle": {
                        "val": "Federal Voting Assistance Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "38.845"
                        },
                        "PriorYear": {
                            "val": "27.476"
                        },
                        "CurrentYear": {
                            "val": "9.692"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Federal Voting Assistance Program (FVAP) exists to:\no  Assist military personnel, their dependents, and overseas Americans exercise their right to vote so that they have an equal opportunity with the general population to have their vote counted;\no  Assist the States in complying with relevant federal laws, and advise them on ways to best comply with those laws; and \no  Advocate on behalf of military and overseas voters, identifying impediments to their ability to exercise their right to vote, and proposing methods to overcome those impediments.\n\nFurther, the Department of Defense is legislatively mandated to develop and deploy an absentee voting system demonstration project in which military voters can cast their votes electronically in a general federal election.   To develop that system, numerous preliminary and iterative steps are necessary, including online voter registration, online ballot delivery and marking, rigorous cyber security threat analysis and evaluation, and pre-deployment system testing.  \n\nThese preliminary steps also directly support improved voter assistance by providing voters easier access to voting assistance resources, expediting the delivery of blank ballots, reducing errors in completing election forms and ballots, and providing better system and program evaluation data for more agile planning and execution, as well as to support mid-course corrections in achieving the final mandate of the electronic absentee voting demonstration project. \n\nGiven the inherent uncertainties in deploying an internet voting system five to seven years from now, the Department requires substantial flexibility in shifting two-year RDT& funds over different fiscal years, and in accelerating or decelerating execution rates, dependent upon the results of the intermediate programs which support future steps in the overall effort.  For example, in August 2011, during a working group meeting with computer technology scientists and representatives of EAC and NIST, the idea of conducting iterative public competitions of internet voting systems, akin to a weapon system “fly-off,” was adopted, and which provides the Department potential significant cost and time savings in deploying an internet voting system.  But its discovery near the end of FY2011 also makes it very difficult to fit such program development into the rigid requirements of the budget cycle and the even more rigid requirements of State election cycles.\n\nCongressional mandates also charge the Election Assistance Commission (EAC) (and through the Technical Guideline Development Committee, the National Institute of Standards and Technology (NIST)), with developing guidelines for the Department on such electronic absentee voting systems.  FVAP, EAC and NIST are jointly developing these guidelines, supported by full public engagement with the computer science, military and overseas voting advocacy, and voting system development communities.  This public outreach is crucial to designing electronic absentee voting systems which will be accepted as providing the same level of ballot access, security, privacy, and accountability as the current absentee voting systems provided military and overseas voters.  \n\nOriginal FY 2013 FVAP budget estimates assumed a 2012 or 2014 deployment of the electronic absentee voting system demonstration project.  However, system and guideline development does not support demonstration project deployment prior to 2016 or 2018."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Federal Voting Assistance Program"
                                    },
                                    "Description": {
                                        "val": "Federal Voting Assistance Program Funding will support the development of online tools to provide Voter Assistance Officer (VAO) training and to develop a dynamic public web-site to facilitate internet-based voter registration, ballot delivery and voting system for use in the first general election after the release of guidelines. FVAP will conduct a variety of research, analysis, evaluation, test and support functions with the intent of supporting Wounded Warrior, disabled military members, military members, their dependents and overseas civilian voters to register and vote successfully with a minimum amount of effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.476"
                                            },
                                            "Text": {
                                                "val": "Based on the results of the research and testing conducted in FY 10 and 11, continue to conduct evaluations, research and testing that will improve the assistance given to military and overseas voters in exercising their right to vote, assist state and local election officials in complying with the requirements of federal law, and in providing equal voting opportunity for military and overseas voters, and advocate for military and overseas voting rights with federal, state and local governments.\n\no  Electronic Absentee Voting System Evaluation Grants to States: FVAP will award approximately $20 million to States and local election jurisdictions to test various electronic absentee voting support systems, across the range of the absentee voting process (but not to include funding electronic transmission of voted ballots in a live election), for multiple election cycles.  State and local jurisdictions awarded grants will provide extensive data on UOCAVA voter behavior and system performance in order to feed future phases of pilot projects supporting the final demonstration project.  This should have the additional effect of providing UOCAVA voters more opportunities to register to vote, request an absentee ballot, and receive and mark absentee ballots online.  The Department will use FY2012 for a second round of grants, this time focusing on establishing automated and detailed data collection and reporting systems at the State and local level to provide FVAP and the EAC with better, timelier post-election data.\n\no  Initiate a Multi-Track Electronic Absentee Voting Demonstration Project Plan:  Currently, the EAC is not anticipating final validation of its testable standards for an electronic absentee voting demonstration project until 2014, which won’t support the execution of such a demonstration project until 2016, at the earliest.  In order to accommodate the standards development, procurement and full testing, as well as any remediation discovered along the way, the 2018 general election remains the most likely date for the full conduct of the internet voting demonstration project.  Therefore, the Department will suspend funding of its internet voting program until testable standards have been established.  Once standards are established, the Department will pursue a simultaneous three-track approach:\n\n  -  The first track would focus kiosk voting systems, to serve as a monitored test platform where the ballots of record are printed out and delivered to jurisdictions like other absentee ballots, but the same ballot would be delivered electronically to the election jurisdiction for comparison to the paper ballot of record.  This would allow the testing of electronic absentee ballot transmission security and reliability in a live election, without threatening the integrity of the election.    \n\n  -  The second track would use a three phase competition where external stakeholders and industry leaders will be challenged to exceed the Department’s current approach and technical requirements, again to support a 2018 deployment.  This competition would be modeled on similar competitions conducted by NIST and DARPA for cryptological and weapon system development.\n\n  -  The third track would continue the Department’s direct efforts, supported by the EAC and NIST, to deploy an electronic absentee voting system in 2018 for military voters only, using CAC cards and PKI, on military-protected computers resident on the Defense Information System Network (DISN). \n\n  -  To support this revised plan, a number of projects will be executed in FY 2012, as described below.  Additionally, to the extent possible, FVAP will direct investment, minimum of $2 million in the SBIR (Small Business Investment Research) program.\n\n  -  Voting Behavior and Failure Research:  The Department plans on issuing a Broad Agency Announcement in FY2012 detailing the key data and knowledge gaps regarding military and overseas voting (particularly regarding the key causes and extent of voting failure), providing a number of recommended research areas, but also inviting outside experts to propose innovative methods of filling those knowledge and data gaps.\n\n  -  Mobile Applications: The Department will design and deploy smartphone and mobile applications to support general voting assistance, voter awareness, and completion of voter registration and absentee ballot forms.\n\n  -  Computer Forensic and Software Assurance Tools:  To support future electronic absentee ballot security and reliability requirements, develop tools to improve the Department’s ability to prevent, detect, and mitigate attacks on military and overseas voter systems.  \n\n  -  Data Migration Tool:  Given the wide variety of election administration systems in use amongst the 7,200 election jurisdictions, the Department will design and deploy a data migration tool to convert election administration and ballot files into different and common database formats.\n\n  -  Improved FVAP Portal: Design and deploy an improved FVAP.gov website that more seamlessly links voters to State and local jurisdiction voting systems, provides easier and more intuitive access to voter information such as local election official or Voting Assistance Officer contact information, provides FVAP-developed data in API format for public use, and more logically links the various voter assistance systems provided by FVAP, to each other.\n\n  -  Improved Voter Registration and Back-Up Ballot Wizards:  The Department will improve the FPCA and FWAB wizards deployed in 2010, to improve candidate database reliability, provide States the ability to upload candidate data directly, to increase candidate data to Statewide races as well as federal races, and to migrate the entire system to the overall Portal server.\n\n  -  Military Address Lookup Tool: Given election officials problems with undeliverable ballots and old military addresses, FVAP will work to develop a State election official accessible system for military voter address verification and correction.\n\n  -  Additional Evaluation of all FVAP Programs: The Department will conduct rigorous evaluations of voter assistance programs including the usefulness of currently drafted documents and forms, effectiveness of the grant programs, online wizards, FVAP.gov portal hosting security and reliability, local election official and voting assistance officer databases, API architecture, data migration tools, and the knowledge management methods presented to voters and election officials on the FVAP.gov portal."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.692"
                                            },
                                            "Text": {
                                                "val": "Given the agile planning and deployment flexibilities required in as dynamic a RDT&E environment as internet voting, the FY 2013 execution plan will be significantly influenced by the results of the FY2011 and FY2012 research, development, and evaluation results.  However, current plans are to initiate the first two phases of the internet voting demonstration competition challenge:\n\no  Phase I of Internet Voting Competition Challenge:  In the first phase submissions will focus on defining security, reliability, usability, and accountability requirements for internet voting systems. Submissions will be open to the public, and will be open to public critique. FVAP will review those submissions and critiques, and then consolidate them into a single set of requirements for Phase II. \n\no  Phase II of Internet Voting Competition Challenge:  In this phase, submission will provide high level designs and detailed hardware and software architectures, along with procedures necessary for secure operation. Submissions will be sufficiently detailed so that a reasonably skilled information technologist could implement the system to allow for broader peer review.  However, many details such as user interfaces and database layouts will be likely be undefined. As with the first phase, submissions will be open for critique. In this phase critiques will focus on identifying areas where designs do not meet the requirements defined in the first phase. The result may be modification of architectures to incorporate ideas from several teams. At the conclusion of this phase, the Department will narrow down the set of acceptable architectures. \n\no  Conformance Testing to EAC Pilot Program Requirements for Kiosk Systems Used in a 2014 Election: To support the testing of internet voting systems from monitored kiosk test platform (where the ballots of record are printed out and delivered to jurisdictions like other absentee ballots, but the same ballot is delivered electronically to the election jurisdiction for comparison to the paper ballot of record), the Department will test conformance of selected systems to the EAC Pilot Program Testing Requirements.  \n\nFY 2014 plans, as stated above, plans for RDT&E funding beyond FY 2013 depend on the NIST and EAC establishing the measurements for standards against which internet voting can be evaluated."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NOT REQUIRED"
                        },
                        "PerformanceMetrics": {
                            "val": "The project is the development , testing and deployment of an internet-based  voter registration, ballot delivery and voting system that integrates the requirements of the electronic absentee voting guidelines."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 5"
                    },
                    "ProjectTitle": {
                        "val": "Human Resources Automation Enhancements"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.855"
                        },
                        "PriorYear": {
                            "val": "6.772"
                        },
                        "CurrentYear": {
                            "val": "1.312"
                        },
                        "BudgetYearOne": {
                            "val": "2.831"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.831"
                        },
                        "BudgetYearTwo": {
                            "val": "2.833"
                        },
                        "BudgetYearThree": {
                            "val": "1.868"
                        },
                        "BudgetYearFour": {
                            "val": "2.873"
                        },
                        "BudgetYearFive": {
                            "val": "2.873"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Civilian HR automation enhancements planned for FY 2013 and FY 2014 are focused on software development to support the Department’s civilian workforce, including  a performance management system; development of an employee competency assessment capability and EEO investigations case management; and  the Office of Personnel Management (OPM) mandates for HR Line of Business (LoB), electronic Official Personnel Folder, and Retirement Systems Modernization implementation. DoD is one of five designated Shared Service Centers in the federal  government focused on providing standard services across agency lines, gaining potential significant business and cost-saving benefits. DoD is considered a leader in this initiative.  DCPDS is the Department’s enterprise civilian HR system that has provided the savings originally projected in the achievement of full operational capability in 2002 and which has continued to operate as the DoD system serving over 800,000 employee records. Additional initiatives to sustain the Department’s lead in automated systems include expansion of employee self service functionality, and support for data warehouse improvements, engineering plans for consolidation and migration to a federal data center, an employee-manager portal, and information assurance initiatives to comply with DoD-mandated DMZ requirements.  DCPDS enhancements will support the Department’s focus on the further consolidation of civilian HR operations to a single operational site, with linkage to Component operations worldwide."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Resources Automation Enhancements"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.772"
                                            },
                                            "Text": {
                                                "val": "Phase III of DMZ extension to comply with DoD mandated DMZ extension requirements for all systems; enhancements to comply with legislative and DoD requirements; HR LoB initiatives, including modification to eOPF interface, Retirement Systems Modernization (RSM) IAW OPM mandates. Development of improvements, interfaces, and support of the Defense Enterprise\nHiring Solution to comply with mandated changes in hiring practices federal-wide."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.312"
                                            },
                                            "Text": {
                                                "val": "Continued enhancement and compliance with information assurance requirements, including DMZ extension requirements; DCPDS and other systems development to ensure compliance with legislative, OPM and OMB mandates; continued system enhancements to support HR LoB initiatives, including eOPF, RSM and related federal-wide initiatives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.831"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.831"
                                            },
                                            "Text": {
                                                "val": "Information assurance requirements for continued compliance with IA mandates, including further DMZ extension requirements; development of functionality to comply with legislative mandates; software development support of HR LoB with DCPDS system enhancements, including eOPF, retirement system modernization, and mandated changes in hiring practices; and development and prototyping of Advanced Benefits to support self-service initiatives for civilian employee access and use."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 6"
                    },
                    "ProjectTitle": {
                        "val": "Sexual Assault Prevention and Response Office"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "6.964"
                        },
                        "PriorYear": {
                            "val": "4.980"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the Under Secretary of Defense for Personnel and Readiness (USD (P&R)). \n\nThe integrated DoD SAPR Data Collection and Reporting System (Defense Sexual Assault Incident Database (DSAID)) must accommodate a variety of uses, including the tracking of sexual assault victim support services, support SAPR program administration, program reporting requirements, and data analysis. In order to facilitate analysis at the OSD level, the System should be able to easily export data for analysis in computerized statistical applications, such as Statistical Package for the Social Sciences (SPSS). Service field-level users may use the system to track support to victims of sexual assault throughout the lifecycle of that support requirement and to facilitate sexual assault case transfer between SARCs and Services. Service headquarters-level users will use the system to support program planning, analysis, and management. DoD SAPR Office (SAPRO) users and Service headquarters-level users will access the system to produce mandated and requested reports, monitor program effectiveness and support cohort and trend analysis. The Defense Sexual Assault Incident Database (DSAID) will support SAPR programs for all active duty and Reserve personnel, including National Guard (NG) Service members when on active duty or when performing active service and inactive duty training (as defined in Section (101)(d)(3) of Chapter 47 of title 10, United States Code) with the ability to expand to cover other DoD personnel as required. Additionally, system implementation at the state level will provide a new capability to manage SAPR programs for National Guard personnel under Title 32 USC. Implementation of this capability will be based on a state NG structure grouped according to state and subdivided into sexual assaults from the separate Army and Air National Guard.  Full Deployment and Delivery (FDD) is scheduled for Q4 FY2012 as a result additional RDT&E funding will not be required after FY2012."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sexual Assault Prevention and Response Office"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.980"
                                            },
                                            "Text": {
                                                "val": "• Continued development of DSAID with an expected Full Deployment and Delivery (FDD) in August 2012."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Contract Type: Firm-Fixed, Period of Performance: 12 month Base Year Plus 4 Option Years; Planned award date 16 April 2010; Number of Awards: Single; Use of Commercial Procedures (FAR Part 12); Estimated value including all options $20,000,000.00."
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2010 Q3-Q4 activities will include the initiation of development of DSAID, with further developments in FY2011 and FY2012"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 7"
                    },
                    "ProjectTitle": {
                        "val": "Global Force Mgmt Data Initiative"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.396"
                        },
                        "CurrentYear": {
                            "val": "0.608"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Defense Manpower Data Center (DMDC) acts as the authoritative source for identity and personnel information for the DoD Net Centric Enterprise Computing vision of the Department of Defense’s Global Information Grid (GIG 2.0). Based on the DEERS identities, DMDC provides the key attribute service for the Department of Defense (DoD) Identity and Access Management (IdAM) Capability. The Enterprise Identity Attribute Service (EIAS) supports IdAM through the distribution of DoD person and personnel attributes to applications and services in a controlled, consistent, and secure manner to support ABAC decisions. The controlled, authoritative information provided via EIAS can be used to confirm an individual’s identity, affiliation to the DoD, clearance, pay grade\/rank, organization and occupation series for an authorization decision. A key attribute for decision makers is organization. The Global Force Management Data Initiative (GFM_DI) provides the unique organization identifier (OUID) in the EIAS payload. To meet the DoD demand for the OUID, DMDC working with J8 and the Service\/Agencies has to 1) establish the linkage between a person (EDI_PI) and the OUID, 2) provide the OUID attribute in the EIAS payload for access decisions, and 3) standardize the organizational attributes required to make access decisions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Global Force Mgmt Data Initiative (GFMDI)"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.396"
                                            },
                                            "Text": {
                                                "val": "Create a pilot to:\n• Establish a web service between DEERS and Component’s personnel Systems to support the EDIPI to SSN links\n• Facilitate Component’s ability to expose their Organizational Hierarchies for usage by the IdAM community\n• Provide web services to support development of an Enterprise organization attribute service for DoD which supports Secure Data Access"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.608"
                                            },
                                            "Text": {
                                                "val": "• Continue to establish a web service between DEERS and Component’s personnel Systems to support the EDIPI to SSN links\n• Continue to facilitate Component’s ability to expose their Organizational Hierarchies for usage by the IdAM community\n• Continue to standardize the web services to support an Enterprise organization attribute service for DoD which promotes Secure Data Access"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Existing contract vehicles in place\/GSA for COTS."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 8"
                    },
                    "ProjectTitle": {
                        "val": "NEO Tracking System"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.761"
                        },
                        "BudgetYearOne": {
                            "val": "0.759"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.759"
                        },
                        "BudgetYearTwo": {
                            "val": "0.629"
                        },
                        "BudgetYearThree": {
                            "val": "0.758"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Neo Tracking System (NTS) \/ Electronic Tracking Accountability System (ETAS) is a certified and accredited DoD automated system that accounts for, and sustains visibility of noncombatant evacuees during a NEO under the authority of DODD 1000.25, DoD Personnel Identity Protection (PIP) Program. NTS is currently being used in the USAFRICOM, USCENTCOM, USEUCOM, USSOUTHCOM, and USPACOM AORs. The ETAS component is the CONUS domestic version of NTS and is for use by USNORTHCOM during disasters in the CONUS whether natural, accidental, or acts of terrorism. The primary purpose of the NTS\/ETAS is to provide individual accountability of the evacuee by creating and maintaining a database of evacuees assembled during an evacuation operation and subsequently tracking the evacuees’ movement through the evacuation process."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NEO Tracking System (NTS)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.761"
                                            },
                                            "Text": {
                                                "val": "• Convert the NTS program to a mobile application package that can be run on tablets and smart phones\n• Streamline the distribution of NTS images, reducing not only the costs associated with the creation of an image, but also the time associated with receiving the image in the field"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.759"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.759"
                                            },
                                            "Text": {
                                                "val": "•Upgrade system software and hardware drivers for Windows 7, 64-bit compatibility\n•Continued hardware implementation\n•Automate distribution of system updates"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Existing contract vehicles in place\/GSA for COTS."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 9"
                    },
                    "ProjectTitle": {
                        "val": "Synchronized Pre-deployment & Operational Tracker Enterprise Suite"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.937"
                        },
                        "BudgetYearOne": {
                            "val": "2.937"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.937"
                        },
                        "BudgetYearTwo": {
                            "val": "1.926"
                        },
                        "BudgetYearThree": {
                            "val": "1.927"
                        },
                        "BudgetYearFour": {
                            "val": "1.932"
                        },
                        "BudgetYearFive": {
                            "val": "1.932"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Synchronized Pre-deployment and Operational Tracker Enterprise Suite (SPOT-ES) is the Department of Defense (DoD) system of record for accountability and visibility of contracts and contractor personnel authorized to operate in a contingency operation.  SPOT-ES provides web based tracking and visibility into contract services, personnel and equipment locations; provides a common operational picture for Combatant Commanders; enhances the analytical tools to accurately plan for the quantity of contracted support required for future contingency operations; and collects accurate data for the OMB-directed quarterly census of all contractors supporting contingency operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "The Synchronized Pre-deployment and Operational Tracker"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.937"
                                            },
                                            "Text": {
                                                "val": "• Continue to be the system of record for accountability and\nvisibility of contracts and contractor personnel in support of the CENTCOM\nArea of Responsibility and other contingencies around the world.  \n• Continue to provide the only DoS, DoD, and USAID sanctioned\nLetter of Authorization (LOA) which provides the Government Furnished\nServices to contractor personnel.  \n• Provide the information on contractor personnel supporting Iraq\nand Afghanistan to the Office of the Secretary of Defense for reports to\nCongress.\n• Provide the number of contractor personnel and contract\ncapability to Combatant Commands for operational planning purposes and to\naid in their decision making processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.937"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.937"
                                            },
                                            "Text": {
                                                "val": "• Continue to be the system of record for accountability and visibility of contracts and contractor personnel in support of the CENTCOM Area of Responsibility and other contingencies around the world.\n• Continue to provide the only DoS, DoD, and USAID sanctioned Letter of Authorization (LOA) which provides the Government Furnished Services to contractor personnel.\n• Provide the information on contractor personnel supporting Iraq and Afghanistan to the Office of the Secretary of Defense for reports to Congress.\n• Provide the number of contractor personnel and contract capability to Combatant Commands for operational planning purposes and to aid in their decision making processes."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}