{
    "id": "b9bc59ee218b73306dab5378c4066b8a40fd723a",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA1_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601101A"
        },
        "ProgramElementTitle": {
            "val": "In-House Laboratory Independent Research"
        },
        "R1LineItemNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.395"
            },
            "CurrentYear": {
                "val": "20.860"
            },
            "BudgetYearOne": {
                "val": "21.803"
            },
            "BudgetYearOneBase": {
                "val": "21.803"
            },
            "BudgetYearTwo": {
                "val": "21.202"
            },
            "BudgetYearThree": {
                "val": "21.549"
            },
            "BudgetYearFour": {
                "val": "21.834"
            },
            "BudgetYearFive": {
                "val": "22.236"
            }
        },
        "ProgramElementNote": {
            "val": "Not Applicable for this item"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) supports basic research at the Army laboratories through the In-House Laboratory Independent Research (ILIR) program.  Basic research lays the foundation for future developmental efforts by identifying fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge.  The ILIR program serves as a catalyst for major technology breakthroughs by providing laboratory directors flexibility in implementing novel research ideas, by nurturing promising young scientists and engineers, and is used to attract and retain top doctoral degreed scientists and engineers.  The ILIR program also provides a source of competitive funds for peer reviewed efforts at Army laboratories to stimulate high quality, innovative research with significant opportunity for payoff to Army warfighting capability.  \n\nThis PE supports ILIR at the Army Materiel Command's (AMC) six Research, Development, and Engineering Centers (Project 91A); at the six Medical Research and Materiel Command (MRMC) laboratories (Project 91C); at the Corps of Engineer's seven laboratories at the US Army Engineer Research, and Development Center (ERDC) (Project 91D); at the Army Research Institute for the Behavioral and Social Sciences (ARI) (Project 91E); and at the Space and Missile Defense Command (SMDC) Technical Center (Project F16).\n\nWork in the PE provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the AMC, Aberdeen Proving Grounds, MD, MRMC, Ft. Detrick, MD, the ERDC, Vicksburg, MS, the ARI, Arlington, VA, and the SMDC, Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.031"
                },
                "CurrentYear": {
                    "val": "20.860"
                },
                "BudgetYearOne": {
                    "val": "21.609"
                },
                "BudgetYearOneBase": {
                    "val": "21.609"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.395"
                },
                "CurrentYear": {
                    "val": "20.860"
                },
                "BudgetYearOne": {
                    "val": "21.803"
                },
                "BudgetYearOneBase": {
                    "val": "21.803"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.636"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.194"
                },
                "BudgetYearOneBase": {
                    "val": "0.194"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.146"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.490"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.194"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.194"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "91A"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-AMC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.620"
                        },
                        "CurrentYear": {
                            "val": "16.062"
                        },
                        "BudgetYearOne": {
                            "val": "17.504"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.504"
                        },
                        "BudgetYearTwo": {
                            "val": "16.847"
                        },
                        "BudgetYearThree": {
                            "val": "17.118"
                        },
                        "BudgetYearFour": {
                            "val": "17.320"
                        },
                        "BudgetYearFive": {
                            "val": "17.632"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds basic research within the Army Materiel Command's (AMC) Research, Development, and Engineering Centers and lays the foundation for future developmental efforts by identifying the fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Edgewood Chemical and Biological Center, Aberdeen Proving Grounds, MD within AMC, the Armaments Research, Development, and Engineering Center, Picatinny, NJ, the Tank and Automotive Research, Development, and Engineering Center, Warren, MI, the Natick Soldier Research, Development, and Engineering Center, Natick, MA, the Aviation and Missile Research, Development, and Engineering Center, Huntsville, AL, and the Communications and Electronics Research, Development, and Engineering Center, Ft. Monmouth, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Edgewood Chemical Biological Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in chemistry, biology, biotechnology, and aerosol for counter improvised explosive devices (IEDs), obscurants, and\/or target defeat."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.833"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued basic research efforts in the areas of rational molecular and nano-system design for the design of functional abiotic structures, reconfigurable self-organizing systems, novel nanoparticles and supramolecular self-assembly;   Continued investigations in synthetic biology using new molecular programming techniques for creating biofuels and materials; continued fundamental research in surface science in PE 0601102A, Project VR9, Surface Science Research."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.956"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to solicit on a yearly basis new efforts to further basic research in areas such as advanced materials and nanotechnologies, more powerful energetics including those with insensitive munitions (IM) properties, counter terrorism technologies, power and energy systems, smaller more lethal warheads and composite materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.968"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.968"
                                            },
                                            "Text": {
                                                "val": "Will conduct fundamental research to develop an understanding of rational molecular and nano-system design, synthetic biology, nano-scale chemical and biological sensing and signaling, molecular toxicology, interfacial phenomena of particulate matter (solid\/liquid) with chemical surfaces, and synthesis of new materials for protection, decontamination, and detection, as well as research the mathematics involved in data processing and interpretation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armaments Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in weapons component development, explosives synthesis\/detection and area denial."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.673"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Solicitied new efforts to further basic research in areas such as advanced materials and nanotechnologies, more powerful energetics including those with IM properties, counter terrorism technologies, power and energy systems, smaller more lethal warheads and composite materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.682"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to solicit on a yearly basis new efforts to further basic research in areas such as advanced materials and nanotechnologies, more powerful energetic including those with IM properties, counter terrorism technologies, power and energy systems, smaller more lethal warheads and composite materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.707"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.707"
                                            },
                                            "Text": {
                                                "val": "Will continue to solicit on a yearly basis new efforts to further basic research in areas such as advanced materials and nanotechnologies, more powerful energetics including those with insensitive munition (IM) properties, counter terrorism technologies, power and energy systems, smaller more lethal warheads and composite materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tank-Automotive Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in ground vehicle technologies to include power, mobility, and unmanned systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.202"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and investigated models for nanofluid coolants and lubricants; developed and investigate durability and blast models for composite materials, including carbon nanotube reinforced composite; and developed algorithms for bio-inspired object recognition for unmanned systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.199"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to research models for nanofluid coolants and lubricants. Rresearch functionally graded structures exposed to shock, will investigate statistical theories and algorithms for reliability based design optimization.   Rresearch the combustion properties of JP-8, diesel and other fuels."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.220"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.220"
                                            },
                                            "Text": {
                                                "val": "Will research novel nanofluid coolants and lubricants; investigate statistical theories and algorithms for multi-disciplinary design optimization; research the combustion properties of new fuels; explore novel on-chip microwave nonreciprocal devices; research manned\/unmanned teaming and cooperative mobility behaviors; and study electromagnetic wave reflection from nano-structured non-reciprocal metamaterials for non-reflective, cloak-type coatings."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Natick Soldier Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in food sciences, textiles, and lightweight materials with potential for individual protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.358"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Created zwitterionic 3-dimensional nanofibrous architectures for antifouling and food pathogen sensing; conducted fundamental studies on novel metal oxides for tuned optical response; and explored understanding of the lysis mechanisms of peptides for antimicrobial protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.321"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop novel biochemical functionalization strategies to tether bio-recognition elements and antibodies onto graphene;  investigate covalent and non-covalent methods for attachment of antibodies to native graphene; will measure physical and transport properties as well as demonstrate a functionalized graphene FET for analyte detection to identify visual information derived from the movements of individuals in crowds that specifies threatening or suspicious behaviors;  validate experimental paradigms;  conduct experiments to refine the use of immersive virtual reality technologies for use with Soldier-volunteers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.341"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.341"
                                            },
                                            "Text": {
                                                "val": "Will explore the unique physics of photonic nanomaterials for revolutionizing the performance and size of systems such as IR detectors, power generation and remote imaging; continue to explore the relationship between peptide structure on tailored structures for controlling and optimizing the destructive efficacy of antimicrobial peptides for multiple applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Missile Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in guided missile and rocket systems, directed energy weapons, unmanned vehicles, and related components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.237"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Solicited new concepts for basic research efforts with broad applicability to science and technology that support exploratory and advanced development for guided missile and rocket systems, directed energy weapons, unmanned vehicles, and related components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.241"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experimentally explore infrared emissivity \/ absorptivity enhancement of polar materials by surface phonon coupling;  analyze nonlinear effects in nanostructure devices;  experimentally investigate excitation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.273"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.273"
                                            },
                                            "Text": {
                                                "val": "Will investigate paucity of attractors phenomenon in dynamical systems; develop theory of harmonic generation and Raman scattering from surfaces in nano-cavity environments; study optical propagation phenomena in the plasmonic regime in semiconductor and metal-based nanostructures and metamaterials; explore remote sensing of trace gases in the atmosphere using infrared\/terahertz double resonance active interrogation; assess enhancement of infrared emissivity\/absorptivity of polar materials near optical phonon resonances by surface phonon coupling and metamaterial effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Aviation Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for aviation enabling technologies in the areas of aerodynamics, structural dynamics, and material science."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.621"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated inflow dynamics and wake physics at high advance ratios and investigated dielectric barrier discharge plasma devices for reduced bluff body drag."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.623"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete initial testing on trailed wake vorticity and spanwise loading;  complete Particle Image Velocimetry (PIV) data analysis for dynamic stall test case; and  complete project on high advance ratio theory including all reporting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.647"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.647"
                                            },
                                            "Text": {
                                                "val": "Will continue basic aerodynamic science research in the areas of vorticity dynamics, compressible dynamic stall, bluff body flow separation and flow physics; and will investigate advanced boundary layer flow control phenomenon including fluidic oscillators and plasma devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications-Electronics Research, Development, and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for communication and network enabling technologies in the areas of antenna design, network management, power generation and storage, and also sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.475"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed research for developing cognitive algorithm and intelligent cognitive network with optimized managed resources, and flexible and reconfigurable radio frequency (RF) technologies; explored RF interaction of nano-tubes and metamaterial for wideband signal amplification and also electromagnetic radiation;  explored control theory in addressing the uncertainty and latency in the cognitive ad-hoc network;  performed research on sensor network scenarios that can perform blind signal sensing and classification of weak signals;  investigated alternative separator and electrolytes for high energy\/power electrochemical couples;  concentrated on reducing the parasitic (non-electrochemical) reactions between synthesized separator and electrolyte and high energy electrode components; and  investigated new metallic polymers for next generation infrared sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.485"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform research in III-V component detector materials,  advanced non-contact biometrics, nano engineered methods for explosive detection, and novel semiconductor growth processes and process monitoring;  investigate novel electromagnetic polymer nanocomposites to gain a fundamental understanding of the underlying physics for potential antenna applications;  continue investigations into alternative separator and electrolytes for high energy\/power electrochemical couples by concentrating on reducing the parasitic (non-electrochemical) reactions between synthesized separator and electrolyte and high energy electrode components and  initiate research into halogenated mixed metal oxides cathode material for advanced lithium electrochemical systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.509"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.509"
                                            },
                                            "Text": {
                                                "val": "Will conduct research into signals exploitation techniques by investigating algorithms for intelligently and rapidly searching wide bands of RF spectrum for short duration signals by mathematically representing the shape of a specific RF signals; Will research new algorithms based on mathematical models and new routing schemes for scalable and secure mobile ad hoc network (MANET)-based Real-Time Peer-to-Peer (P2P) Voice-over-IP (VoIP)\/Multimedia Network; Will synthesize and evaluate high energy cathode materials for application to electrochemical capacitors for increased energy density and longer cycle life; Will investigate the feasibility of real-time, in-vacuo band edge thermometry for heteroepitaxy of II-VI thin films on semiconductor substrates for advanced IR detectors. Will research the synthesis of dense Bismuth Selenide thin films, maximizing the material properties of conduction on the surface and insulating properties in the bulk, for use in RF front end electronics.  Initiate research in Cyber Protection and Attack."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Peer Reviewed Proposal Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds peer reviewed proposals in basic research to provide increased quality and responsiveness in exploring new technological concepts that are highly relevant to Army needs. This funding also enhances recruitment, development, and retention of outstanding scientists and engineers engaged in high quality basic research for the Army, which provides a constant flow of new knowledge to Army laboratories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.221"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted basic research efforts aimed at developing and maintaining a cadre of active research scientists who can distill and extend results from worldwide research in areas of interest to the Army."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.555"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Solicit new basic research efforts aimed at developing and maintaining a cadre of active research scientists who can distill and extend results from worldwide research in areas of interest to the Army."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.839"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.839"
                                            },
                                            "Text": {
                                                "val": "Will solicit new basic research proposals aimed at developing and maintaining a cadre of active research scientists who can distill and extend results from worldwide research in areas of interest to the Army."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "91C"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-Med R&D Cmd"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.575"
                        },
                        "CurrentYear": {
                            "val": "2.839"
                        },
                        "BudgetYearOne": {
                            "val": "2.886"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.886"
                        },
                        "BudgetYearTwo": {
                            "val": "2.935"
                        },
                        "BudgetYearThree": {
                            "val": "2.984"
                        },
                        "BudgetYearFour": {
                            "val": "3.032"
                        },
                        "BudgetYearFive": {
                            "val": "3.087"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project fosters investigator-driven medical and force-health protection basic research initiatives performed at the six U.S. Army Medical Research and Materiel Command laboratories. Research areas address countermeasures against infectious diseases, defense against environmental extremes and operational hazards to health, mechanisms of combat trauma and innovative treatment and surgical procedures, and medical chemical\/biological warfare threats.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Walter Reed Army Institute of Research, Silver Spring, MD; U.S. Army Medical Research Institute of Chemical Defense, Aberdeen Proving Ground, MD; US Army Medical Research Institute of Infectious Diseases, Fort Detrick, MD; U.S. Army Institute of Environmental Medicine, Natick, MA; U.S. Army Institute of Surgical Research, Fort Sam Houston, TX; U.S. Aeromedical Research Laboratory, Fort Rucker, AL; and the Telemedicine and Advanced Technology Research Center, Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Independent Research Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in medical and force health protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.575"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated an in vitro (outside of animal\/in test tube) and in vivo (in animal) model systems to examine nutritional countermeasures for enhanced neuroprotection and stress resilience; Studied the evolution of RNA genome viruses under immune system selective pressure to improve vaccine design: Theory, modeling, and validation; Investigated the use of recombinant reovirus particles as environmentally stable oral vaccine vectors against bioweapon threat agents; Enhanced understanding the role of the Sap proteins (particular type of proteinase protein) in disease causing capability of microorganisms (pathogenesis); Investigated genetic determinants which contribute to the intracellular survival and replication of Burkholderia pseudomallei (a gram negative bacterium often associated with infections); Evaluated the basic science of filovirus (includes Ebola and Marburg viruses which cause serious often fatal hemorrhagic disease) neutralization and peptide entry inhibitors (proteins which inhibit infection;  Investigate genetic determinants which contribute to the intracellular survival and replication of Burkholderia pseudomallei (a gram negative bacterium often associated with infections); Evaluate the basic science of filovirus (includes Ebola and Marburg viruses which cause serious often fatal hemorrhagic disease)\nneutralization and peptide entry inhibitors (proteins which inhibit infection; Study an in vitro screening model for evaluating the efficacy of potential therapeutics for chemical warfare agent-induced airway epithelial cell damage and edema."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The program funds innovative in-house basic research proposals that focus on research to explore treatments and countermeasures against militarily relevant infectious diseases; defense against environmental extremes and operational hazards to health; mechanisms of combat trauma and innovative treatment and surgical procedures; and medical chemical\/biological warfare threats. Examples of research efforts are as follows: Host and Wound Adaptations in Acinetobacter baumannii (a highly infectious bacteria) - this research enables novel methods to detect pathogens (germs) in the operating environment and predict their capacity to colonize or contaminate wounds in Soldiers and contaminate equipment to reduce infection with aggressive and drug resistant pathogens; explore the psychology of fear conditioning and learning to combat stimuli, to better understand psychopathology (causes of abnormal psychology) associated with combat experience; develop rodent models to study stress effects on brain cells, and use those models to identify nutritional measures conferring neuroprotection (brain protection) and resilience."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.886"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.886"
                                            },
                                            "Text": {
                                                "val": "The program will fund innovative in-house basic research proposals that will focus on research to explore treatments and countermeasures against militarily relevant infectious diseases; defense against environmental extremes and operational hazards to health; mechanisms of combat trauma and innovative treatment and surgical procedures; and medical chemical\/biological warfare threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "91D"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-Corps Of Engr"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.495"
                        },
                        "CurrentYear": {
                            "val": "1.073"
                        },
                        "BudgetYearOne": {
                            "val": "0.587"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.587"
                        },
                        "BudgetYearTwo": {
                            "val": "0.597"
                        },
                        "BudgetYearThree": {
                            "val": "0.608"
                        },
                        "BudgetYearFour": {
                            "val": "0.626"
                        },
                        "BudgetYearFive": {
                            "val": "0.646"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds In-house Laboratory Independent Research (ILIR) in the areas of geospatial research and engineering, military engineering, and environmental quality\/installations at the seven laboratories within the Corps of Engineer's US Army Engineer Research and Development Center (ERDC).    \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army ERDC, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Geospatial Research and Engineering\/Military Engineering\/Environmental Quality and Installations"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in the areas of geospatial research and military engineering as well as environmental quality and installations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.495"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed basic research efforts for ultra-compact soils for soil mechanics systems; investigated vegetation photopigment decay for remote sensing of hazardous materials; and investigated DNA pattern formation upon non-directed assembly at a functionalized surface for Army relevant compounds."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.073"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Create a numerical physics-based model of dynamic geologic-material contact behavior with buried sensors; create a methodology to rapidly characterize the near-ground atmospheric and instantaneous sound field between sensor nodes for a large region; compare experimental ground-penetrating radar data with models of the Maxwell Wagner process to understand if Maxwell Wagner processes are responsible for the variety of dielectric constants that appear in any soil at any water content."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.587"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.587"
                                            },
                                            "Text": {
                                                "val": "Will quantify the fundamental coupling effects and transfer functions of fiber optic cable sensors inside of protective conduit within realistic and variable geologic media; determine parameters and build physics-based seismic propagation models for fiber, conduit, and geomaterial interaction."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "91E"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-ARI"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.153"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides funding for In-house Laboratory Independent Research (ILIR) in the Army Research Institute for Behavioral and Social Sciences (ARI). This project supports basic research in the Cognitive Sciences and is focused on theories, approaches, and models from the Behavioral and Social Sciences that have the highest potential to improve human performance.   Improved recruiting, selection, assignment, training, leader development, performance, performance assessment, organizational dynamics, and retention are the goals. \n\nWork in this project is performed by the Army Research Institute, Arlington, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Research Institute"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in cognitive, behavioral, and social sciences to improve Soldier recruiting, assignment and retention and providing fundamental knowledge for human performance and organizational behavioral research."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.153"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research focused on topics such as improving classification & assignment mechanisms (right person, right job, right time), identifying innovative metrics for leader and teams performance, as well as contributing empirically based knowledge for human performance and behavioral research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F16"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-SMDC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.705"
                        },
                        "CurrentYear": {
                            "val": "0.733"
                        },
                        "BudgetYearOne": {
                            "val": "0.826"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.826"
                        },
                        "BudgetYearTwo": {
                            "val": "0.823"
                        },
                        "BudgetYearThree": {
                            "val": "0.839"
                        },
                        "BudgetYearFour": {
                            "val": "0.856"
                        },
                        "BudgetYearFive": {
                            "val": "0.871"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides In-house Laboratory Independent Research (ILIR) at the Space and Missile Defense Command (SMDC) Technical Center.  This basic research on lasers and directed energy lays the foundation for future developmental efforts on high energy lasers and directed energy systems by identifying the fundamental principles governing various directed energy phenomena.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army SMDC\/ARSTRAT, Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SMDC In-house Laboratory Independent Research (ILIR)"
                                    },
                                    "Description": {
                                        "val": "Funds basic research to investigate laser propagation phenomenology for application in modeling and simulation and future directed energy weapons design."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.705"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted modeling and simulation studies and experiments for new laser technology and beam propagation concepts to enable understanding of next generation high energy laser systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.733"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct laser beam propagation experiments and spectroscopic research to improve modeling and simulation capabilities and improve high energy laser systems design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.826"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.826"
                                            },
                                            "Text": {
                                                "val": "Will complete laser beam propagation experiments and provide data for model anchoring.  Will continue spectroscopic research and improve modeling and simulation capabilities and begin design for flowing rare earth laser."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}