{
    "id": "bbc9eca6dec746f7c4ed1a91ed562d371ee574bf",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA7_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0303141A"
        },
        "ProgramElementTitle": {
            "val": "Global Combat Support System"
        },
        "R1LineItemNumber": {
            "val": "175"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "140.017"
            },
            "CurrentYear": {
                "val": "120.927"
            },
            "BudgetYearOne": {
                "val": "41.225"
            },
            "BudgetYearOneBase": {
                "val": "41.225"
            },
            "BudgetYearTwo": {
                "val": "5.640"
            },
            "BudgetYearThree": {
                "val": "3.390"
            },
            "BudgetYearFour": {
                "val": "2.540"
            },
            "BudgetYearFive": {
                "val": "0.315"
            }
        },
        "ProgramElementNote": {
            "val": "The FY 2014 funding increase allows GCSS-Army to make large changes to the ERP environment immediately after testing and deployments. The increase also enables the Program to fix critical deficiencies in the system once system is deployed."
        },
        "ProgramElementMissionDescription": {
            "val": "The Global Combat Support System-Army (GCSS-Army) program has two components: a functional component titled GCSS-Army and a technology enabler component titled Army Enterprise Systems Integration Program (AESIP) (formerly Product Lifecycle Management Plus (PLM+)).  GCSS-Army coupled with AESIP are information and communications technology investments that will provide key enabling support to the transformation of the Army into a network-centric, knowledge-based future force.  The GCSS-Army approved Joint Capability Description Document (CDD) requires an enterprise approach to replace current logistics and maintenance Standard Army Management Information Systems (STAMIS). GCSS-Army will provide the Army's Sustainment Support for the warfighter with a seamless flow of timely, accurate, accessible and secure information management that gives combat forces a decisive edge. AESIP will provide the system's enterprise hub services, centralized master data management and cross-functional business intelligence\/analytics.  GCSS-Army will implement best business practices to streamline supply, accountability, maintenance, distribution, and reporting procedures in support of the future force transition path of the Army Campaign Plan."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "160.491"
                },
                "CurrentYear": {
                    "val": "120.927"
                },
                "BudgetYearOne": {
                    "val": "23.475"
                },
                "BudgetYearOneBase": {
                    "val": "23.475"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "140.017"
                },
                "CurrentYear": {
                    "val": "120.927"
                },
                "BudgetYearOne": {
                    "val": "41.225"
                },
                "BudgetYearOneBase": {
                    "val": "41.225"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-20.474"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "17.750"
                },
                "BudgetYearOneBase": {
                    "val": "17.750"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-20.474"
                                },
                                "BudgetYearOne": {
                                    "val": "17.750"
                                },
                                "BudgetYearOneBase": {
                                    "val": "17.750"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "083"
                    },
                    "ProjectTitle": {
                        "val": "Global Combat Support Sys - Army"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "90.040"
                        },
                        "CurrentYear": {
                            "val": "96.596"
                        },
                        "BudgetYearOne": {
                            "val": "22.615"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.615"
                        },
                        "BudgetYearTwo": {
                            "val": "2.070"
                        },
                        "BudgetYearThree": {
                            "val": "1.680"
                        },
                        "BudgetYearFour": {
                            "val": "1.620"
                        },
                        "BudgetYearFive": {
                            "val": "0.315"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Global Combat Support System-Army will provide the Army's Tactical warfighter with a seamless flow of timely, accurate, accessible, actionable, and secure information not readily available today that gives combat forces a decisive edge.  GCSS-Army will modernize automated logistics by implementing best business practices to streamline supply operations, maintenance operations, property accountability, and tactical logistics and financial management and integration procedures in support of the Future Force transition path of the Army Campaign Plan.  This effort will implement a comprehensive logistics automation solution for the field (deployable) and installation level Army and provide the Commander on the battlefield with an integrated, interoperable view of the battle-space in time to support decisions that will affect the outcome of combat operations.  Further, it will allow the Army to meet statutory requirements for auditability.  This solution implements Commercial-Off-The-Shelf (COTS) Enterprise Resource Planning (ERP) products from SAP AG.  This will also allow the Army to retire multiple custom designed stand-alone business software baselines optimized to existing Army business processes and replace them with a single integrated business software baseline that has been optimized to industry defined best business practices.  GCSS-Army is a key component of the Federated ERP Integration solution that will optimize tactical logistics and finance domain business processes into a single federated approach.  It will eliminate the need for extensive maintenance and modification of aging, diverse software systems resulting in improved and efficient change control and configuration management through implementation of an enterprise system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PM Operations"
                                    },
                                    "Description": {
                                        "val": "Provide functional support across a wide array of specialty areas to sustain product development and evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.725"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to provide functional support across a wide array of specialty areas to sustain product development and evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.021"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide functional support across a wide array of specialty areas to sustain product development, evaluation and begin fielding."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Production and Full Deployment Phase Contract Activity"
                                    },
                                    "Description": {
                                        "val": "Manage a myriad of Government contracts associated with work relating to acquisition, engineering, planning and integration activities supporting Global Combat Support System-Army (GCSS-Army).  These contracts support an evolutionary development strategy using Systems Applications & Products (SAP) products and architecture. The current efforts support the Milestone Decision Authority  federated approach.  It is also synchronized with the Army Enterprise Systems Integration Program (AESIP), the Logistics Modernization Program (LMP), and the General Fund Enterprise Business System (GFEBS) to enable end-to-end integration of the Army's logistical and financial Enterprise Resource Planning (ERP) programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "72.757"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Following the successful FY 2011 MS C decision, GCSS-Army began the plan, analyze and design phases for Release 1.2 which will continue throughout FY 2012.  The 1st Qtr FY 2012 plan included a successful Intial Operational Test and Evaluation (IOT&E) for Rel 1.1.Based on this success, the Program plannned to seek a Full Deployment Decision (FDD) for this capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "83.955"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "After a Lead Site Verification Test, the program will begin fielding Wave 1 of GCSS-Army. Work will continue on the design and build phases for Release 1.2. In the 1st Qtr FY 2013 the program successfully obtained FDD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.131"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.131"
                                            },
                                            "Text": {
                                                "val": "Release 1.2 will be completed and operationally assessed, the program will seek a Fielding Decision from MDA in 2nd Qtr FY 2014 to field Wave 2."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government System Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Plans, conducts and reports on developmental tests and assists in planning, conducting, and reporting of operational and interoperability tests, assessments, and experiments in order to provide essential information for the acquisition and fielding of warfighting systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.558"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Successfully completed IOT&E for GCSS-Army Rel 1.1. in 1st Qtr FY12 and JITC Testing"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.620"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct Lead Site Verification with ATEC in 1st Qtr FY 2013."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.484"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.484"
                                            },
                                            "Text": {
                                                "val": "Continue ATEC, OTC and JITC testing and evaluation focusing on testing of GCSS-Army Rel 1.2. Conduct Operational Assessment for release 1.2 in 1st Qtr FY 2014."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Single Army Logistic Enterprise OPA"
                                    },
                                    "Title": {
                                        "val": "GCSS-Army Other Procurement, Army STACOMP (OPA)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "83.651"
                                        },
                                        "CurrentYear": {
                                            "val": "110.158"
                                        },
                                        "BudgetYearOne": {
                                            "val": "115.736"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "115.736"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "135.524"
                                        },
                                        "BudgetYearThree": {
                                            "val": "139.280"
                                        },
                                        "BudgetYearFour": {
                                            "val": "130.907"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.700"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "GCSS-Army Sustainment"
                                    },
                                    "Title": {
                                        "val": "GCSS-Army Operations & Maintenance, Army (OMA)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "29.390"
                                        },
                                        "CurrentYear": {
                                            "val": "45.306"
                                        },
                                        "BudgetYearOne": {
                                            "val": "74.618"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "74.618"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "97.106"
                                        },
                                        "BudgetYearThree": {
                                            "val": "93.926"
                                        },
                                        "BudgetYearFour": {
                                            "val": "101.663"
                                        },
                                        "BudgetYearFive": {
                                            "val": "93.974"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "PM GCSS-Army Other Procurement, Army (OPA) and Operations & Maintenance, Army (OMA) funding supports acquisition, deployment, and implementation followed by the associated sustainment of GCSS-Army capabilities."
                        },
                        "AcquisitionStrategy": {
                            "val": "GCSS-Army has an evolutionary acquisition strategy as defined in DoD Directive 5000.01 and DoD Instruction 5000.02 and will define, develop and produce\/deploy an initial, militarily useful (and supportable) operational capability based upon proven technology, time-phased requirements, projected threat assessments, and demonstrated manufacturing capabilities in as short a time as possible.  The system will be developed in multiple releases as functional capabilities are defined and as integration and synchronization opportunities with related systems present opportunities for subsequent releases.  Release 1.2 will be a viable stand alone capability that will not require subsequent releases to be operational.  \n\nGCSS-Army is being implemented in three releases to ensure program success. \n\nRelease 1.0 replaces: Standard Army Retail Supply System (SARSS) at one Direct Support Unit (DSU) in the 11th Armored Cavalry Regiment (ACR), Fort Irwin, California. An Operational Assessment (OA) was conducted on Release 1.0 and information is gathered through Continuous Evaluation. \n\nRelease 1.1 includes: Supply (Tactical and Installation Warehouse and Materiel Management); Field-level and Installation Based Maintenance; Property Accountability (Property Book, Unit Level Supply, and Unit Basic Load Ammunition); Force Element and Defense Forces Public Security (Allows Task Organization of Personnel, Equipment and Associated Property Accountability, Maintenance and Finance Actions); Store and Forward capability; Interoperability with STAMIS systems; Tactical and Installation Finance (Cost Management, Funds Distribution and Execution, Fund Status Reporting, and General Fund Enterprise Business System (GFEBS) Data Synchronization); Hub services; and Enterprise Master Data Management. Release 1.1 provides over 80% of the required GCSS-Army capability; it subsumes Release 1.0 and replaces the SARSS, Property Book Unit Supply Enhanced (PBUSE), Standard Army Maintenance System - Enhanced (SAMS-E) and Standard Army Maintenance System Installation Enhanced (SAMS-IE) legacy systems. \n\nRelease 1.2 provides enhanced capabilities such as disconnected operations,increased financial capabilities, expanded enterprise master data management and is prepared to interface with an aviation maintenance system. Rel 1.2 does not by itself replace any additional Systems. Rel 1.2 represents the complete baseline with all required capabilities provided."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "1 .  PMO Operations - PM GCSS-Army PMO Operations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM GCSS-Army"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FT LEE"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "94.945"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.617"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.369"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "62.385"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "1. Enterprise Resource Planning (ERP) design and development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Information Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chester, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "302.954"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "68.685"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "82.809"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.131"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.131"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "453.329"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Developer Subject Matter Experts"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ASA (FM&C), CASCOM and GFEBS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.097"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.072"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.146"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "19.730"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "1. PM Support - Independent Verification and Validation (IV&V)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CAP Gemini"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "2250 Corporate Park Dr, Herndon, VA 20171"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.477"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.370"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.184"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "2.  PM Support - Program Management Support Services A"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Engility Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "3750 Centerview Drive Chantilly, VA 20151"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.213"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.694"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.479"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "25.580"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "3. PM Support - Program Management Support Services B"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Logistics Management Institue"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colonial Heights, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "27.068"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "11.044"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.989"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "34.531"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "1. Test and Evaluation -  Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AEC, ATEC, OTC and JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "30.100"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.558"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.620"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.484"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.484"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Lead Site Verification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 1.1 Full Deployment Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Field Wave 1 Release 1.1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 1.2 Fielding Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Field Wave 2 Release 1.2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "08A"
                    },
                    "ProjectTitle": {
                        "val": "Army Enterprise System Integration Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "49.977"
                        },
                        "CurrentYear": {
                            "val": "24.331"
                        },
                        "BudgetYearOne": {
                            "val": "18.610"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.610"
                        },
                        "BudgetYearTwo": {
                            "val": "3.570"
                        },
                        "BudgetYearThree": {
                            "val": "1.710"
                        },
                        "BudgetYearFour": {
                            "val": "0.920"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Army Enterprise Systems Integration Program (AESIP), mission is to integrate Army business processes by providing a single source for enterprise hub services, centralized master data management, and business intelligence and analytics.  AESIP will support the Army's federated approach and enable the integration of end-to-end logistical and financial processes. The Army has successfully addressed concerns about the lack of integration of ERPs by leveraging AESIP core capabilities and expanding those benefits across the Army enterprise. AESIP will be an Army specific commercial off-the-shelf (COTS) web portal implementation via the NetWeaver Platform from developer Systems Applications and Products (SAP) American Group to support Army process scenarios and requirements that will provide core competencies:\n\nEnterprise Service Bus (Hub Services) - For a Service oriented, Single Point of Entry to connect, mediate, and control the exchange of data.\nEnterprise Business Intelligence\/Business Warehouse - Aggregates data from ERP and non-ERP systems to provide flexible Enterprise level reporting.\nEnterprise Master Data Management - For a single source of authoritative data and improved workflow and business processes. \n\nHence, the AESIP solution establishes a framework for a fully integrated ERP centric environment that will ultimately provide Commanders Total Visibility from Factory to Foxhole thereby ensuring delivery of the right equipment to the right unit at the right time, while reducing backlogs of material on the battlefield."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System Development and Demonstration (SDD) Phase Contract Activity"
                                    },
                                    "Description": {
                                        "val": "Manage a myriad of Government contracts associated with work relating to acquisition, engineering, planning and integration activities supporting production and deployment.  These contracts support an evolutionary development strategy for enterprise hub services, centralized master data management and business intelligence\/business warehouse applications using Systems Applications & Products (SAP) products and architecture. The current efforts support the Milestone Decision Authority federated approach.  It is also synchronized with the Global Combat Support System-Army (GCSS-Army), the Logistics Modernization Program (LMP), and the General Fund Enterprise Business System (GFEBS) to enable end-to-end integration of the Army's logistical and financial Enterprise Resource Planning (ERP) programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.302"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to manage a myriad of Government contracts associated with work relating to acquisition, engineering, planning and integration activities supporting production and deployment. The focus of work planned for FY 2012 included designing, building and testing hub services and the material master (MM) interfaces required for GCSS-Army Rel 1.2 and complete MM release functionality and attain a Full Deployment Decision. FY 2012 work also included design, development, testing & implementation of MM 3.2 release to support the initial Army instance of an Enterprise non-standard material capability. Funding supported the initiation of convergence of the ERP programs IAW the federated approach.  The plan for application server hosting and enterprise service support remained unchanged at Redstone Arsenal and ALTESS respectively."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to manage a myriad of Small Business and Government contracts associated with work relating to acquisition, engineering, planning and integration activities supporting production and deployment. The focus of work planned for FY13 includes designing, building and testing hub services and the MM interfaces required for GCSS-Army Rel 1.2 and complete MM 3.3, 3.5 release functionality. Funding will continue to support the convergence of the ERP programs IAW the federated approach. The plan for application server hosting and enterprise disaster recovery support remains unchanged at Redstone Arsenal and ALTESS respectively."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Production & Full Deployment Phases Contract Activity"
                                    },
                                    "Description": {
                                        "val": "Manage a myriad of Government contracts associated with work relating to acquisition, engineering, planning and integration activities supporting Army Enterprise Systems Integration Program (AESIP).  These contracts support an evolutionary development strategy using Systems Applications & Products (SAP) products and architecture. The current efforts support the Milestone Decision Authority  federated approach.  It is also synchronized with the Global Combat Support System-Army (GCSS-Army), the Logistics Modernization Program (LMP), and the General Fund Enterprise Business System (GFEBS) to enable end-to-end integration of the Army's logistical and financial Enterprise Resource Planning (ERP) programs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.079"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.079"
                                            },
                                            "Text": {
                                                "val": "Funding is required for AESIP to address system enhancement requests from users, events in the development of other systems, and critical requirements from CASCOM or LOGSA during the GCSS-Army full fielding."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PM Operations"
                                    },
                                    "Description": {
                                        "val": "Provide functional support across a wide array of specialty areas to sustain product development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.898"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to provide functional support across a wide array of specialty areas to sustain product development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.990"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide functional support across a wide array of specialty areas to sustain product development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government System Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Plans, conducts and reports on developmental tests and assists in planning, conducting, and reporting of operational and interoperability tests, assessments, and experiments in order to provide essential information for the acquisition and fielding of warfighting systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.189"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued ATEC, OTC and JITC testing and evaluation of Enterprise Service Bus (Hub Services) products including but not limited to Business Intelligence\/Business Warehouse, Material Master Data and Equipment Master Data applications for full deployment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.190"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue ATEC, OTC and JITC testing and evaluation of Enterprise Service Bus (Hub Services) products including but not limited to Business Intelligence\/Business Warehouse, Material Master Data and Equipment Master Data applications for full deployment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.956"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.956"
                                            },
                                            "Text": {
                                                "val": "Continue developmental and operational (ATEC and JITC) testing and evaluation of AESIP Hub Services products.  These products include data brokering (interfaces and data conversion), enterprise master data management (material, customer, and vendor records), and enterprise business intelligence\/business warehouse capabilities. Additionally, AESIP will conduct continuous evaluation as mandated by ATEC in the Program's capstone TEMP as well as participation in test events such as Limited User Tests and Operational Assesments with various other trading partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Business Innovative Research\/Small Business Technology Transfer Programs"
                                    },
                                    "Description": {
                                        "val": "Small Business Innovative Research\/Small Business Technology Transfer Programs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.588"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to transition systems integration to small business firms through Source Selection Evaluation Boards (SSEB) to identify potential vendors and offer them fair opportunity competitions for TO Award."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.514"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to transition systems integration to small business firms through Source Selection Evaluation Boards (SSEB) to identify potential vendors and offer them fair opportunity competitions for TO Award."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.575"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.575"
                                            },
                                            "Text": {
                                                "val": "Continue to manage a myriad of Small Business contracts through the Government Lead System Integrator during the Production & Full Deployment Phases. Funding is required for AESIP to address system enhancement requests from users, events in the development of other systems, and critical requirements from CASCOM or LOGSA during the GCSS-Army full fielding."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Single Army Logistic Enterprise OPA"
                                    },
                                    "Title": {
                                        "val": "AESIP Other Procurement, Army (OPA)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.022"
                                        },
                                        "CurrentYear": {
                                            "val": "3.011"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.700"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.700"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.076"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.420"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.740"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "AESIP Sustainment"
                                    },
                                    "Title": {
                                        "val": "AESIP Operations & Maintenance Army (OMA)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.235"
                                        },
                                        "CurrentYear": {
                                            "val": "19.364"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.881"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.881"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "37.688"
                                        },
                                        "BudgetYearThree": {
                                            "val": "37.435"
                                        },
                                        "BudgetYearFour": {
                                            "val": "37.343"
                                        },
                                        "BudgetYearFive": {
                                            "val": "36.303"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "As the technical component of GCSS-Army, AESIP employs an evolutionary acquisition strategy as defined in DoD Directive 5000.1 and DoD Instruction 5000.2, and will define, develop and produce\/deploy an initial operational capability based upon proven technology, time-phased requirements, projected threat assessments, and demonstrated manufacturing capabilities in as short a time as possible.  The system will be developed in multiple releases then integrated and synchronized with related systems presenting opportunities for subsequent increments.  \n\nAESIP will support the same Release 1.1 and 1.2 schedules of GCSS-Army by providing Enterprise Service Bus (Hub Services), Enterprise Master Data Management, and Enterprise Business Intelligence\/Business Warehouse capabilities in support of the entire GCSS-Army program to include various other trading partners namely; Logistics Modernization program (LMP), General Fund Enterprise Business System (GFEBS) and Logistics Support Agency (LOGSA)."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "1 .  PMO Operations - PM AESIP PMO Operations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM AESIP"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "5911 Kingstowne Village Pkwy, Alexandria VA  22315"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.740"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.589"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.761"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "1.  Enterprise Resource Planning (ERP) Implementation Systems Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Computer Sciences Corporation (CSC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "3160 Fairview Park Drive, Falls Church, VA 22042"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "118.445"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "111.902"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "2. Enterprise Resource Planning (ERP) Implementation - Technical Support Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "7615 Colshire Drive, McLean, VA 22102"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.363"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.457"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.359"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "3.  Enterprise Resource Planning (ERP) - Government Lead Systems Integrator"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "US Army ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny Arsenal NJ 08706"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "34.577"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.844"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.179"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "4.  Enterprise Resource Planning (ERP) - Technical Support Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Systems Applications and Services (SAP)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "1300 Pennsylvania Ave, Washington DC 20004"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.009"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.453"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.664"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.079"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.079"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "5.  Enterprise Resource Planning (ERP) - ERP\/SAP Technical and Management Support Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "iLuMina Solution Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "23330 Cottonwood, California MD 20619"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.430"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.548"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.435"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "6. Enterprise Resource Planning (ERP) - Enterprise Application Services A"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Attain, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "8000 Towers Crescent Dr., Vienna VA 22182"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.214"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.782"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.935"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "7. Enterprise Resource Planning (ERP) - Enterprise Application Services B"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Insap Services Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "12000 Lincoln Dr. Marlton, NJ 08053"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.010"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.010"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "8. Enterprise Resource Planning (ERP) - Enterprise Application Services C"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oakland Consulting Group Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "9501 Sheridan Lanham MD 20706"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.821"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.806"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.470"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise Resource Planning (ERP) - Enterprise Application Services D"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "14.575"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "14.575"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.575"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "9.  Enterprise Resource Planning (ERP) - Enterprise Integration Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EDC Consulting LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "1104 Good Hope Rd SE Washington DC 20020"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.364"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.050"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "10. Enterprise Resource Planning (ERP) - Infrastructure Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.050"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "1.  PM Support - Program Management Support Services  A"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L3 Services Inc. (MPRI Division)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "1320 Braddock PL, Alexandria, 22314"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.846"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.094"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "2. PM Support - Program Management Support Services  B"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "LMI Government Consulting"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "2000 Corporate Ridge, McLean, VA 22102"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.477"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.847"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.884"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "3.  PM Support -  Program Management Support Services C"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Science Applications Internation Corporation (SAIC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "1710 SAIC Dr., McLean, VA 22102"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.366"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.654"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "4. PM Support - Indepent Verification and Validation (IV&V)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CAP Gemini"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "2250 Corporate Park Dr, Herndon, VA 20171"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.046"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.462"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.596"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "1. Test and Evaluation -  Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AEC, ATEC, OTC and JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.907"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.189"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.190"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.956"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.956"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "MM Release 3.3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MM Release 3.4"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MM Release 3.5"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GCSS-Army Release 1.1 - Full Deployment Decision (FDD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GCSS-Army Release 1.1 - Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}