{
    "id": "bfc2986f145894b076c574fb61a63d36910fd3c9",
    "meta": {
        "filename": "dod-2014_RDTE_2014_DTRA_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2014.zzz_unzipped_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602718BR"
        },
        "ProgramElementTitle": {
            "val": "WMD Defeat Technologies"
        },
        "R1LineItemNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "197.984"
            },
            "PriorYear": {
                "val": "193.189"
            },
            "CurrentYear": {
                "val": "172.352"
            },
            "BudgetYearOne": {
                "val": "175.282"
            },
            "BudgetYearOneBase": {
                "val": "175.282"
            },
            "BudgetYearTwo": {
                "val": "178.437"
            },
            "BudgetYearThree": {
                "val": "181.649"
            },
            "BudgetYearFour": {
                "val": "184.919"
            },
            "BudgetYearFive": {
                "val": "188.247"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "*RA Project title change from Systems Engineering and Innovation starting in FY 2014\n*RF Project title change from Detection Technology starting in FY 2014 \n*RG Project title change from Advanced Energetics & Counter WMD Weapons starting in FY 2014\n*RM Project title change from Battle Management starting in FY 2014"
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Defense Threat Reduction Agency (DTRA) is to safeguard America and its allies from Weapons of Mass Destruction (WMD) by reducing the present threat and preparing for the future threat.  This mission directly reflects several national and Department of Defense level guidance\/vision documents to include the National Security Strategy, Unified Command Plan, National Strategy to Combat WMD, Counterproliferation Interdiction, National Strategy for Combating Terrorism, National Military Strategy, Global Development of Forces, Global Employment of Forces, National Military Strategy for Combating WMD, National Military Strategic Plan for the War on Terrorism, Joint Strategic Capabilities Plan (including the Nuclear Annex), and Nuclear Posture Review.  To achieve this mission, DTRA has identified principal objectives along with strategies and tasks to ensure the objectives are met.  Three of these objectives are to deter the use of WMD, reduce the present threat, and to prepare for the future threat.  A focused and strong threat reduction technology base is critical to achieving these objectives and is closely tied with the operational support programs that make up its combat support mission.  DTRA has taken the steps to develop this technology base and provide a foundation for transformational activities within the WMD arena.\n\nActivities funded by Program Element 0602718BR implement a wide set of National Security Presidential Directive (NSPD) 17 and emerging Presidential Policy Directive (PPD) guidance for prevention of proliferation of WMD and WMD terrorism.  Projects support strengthening nonproliferation, through the development of the Arms Control Enterprise System (ACES) and development of Arms Control inspection training and operational capabilities.  Through development of new sensor systems, sensor networks, counterforce and fundamental CWMD research, these programs contribute to securing and interdicting WMD, WMD delivery systems and related materials.  Finally, programs in this area fund development and operation of the STRATCOM-DTRA SCC-WMD Technical Reachback center, which supports all GCC, US and Allied Forces, and civil authorities with 24\/7 analysis support, enabling force and civilian population protection against WMD attack.\n\nThe DTRA’s WMD Defeat Technologies program element also supports the National Strategy for Countering Biological Threats priorities. The strategy spells out four focus areas:  1) Promote global health security efforts through building and improving international capabilities to prevent, detect, and respond to infectious disease threats, whether caused by natural, accidental, or deliberate events, 2) Establish and reinforce norms against the misuse of the life sciences, 3) Expand our capability to prevent, attribute, and apprehend those engaged in biological weapons proliferation or terrorism, with a focus on facilitating data sharing and knowledge discovery to improve integrated capabilities (Capability Expansion), and 4) Leverage science, technology, and innovation through domestic and international partnerships and agreements to improve global capabilities to respond to and recover from biological incidents (Leveraging Science).   There are two of the four focus areas (3 and 4) supported in this program element under projects RA-Information Science and Applications, RL-Nuclear & Radiological Effects, RM-WMD Counterforce Technologies, and RR-Test Infrastructure.  Details are provided in the R-2a exhibits.\n\nProject RA (Information Science and Application) develops innovative technologies and modeling and simulation (M&S) capabilities and provides Technical Reachback support to create decision advantage for the U.S. and our Allies through improved situational understanding across the complete CWMD mission space.\n\nProject RE (Counter-Terrorism Technologies) provides research and development support to Joint U.S. Military Forces, specifically U.S. Special Operations Command (USSOCOM), in the areas of Explosive Ordnance Disposal Device Defeat; counter-WMD technologies for warfighters; the USSOCOM Combating Weapons of Mass Destruction – Terrorism Support Program (SCSP); and oversight of counterproliferation (CP) research and development resources sent directly to USSOCOM for warfighter-unique CP technologies.  \n\nProject RF (Detection and Forensics Technologies) develops technologies, systems and procedures for post detonation nuclear forensics, and to detect, identify, track, tag, locate, monitor and interdict strategic and improvised nuclear and radiological weapons, components, materials, or infrastructure in support of Department of Defense (DoD) requirements for combating terrorism, counterproliferation and nonproliferation, homeland defense, and international initiatives and agreements.  \n\nProject RG (Defeat Technologies) develops advanced technologies and weapon concepts and validates their applicability as counter WMD weapon systems.\n\nProject RI (Nuclear Survivability) provides the capability for DoD nuclear forces and their associated control and support systems and facilities in wartime to avoid, repel, or withstand attack or other hostile action, to the extent that essential functions can continue or be resumed after the onset of hostile action.  \n\nProject RL (Nuclear & Radiological Effects) develops nuclear and radiological assessment modeling tools to support military operational planning, weapon effects predictions, and strategic system design decisions.  \n\nProject RM (WMD Counterforce Technologies) provides (1) full-scale testing of counter WMD weapon effects, sensor performance, and weapon delivery optimization, (2) weapon effects modeling, and (3) the DTRA Experimentation Lab.  \n   \nProject RR (Test Infrastructure) provides a unique national test bed capability for simulated WMD facility characterization, weapon-target interaction, and WMD facility defeat testing to respond to operational needs by developing and maintaining test beds used by the DoD, the Services, the Combatant Commanders and other federal agencies to evaluate the implications of WMD, conventional, and other special weapon use against U.S. military or civilian systems and targets. \n\nProject RU (Fundamental Research for Combating WMD) provides (1) strategic studies to support DoD, (2) decision support tools and analysis to support combating WMD research and development investments, and (3) early applied research for technology development."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "196.083"
                },
                "CurrentYear": {
                    "val": "172.352"
                },
                "BudgetYearOne": {
                    "val": "170.483"
                },
                "BudgetYearOneBase": {
                    "val": "170.483"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "193.189"
                },
                "CurrentYear": {
                    "val": "172.352"
                },
                "BudgetYearOne": {
                    "val": "175.282"
                },
                "BudgetYearOneBase": {
                    "val": "175.282"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.894"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.799"
                },
                "BudgetYearOneBase": {
                    "val": "4.799"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.894"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.199"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.199"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Programmatic - Fiscal Guidance"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.600"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.600"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease from the previous President’s Budget submission in FY 2012 is due to the internal SBIR transfer.  The increase in FY 2014 from the previous President’s Budget submission is predominately due to increased investment in the areas of RG-Defeat Technologies, RI-Nuclear Survivability, RL-Nuclear and Radiological Effects, and RR-Test Infrastructure."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RA"
                    },
                    "ProjectTitle": {
                        "val": "Information Science and Applications"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "44.923"
                        },
                        "PriorYear": {
                            "val": "42.279"
                        },
                        "CurrentYear": {
                            "val": "33.396"
                        },
                        "BudgetYearOne": {
                            "val": "31.263"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.263"
                        },
                        "BudgetYearTwo": {
                            "val": "32.901"
                        },
                        "BudgetYearThree": {
                            "val": "31.870"
                        },
                        "BudgetYearFour": {
                            "val": "33.852"
                        },
                        "BudgetYearFive": {
                            "val": "34.505"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "*RA Project title change from Systems Engineering and Innovation starting in FY 2014"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Information Science and Applications project provides (1) systems engineering and analysis support across all other projects, (2) innovative counterproliferation research and development, and (3) technical advisory reachback support on Weapons of Mass Destruction (WMD) effects and consequences.   The systems engineering effort provides research and development with requirements, technology, architecture analyses and proof-of-principle capability necessary for making decisions on strategic planning, research and development investments, new initiatives, cooperation, ventures with new customers, and accomplishment of high-level, short notice special projects.  It also conducts the development, validation and fielding of the Arms Control Enterprise System (ACES) as a part of the U.S. commitment under arms control treaties.  The innovative counterproliferation effort conducts research and development to investigate, identify, develop and transition short term, high payoff technologies from Defense Threat Reduction Agency (DTRA), other government agencies, industry, academia and international Science and Technology partners into the respective DTRA and other research and development programs and to end user organizations.  The technical reachback effort provides 24 hour\/7 days per week information and analyses on potential impacts of a WMD event to Warfighters and First Responders in consult with DTRA’s Combating WMD Research and Development subject matter experts.  This project also provides support to international Counter-WMD science and technology cooperation by developing modifications, improvements, or new technologies and information tools suitable for foreign release and cooperative efforts.\n\nProgram RA supports the National Strategy for Countering Biological Threat priority\/focus area 3) Capability Expansion and 4) Leveraging Science.  DTRA’s integration of the Chemical-Biological Simulation Suite into the Chemical, Biological, Radiological, Nuclear, and High-yield Explosives (CBRNE) Tactical Training System (CTTS) toolset to represent the threat delivery, hazard environment, and real-time sensors will be utilized for training and passive defense within the battlespace.  Particularly in support of Leveraging Science, DTRA continues comprehensive information exchanges with Chief of Science and Technology (S&T) Offices across various agencies responsible for countering biological threats in response to SecDef S&T Priorities Memorandum.   This program also targets development of a common picture of biological threats, clarification of lead on specific counter bio mission areas, and collaboration on common technology development.  \n\t\nThe decrease from FY 2012 to FY 2013 is predominantly due to reduced investment in systems engineering collaboration with external partners and customers and the slowing development and fielding of innovative technologies to the warfighter.  The decrease from FY 2013 to FY 2014 is predominately due to decreased investment in research and development analysis support to fund increased investment in RU-Fundamental Research for Combatting WMD and RG-Defeat Technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RA:  Information Science and Applications"
                                    },
                                    "Description": {
                                        "val": "Project RA (Information Science and Application) develops innovative technologies and modeling and simulation (M&S) capabilities and provides Technical Reachback support to create decision advantage for the U.S. and our Allies through improved situational understanding across the complete CWMD mission space."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "42.279"
                                            },
                                            "Text": {
                                                "val": "Developed next generation CWMD analysis Reachback tool capabilities.\n-  Solicited innovative research projects focused on Chemical-Biological (CB) detection, Improvised Explosive Device (IED), and Special Nuclear Materials (SNM) detection including: Vessel Boarding Inspection System, Bioaerosol Collector, Handheld CBE Sensors, Detection of Water Based Threats (Radiation), Multi-Mode Laser-Based Sensor for Explosive Standoff Detection, Gadolinium Aerogel, and Medical-Radiation Exposure Device.\n- Provided Open Innovation and Technology Watch\/Scouting in support of CBRNE S&T development for DTRA and Other Government Agencies to include DTRA’s Operations, Exercise, and Readiness, OSD(AT&L), Rapid Reaction Technology Office, and Counter Terrorism Technology Support Office. \n- Conducted requirements and gap analyses to enable research and development efforts to meet WMD capability gaps.  \n- Supported program and project managers by translating Agency goals and Concept of Operations into actionable products.\n- Completed initial concept demonstrations for Standoff Detection in the Continental United States (CONUS) and Outside the Continental United States (OCONUS) environments to combat WMD proliferation.\n       - Investigated and explored modeling and simulation developmental technologies, such as Virtual Worlds.\n  - Analyzed, explored, and identified gaps, and barriers associated with CWMD Warfighter Challenges\n  - Supported STRATCOM requirements for an integrated strategic stockpile force structure planning tool.\n- Supported Office of the Secretary of Defense Capability Assessment and Program Evaluation (OSD CAPE) with standoff nuclear detection analysis and modeling.\n- Performed analysis studies to predict new WMD threats.\n- Stimulated, identified, and executed high-impact projects to address long term resolution of WMD issues.\n- Provided long-range analytical CWMD support to the warfighter. \n-  Designed and implemented Mission Domain IT architecture.  This included migration and integration of current R&D IT capabilities leveraged by DTRA operational and combat support customers into the operational IT infrastructure.\n-  Contracted support to design, implement and manage the DTRA Integration, Test and Experimentation Center.\n-  Designed Mission Domain IT architecture and completed first phase of implementation.  Implementation includes migration and integration of current R&D IT capabilities leveraged by DTRA operational and combat support customers into the operational IT infrastructure.\n-Provided capability to model, simulate and analyze existing DTRA systems, networks, enclaves and communications capabilities and perform regression testing for system changes and upgrades (including Information Assurance patches).\n- Began modifications and capability improvements to vulnerability assessment software and integrated WMD toolsets, including  initial modularization of software architectures to allow for easy removal and optional replacement of engineering models.  \n- Began development of capability to model secondary and tertiary effects supporting optimal course of action and tactical decisions for WMD operations, focusing on a nuclear scenario.\n- Provided systems engineering support to numerous DTRA programs, projects, and activities, to include nuclear detection activities, innovative new technologies, modeling and simulation activities, and strategic planning efforts.\n- Designed and implemented a research and development portfolio management software tool for use across all programs, projects, and activities.\n- Managed the Threat Reduction Advisory Committee (TRAC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.396"
                                            },
                                            "Text": {
                                                "val": "- Continue requirements and gap analyses to enable research and development efforts to meet combating WMD capability gaps.  Support program and project managers by translating Agency goals and Concept of Operations into actionable products.\n- Support STRATCOM requirements for an integrated strategic stockpile force structure planning tool.\n- Integrate first person virtual environments into the suite of CWMD Modeling and Simulation capabilities.\n- Facilitate Joint Concept Development & Experimentation (JCDE) for the CWMD Community of Interest.\n- Integrate Joint Semi-Automated Forces (JSAF) mission planning, constructive analysis, and virtual training toolkit into the Integrated Weapons of Mass Destruction (WMD) Toolset (IWMDT).\n- Continue to support OSD-CAPE and OSD-Nuclear Matters office (NM) strategic planning efforts and force analyses.\n- Deploy advanced Combating WMD (CWMD) operational virtual\/live training capabilities for Technical Support Group (TSG) and related DOE activities.\n- Integrate Defense Intelligence Operations Coordination Center\/Defense Intelligence Agency (DIOCC\/DIA) collection planning tools into NIMBLE ELDER mission capabilities.\n- Deploy 1st generation real time radiation modeling capabilities into DTRA Reachback support.\n- Continue to solicit new innovative research projects for developing needed new technologies and increased end-user capabilities (leveraging other DoD and USG resources where possible) focused on Chemical, Biological, Radiological, Nuclear, and High Explosives (CBRNE) detection, CWMD, Improvised Explosive Device detection and defeat, and\/or Special Nuclear Materials detection.\n- Continue development of capability to model secondary and tertiary effects supporting optimal course of action and tactical decisions for WMD operations, including power and communication infrastructures.\n- Organize\/conduct senior Combatant Command (COCOM), Interagency, and International workshops, symposiums, and table top exercises to address key national\/international strategies for reducing\/combating the WMD threat.\n- Refine and enhance WMD lessons learned process with international staff and across the other COCOMs, incorporating lessons learned from partner activities.\n- Develop and update DTRA Support Plan as directed in the Defense Planning and Programming Guidance (DPPG) to further the Combating WMD mission across all theaters while balancing DTRA assets and managing risks as prioritized within the Guidance for Employment of the Force (GEF).\n- Utilize institutionalized linkage with NATO\/SHAPE and USEUCOM in international research and development collaboration to further develop similar international research and development collaboration within the Pacific Region in accordance with the GEF. \n- Continue to conduct strategic analyses and assessments on emerging WMD threats using various strategic research methodologies.  Expand the use of Second Track Dialogues to meet future CWMD challenges.\n- Manage the Threat Reduction Advisory Committee (TRAC).\n- Build a professional network of up-and-coming professionals (post-BS\/BA and pre-PhD) through effective management of the Bio Initiative for the Next Generation.\n- Complete modernization of infrastructure and extend enhanced enterprise services.\n- Complete documentation and architecture development for migrated mission systems.\n- Begin code-based vulnerability scanning and documentation.  Expand capability to perform code analysis earlier in the life-cycle development as well as interfacing passive code exploitation reporting to the DTRA Computer Network Defense Service Provider (CNDSP)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.263"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.263"
                                            },
                                            "Text": {
                                                "val": "- Continue to solicit innovative research projects for developing  new technologies and increased end-user capabilities  to support “Data to Decisions” S&T development.\n-  Provide Open Innovation and Technology Watch\/Scouting in support of “Data to Decisions” S&T development for DTRA and Other Government Agencies.\n- Continue to conduct strategic analyses and assessments on emerging WMD threats using various strategic research methodologies.  \n- Manage the Threat Reduction Advisory Committee (TRAC).\n- Modernize and improve DTRA’s portfolio management software tool.\n- Continue requirements and gap analyses to enable research and development efforts to meet combating CWMD capability gaps.  \n- Support program and project managers by translating Agency goals and Concept of Operations into actionable products.\n- Test and continue development on next generation capabilities for “real-time” reachback supporting radiological search and visualization\n- Continue modifications and capability improvements to vulnerability assessment software and integrated WMD toolsets to contribute to new CWMD cooperative technology efforts.\n- Continue activities to implement Full Operational Capability for Mission Domain IT architecture.\n- Make improvements to the DTRA Integration, Test and Experimentation Center.\n- Continue to provide systems engineering contractor support to numerous DTRA Research and Development programs, projects, and activities, to include nuclear detection activities, innovative new technologies, modeling and simulation activities, and Research and Development strategic planning efforts.\n- Continue to upgrade and manage the research and development portfolio management software tool for use across all DTRA Research and Development programs, projects, and activities.\n- Develop and modernize a Global Knowledge Management Capability (GKMC) software tool for OSD level and other users."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "31\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.354"
                                        },
                                        "CurrentYear": {
                                            "val": "7.455"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.431"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.431"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.934"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.415"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.351"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.381"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Number of customer requests for data analysis compared to historical level.\nNumber of changes to investments based on systems engineering analyses.\nNumber of exercise and operations supported.\nNumber of Defense Acquisition Workforce Improvement Act certified systems engineers. \nNew capabilities delivered and transitioned to operational capabilities.\nMission Enclave moves from development to Initial Operational Capability (IOC).\nMission Enclave moves from IOC to Full Operational Capability (FOC) by FY 2014.\nSegment architectures for the mission enclave and supported mission systems.  \nIntegrate segment architectures into the DTRA Enterprise Architecture.\nDevelopment of network modeling and system-in-the-loop testing capabilities within the DTRA Integration, Test and Experimentation Center (DITEC)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RE"
                    },
                    "ProjectTitle": {
                        "val": "Counter-Terrorism Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "15.946"
                        },
                        "PriorYear": {
                            "val": "2.409"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The USSOCOM Combating Weapons of Mass Destruction – Terrorism Support Program (SCSP) supports processes to forecast plausible terrorist WMD threats for planning and conducting operations to combat WMD terrorism (CWMD-T).  The SCSP specifically addresses Commander USSOCOM responsibilities under the Chairman, Joint Chiefs of Staff (CJCS) Unified Command Plan (UCP) for integrating and synchronizing Defense-wide operations and activities to prevent terrorists from developing, acquiring, proliferating, or using WMD.\n\nFollow-on funding for this project can be found in the Proliferation Prevention and Defeat; 0603160BR, budget exhibit."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RE: Counter-Terrorism Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RE (Counter-Terrorism Technologies) provides research and development support to Joint U.S. Military Forces, specifically U.S. Special Operations Command (USSOCOM), in the areas of Explosive Ordnance Disposal Device Defeat; counter-WMD technologies for warfighters; the USSOCOM Combating Weapons of Mass Destruction – Terrorism Support Program (SCSP); and oversight of counterproliferation (CP) research and development resources sent directly to USSOCOM for warfighter-unique CP technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.409"
                                            },
                                            "Text": {
                                                "val": "- SCSP reached Full Operational Capability (FOC) while increasing support to COCOM planning efforts related to CWMD-T from previous levels."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "31\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "112.905"
                                        },
                                        "CurrentYear": {
                                            "val": "110.657"
                                        },
                                        "BudgetYearOne": {
                                            "val": "111.658"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "111.658"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "111.820"
                                        },
                                        "BudgetYearThree": {
                                            "val": "114.130"
                                        },
                                        "BudgetYearFour": {
                                            "val": "116.796"
                                        },
                                        "BudgetYearFive": {
                                            "val": "118.230"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Number of technologies developed and delivered, and\/or proof of concept, or successful Military Utility Assessments conducted that increase the potential mission success and reduces the number of current gaps in SOF capabilities to counter weapons of mass destruction when conducting Overseas Contingency Operations."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RF"
                    },
                    "ProjectTitle": {
                        "val": "Detection and Forensics Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "43.697"
                        },
                        "PriorYear": {
                            "val": "45.570"
                        },
                        "CurrentYear": {
                            "val": "44.998"
                        },
                        "BudgetYearOne": {
                            "val": "40.454"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.454"
                        },
                        "BudgetYearTwo": {
                            "val": "40.857"
                        },
                        "BudgetYearThree": {
                            "val": "41.638"
                        },
                        "BudgetYearFour": {
                            "val": "42.560"
                        },
                        "BudgetYearFive": {
                            "val": "43.447"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "*RF Project title change from Detection Technology starting in FY 2014"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technologies, systems and procedures to detect, identify, track, locate, monitor and interdict strategic and improvised nuclear and radiological weapons, components, materials or infrastructure in support of Department of Defense requirements for combating terrorism, counterproliferation and nonproliferation, homeland defense, and international initiatives and agreements. This project researches, develops, demonstrates, and transitions advanced technologies to improve operational capabilities to detect and identify nuclear and radiological weapons.  It supports the attribution process through development, demonstration, and transition of improved post-detonation National Technical Nuclear Forensics (NTNF) operational capabilities in the areas of materials collection, debris diagnostics and materials analysis, and prompt diagnostics and device reconstruction.  Efforts under this project also support international peacekeeping and nonproliferation objectives, on-site and aerial inspections and monitoring, on-site sampling and sample transport, and on-site and off-site analysis to meet forensic, verification, monitoring and confidence-building requirements.\n\nThe Detection and Forensics Technologies project under Weapons of Mass Destruction Proliferation Prevention and Defeat emphasizes the advanced technology development and engineering portion of the overall effort.\n\nThe decrease from FY 2012 to FY 2013 is predominately due to the redirection of the nuclear detection portfolio toward a more holistic Nuclear Threat Detection portfolio that integrates both passive and active radiation detection into a comprehensive Intelligence, Surveillance, and Reconnaissance (ISR) solution. This resulted in a decreased investment in advanced detector technology to fund increased investment in nuclear weapons effects in Project RI - Nuclear Survivability and system vulnerability and assessment capabilities in Project RL - Nuclear and Radiological Effects. \n\nThe decrease from FY 2013 to FY 2014 is predominately due to decreased investment in Detection Technology to fund increased investment in nuclear weapons effects research for survivability in Project RL - Nuclear & Radiological Effects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF: Detection and Forensics Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RF (Detection and Forensics Technologies) develops technologies, systems and procedures for post detonation nuclear forensics, and to detect, identify, track, tag, locate, monitor and interdict strategic and improvised nuclear and radiological weapons, components, materials, or infrastructure in support of Department of Defense (DoD) requirements for combating terrorism, counterproliferation and nonproliferation, homeland defense, and international initiatives and agreements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "45.570"
                                            },
                                            "Text": {
                                                "val": "- Continued maturing passive interrogation systems for determining the location of nuclear material.\n- Completed design of man-portable field instrument capable of passively locating and identifying nuclear materials.\n- Continued to develop and demonstrate neutron detection technology as an alternative to helium-3 neutron detectors.\n- Began development of a rugged, mobile stand-off radiation detection system to provide detection and identification of nuclear materials in a field environment.\n- Continued development of new detector materials intended to improve the capability to detect, locate, and identify threat materials. Improved the manufacturing readiness level by maturing technologies, designs, and production processes.\n- Transitioned compact, high performing replacement electronics for detectors to commercial production. \n- Continued development and improvements to an advanced algorithm to increase speed and reliability of isotope identification in fielded hand-held and portable detectors.\n- Began incorporating radiation transport into existing operational modeling tools.\n- Began development of compact superconducting cyclotrons as a source in active interrogation systems.\n- Continued to develop, accelerated development where appropriate, and demonstrated prototype upgraded technical capabilities for prompt and debris sample collection, sample analysis, and integration of design modeling and forensic data to support development of technical conclusions.\n- Under the NTNF Joint Capability Technology Demonstration (JCTD), tested, trained, and operationally demonstrated\/exercised (ODX) advanced post-detonation ground\/airborne particulate collection and yield determination technologies.\n- Continued development of a fieldable standoff active interrogation system for standoff detection and warning of hidden and shielded nuclear material.\n- Continued to perform field demonstrations of new detector technologies for handheld detectors, distributed sensors, and vehicle mountable detector systems, to improve the ability of fielded forces to detect, locate, and identify nuclear materials in the battle space.  \n- Continued to improve performance of new detector materials, imaging and spectroscopy systems, and signals analysis methods through rigorous field testing.\n- Expanded the functionality of the Mobile Field Kit – Radiological (MFK-R) to add radiological situational awareness to the current suite of chemical sensors in the kit.\n- Investigated alternative methods to detect fissions in nuclear materials from standoff ranges, including the use of high-power lasers to generate beams of mono-energetic x-rays.\n- Continued to advance the laboratory physics demonstrations of target stimulation, signature detection, and validated modeling capability.\n- Continued to investigate the possibility and Concept of Operations (CONOPS) to detect radiation induced air fluorescence from special nuclear material (SNM) by passive and active means.\n- Investigated concept of a pulsed millimeter wave system, which detects radioactive sources in both passive and active interrogation scenarios.\n- Continued improvements to the Monte Carlo N-Particle (MCNP) code to enhance its modeling capability for specific problems.\n- Continued development of a large standoff, directionally oriented, monoenergetic gamma (e.g. laser Wakefield\/inverse Compton scattering accelerator) source for integration with an active interrogation system.\n- Continued efforts to improve designs for higher acceleration gradients and reduced accelerator weight and size."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "44.998"
                                            },
                                            "Text": {
                                                "val": "- Continue development of a compact superconducting source in active interrogation systems.\n- Continue to identify all-source nuclear threat signatures, characteristics, and corresponding detection modalities; identify the proper tipping, queuing, and data fusion techniques and algorithms to enable the rapid and effective accumulation of all-source intelligence on nuclear threat scenarios. \n- Investigate alternative methods to detect fissions in nuclear materials from standoff ranges.\n- Investigate the use of proton beams for standoff stimulation of fission in nuclear materials.  Conduct experiments to validate the feasibility of the approach.\n- Progressively advance the laboratory physics demonstrations of target stimulation, signature detection, and validated modeling capability.\n- Investigate concept of a radio wave-type system to detect radioactive sources in multiple scenarios.\n- Improve a probabilistic code to enhance its modeling capability for specific problems.\n-Continue efforts to improve accelerator designs for improved capabilities with reduced weight and size.\n- Continue to incorporate radiation transport into existing operational modeling tools.\n- Test and evaluate developmental large-area detection systems.\n- Research and develop new detector materials intended to improve the capability to detect, locate, and identify threat materials. Improve the manufacturing readiness level by maturing technologies, designs, and production processes.\n- Continue to develop and demonstrate neutron detection technology as an alternative to helium-3 neutron detectors.\n- Continue to develop, accelerate development where appropriate, demonstrate, and field (prototype) upgraded technical capabilities for prompt diagnostics (under DISCREET OCULUS and MINIKIN ECHO) and debris sample collection, sample analysis, modeling to support nuclear device reconstruction, and forensics data to lower uncertainties\/increase confidence in technical nuclear forensics (TNF) conclusions. Includes development of new debris collection and field analysis concepts and supporting technologies that take advantage of higher activity level samples and the ability to collect\/analyze short-lived isotopes to significantly shorten the timeline. \n- Begin development of methods to rapidly determine post-event nuclear weapon yields and reaction history by investigating alternative prompt nuclear weapons effects, effects on the environment, and developing\/fielding prototype capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.454"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.454"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop, accelerate development where appropriate, demonstrate, and field (prototype) upgraded technical capabilities for prompt diagnostics (under DISCREET OCULUS and MINIKIN ECHO) and debris sample collection, sample analysis, modeling to support nuclear device\nreconstruction and forensics data to lower uncertainties\/increase confidence and improve timeliness of technical nuclear forensics (TNF) conclusions. Includes development of new debris collection, field analysis concepts, in-laboratory timeline improvements, new signature development, improved modeling and simulation capabilities, and other supporting technologies. \n- Continue development of methods to rapidly determine post-event nuclear weapon yields and reaction history by investigating alternative prompt nuclear weapons effects, effects on the environment, and developing\/fielding prototype capabilities.  \n-  Continue identifying all-source nuclear threat signatures, characteristics, and corresponding detection modalities; identify the proper tipping, queuing, and data fusion techniques and algorithms to enable the rapid and effective accumulation of all-source intelligence on nuclear threat scenarios. \n- Continue development and improvements to an advanced algorithm to increase speed and reliability of isotope identification in fielded hand-held and portable detectors.\n- Continue to collaborate with international partners to develop a photon Bremsstrahlung capability for active interrogation of SNM.\n- Research and develop new detector materials intended to improve the capability to detect, locate, and identify threat materials. Improve the manufacturing readiness level by maturing technologies, designs, and production processes.\n- Continue to develop and demonstrate neutron detection technology as an alternative to helium-3 neutron detectors."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "31\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "72.980"
                                        },
                                        "CurrentYear": {
                                            "val": "76.298"
                                        },
                                        "BudgetYearOne": {
                                            "val": "74.556"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "74.556"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "75.219"
                                        },
                                        "BudgetYearThree": {
                                            "val": "77.505"
                                        },
                                        "BudgetYearFour": {
                                            "val": "79.198"
                                        },
                                        "BudgetYearFive": {
                                            "val": "79.891"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Successful completion of the individual digital dosimeter project.\nDemonstrate military utility of active interrogation.\nSuccessful development and operational acceptance of transitional detection technologies.\nSuccessful demonstrations of forensics capabilities to support attribution involving both Radiological Dispersal and Improvised Nuclear Devices. \nSuccessful demonstration of the capability to exfiltrate data to a remote platform.\nDelivery of technical equipment prototypes to reduce their current gaps in technology, to locate, characterize and provide advanced diagnostics to defeat Weapons of Mass Destruction devices in support of a classified Chairman Joint Chiefs of Staff plan. \nImproved forensics evaluation tool capabilities.\nSupport development of National Technical Nuclear Forensics (NTNF) capabilities through development of technologies\/prototypes addressing gaps and shortfalls in Department of Defense (DoD) NTNF capabilities, and through participation in the interagency process.  Note: More specific metrics associated with NTNF are classified."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RG"
                    },
                    "ProjectTitle": {
                        "val": "Defeat Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.432"
                        },
                        "PriorYear": {
                            "val": "15.881"
                        },
                        "CurrentYear": {
                            "val": "14.645"
                        },
                        "BudgetYearOne": {
                            "val": "15.059"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.059"
                        },
                        "BudgetYearTwo": {
                            "val": "12.753"
                        },
                        "BudgetYearThree": {
                            "val": "13.971"
                        },
                        "BudgetYearFour": {
                            "val": "13.206"
                        },
                        "BudgetYearFive": {
                            "val": "13.459"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "*RG Project title change from Advanced Energetics & Counter WMD Weapons starting in FY 2014"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Defeat Technologies Project develops, integrates, demonstrates and transitions innovative kinetic and non-kinetic weapon capabilities to expand traditional and asymmetric options available to Combatant Commanders (CCDRs) to deny, disrupt, and defeat adversarial use of Weapons of Mass Destruction (WMD) while minimizing collateral effects from incidentally released agent.  Technology development focuses on the physical or functional defeat of (1) chemical, biological, radiological, and nuclear (CBRN) threat materials, (2) an adversary's ability to deliver the same, as well as (3) the physical and non-physical support networks enabling both.  It does so through the systematic identification and maturation of advanced technologies capable of defeating WMD agents or agent based processes, then integrating them into weapons, delivery systems or rapid WMD elimination capabilities that are most relevant to the COCOM's WMD Defeat CONOPS and their Area of Responsibility (AOR).  This program includes developing specific WMD agent\/agent-based process simulants, test infrastructure, and sampling capability required for effective development, testing, and evaluation (DT&E) of next-generation capabilities to ensure optimum weapon solutions are achieved based on this technology.  The program is addressing defeat of adversaries' offensive WMD programs through integration of current conventional weapons capabilities and next generation kinetic and non-kinetic solutions to provide full-spectrum asymmetric defeat options.  The program addresses requirements delineated in the Quadrennial Defense Review and Strategic Planning Guidance as codified Joint Capabilities Integration and Development System (JCIDS), Service requirements documents, and COCOM and Agency Priority Lists for lethal and non-lethal C-WMD capability.\n\nThe investment approach is based on a strategic top-down analysis of threat vulnerabilities and aligned with stated organizational core competencies and lines of operations aimed at the defeat of (1) the chemical, biological, radiological, and nuclear (CBRN) threat materials, (2) the ability to deliver the same, and (3) the support networks, both physical and non-physical, enabling both.  The program places a high priority on understanding, characterizing, and validating potential weapon effects within some mathematical confidence as it relates to the unintended release of hazardous threat materials.  Our end-state is to provide COCOMs with accurate and timely WMD defeat expertise, tailored technologies, and customized solutions that provide offensive weapons and capabilities to combat WMD in any target while mitigating collateral contamination effects.  Without these capabilities our nation cannot effectively hold at risk our adversaries’ WMD capabilities thus giving them strategic advantage.\n\nThe decrease from FY 2012 to FY 2013 represents an efficiency reduction to contract support services as part of Departmental efficiency initiatives to reduce reliance on service support contractors.  \n\nThe increase from FY 2013 to FY 2014 is predominately due to increased investment in Counter-WMD hard target defeat weapons development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RG: Defeat Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RG (Defeat Technologies) develops advanced technologies and weapon concepts and validates their applicability as counter WMD weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.881"
                                            },
                                            "Text": {
                                                "val": "- Selected the most promising and enhanced survivable energetic material fill and inert simulant for CWMD weapon development for future testing.\n- Continued maturing advanced non-energetic WMD Defeat payload components.\n- Began testing and demonstrations of non-energetic WMD Defeat payloads.\n- Began reduced scale target testing of WMD Defeat payloads and capabilities.\nConducted subscale experiments to develop and verify prediction capability for countermeasure effects on projectile penetration.\n- Continued advanced testing of WMD Defeat sub-munitions.\n- Began integration of WMD Defeat sub-munitions into a weapon warhead.\n- Developed and tested fuze well redundant data recorder for field testing of both legacy and developmental hard target defeat weapons.\n- Began testing and demonstrations of CWMD weapons payloads for use against bulk chemical agent.\n- Continued to explore new energetic CWMD payloads by performing sub-scale characterizations of the next generation survivable penetrator energetic material fill.\n- Continued development of process modeling capability for non-kinetic-based CWMD and applied it to specific CWMD targets. \n- Conducted flight testing of BDI Link Advanced Demonstrator (BLADE) system, demonstrating capability to relay Battle Damage Information (BDI) data.\n- Continued to explore combining integration of kinetic and non-kinetic payloads into a single weapon for counter WMD.\n- Determined the accuracy and precision of sampling equipment utilized in counter-WMD testing.\n- Conducted initial investigations necessary to develop a capability that can determine how much chemical or biological agent is released in an explosive plume while achieving acceptable accuracy and precision.\n- Completed testing with insensitive munitions and other High Energy fills to determine how well they can neutralize large quantities of WMD agent.\n- Initiated testing for Bomb, Live Unit (BLU)-119\/B conversion to safer, lower Life Cycle Cost payload fill."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.645"
                                            },
                                            "Text": {
                                                "val": "- Initiate small-scale testing in support of BLU-121\/B bomb development focusing on development of low lifecycle cost payload fills.\n- Initiate warhead integration of enhanced survivable explosive material fill and inert simulant.\n- Continue advanced testing of non-energetic WMD Defeat sub-munitions.\n- Continue testing and demonstrations of CWMD payloads.\n- Continue to explore integration of kinetic and non-kinetic capabilities into single payload for counter-WMD testing.\n- Continue testing and demonstrations of payloads capable of neutralizing large amounts of WMD agent.\n- Determine and catalog the accuracy and precision of bio-aerosol sampling equipment used in counter-WMD testing.\n- Continue development of a capability to conduct full-scale agent defeat testing with acceptable accuracy and precision.\n- Conduct large-scale target testing of functional and kinetic defeat technologies.\n- Conduct flight tests of Hard Target Void Sensing Fuze.\n- Conduct Next Generation AFX-757 Explosive Survivable Formulation that demonstrates enhanced survivability against hard and deeply buried targets.\n- Conduct flight testing of Robust Fuzewell Instrumentation System (RFIS) prototype to fully demonstrate capability of RFIS to support high shock munitions testing.\n- Develop robust forensic tools for an automated analysis of susceptibility of electronics to electromagnetic fields.\n- Demonstrate the capabilities of the JDAM tail kit BDI systems to provide near-real-time munitions effectiveness estimates to the warfighter. \n- Demonstrate BDI system prototype.\n- Initiate potential WMD target access denial or denial-of-use technologies.\n- Evaluate small new inventory weapons effectiveness against WMD threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.059"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.059"
                                            },
                                            "Text": {
                                                "val": "- Mature an automated system for the analysis of electronics susceptibility to electromagnetic fields.\n- Continue classified components testing.\n- Begin classified integration and component design.\n- Continue testing in support of a WMD agent defeat penetrator bomb development focusing on development of low lifecycle cost payload fills.\n- Continue development of potential WMD target access denial or denial-of-use technologies.\n- Continue developing robust forensic tools for an automated analysis of susceptibility of electronics to electromagnetic fields.\n- Continue advanced testing of non-energetic WMD Defeat sub-munitions.\n- Continue small-scale testing of CWMD payloads.\n- Continue to explore integration of kinetic and non-kinetic capabilities into single payload for CWMD testing.\n- Continue testing and demonstrations of payloads capable of neutralizing large amounts of WMD agent.\n- Continue to catalog the accuracy and precision of WMD sampling equipment used in CWMD testing.\n- Continue development of a capability to conduct full-scale agent defeat testing with acceptable accuracy and precision.\n- Conduct large-scale target testing of functional and kinetic defeat technologies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "31\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.606"
                                        },
                                        "CurrentYear": {
                                            "val": "20.682"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.811"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.811"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "19.776"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.718"
                                        },
                                        "BudgetYearFour": {
                                            "val": "23.417"
                                        },
                                        "BudgetYearFive": {
                                            "val": "23.811"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Enhance the Nuclear Weapons Effects (NWE) Simulator Program at the West Coast Facility (WCF) that provides capability for Department of Defense (DoD) programs to validate and verify survivability of military hardware against a nuclear threat.\nDevelopment of cold x-ray effects capabilities that meet or exceed the current capabilities.\nDemonstrate advanced warm x-ray experimental and computational capabilities to meet emerging DoD system survivability requirements.\nSuccessful demonstration of Short Pulse Gamma simulator to support high temporal fidelity for validation of prompt gamma nuclear weapon effects on advanced electronics.\nSuccessfully conduct nuclear weapon effects experimental campaigns to allow identification of x-ray effects phenomena."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RI"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear Survivability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.525"
                        },
                        "PriorYear": {
                            "val": "19.606"
                        },
                        "CurrentYear": {
                            "val": "18.810"
                        },
                        "BudgetYearOne": {
                            "val": "21.041"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.041"
                        },
                        "BudgetYearTwo": {
                            "val": "22.289"
                        },
                        "BudgetYearThree": {
                            "val": "23.241"
                        },
                        "BudgetYearFour": {
                            "val": "23.261"
                        },
                        "BudgetYearFive": {
                            "val": "23.658"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Nuclear Survivability project provides enabling technologies for Department of Defense (DoD) nuclear forces and their associated control and support systems and facilities in wartime to avoid, repel, or withstand attack or other hostile action, to the extent that essential functions can continue or be resumed after the onset of hostile action.  Emphasis is on ionizing radiation effects. The Nuclear Survivability project provides Radiation Hardened (RadHard) Microelectronics and Nuclear Weapons Effects (NWE) experimentation research.  Funding in this project also supports the expanding role of the Nuclear Test Personnel Review (NTPR) program into Science & Technology development for human survivability.\n\nThe NWE simulators are available to validate nuclear survivability requirements for DoD missile and space systems, conduct research in radiation effects, and validate computational models.  The Nuclear Survivability Experimental Capabilities program is working with the National Nuclear Security Administration and the United Kingdom Atomic Weapons Establishment to jointly develop new, enabling technologies for improved NWE experimentation capabilities for x-rays, gamma rays and neutrons.\n \nThe Nuclear Technology Analysis Support provides support for the Joint Atomic Information Exchange Group (JAIEG) and the international Weapon Effects Steering Committee (WESC) that was called the NWE Users’ Group.  The WESC establishes standards for U.S. and U.K. nuclear weapons effects simulation codes and models as defined and prioritized by the nuclear community, and serves as a forum for sharing information on nuclear technologies, gaps and plans.\n\nThe decrease from FY 2012 to FY 2013 was predominately due to decreased in investment in nuclear weapons effects relative to a nonrecurring increase for a Short Pulse Gamma (SPG) simulation capability in FY 2012 and decreased investment in human survivability beginning in FY 2013.\n\nThe increase from FY 2013 to FY 2014 is predominately due to increased investment in nuclear weapons effects experimental capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RI: Nuclear Survivability"
                                    },
                                    "Description": {
                                        "val": "Project RI (Nuclear Survivability) provides the capability for DoD nuclear forces and their associated control and support systems and facilities in wartime to avoid, repel, or withstand attack or other hostile action, to the extent that essential functions can continue or be resumed after the onset of hostile action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.606"
                                            },
                                            "Text": {
                                                "val": "- Developed 45nm RadHard-By-Design mitigation techniques.\n- Investigated 32nm technology Total Ionizing Dose mitigation methods.\n- Demonstrated compatibility of 90nm RadHard by design library cells and macro with 90nm RadHard by process enhancements.\n- Completed fabrication and assembly of the Short Pulse Gamma (SPG) simulator core components. \n- Conducted laser-driven x-ray source demonstrations to support missile defense and satellite subsystem survivability.\n- Investigated x-ray sources on NIF to characterize the survivability of satellite solar arrays.\n- Developed high-fidelity warm x-ray sources to reduce the design margins for survivable mission critical systems.\n- Integrated fast-running urban radiation transport algorithms into operational code.\n- Initiated a five-year plan to sustain the test capabilities of the DTRA West Coast Facility."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.810"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate initial 45nm RadHard prototype circuits to develop RadHard by design methods.\n- Continue development of Technology Computer-Aided Design modeling for 45nm circuit devices.\n- Characterization and mitigation of radiation effects in graphene devices.\n- Implementation of human radiation induced performance decrement model into operational code.\n- Perform a full-scale space interceptor telescope survivability test on NIF in collaboration with the Missile Defense Agency (MDA).\n- Initiate an investigation of advanced concepts to generate >10X the existing warm x-ray test capability to support strategic system life extension programs in collaboration with the National Nuclear Security Administration (NNSA).\n- Continue the sustainment of the test capabilities of the DTRA West Coast Facility."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.041"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.041"
                                            },
                                            "Text": {
                                                "val": "- RadHard-by-Design (RHBD) 45nm \/32nm technology demonstration\n- Radiation effects on advanced technology testing and characterization.\n- Product Demonstration Vehicle (PDV) architecture and circuit layout designs for 45nm\/32nm RHBD project.\n- Complete 45nm and 32nm Hardness Assurance Methods for Testing and Assurance Projects.\n- Transition radiation effects modeling and simulation project from planar 45nm \/ 32nm Electronic Design Automation to 28nm \/ 22nm Fin-Shaped Field Effect Transistors (FinFets).\n- Continue the sustainment of the test capabilities of the DTRA West Coast Facility.\n- Establish the Short Pulsed Gamma prototype as a test capability within the West Coast Facility for hardening and validation of military systems.\n- Demonstrate strategic level direct laser blow-off impulse test capability for two-dimensional configurations to support material modeling & simulation.\n- Perform a full-scale space interceptor telescope survivability test on National Ignition Facility (NIF) in collaboration with the Missile Defense Agency (MDA).\n- Demonstrate new pulsed power driven source designs for enhanced warm (>10 keV) X-ray outputs.\n- Implementation of combined radiation and burn, partial human body model in nuclear weapons effects code.\n- Initiate update of MIL-STD-188-125-1 High-Altitude Electromagnetic Pulse (HEMP) Protection For Ground-Based C4I Facilities Performing Critical, Time-Urgent Missions Part 1 Fixed Facilities.\n- Complete Verification Test of Modernization of Enterprise Terminals (MET) Hardened Transportable Terminal to MIL-STD-188-125-2.\n- Complete Consolidated Afloat Network and Enterprise Services (CANES) Military Standard.\n- Complete draft MIL-STD-4023 Maritime EMP Standard for surface ships."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "31\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.388"
                                        },
                                        "CurrentYear": {
                                            "val": "6.129"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.016"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.016"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.971"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.283"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.903"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.941"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Enhance the Nuclear Weapons Effects (NWE) Simulator Program at the West Coast Facility (WCF) that provides capability for Department of Defense (DoD) programs to validate and verify survivability of military hardware against a nuclear threat.\nDevelopment of cold x-ray effects capabilities that meet or exceed the current capabilities.\nDemonstrate advanced warm x-ray experimental and computational capabilities to meet emerging DoD system survivability requirements.\nSuccessful demonstration of Short Pulse Gamma simulator to support high temporal fidelity for validation of prompt gamma nuclear weapon effects on advanced electronics.\nSuccessfully conduct nuclear weapon effects experimental campaigns to allow identification of x-ray effects phenomena."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RL"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear & Radiological Effects"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "15.891"
                        },
                        "PriorYear": {
                            "val": "25.783"
                        },
                        "CurrentYear": {
                            "val": "25.752"
                        },
                        "BudgetYearOne": {
                            "val": "35.741"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.741"
                        },
                        "BudgetYearTwo": {
                            "val": "37.284"
                        },
                        "BudgetYearThree": {
                            "val": "37.888"
                        },
                        "BudgetYearFour": {
                            "val": "38.297"
                        },
                        "BudgetYearFive": {
                            "val": "38.824"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Nuclear and Radiological Effects project develops nuclear and radiological assessment modeling tools to support military operational planning, weapon effects predictions, and strategic system design decisions; consolidate validated Defense Threat Reduction Agency modeling tools into net-centric environment for integrated functionality; predict system response to nuclear and radiological weapons producing electromagnetic, thermal, blast, shock and radiation environments - key systems include Nuclear Command and Control System, Global Information Grid, missiles, structures, humans and environment; provide detailed adversary nuclear infrastructure characterization to enhance counterforce operations and hazard effects; conduct analyses in support of nuclear and radiological Science and Technology and address the priority needs of the Combatant Commands and the Department of Defense, develop and provide electromagnetic pulse assessment capabilities to support national and military operational planning, weapon effects predictions, and national strategic systems designs; and develop foreign nuclear weapon outputs.\n\nNuclear Technology Analysis Support provides support for the Joint Atomic Information Exchange Group (JAIEG) and the international Weapon Effects Steering Committee (WESC) that was called the NWE Users’ Group.  The WESC establishes standards for U.S. and U.K. nuclear weapons effects simulation codes and models as defined and prioritized by the nuclear community, and serves as a forum for sharing information on nuclear technologies, gaps and plans.\n\nThe increase from FY 2013 to FY 2014 is predominately due to increased investment for nuclear weapons effects for survivability, targeting support, and consequence of execution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RL: Nuclear & Radiological Effects"
                                    },
                                    "Description": {
                                        "val": "Project RL (Nuclear & Radiological Effects) develops nuclear and radiological assessment modeling tools to support military operational planning, weapon effects predictions, and strategic system design decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.783"
                                            },
                                            "Text": {
                                                "val": "- Stood up the Nuclear Weapons Effects Network (NWEN) and began to do the following:\n- Modeled and coded development to perform analyses at all computational levels of fidelity and run times.\n- Re-initiated quality NWE science via balanced modeling and simulation and experimentation.\n- Focused initially on first-principles model development and Uncertainty Quantification.\n- Completed non-ideal Source Region Electromagnetic Pulse (SREMP) Study.\n- Completed new version of United States Strategic Command’s (USSTRATCOM) official strategic targeting code used to determine the probability of damage from nuclear weapon.  \n- Updated trapped radiation belt model.\n- Completed 4 chapters of  Effects Manual One (EM-1); published one edition of Joint Radiation Effects document, upgraded database of foreign nuclear weapon outputs for DoD and the Services.\n- Updated Nuclear Weapons Effects Database (NWEDS) used by the Army for survivability and targeting calculations.\n- Published MIL-STD-3023: High-Altitude Electromagnetic Pulse (HEMP) Protection for Military Aircraft\n- Completed HEMP Verification Test of a Missile Alert Facility.\n- Completed HEMP Verification Test of Satellite Communication Station at Thule, Greenland and recommended certification.\n- Completed HEMP Verification Test of Northwest Earth Terminal Complex.\n- Published MIL-STD-2169C: High-Altitude Electromagnetic Pulse (HEMP) Environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.752"
                                            },
                                            "Text": {
                                                "val": "- Prototype first principles urban effects model for nuclear detonations.\n- Deliver improved High Altitude Nuclear Environments (HANE) model for better modeling\/predictions of nuclear effects from space detonations.\n- Complete three dimensional models of nuclear fallout for better modeling\/predictions of fallout from ground or low-altitude detonations.\n- Begin component level EMP response model for better modeling\/predictions of effects on electronic systems.\n- Continue Effects Manual One (EM-1) development (4 chapters); continue publication of Joint Radiation Effects documentation, continue to upgrade database of foreign nuclear weapon outputs for DoD and the Services.\n- Deliver hazard source terms to the Chemical – Biological Defense Program’s Joint Effects Model Block II, enhancing our ability to predict hazards associated with weapons of mass destruction.\n- Conduct Maritime EMP Standard Ship Test to provide improved techniques for testing Navy vessels against EMP threats.\n- Complete HEMP Verification Test of the National Military Command Center (NMCC).\n- Report on a Power Protection Experiment at Idaho National Laboratory.\n- Release of Electromagnetic Reliability and Effects Prediction (EMREP) Program version 4.0 and complete EMREP training.\n- Complete HEMP Verification Test of Satellite Communication Station at Fylingdales, UK."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.741"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.741"
                                            },
                                            "Text": {
                                                "val": "- Start Atmospheric Nuclear Environment Military Standard\n- Start Communication in Disturbed Environment Military Standard.\n- Complete Verification Test of Modernization of Enterprise Terminals (MET) Hardened Transportable Terminal to MIL-STD-188-125-2.\n- Complete draft MIL-STD-4023 , HEMP protection for maritime assets.\n- Via the NWEN, model fire start to support USSTRATCOM’s interest in Consequences of Execution, fire start experiments, and tunnel defeat.\n- Model Nuclear Infra-Red effects for global assessment of missile defense systems’ capabilities.\n- Expand to include modeling nuclear detonations at lower altitudes\n- Update radar and IR system models\n- Update Open cavity System Generated Electro-magnetic Pulse SGEMP model to support satellite systems design \n- Modify input requirements of engineering level codes to take advantage of Redbook and Bluebook output\n- Model the effects of urban nuclear detonations for underground tunnels (e.g., subways) in support of infrastructure assessments.   \n- Support NWEDS functionality with expanded targets and damage calculations, enhanced reports, plot rendering, combined and multiple weapon effects and Nuclear Weapons Database\n- Provide model for analysis of the high altitude nuclear environments, the effects of EMP and non-ideal air-blast on defense systems for an integrated net-centric application."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "117\/0605000BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Capabilities"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.750"
                                        },
                                        "CurrentYear": {
                                            "val": "5.749"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.995"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.995"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.077"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.359"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.541"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.694"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Provide Department of Defense the ability to predict the survival and mission impact of military critical systems exposed to nuclear weapon environments within acceptability criteria defined during the model accreditation process.\nContinuously improve United States Strategic Command (USSTRATCOM) official strategic targeting capability to determine the consequences of execution from nuclear weapons.\nWeapon Effects Steering Committee: Coordinate and integrate nuclear weapon effects needs, capabilities and programs across the United States and United Kingdom defense communities."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RM"
                    },
                    "ProjectTitle": {
                        "val": "WMD Counterforce Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.255"
                        },
                        "PriorYear": {
                            "val": "16.089"
                        },
                        "CurrentYear": {
                            "val": "18.969"
                        },
                        "BudgetYearOne": {
                            "val": "16.617"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.617"
                        },
                        "BudgetYearTwo": {
                            "val": "16.919"
                        },
                        "BudgetYearThree": {
                            "val": "17.032"
                        },
                        "BudgetYearFour": {
                            "val": "17.137"
                        },
                        "BudgetYearFive": {
                            "val": "17.458"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "*RM Project title change from Battle Management starting in FY 2014"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Weapons of Mass Destruction (WMD) Counterforce Technologies project provides applied research to support full and sub-scale testing required to investigate countering WMD weapon effects, and sensor performance, weapon effects modeling algorithm development, and the set-up of the Defense Threat Reduction Agency (DTRA) Experimentation Lab (DEL).\n\nThis project provides combatant commanders the prediction capability and the attack options to engage WMD targets, to include related Hard & Deeply Buried Targets (HDBTs) as the proliferation and hardness of this class of targets increases.  The project conducts weapon effects phenomenology (WEP) tests, analyzes data, conducts high performance computer simulations, and creates\/modifies software to more accurately model cratering effects, fragmentation (both primary & secondary), internal air blast, equipment\/container damage, structural response, and penetration.  These efforts will lead to advanced modeling and simulation capability in the countering WMD planning tools, to include the Integrated Munitions Effects Assessment (IMEA) planning tool used for weaponeering and the Vulnerability Assessment and Protection Option (VAPO) planning tools used for force\/structure protection.  The Advanced Energetics & Counter WMD Weapons Program develops new novel energetic materials and weapon design technology for rapid, directed and enhanced energy release, providing new capability to defeat difficult WMD\/HDBTs. The Advanced Energetics Program also develops new high energy systems well above current chemical energy levels to defeat WMD targets beyond the reach of traditional high explosive blast\/frag warhead technology.\n  \nThe DTRA Experimentation Lab Capability is an Agency-wide capability that assures the timely acquisition, synchronization, correlation and delivery of Chemical, Biological, Radiological, Nuclear and Explosive (CBRNE) consequence management and mitigation data necessary in combating WMD.  The DTRA Experimentation Lab will be the “key enabler” allowing the Agency to transform successfully into an interoperable DoD Science and Technology environment.  Using the DTRA Experimentation Lab, DTRA will be able to shape and improve military situational awareness independent of time or location, effectively shorten decision cycles in a CBRNE event, and extend DTRA’s knowledge base externally through collaborative technologies.\n\nProgram RM supports the National Strategy for Countering Biological Threat priority\/focus area 3) Capability Expansion.  DTRA is developing blast explosives technologies such as the EG Hybridized Enhanced Blast Explosive (HEBX) as well as reactive cases for explosives used for countering special targets including biological weapons. The approach is to develop an enhanced explosive fill that will envelop the target with a high temperature caustic environment that will kill any bio-agents released during the strike.\n\nDTRA initiated efforts to develop and demonstrate advanced material science solutions to support WMD Counterforce missions.  This effort investigates the relationship between the structure of materials at atomic or molecular scales and their macroscopic properties.  The goal of this program is to provide a practical mechanism to develop, demonstrate and deliver novel materials for several WMD counterforce missions. Materials developed under this auspice will have use in these areas; Energetic Materials, Non-Kinetic defeat, Agent Defeat (Biological) and Interfacial materials for WMD Sensors\n\nThe increase from FY 2012 to FY 2013 is predominately due to the reallocation of funds from infrastructure development in Project RR - Test Infrastructure to weapons effects and planning tools in Project RM – WMD Counterforce Technologies to properly align mission responsibilities.\n\nThe decrease from FY 2013 to FY 2014 is predominately due to decreased investment in Advanced Energetics and DTRA Wargaming to fund increased investment in WMD Intelligence, Surveillance, and Reconnaissance activities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RM: WMD Counterforce Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RM (WMD Counterforce Technologies) provides (1) full-scale testing of counter WMD weapon effects, sensor performance, and weapon delivery optimization, (2) weapon effects modeling, and (3) the DTRA Experimentation Lab."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.089"
                                            },
                                            "Text": {
                                                "val": "- Integrated first principle modeling codes into Graphical User Interface (GUI)-based hazard prediction models.\n- Facilitated Joint Concept Development & Experimentation (JCDE) for the C-WMD COI.\n- Investigated and explored developmental technologies, such as Virtual Worlds.\n- Analyzed, explored, and identified gaps and barriers associated with CWMD warfighter challenges.\n- Completed facilitation of the internal Continuity of Operations Table Top Experiment through the DTRA Experimentation Lab (DEL).\n- Planned, designed, executed, and analyzed warfighting experimentation in support of DTRA, and in coordination with the Services, Combatant Commands, Defense agencies, and the interagency as appropriate.\n- Performed annual cycle of requirements collection, challenge proposals, resource allocation, and tech support through High Performance Computing.\n- Supported two DTRA DoD high performance computing challenge projects, simulating hard target defeat scenarios and deflagration to detonation transitions.\n- Improved parallel scalability of important computational fluid dynamics (CFD) and computational structural mechanics (CSM) codes to reduce computational required time to deliver a solution.\n- Interfaced important CFD & CSM codes with analysis software to facilitate validation, sensitivity studies, and uncertainty quantification.\n- Developed capability to model equipment fragility for any generic equipment.\n- Conducted testing and modeling improvements to the WMD Agent Release Model to support DoD need for accurate weapons effects modeling and simulation for counter-WMD planning tools.\n- Completed blast door damage model verification and validation.\n- Conducted Phase 2 progressive collapse testing. \n- Finalized Internal Detonation testing for blast through building walls and finalized a human injury model.\n- Started testing near miss lethality for an additional inventory weapon.\n- Incorporated Second-order Hydrodynamic Automatic Mesh Refinement Code (SHAMRC) workshop recommendations into improved SHAMRC; compare the simulated results with test results.\n- Evaluated technology transfer to cruise missile payload using DTRA-developed reactive case technology.\n- Integrated enhanced blast explosives and reactive cases into designs for weapon payloads.\n- Studied performance of payloads based on enhanced blast explosives and reactive cases for agent defeat.\n- Began efforts to develop novel energy storage capabilities based on antimatter storage, super halogen chemistry, and warm dense matter at high pressure, hydrogen isotope reactions, and high nitrogen explosives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.969"
                                            },
                                            "Text": {
                                                "val": "- Facilitate Joint Concept Development & Experimentation (JCDE) for the CWMD Community of Interest.\n- Integrate virtual environments into DTRA wargaming activities.\n- Analyze, explore, and identify gaps, and barriers associated with CWMD Warfighter Challenges through the use of wargaming and tabletop exercises.\n- Perform annual cycle of requirements collection, challenge proposals, resource allocation, and technical support through High Performance Computing.\n- Submit two DTRA Challenge Proposals for improved quality of service in time limit, allowed job size, and job throughput on DoD high performance computers.\n- Improve computational methods for prediction of progressive collapse.\n- Complete blast through failing walls test series and provide new model for blast through failing walls from inventory weapons.\n- Start delivery of validated high fidelity models for air blast in complex tunnels.\n- Start delivery of validated models for blast and fragmentation through failing blast doors.\n- Improve computational methods for prediction of progressive collapse.\n- Begin implementation of Advanced Targeting Assessment Capability (ATAC).\n- Provide modeling support for the transfer of novel energetic concepts to selected weapon systems.\n- Complete formulation testing; perform in-depth fragmentation test and analysis with reactive liners in sub-scale warheads.\n- Continue testing of agent defeat mechanisms using hybrid enhanced blast explosives and reactive cases.\n- Begin work to develop warhead energy release tailored to target environment and to develop directed blast energy release to enhance target damage.\n- Continue development of warm dense matter at high pressure; demonstrate novel use of this material state for x-ray generation.\n- Complete synthesis and lab tests of one new explosive compound."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.617"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.617"
                                            },
                                            "Text": {
                                                "val": "- Complete Hybridized Enhanced Blast Explosive (HEBX)\/Agent Defeat (AD) Payload Demo \n- Demonstrate capability to capture and store positron in Electromagnetic Field.\n- Develop generalized Equipment Fragility Model.\n- Develop Dynamic Pressure Model for bunkers.\n- Develop Blast Propagation Through Failed Walls Model.\n- Update Agent Release Model for container perforated translation\/collision.\n- Optimize Computational Fluid Dynamics (CFD) (SHAMRC and Finite Element Flow Solver (FEFLO)) for fast calculations in complex tunnels.\n- Complete General Near Miss Lethality Model.\n- Perform annual cycle of requirements collection, challenge proposals, resource allocation, and technical support through High Performance Computing.\n- Enhance one HPC production code to better leverage capabilities of DoD high performance computers for improved modeling and simulation time to response.\n- Continue testing and model development for blast and fragment propagation through failing blast doors and multi-blast doors and deliver an initial model for integration in IMEA.\n- Continue lab and scale testing for validation of high fidelity models for penetration mechanics through ultra-high strength materials.\n- Validate a fast running model for progressive collapse analysis of steel buildings.\n- Integrate final blast through failed walls and doors with human injury prediction model into the Vulnerability Assessment and Protection Option (VAPO) planning tool.\n- Complete a generalized equipment fragility model.\n- Complete a model for blast propagation through bunker walls for inventory weapons.\n- Conduct a large scale test of hybrid enhanced blast explosives and reactive cases for defeat of biological agents using simulants.\n- Scale up synthesis of novel explosives, prepare their metalized composites and conduct field tests.\n- Develop real-time reachback requirements and gap solutions through wide area search Table Top Exercise."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "31\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation, Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.735"
                                        },
                                        "CurrentYear": {
                                            "val": "22.503"
                                        },
                                        "BudgetYearOne": {
                                            "val": "29.420"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "29.420"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "31.893"
                                        },
                                        "BudgetYearThree": {
                                            "val": "33.971"
                                        },
                                        "BudgetYearFour": {
                                            "val": "34.523"
                                        },
                                        "BudgetYearFive": {
                                            "val": "35.108"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Confidence in engineering models based on software validation and testing.\nNumber of targets successfully planned.\nTime required completing assessments.\nThe DTRA Experimentation Lab (DEL) is occupied by planning or execution efforts 75% of the year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RR"
                    },
                    "ProjectTitle": {
                        "val": "Test Infrastructure"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.509"
                        },
                        "PriorYear": {
                            "val": "16.641"
                        },
                        "CurrentYear": {
                            "val": "13.782"
                        },
                        "BudgetYearOne": {
                            "val": "14.591"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.591"
                        },
                        "BudgetYearTwo": {
                            "val": "14.867"
                        },
                        "BudgetYearThree": {
                            "val": "15.460"
                        },
                        "BudgetYearFour": {
                            "val": "16.057"
                        },
                        "BudgetYearFive": {
                            "val": "16.337"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Test Infrastructure project provides a unique national test bed capability for simulated Weapons of Mass Destruction (WMD) facility characterization, weapon-target interaction, and WMD facility defeat testing to respond to operational needs by developing and maintaining test beds used by the Department of Defense (DoD), the Services, the Combatant Commanders, and other federal agencies to evaluate the implications of WMD, conventional, and other special weapon use against U.S. military or civilian systems and targets.  It leverages fifty years of testing expertise to investigate weapons effects and target response across the spectrum of hostile environments that could be created by proliferate nations or terrorist organizations with access to advanced conventional weapons or WMD (nuclear, biological and chemical).  The project maintains testing infrastructure to support the testing requirements of warfighters, other government agencies, and friendly foreign countries on a cost reimbursable basis.  It creates testing strategies and a WMD Test Bed infrastructure focusing on the structural response of buildings and Hard & Deeply Buried Targets that house nuclear, biological, and chemical facilities.  It provides support for full and sub-scale tests that focus on weapon-target interaction with fixed soft and hardened facilities to include above ground facilities, cut-and-cover facilities, and deep underground tunnels.  This capability does not exist anywhere else within the DoD and supports the counterproliferation pillar of the National Strategy to Combat WMD.\n\nThis project supports the National Strategy for Countering Biological Threat priority\/focus area 3) Capability Expansion and 4) Leveraging Science.  DTRA conducts an intergovernmental test program with the Defence Research and Development Canada (DRDC) for Biological Agent Defeat testing.  In FY 2014 DTRA will continue research for Biological Re-aerosolization in conjunction with DoD\/DHS\/EPA to help develop precise measurement technologies for residual biological pathogens reentering air after settling—Canceled by DHS.  In addition, DTRA supports the development and demonstration of Transatlantic Collaboration Biological Resiliency Demo (TACBRD), a DoD capability to shape interagency approach to counter a wide area biological event impacting U.S. and partner nations’ key civilian\/military infrastructure.  Particularly in support of capability expansion, DTRA conducts Interagency Biological Restoration Demonstration (IBRD) testing in conjunction with the Department of Defense (DoD) and the Department of Homeland Security (DHS) to reduce the time and resources necessary to recover and restore wide urban areas, military installations, and critical infrastructure, following a biological incident, but is transitioning into TaCBRD.  Additionally, DTRA is funding an internal Research program (Innovative Research Program) which examines the novel use of “MicroNeedles” for use in physiological monitoring and\/or drug delivery; This project is being conducted by Sandia National Labs and the first phase will be completed by February 28, 2013.  \n\nThe decrease from FY 2012 to FY 2013 is predominately due to the reallocation of funds from infrastructure development in Project RR - Test Infrastructure to weapons effects and Planning tools in Project RM - Counterforce Technologies, and reduced investment in test infrastructure environment restoration support and the WMD National Test Bed (TB).  \n\nThe increase from FY 2013 to FY 2014 is predominately due to the realignment of test bed facilities from RT-Target Assessment Technologies in Program Element (PE) 0603160BR to RR-Test Infrastructure in PE 0602718BR to better reflect the nature of those activities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RR: Test Infrastructure"
                                    },
                                    "Description": {
                                        "val": "Project RR provides a unique national test bed capability for simulated WMD facility characterization, weapon-target interaction, and WMD facility defeat testing to respond to operational needs by developing and maintaining test beds used by the DoD, the Services, the Combatant Commanders and other federal agencies to evaluate the implications of WMD, conventional, and other special weapon use against U.S. military or civilian systems and targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.641"
                                            },
                                            "Text": {
                                                "val": "- Developed prototype Voice Over Internet Protocol (VOIP) technology that can transfer both classified and unclassified data, voice communications, video, etc., to support test program execution starting first quarter FY2012..\n- Implemented updates and test infrastructure improvements to support revitalized Weapons Effects Phenomenology Program supporting DTRA test programs.\n- Completed improvements to existing test infrastructure and test articles and constructed new test articles to support DTRA Detection Technology Program starting in first quarter FY 2012.\n- Conducted sensor testing at the Technical Evaluation Assessment and Monitor Site (TEAMS) to detect and prevent nuclear grade material from entering the U.S., U.S. Territories, and Allied Nations through rail, ship, and air ports.\n- Supported Interagency Biological Restoration Demonstration (IBRD) testing in conjunction with DoD and DHS to reduce the time and resources necessary to recover and restore wide urban areas, military installations, and critical infrastructure, following a biological incident.\n- Conducted testing Chemical, Biological, Radiological, Nuclear, and Explosive sensors, WMD countermeasures, remote geological sensing, and battle management systems designed for surveillance and tracking targets used for WMD activities.\n- Continued nuclear detection and forensics testing to prevent weapons grade material\/dirty bombs from entering the U.S., U.S. Territories, and Allied Nations.\n- Continued Weapons of Mass Destruction sensor testing at the Technical Evaluation Assessment and Monitor Site to detect and prevent nuclear grade material from entering the U.S., U.S. Territories, and Allied Nations through rail, ship, and air ports.\n- Implemented environmental remediation and compliance activities at the Nevada National Security Site (NNSS), White Sands Missile Range (WSMR), and Kirtland Air Force Base (KAFB) in accordance with EPA, Safety, and Environmental guidelines throughout FY 2012.\n- Supported tunnel work detection testing at Nevada National Security Site for the Customs and Border Patrol to be able to detect tunnel work or tunnels along northern and southern borders of CONUS.\n- Implemented infrastructure and instrumentation upgrades to ensure test beds meet customers’ advanced technology testing needs.\n- Continued documentation, support and prioritization of test infrastructure requirements.\n- Completed WMD Aerial Collection System (WACS) testing that is designed to meet U.S. Forces Korea’s requirement of an “all-in-one” CBRN sensor system for post-strike assessment (Battle Damage Assessment) of suspected WMD facilities and mobile time-sensitive targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.782"
                                            },
                                            "Text": {
                                                "val": "- Complete Integrated Technology Demonstration (ITD) at NNSS to defeat credible and threat-based scenarios; continue with transition into several related projects\/planned events through FY 2017.\n- Begin Directorate ITD testing at WSMR prioritizing requirements to support reduced architectural and engineering design efforts and construction of future CWMD test beds.\n- Support development and demonstration of Transatlantic Collaboration Biological Resiliency Demo (TACBRD), a DoD capability to shape interagency approach to counter a wide area biological event impacting U.S. and partner nations’ key civilian\/military infrastructure.\n- Begin research of Biological Re-aerosolization in conjunction with DoD\/DHS\/EPA to help develop precise measurement technologies for residual biological pathogens reentering air after settling.\n- Conduct intergovernmental test program between DTRA and Defence Research and Development Canada (DRDC), Biological Agent Defeat testing.\n- Begin testing in support of “Speed of Sound” nuclear forensic program estimated to continue through FY 2015\n- Maintain current version of VOIP system that can transfer classified and unclassified data, voice communications, video, etc. to support test program execution.\n- Maintain existing test infrastructure in current configuration to support revitalized Weapons Effects Phenomenology Program supporting DTRA test programs; make improvements through funding provided by external program managers.\n- Improve existing test infrastructure and test articles or construct new test articles to support DTRA Detection Technology Program through funding provided by external program managers.\n- Continue testing in support of Treaty Verification Technologies Program and Source Physics Experiments to support Comprehensive Test Ban Treaty Initiatives, New START Warhead Verification, and detection and verification of Biological and Chemical Weapons.\n- Continue support of Weapons of Mass Destruction sensor testing at the TEAMS to detect and prevent nuclear grade material from entering the U.S., U.S. territories, and Allied Nations through rail, ship, and air ports with funding provided by external program managers.\n- Continue IBRD testing in conjunction with DoD and DHS to reduce the time and resources necessary to recover and restore wide urban areas, military installations, and critical infrastructure, following a biological incident.\n- Continue testing CBRNE sensors, WMD countermeasures, remote geological sensing, and battle management systems designed for surveillance and tracking targets used for WMD activities.\n- Continue nuclear detection and forensics testing to prevent weapons grade material\/dirty bombs from entering the U.S., U.S. territories, and Allied Nations through funding provided by external program managers.\n- Continue environmental remediation and compliance activities at the NNSS, DPG, WSMR, and KAFB in accordance with EPA, Safety, and Environmental guidelines. Defer major demolition and restoration efforts of major test articles while ensuring they are safely closed and sealed at minimal acceptable standards.\n- Maintain current inventory of infrastructure and instrumentation, extending life-cycle of these items as long as possible to ensure test beds meet customers’ advanced technology testing needs.\n- Document, prioritize, and support test infrastructure requirements.\n- Close the Large Blast Thermal Simulator eliminating ability to execute test requirements on these nuclear effects.\n- Evaluate and determine courses of action for current usefulness of remaining existing nuclear simulators within management control of Test Support Division."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.591"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.591"
                                            },
                                            "Text": {
                                                "val": "- Continue CWMD testing\/demonstration at NNSS to defeat credible and threat-based scenarios; continue with transition into several related projects\/planned events through FY 2017.\n- Begin CWMD testing at WSMR prioritizing requirements to support reduced architectural and engineering design efforts and construction of future CWMD test beds.\n- Support development and demonstration of TransAtlantic Collaboration Biological Resiliency Demo (TACBRD), a DoD capability to shape interagency approach to counter a wide area biological event impacting U.S. and partner nations’ key civilian\/military infrastructure.\n- Continue research of Biological Re-aerosolization in conjunction with DoD\/DHS\/EPA to help develop precise measurement technologies for residual biological pathogens reentering air after settling.\n- Continue intergovernmental Biological Agent Defeat test program between DTRA and DRDC.\n- Continue testing in support of “Speed of Sound” nuclear forensic program estimated to continue through FY 2015.\n- Maintain existing test infrastructure in current configuration to support revitalized Weapons Effects Phenomenology Program supporting DTRA test programs; make improvements through funding provided by external program managers.\n- Improve existing test infrastructure and test articles \n- Conduct testing in support of Treaty Verification Technology Program and Source Physics Experiment (SPE) to support Comprehensive Test Ban Treaty (CTBT) Initiatives, New START Warhead Verification, and detection and verification of Biological and Chemical Weapons.\n- Continue support of WMD sensor testing at the TEAMS to detect and prevent nuclear grade material from entering the U.S., U.S. territories, and Allied Nations through rail, ship, and air ports\n- Continue testing CBRNE sensors, WMD countermeasures, remote geological sensing, and battle management systems designed for surveillance and tracking targets used for WMD activities.\n- Continue nuclear detection and forensics testing to prevent weapons grade material\/dirty bombs from entering the U.S., U.S. territories, and Allied Nations through funding provided by external program managers.\n- Continue environmental remediation and compliance activities at the NNSS, DPG, WSMR, and KAFB in accordance with EPA, Safety, and Environmental guidelines.  Defer major demolition and restoration efforts of major test articles while ensuring they are safely closed and sealed at minimal acceptable standards.\n- Maintain current inventory of infrastructure and instrumentation, extending life-cycle of these items as long as possible to ensure test beds meet customers’ advanced technology testing needs.\n- Document, prioritize, and support test infrastructure requirements.\n- Evaluate and determine courses of action for current usefulness of remaining existing nuclear simulators within management control of Test Support Division."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Number of tests executed safely, i.e., no loss of life or limb, no unintentional significant damage of property.\nFY 2012 – No safety issues\/incidents during scheduled test events.\nNumber of tests that are evaluated through the milestone review process.\n100% of all tests completing scheduled milestones.\nNumber of tests that undergo environmental assessment consistent with existing Environmental Impact Statements.\nAll test executed undergo environmental review consistent with existing Environmental Impact Statements.\nFY 2012 - 87 Tests \nFY 2013 - 90 Tests (projected)\nFY 2014 - 76-90 Tests (projected)"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RT"
                    },
                    "ProjectTitle": {
                        "val": "Target Assessment Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.845"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "For some hard and deeply buried targets, physical destruction is neither possible, nor practical, with current conventional weapons and employment techniques.  It may be possible, however, to achieve target defeat objectives by denying or disrupting the mission or function of the target facility.  Functional defeat, however, requires more information and more detailed analysis of the target.  The functional defeat process includes finding and identifying a facility, characterizing its function and physical layout, determining its vulnerabilities to available weapons, planning and executing an attack, assessing damage, and if necessary, suppressing reconstitution efforts and re-attacking the facility.  Target Assessment Technologies provides the Combatant Commands and the Intelligence Community with technologies and processes to find and characterize Weapons of Mass Destruction (WMD) targets located in underground facilities and then, in near-real-time, assess the results of attacks against those targets.  Overall objectives are to develop new methodologies, processes and technologies for detecting, locating, identifying, physically and functionally characterizing, modeling, and assessing new and existing hard and deeply buried targets to support either physical or functional defeat.  Extending this activity and applying these processes to Weapons of Mass Destruction (WMD) target characterization and threat analysis presents the next technical challenge.  The Target Assessment Technologies project now consists of three subordinate and related activities: (1) Targeting and Intelligence Community Technology Development; (2) Find, Characterize, Assess Technology Development; and (3) Counter-WMD Analysis Cell (C-WAC) Technology Support.  Follow-on funding for this project can be found in the Proliferation Prevention and Defeat; 0603160BR, budget exhibit."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RT - Target Assessment Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RT provides the Combatant Commands and the Intelligence Community with technologies and processes to find and characterize Weapons of Mass Destruction (WMD) targets located in underground facilities and then, in near-real-time, assess the results of attacks against those targets.  Follow-on funding for this project can be found in the Proliferation Prevention and Defeat; 0603160BR, budget exhibit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "28\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation, Prevention, and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "36.198"
                                        },
                                        "CurrentYear": {
                                            "val": "31.298"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.141"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.141"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "29.276"
                                        },
                                        "BudgetYearThree": {
                                            "val": "30.152"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.936"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.596"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RU"
                    },
                    "ProjectTitle": {
                        "val": "Fundamental Research for Combating WMD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.961"
                        },
                        "PriorYear": {
                            "val": "8.931"
                        },
                        "CurrentYear": {
                            "val": "2.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.516"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.516"
                        },
                        "BudgetYearTwo": {
                            "val": "0.567"
                        },
                        "BudgetYearThree": {
                            "val": "0.549"
                        },
                        "BudgetYearFour": {
                            "val": "0.549"
                        },
                        "BudgetYearFive": {
                            "val": "0.559"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Fundamental Research for Combating WMD project conducts technology reviews of the Defense Threat Reduction Agency (DTRA) Basic Research Program to identify promising emerging science with potential to be matured into Counter WMD technologies.  The advancement of technology and science into applied technology development efforts focus upon increasing the stability and utility of mid-to-long term, moderate risk but high payoff science, and emerging technologies for transition to other DTRA applied technology programs.  This effort serves as the bridge between the bench scientist and the applied technologist.\nThe decrease from FY 2012 to FY 2013 is predominately due to the significant reduction of University Strategic Partnerships activities, reduced efforts in Combating Weapons of Mass Destruction – Terrorism (CWMD-T), and the transfer of advanced systems concepts funding from project RU – Fundamental Research for Combating WMD to project RA – Information Science and Applications to perform strategic research and dialogues.  \n\nThe decrease from FY 2013 to FY 2014 is predominately due to decreased investment in University Strategic Partnership (USP) activities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RU: Fundamental Research for Combating WMD"
                                    },
                                    "Description": {
                                        "val": "Project RU (Fundamental Research for Combating WMD) provides (1) strategic studies to support DoD, (2) decision support tools and analysis to support combating WMD research and development investments, and (3) early applied research for technology development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.931"
                                            },
                                            "Text": {
                                                "val": "- Successfully expanded the Fundamental Research Broad Agency Announcement (BAA) to continue 10 years.\n- Identified and transitioned all suitable investigatory Science and Technology research and development projects to appropriate long-term sponsors for concept\/design validation, prototype fabrication, testing, and fielding.\n- Initiated collaboration between scientists from Lawrence Livermore National Laboratory (LLNL) and the Laboratory for Laser Energetics (LLE) at the University of Rochester (UR), which will develop the DTRA time resolved x‐ray spectrometer for basic and fundamental science, radiation effects, and other experiments on the National Ignition Facility (NIF).  A time resolved x‐ray spectrometer will be designed, fabricated and fielded on the NIF over a two-year period.  The technical work began in the first quarter of FY 2013 and the first NIF experiment using the spectrometer will be performed in FY 2014.\n- Continued “bridging” projects for early applied development of combating WMD technologies.  Several FY 2012 awards advanced previously funded basic research grants:  Quantifying Gamma\/Neutron Discrimination in Gadolinium-Rich Real-time Neutron Detection Materials and Devices and Dynamics of exploding plasmas in a large magnetized plasma\n- Provided technical expertise and advice to generate the new basic research topics in support of the semi-annual solicitation.\n- Continued the mentoring, sponsorship, and education of the “Next Generation” of mission-critical scientific, technical and engineering expertise."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "- Close out of the current University Strategic Partnership (USP) contract after 10 years of activities.\n- Close out the remainder of the eleven active research projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.516"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.516"
                                            },
                                            "Text": {
                                                "val": "- Provide technical and programmatic support to DTRA’s basic research program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "1\/0601000BR"
                                    },
                                    "Title": {
                                        "val": "DTRA Basic Research Initiative"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "47.712"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.071"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.071"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.662"
                                        },
                                        "BudgetYearThree": {
                                            "val": "47.502"
                                        },
                                        "BudgetYearFour": {
                                            "val": "48.357"
                                        },
                                        "BudgetYearFive": {
                                            "val": "49.228"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance is measured via a combination of statistics including the number of publications generated, number of students trained in sciences and engineering supporting DoD’s educational goals, number of research organizations participating, and percentage of participating universities on the US News & World Report “Best Colleges” list.\n\nPublication of an annual basic research technical and external programmatic review report.\n\nEach study\/project will commence within 3 months of customer request and results delivered within 3 months of completion."
                        }
                    }
                }
            ]
        }
    }
}