{
    "id": "c4da25fb790dff1a490421f7db99f9aa162e7e81",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603781D8Z"
        },
        "ProgramElementTitle": {
            "val": "Software Engineering Institute (SEI)"
        },
        "R1LineItemNumber": {
            "val": "62"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "27.189"
            },
            "CurrentYear": {
                "val": "30.036"
            },
            "BudgetYearOne": {
                "val": "19.008"
            },
            "BudgetYearOneBase": {
                "val": "19.008"
            },
            "BudgetYearTwo": {
                "val": "19.522"
            },
            "BudgetYearThree": {
                "val": "20.162"
            },
            "BudgetYearFour": {
                "val": "18.528"
            },
            "BudgetYearFive": {
                "val": "18.953"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "To ensure that the Department of Defense (DoD) retains a differential advantage over potential adversaries, Defense-Wide software research and development will include this Program Element (PE) 0603781D8Z and a new budget activity (BA) 2, SEI Applied Research, PE 0602751D8Z.  Funding for Advanced Technology Development in PE 0603781D8Z will decrease beginning in FY 2014 to reflect a pivot toward more fundamental research that will enable the DoD to address longer-term challenges in software technology and engineering.  When combined together, the two PEs represent a level of investment consistent with previous plans."
        },
        "ProgramElementMissionDescription": {
            "val": "Software is key to meeting the DoD’s increasing demand for high-quality, affordable, and timely national defense systems.  Systemic software issues are significant contributors to poor program execution, and reliance on software-intensive mobile and net based products and systems has been increasing (e.g., Joint Tactical Radio System, DDG-1000, Joint Strike Fighter, F-22, and Army Modernization).  As stated in the 2010 National Research Council of the National Academy of Sciences report entitled Critical Code, “It is dangerous to conclude that we are reaching a plateau in capability and technology for software producibility.”  The report notes that software is “…unconstrained by traditional physical engineering limitations…” and what we can accomplish is derived “…from [the] human intellectual capacity to conceptualize and understand systems….”  With growing global parity in software engineering, the DoD must maintain leadership to avoid strategic surprise.  The Software Engineering Institute (SEI) Program Element (PE) addresses the critical need to research, develop, and rapidly transition state-of-the-art software technology, tools, development environments, and best practices to improve the engineering, management, fielding, evolution, acquisition, and sustainment of software-intensive DoD systems.  The SEI PE’s program of work seeks to coordinate across the Department and the Services and leverages expertise in industry and academia to enable the development of joint capabilities.\n\nSoftware is more pervasive than ever and computer programs are growing in size and complexity.  Designing, managing, and securing integrated, complex, and large-scale mission-critical systems are abilities that the DoD and Defense Industrial Base (DIB) have not yet mastered.  The P781 project within this PE funds research and development at the SEI Federally Funded Research and Development Center (FFRDC).  The SEI FFRDC is an institute which enables the exploitation of emerging software technology by bringing engineering, management, and security discipline to software acquisition, development, and evolution.  The SEI FFRDC focuses on software technology areas judged to be of the highest payoff in meeting defense needs.  To ensure that the DoD retains a differential advantage over potential adversaries, research funding at the SEI FFRDC will include a new Budget Activity 2 funding line beginning in FY 2014.  The reduction in P781 in this line beginning in FY 2014 is offset by the creation of the new line, the SEI Applied Research PE.  The creation of this new line represents a pivot toward more fundamental research that will enable the DoD to address longer-term challenges in software technology and engineering.  The SEI Applied Research PE will also increase the collaboration opportunities for the SEI FFRDC with academia and attract top research talent to the SEI.  \n\nPrivate sector investment has created rapid advances in information technologies, but the pace of transition to DoD applications is often very slow or the commercial applications do not meet DoD unique needs, e.g., high assurance software or large-scale integrated systems.  The DoD needs to create opportunities to discover emerging technologies, to evaluate their potential to fit DoD needs, and where appropriate, conduct critical tests of the technologies under DoD conditions.  The P783 project within this PE funds the Software Producibility Initiative.  The Software Producibility Initiative works across the Services, industry, and academia to research and transition software science and tools that address the capacity to design, produce, assure, and evolve software-intensive systems in a predictable manner while effectively managing risk, cost, schedule, quality, and complexity."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "29.347"
                },
                "CurrentYear": {
                    "val": "30.036"
                },
                "BudgetYearOne": {
                    "val": "30.616"
                },
                "BudgetYearOneBase": {
                    "val": "30.616"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "27.189"
                },
                "CurrentYear": {
                    "val": "30.036"
                },
                "BudgetYearOne": {
                    "val": "19.008"
                },
                "BudgetYearOneBase": {
                    "val": "19.008"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.158"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-11.608"
                },
                "BudgetYearOneBase": {
                    "val": "-11.608"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.149"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-11.608"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.608"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.009"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 baseline adjustments are reflective of DoD priorities and requirements.\n\nTo enhance the SEI’s role as a Research and Development FFRDC, the Department created the new SEI Applied Research PE 0602751D8Z in FY 2014 to offset the reduction in P781 in this PE.  The Department is splitting funding for research at the SEI FFRDC across these two PEs to address both longer-term challenges in software technology and engineering (0602751D8Z) and to continue to benefit from the proven experience the SEI FFRDC has with developing and transitioning advanced technology (0603781D8Z).  The two PEs represent a level of investment consistent with previous plans."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P781"
                    },
                    "ProjectTitle": {
                        "val": "Software Engineering Institute (SEI)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.234"
                        },
                        "CurrentYear": {
                            "val": "22.735"
                        },
                        "BudgetYearOne": {
                            "val": "11.660"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.660"
                        },
                        "BudgetYearTwo": {
                            "val": "11.994"
                        },
                        "BudgetYearThree": {
                            "val": "12.422"
                        },
                        "BudgetYearFour": {
                            "val": "10.649"
                        },
                        "BudgetYearFive": {
                            "val": "10.956"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The SEI Federally Funded Research and Development Center (FFRDC) was established in 1984 as an integral part of the Department of Defense’s (DoD’s) initiative to identify, evaluate, and transition software engineering technologies and practices.  The SEI maintains unique software research and program support capabilities in a space where the Defense Industrial Base (DIB) and academia cannot as readily address challenges.  The mission of the SEI is to provide DoD with technical leadership and innovation through research and development to advance the practice of software engineering and technology.  The Institute works across Government, industry, and academia to improve the state of software engineering from the technical, acquisition, and management perspectives.  The SEI engages in research and development of critical software technologies and tools, and collaborates with the larger software engineering research community. It facilitates rapid transition of software engineering technologies into practice, and evaluates emerging software engineering technologies to determine their potential for improving software-intensive DoD systems.  Since its inception, the SEI has helped to transform the fields of software engineering and acquisition, network security, real-time systems, software architectures, and software-engineering process management.\n\nTo enhance the SEI’s role as a Research and Development FFRDC, the Department has created a new PE: SEI Applied Research, 0602751D8Z, beginning in FY 2014.  The reduction in P781 in this PE beginning in FY 2014 is offset by the creation of the SEI Applied Research PE.  The Department is splitting funding for research at the SEI FFRDC across these two PEs to address both longer-term challenges in software technology and engineering (0602751D8Z) and to continue to benefit from the proven experience the SEI FFRDC has with developing and transitioning advanced technology (0603781D8Z, P781)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SOFTWARE ENGINEERING INSTITUTE (SEI) RESEARCH"
                                    },
                                    "Description": {
                                        "val": "SEI research projects are awarded on a competitive basis across the SEI.  The number of projects will vary from year to year based on the size and scope of proposed projects.  Research projects cross-cut the FFRDC's experience base in order to advance existing SEI research initiatives and explore new technical ideas.  SEI research focuses on the most significant and pervasive software challenges within the DoD such as computing for real-time and embedded-systems, multi-core programming, computing at the tactical edge, System of System architectures, discovering effective agile methods to develop DoD-scale systems, cyber-security, and measurement-driven methods to improve the efficiency of acquisition programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.234"
                                            },
                                            "Text": {
                                                "val": "•\tEmpirically identified architecture and agile practices that balance the tension between speed and agility in support of rapid and incremental development of software-reliant systems.\n•\tDeveloped an approach for managing architectural rework in an iterative and incremental development environment and demonstrated the approach on an embedded real-time system case study.\n•\tDefined a fault ontology and a mechanism for associating it with architecture models to specify failure modes, error propagation, and error mitigation.  Applied this framework to several safety-critical network-based systems to facilitate their verification. \n•\tDeveloped, analyzed, and field tested resource allocation and market-inspired approaches for Adaptive Quality of Service (AQoS) in tactical environments.\n•\tCollected and analyzed architecture knowledge from two commercial software platforms to inform an approach for designing and using common platform operating environments.\n•\tDeveloped advanced quality-attribute analyses for high-confidence cyber-physical DoD systems (including avionics mission and flight computing) for timing of parallelized tasks and to reduce concurrency errors.  \n•\tEmpirically analyzed the effectiveness of multiple insider threat mitigation patterns as part of an evolving mitigation pattern language that is designed to help enterprise architects mitigate threats.\n•\tInvestigated exploratory new technology ideas in the early detection of insider threats.\n•\tDeveloped architectures and prototypes for “Situational Awareness Mash-ups” that support rapid integration with multiple back-end data sources for context awareness applications on handheld devices, and for offload to virtual machine-based “cloudlets” in tactical environments. \n•\tDemonstrated techniques to facilitate detection and mitigation of software vulnerabilities in applications, tools, and standards.\n•\tGalvanized several community groups (e.g., Government, DoD contractors, and academia) to formalize an understanding of the challenges and strategies for successfully adopting agile practices in government acquisition programs.\n•\tConstructed an initial behavioral model of program stakeholder interactions to show how joint program dynamics tend to drive toward failure.  This allows the simulation and analysis of new approaches to help acquisition staff understand how to better manage these situations. \n•\tDeveloped semantic hash techniques to predict similarity between malware functions and evaluated the techniques on samples from the CERT malware catalog.\n•\tExplored semantic methods for simplifying obfuscated malware and conducted a study of obfuscation prevalence in the CERT malware catalog.   \n•\tDeveloped methods for early DoD lifecycle cost estimation, including using historical records and expert inputs.  This allows probabilistically modeling of programmatic and technological uncertainties that influence program execution and cost.  \n•\tDeveloped new algorithms for assigning sporadic real-time tasks to processor cores of heterogeneous multi-core processors to guarantee their timing behavior."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.735"
                                            },
                                            "Text": {
                                                "val": "•\tContinue competitive awards within the SEI for novel research. \n•\tRefine economic foundations and measurable analysis of value-driven incremental software development by focusing on the role of quality-attributes in architecture related costs (e.g., rework or delay) and increment planning in DoD acquisition programs.\n•\tDevelop a dependency analysis model and theoretical foundations for architecture decision making that reduces integration risks in iterative and incremental development for DoD acquisition programs.\n•\tAnalyze software project data to determine the efficacy of incremental and iterative practices as related to project outcomes. \n•\tDetermine the contribution of architecture fault model framework evidence to confidence in cyber-physical system behavior as a complement to traditional review and testing evidence.\n•\tDevelop large-scale simulations to further develop and validate theory of adaptive quality-of-service for DoD distributed systems. \n•\tApply economic cost-benefit reasoning to develop new design methods for common software platform architectures that evolve in response to new operational needs.\n•\tDevelop quality-attribute analyses for high-confidence cyber-physical DoD systems for timing of multi-core software.\n•\tExtend software code analysis techniques to mobile environments to detect and rectify vulnerabilities in DoD mobile systems faster than our adversaries can exploit them.\n•\tDevelop an improved behavior-based malware detector to defend DoD mobile devices.\n•\tDevelop a portability strategy that allows mobile computing components to execute across a wide spectrum of computing environments.\n•\tExplore enhanced vulnerability discovery methods by coupling symbolic execution, concrete execution, and black-box fuzz testing to facilitate the discovery of software defects.\n•\tExplore ideas to reduce latent software defects using analytics based on vulnerability and software development process data.\n•\tCollect and analyze relevant baseline data to further validate insider threat mitigation patterns and develop a rigorous composition method as a foundation for evolving the mitigation pattern language toward more systematic application by system architects.\n•\tInvestigate tools to detect malicious network traffic.\n•\tIdentify and develop algorithms to enable flexible division of labor among humans and automation for Unmanned Aircraft Systems.\n•\tProduce patterns, prototypes, and examples for software development on heterogeneous high-performance computer architectures in the area of graph analytics.\n•\tUse analytic techniques, including research from the Mining Software Repositories community, to build tools to assist Certification and Accreditation efforts for Open Source Software.\n•\tContinue early lifecycle cost estimation research for pre-Milestone A evaluations.\n•\tDevelop empirically grounded, quantitative relationships between Bayesian models of program change drivers and cost estimation model inputs.\n•\tDevelop a method to support rapid analysis of changes to social networks in order to provide more timely feedback to soldiers and first responders.\n•\tDevelop software for a rapidly-deployable, scalable autonomous sensor network to support soldiers in activities such as recon, ambush, and search-and-rescue operations.\n•\tDevelop methods for extracting class definitions and relationships from object-oriented malware using automated semantic analysis.\n•\tDevelop next generation disassembly algorithms to improve the quality of automated static analysis and build confidence in the correctness of that disassembly.\n•\tDevelop a functional model for prioritizing malware threats based on execution behavior allowing for faster identification, analysis, and mitigation.\n•\tExplore the extent of threats posed by malware residing on a solid-state hard drive to the security of its host system as well as potential solutions to the problems discovered.\n•\tDevelop science, techniques, and tools to generate and use better synthetic data for test & evaluation of cyber-security technology.\n•\tFormulate an investment model that can forecast capital requirements for software sustainment. \n•\tInvestigate the use of machine learning, social network measurement, and analysis techniques to facilitate large-scale coordinated stakeholder engagement in architecture decisions and requirements elicitation.\n•\tFinalize identification of those projects that would benefit from a complimentary applied research component under the new BA 2 PE."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.660"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.660"
                                            },
                                            "Text": {
                                                "val": "•\tContinue competitive awards within the SEI for novel research.    \n•\tIncrease the research focus on economic foundations and measurable analysis of value-driven incremental development, including analysis of empirical results in a broad range of DoD settings to refine models and integrate them into tools.  A significant portion of this work will transition to the new SEI Applied Research PE (0602751D8Z).\n•\tInvestigate how value-driven incremental development analysis techniques can assist with relating requirements to architecture for improved system and software integration.\n•\tContinue investigation of the architecture fault model framework in incremental qualification and certifications of safety-critical cyber-physical DoD systems.\n•\tDevelop design principles that account for DoD networking infrastructure constraints for an adaptive quality-of-service approach and verify market mechanisms in realistic settings.\n•\tDevelop new methods that leverage reuse of software and architecture patterns in common platform operating environments to provide assurance and accelerate test, integration, and certification of DoD systems-of-systems.  \n•\tDevelop quality-attribute analyses for high-confidence cyber-physical DoD systems to coordinate timing of the computational and physically-related aspects of DoD systems.\n•\tExtend the architecture, algorithms, and prototypes that support rapid analysis of social networks; rapidly-deployable and scalable autonomous sensor networks; and the mobile component portability strategy to other scenarios and environments.\n•\tSupport the reduction of software defects through data analysis, leading to the prevention of the defects in the software design phase of the software development lifecycle.\n•\tEvaluate trends in the insider threat problem based on over 15 years of CERT case data and forecast insider threat mitigation patterns needed to support sustained protection against insider threats.\n•\tExtend and integrate work in group-context-awareness, cloudlets and situational awareness mashups to exploit contextual information and autonomy, thereby providing increased computational capability and reducing cognitive load.\n•\tEmpirically measure the contribution of select security and resilience practices to reducing the occurrence and impact of disruptive events.  \n•\tPursue assurance-at-scale; provide direct, artifact-focused means to support acceptance evaluation of software-reliant systems.\n•\tExtend dynamic testing capabilities to encompass exploit generation and cyber-defense testing to ensure secure DoD applications.\n•\tContinue investigating the detection of malicious network traffic by automating the extraction of indicators and continue to improve capabilities to discover relationships between malware artifacts.\n•\tContinue investigating disassembly algorithms to improve the quality of automated static analysis and build confidence in the correctness of that disassembly.\n•\tSimulate and evaluate algorithms for flexible division of labor among humans and automation for Unmanned Aircraft Systems, in operationally significant scenarios.\n•\tExpand the work to produce patterns, prototypes, and examples for software development on heterogeneous high-performance computer architectures in the area of graph analytics.\n•\tContinue the use of analytic techniques, including research from the Mining Software Repositories (MSR) community, to build tools to assist Certification and Accreditation efforts for Open Source Software.\n•\tContinue early lifecycle cost estimation research for pre-Milestone A evaluations.\n•\tBuild on the investigation of the use of statistical algorithms and automated tools to identify anomalous data in DoD program repositories.\n•\tContinue to investigate the use of machine learning, social network measurement, and analysis techniques to facilitate large-scale coordinated stakeholder engagement in architecture decisions and requirements elicitation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 2, PE # 0602751D8Z, P278"
                                    },
                                    "Title": {
                                        "val": "Software Engineering Institute Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.107"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.107"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.330"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.614"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.766"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.970"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "To ensure that the Department of Defense (DoD) retains a differential advantage over potential adversaries, Defense-Wide software research and development will include this PE and PE 0602751D8Z (Software Engineering Institute Applied Research).  When combined together, the two PEs represent a level of investment consistent with previous plans.  Funding for Advanced Technology Development in PE 0603781D8Z will decrease beginning in FY 2014 to reflect a pivot toward more fundamental research that will enable the DoD to address longer-term challenges in software technology and engineering."
                        },
                        "PerformanceMetrics": {
                            "val": "•\tTransition of tools and practices for use in DoD programs of record and to the Defense Industrial Base (DIB), and number of agencies and organizations sponsoring work.\n•\tNumber of publications in refereed journals and peer reviewed reports.\n•\tNumber of external research collaborations and interactions with the broader software engineering research community.\n•\tAdoption of coding standards and process techniques by standards bodies, working groups, and software\/systems engineering organizations.\n•\tNumber of training courses and curricula developed to contribute to the growth of capability in the software engineering research and development community and software\/system acquisition workforce.\n•\tDevelopment of new scalable technical and software-enabled cyber security approaches that address software assurance and improve enterprise resiliency.\n•\tReduced number of mission-critical software-reliant acquisition program failures and cost and schedule overruns, as well as quantitative improvements in overall system cost, time to develop, and performance – this will be evidenced by: reductions in time to test software and the amount of rework required; improved ability to articulate software requirements; development of techniques that offer orders of magnitude improvement in software productivity; development of new software algorithms and abstractions; and decreased number of software defects found through application of effective process and software development methods."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P783"
                    },
                    "ProjectTitle": {
                        "val": "Software Producibility Initiative"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.955"
                        },
                        "CurrentYear": {
                            "val": "7.301"
                        },
                        "BudgetYearOne": {
                            "val": "7.348"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.348"
                        },
                        "BudgetYearTwo": {
                            "val": "7.528"
                        },
                        "BudgetYearThree": {
                            "val": "7.740"
                        },
                        "BudgetYearFour": {
                            "val": "7.879"
                        },
                        "BudgetYearFive": {
                            "val": "7.997"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Shortcomings in software development often lead to schedule slippage, cost growth, and mission compromise.  These shortcomings can frequently be traced to software development technologies which are not capable of addressing the scale and complexity of the software needed in today’s systems.  The Software Producibility Initiative seeks to conduct an integrated program of research from applied research through demonstration and evaluation to advance the state-of-the-art in the producibility of software for DoD systems, particularly those systems characterized by high complexity, need for robustness, information assurance, real-time performance, and physical distribution.  The Initiative maintains a portfolio of work relevant to the Warfighter and DoD needs by periodically evaluating technology development efforts, retiring those that are under performing, and starting new efforts based on risk-reward priority.  The Initiative demonstrates new underlying software technology and tools in various domains, e.g., Networks, Modeling and Simulation, Avionics, Signal Intelligence, where DoD can benefit and enhance the transition paths for the underlying technology."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SOFTWARE PRODUCIBILITY INITIATIVE"
                                    },
                                    "Description": {
                                        "val": "The Software Producibility Initiative seeks to improve the DoD’s ability to design, build, test, and sustain software-intensive systems which meet mission critical requirements, exhibit predictable behavior, and enable evolution and interoperability.  Technology thrust areas include specification of complex requirements; “correct-by-construction” software development; scalable composition; high-confidence software and middleware; system architectures for network-centric environments; technologies for system visualization, testing, verification, and validation; model-driven development approaches; timing techniques for real-time embedded-systems; static and run-time analysis of software; design tools and development environments; and secure and efficient coding practices. Major performers include the Space and Naval Warfare Center (SPAWAR), Naval Research Laboratory (NRL), and the Air Force Research Laboratory (AFRL), as well as academia and industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.955"
                                            },
                                            "Text": {
                                                "val": "• Selected performers from a competitive solicitation to begin work in the areas of distributed and multi-core processing; technology for completeness, development, testing, and sustainment; instrumentation and monitoring; and tools to improve the efficiency of legacy software analysis, integration, and evolution.\n• Continued the development of the software engineering collaboration environment: increased the number of challenge problems and their difficulty, continued to engage existing users and attract new users, and identified opportunities for transition in FY 2013. \n• The SEI FFRDC began development of a technology roadmap in software producibility and is providing advice to senior levels of the DoD in its FFRDC role as a trusted agent.\n• Assessed the effectiveness of the accelerated synchronous behavior technique in representative systems and determined it was too immature to transition to DoD users.\n• Exploration of model-based design for systems-of-systems to allow scaling-up to DoD-scales resulted in several peer-reviewed publications.\n• Developed capability to create models & services and increased usability of the graphical interface in a development tool that allows scalable models developed by domain experts to be quickly connected graphically (by non-domain experts) to form hierarchical sets of models that can be executed on laptops and generic multi-core workstations as well as high-performance computing machines.\n• Developed and evaluated algorithms to improve the design, development, and optimization of complex software systems, including: efficient coding, tools for programming and efficiently using multi-core computers, and software for real-time embedded-systems and cyber-physical systems.\n• Completed an evidence based comparative assessment of the effectiveness of middleware developed under the Initiative to improve the portability and reuse of software. Critical aspects of this effort transitioned to a classified program.\n• Designed, extended, and investigated tools for constructing and analyzing timed models of cyber-physical systems.\n• Investigated a unified model-centric approach for integrating model-driven development across all phases and programs of the systems engineering lifecycle.\n• Designed algorithms and implemented a proof-of-concept development tool that reduces software bloat and speeds up execution time in C and C++ programs.\n• In collaboration with the SEI FFRDC, began analysis of Adaptive Quality of Service (AQoS) mechanisms that are being developed in an effort to help increase the performance of distributed software systems.\n• Began analysis of software engineering acquisition data to determine Return on Investment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.301"
                                            },
                                            "Text": {
                                                "val": "• In response to the FY 2012 solicitation, plan to continue and initiate work in the areas of distributed and multi-core processing; technology for completeness, development, testing, and improved sustainment; instrumentation and monitoring; and tools to improve the efficiency of legacy software analysis, integration, and evolution.\n• Seek opportunities to modify the open solicitation to address emerging DoD software technology needs. \n• Speed the transition of software research and development that increases the affordability of acquisition programs in accordance with the DoD’s Better Buying Power initiative.\n• Transition the responsibility for the software engineering collaboration environment to the SEI FFRDC.\n• Develop the underlying software techniques to allow scalable models developed by domain experts to be quickly connected graphically to form hierarchical models that can be executed on laptops and generic multi-core workstations, as well as, HPC (high-performance computing) machines.\n• Identify which techniques supporting model-based design of complex, heterogeneous, software intensive systems are sufficiently mature for transition into industrial practice, which require further research investment, and which should be abandoned.  \n• Continue the exploration of model-based design for systems of systems to allow scaling-up to DoD-scales.\n• Improve the efficiency of existing DoD sustainment activities by transitioning new tools and techniques to make correcting, upgrading, or adapting legacy code more efficient.\n• Identify evidence-based measures of the effectiveness of various software tools and acquisition practices on the costs of DoD programs.\n• Continue investigating tools for constructing and analyzing timed models of cyber-physical systems.\n• Continue and expand work to reduce software bloat and speed up execution time in C, C++, and other-languages.\n• Continue analysis of Adaptive Qquality of Service (AQoS) mechanisms that are being developed in an effort to help increase the performance of distributed software systems.\n• Continue analysis of software engineering acquisition data to determine Return on Investment.\n• Continue development of a technology roadmap in Producibility, and use the SEI FFRDC as a trusted advisor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.348"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.348"
                                            },
                                            "Text": {
                                                "val": "• Solicit further responses from the open solicitation.  Plan to continue and initiate work in the areas of distributed processing and multi-core processing; technology for completeness, development, testing, and sustainment; instrumentation and monitoring; and tools to improve the efficiency of legacy software analysis, integration, and evolution.\n• Seek opportunities to modify the open solicitation to address emerging DoD software technology needs. \n• Speed the transition of software research and development that increases the affordability of acquisition programs in accordance with the DoD’s Better Buying Power initiative.\n• Continue to improve the efficiency of existing DoD sustainment activities by investing in new tools and techniques to make correcting, upgrading, or adapting legacy code more efficient.\n• Continue the exploration of model-based design for systems-of-systems to allow scaling-up to DoD-scales.\n• Enhance the software engineering collaboration environment.\n• Complete transition of the underlying software techniques for graphical composition of scalable models developed by non-domain experts.  \n• Continue to identify which techniques supporting model-based design of complex, heterogeneous, software intensive systems are sufficiently mature for transition into industrial practice, which require further research investment, and which should be abandoned. \n• Continue to identify evidence-based measures of the effectiveness of various software tools and acquisition practices on the costs of DoD programs.\n• Continue investigating tools for constructing and analyzing timed models of cyber-physical systems.\n• Continue and expand work to reduce software bloat and speed up execution time in C, C++, and other-languages.\n• Continue analysis of Adaptive Quality of Service (AQoS) mechanisms that are being developed in an effort to help increase the performance of distributed software systems.\n• Continue analysis of software engineering acquisition data to determine Return on Investment.\n• Complete development of a technology roadmap in Producibility, and use the SEI FFRDC as a trusted advisor."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "•  Number of tools developed which enable the specification of interface formalisms, the definition of component interfaces, and the checking of correct composition.\n•  Demonstrable reduction in the number of vulnerabilities and errors detected in software code of large software systems.\n•  Number of transitions of promising systems and software engineering technologies to the DoD and DIB, and successful adoption of technologies by early adopter partners.\n•  Observed improvements in cost, schedule, and performance via advances in the producibility of software for complex DoD systems and the productivity of software developers. \n•  Number of multiple, active collaborations achieved between Software Producibility performers and the broader software engineering research community.\n•  Number of coordinated and Joint activities across research efforts."
                        }
                    }
                }
            ]
        }
    }
}