{
    "id": "c6dfc437f8c0116fe2125cef1b6c8d9837e27f2f",
    "meta": {
        "filename": "dod-2014_RDTE_2014_NAVY_BA1_3_RDTE_MasterJustificationBook_Navy_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Navy_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603747N"
        },
        "ProgramElementTitle": {
            "val": "Undersea Warfare Advanced Tech"
        },
        "R1LineItemNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "43.729"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "43.729"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Advanced Technology Development (PE 0603673N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.3 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nAll Navy advanced technology development in undersea target detection, classification, localization, tracking and neutralization is funded through this PE.  The related technologies being developed are aimed at enabling Sea Shield, one of the three core operational concepts detailed in the Naval Transformational Roadmap.  Associated efforts focus on new Anti-Submarine Warfare (ASW) operational concepts that promise to improve wide-area surveillance, detection, localization, tracking and attack capabilities against quiet adversary submarines operating in noisy and cluttered shallow water environments.  The focus is on leveraging technologies that will protect the country's current capital investment in surveillance, submarine, surface ship and air ASW assets.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "41.959"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "43.729"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.770"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.770"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2916"
                    },
                    "ProjectTitle": {
                        "val": "Undersea Warfare Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "38.729"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "38.729"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "All Navy advanced technology developments in undersea target detection, classification, localization, tracking and neutralization are funded through this project.  Technologies being developed within this project are aimed at enabling Sea Shield, one of the three core operational concepts detailed in the Naval Transformational Roadmap. Associated efforts focus on new ASW operational concepts that promise to improve wide-area surveillance, detection, localization, tracking and attack capabilities against quiet adversary submarines operating in noisy and cluttered shallow water environments. Related efforts are aimed at leveraging technologies that will protect the country's current capital investment in surveillance, submarine, surface ship and air ASW assets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ANTI-SUBMARINE WARFARE (ASW) DISTRIBUTED SEARCH"
                                    },
                                    "Description": {
                                        "val": "ASW Distributed Search focuses the development of technologies for the non-covert tactical search for undersea targets ranging from hours to weeks using automated sensor systems deployed around operating areas including along key transit routes to protect naval\/maritime forces, around temporarily fixed sea base regions and naval force operating areas, or around fixed defensive regions and areas of interest such as key US\/Allied ports. \"Non-covert\" implies availability of airborne assets for sensor deployment (although other means may also be used), and the ability to employ active sonar along with passive and non-acoustic methods. \"Search\" is conducted in concentrated areas, typically exploiting cues received from surveillance systems. The submarine target must be detected beyond its weapons release range. The objective is to develop rapidly deployable systems employing automated detection and classification capabilities for use in both shallow and deep water operating environments. Distributed Search supports the ASW protected passage Maritime Shield operational constructs. Related efforts include the development of distributed systems employing optimization as well as active acoustic sensing and processing techniques, navy-unique transduction and underwater networking technology. Efforts also include the development of Unmanned Undersea Vehicle-based and affordable off-board deployable sensing systems employing persistent detection concepts and components. These efforts provide an extended reach of organic platform-based systems through the use of new sensor concepts, improved materials for advanced sensors, optimized deployment, employment, and automated operation of distributed sensor fields. The cornerstone of Distributed Search is the development of rapidly deployable, long-endurance active sensors with automated processing suitable for use in a wide variety of operational environments.\n\nDecrease from FY 2012 to FY 2013 is due to realignment of Future Naval Capabilities (FNCs) SHD-FY10-02 ASW Command Level Training and SHD-FY10-02 Operator Training to R2 Activity SEA SHIELD in PE 0603673N."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.862"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of high fidelity computer-based simulation training with linked architecture that supports ASW training from the operator-level to the ASW Commander-level applicable to both surface and air platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ANTI-SUBMARINE WARFARE (ASW) PERFORMANCE ASSESSMENT"
                                    },
                                    "Description": {
                                        "val": "The goal of this work is to integrate ocean and atmospheric environmental characteristics with sensor performance predictions in order to develop algorithms and Tactical Decision Aids (TDAs) that will accurately predict overall sensor performance in a given environment in near real-time for both present and future situations. The results of these research efforts in conjunction with embedded state-of-the-art command and operator-level training will facilitate the optimum employment of ASW sensor systems, thus increasing their effectiveness and potentially decreasing the number of sensors used to provide coverage in a given area. This work will provide operational commanders with sensor performance predictions which allow them to accurately judge the performance of those sensors, as well as information with which to deploy them for the greatest operational effect. It will also provide information as to how the performance evolves over time due to effects such as the deformation of sensor locations by currents, sound velocity profile changes, geologic magnetic interference changes, or changes to the optical properties of the water, etc. The effort includes performance predictions for fields of sensors as well as individual sensors themselves and applies to both acoustic and nonacoustic sensors.\n\nWork includes development of ASW sensor and system performance models, and realistic simulations and measures of effectiveness that incorporate and exploit critical environmental knowledge. It includes efforts to couple ocean dynamics and acoustics, characterize ambient noise in the littorals, measure and model acoustic and optical propagation and scattering in complex environments, develop algorithms to extract environmental information from through-the-sensor measurements and quantification and prediction of uncertainty. This information is combined with the operating characteristics of particular sensors (or groups of sensors) to provide predictions of sensor performance in the environment at that particular time and in the future. The predictions will also include assessments of the prediction uncertainty due to environmental measurement and sensor performance uncertainties.\n\nThis work aligns principally with the Assure Access and Hold at Risk S&T Focus Area in the Naval S&T Strategic Plan and contributes measurably to the Operational Environments S&T Focus Area strategic objectives.\n\nThe FY 2012 to FY 2013 funding decrease is due to the realignment of Future Naval Capabilities (FNCs) SHD-FY09-01 Drifting System Placement and Source Control Algorithm, SHD-FY09-01 In-Situ Environmental Characterization and System Monitoring and SHD-FY09-01 Mobile System Placement, Source Control, and Pattern Keeping Algorithm to R2 Activity SEA SHIELD in PE 0603673N."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.040"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued a research effort focusing on distributed system in-situational environmental characterization and system monitoring.\n- Continued a research effort to determine the placement of and follow-on control and pattern keeping of acoustic sources and mobile distributed sensor systems.\n- Continued research effort aimed at the ideal placement of acoustic sources and drifting sensor systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ANTI-SUBMARINE WARFARE (ASW) SURVEILLANCE"
                                    },
                                    "Description": {
                                        "val": "ASW Surveillance focuses on dramatically improving detection, classification, and localization capabilities in large ocean areas relative to the capabilities of legacy ASW surveillance systems. The related technologies support the conduct of covert wide-area surveillance ranging from one day to six months. The objectives are to develop and demonstrate technologies that provide clandestine indications and warnings in far forward and contested operating areas and in complex operational environments against all submarine threats including new threats with unknown target signatures and tactics. Covertness implies use of non-observable platforms and\/or deployed automated sensors employing passive sonar or other non-detectable methods. The surveillance process includes initial detection and classification. Efforts include the development of Unmanned Undersea Vehicle-based and affordable off-board deployable sensing systems employing a wide variety of surveillance concepts and components. These efforts focus on alternative detection phenomena, vector\/tensor sensors, automated acoustic processing, more compact and longer lasting power sources, and high bandwidth acoustic communications links.\n\nThe FY 2012 to FY 2013 funding decrease is due to the realignment of Future Naval Capabilities (FNCs) SHD-FY10-05 Vector Sensor Towed Array, SHD-FY10-05 Vector Sensor Towed Array Signal Processing, SHD-FY12-03 Active Sonar Automation, SHD-FY12-03 Passive Sonar Automation to R2 Activity SEA SHIELD in PE 0603673N, and to the completion of Future Naval Capability (FNC) SHD-FY07-02 On-Demand DCL and the Persistent Littoral Undersea Surveillance (PLUS) INP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.184"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued the On-Demand Detection Classification and Localization (ODDCL) effort focusing on the development of sensor and platform designs and key components compatible with a notional Concept of Operations.\n- Continued system level design and integration for ODDCL.\n- Continued development of a tactical area prototype system for Persistent Littoral Undersea Surveillance (PLUS).\n- Continued system level integration and testing for ODDCL.\n- Continued development of a vector sensor towed array and associated signal processing with performance nominally equivalent to a \"thin-line\" (TB-29) twin-line towed array to be compatible with the existing TB-29 array handling system.\n- Continued a PLUS prototype system simulation test in preparation for FY 2012 at-sea experiments.\n- Continued analysis of data collected during the FY 2011 PLUS at-sea experiments.\n- Continued two at-sea experiments focused on increasing system adaptation and optimization capabilities.\n- Completed analysis of data collected during the FY 2010 PLUS at-sea experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "UNDERSEA WEAPONRY"
                                    },
                                    "Description": {
                                        "val": "Undersea Weaponry focuses on the development of enabling technologies to counter threat submarines and surface vessels by increasing Probability of Kill (PK) and platform survivability.  Weapon technology focus areas include: the Lightweight Torpedo Technologies (LTT) and the Compact Rapid Attack Weapon (CRAW) projects. The ultimate goal of this activity is to provide revolutionary capabilities needed to fill Sea Shield Warfighter Capability Gaps, to accommodate unique payload limitations through the development of modular and reduced sized undersea weapons based on common technology enablers (where possible), and to provide improved submarine cuing\/wide area search in deep and shallow water ocean areas while providing the capability to rapidly transition the submarine mission to engagement\/neutralization.\n\nThe FY 2012 to FY 2013 funding decrease is due to the realignment of Future Naval Capability (FNC) SHD-FY11-01 Torpedo Common Hybrid Fuzing System to R2 Activity SEA SHIELD in PE 0603673N, and the completion of Future Naval Capability (FNC) SHD-FY07-02 Compact Rapid Attack Weapon."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.643"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued LTT integration of broadband and adjunct sensors for in-water data collection to result in a new dual-mode sensor guidance and control system for at-sea testing.\n- Continued feasibility investigations under LTT to quantify adjunct sensor configurations and signal processing approaches to enable positive discrimination of artificial targets at standoff ranges. This feasibility investigation is expected to result in five (5) new patent applications.\n- Continued LTT sensor package development to achieve integrated coherent broadband sonar and novel adjunct sensors homing and classification capabilities for lightweight torpedo (LWT).\n- Continued development and integration of adjunct sensors into a lightweight torpedo sensor and design signal processing and data fusion techniques to improve target classification in areas of high contact density.\n- Continued in-water data collection for development of advanced counter countermeasure processing, weapon-to-weapon acoustic communication and a salvo vehicle intelligent controller.\n- Continued demonstration of LTT underwater acoustic communications capability to enable coordinated attack and net-centric connectivity.\n- Continued demonstration of LTT weapon salvo capability utilizing behavior-based control.\n- Continued new FNC Program for Torpedo Common Hybrid Fusing System.\n- Completed  development of a reduced size\/weight CRAW for air deployment.  This effort will include sensor, guidance and control, warhead, and air frame integration tasks.\n- Completed  CRAW in-water data collection to support development of guidance and control algorithms enabling an ASW offensive capability in the Common Very Lightweight Torpedo.\n- Completed  tests to support the development of a CRAW warhead that will achieve required performance against submarine targets, and demonstrate feasibility of achieving final goal.\n- Completed in-water data collection on CRAW homing in presence of countermeasures."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Improve target detection, localization, and tracking and increase attack capabilities by providing the following capabilities:\n- Localization of 85% or more of enemy submarines in far forward or contested waters with false locations of less than 10% of total calls.\n- Effective cueing of an attack from a distance of up to 200nm.\n- Improvement of the Lightweight Torpedo (Mk 54). Specific improvements are classified.\n- Extending deep water active distributed system lifetime to a few months with a probability of detection (Pd) of 90% within 4 hours (field configuration) or 90% per crossing (barrier configuration), with a False Alarm Rate (FAR) of no more than 4\/day.\n- Delivery from a Vertical Takeoff Unmanned Air Vehicle (VTUAV) and\/or a long-range, high-speed Unmanned Air Vehicle (UAV) a compact undersea weapon capable of a high Probability of Kill (PK) given precise target localization.\n- Detection and localization performance with a single-line vector sensor array nominally equivalent or superior to that of two coherently processed TB-29A arrays. Acquisition costs to be competitive with the cost of a current TB-29A and at least 30% less than the cost of two arrays. Sensor and telemetry packaging will be adequate to achieve neutral buoyancy in an existing TB-29A form factor with array power efficiency greater than 75%. Array handling will be compatible with the existing TB-29 handling system.\n\nIncrease sensor to shooter performance and the effective lifetime of distributed ASW search systems by:\n- Achieving a drifting active distributed system lifetime of at least two days in areas of tactical significance while maintaining required system performance with a minimum number of sensor nodes.\n- Maintaining an effective lifetime of a month for mobile active distributed systems when subjected to the action of eddies from a major ocean current.\n- Predicting reseed 6 hours before performance degrades.\n- Holding the Area of Uncertainty (AOU) to no larger than 10 nm2 for an hour after initial detection through the control of the coherent sources.\n\nThrough a combination of better Anti-Submarine Warfare (ASW) command-level training and improved operator training provide the following:\n- Improve the ability of active sonar operators to detect targets and reject potential false alarms compared to current simulation based training.\n- Increase Pd by 50%.\n- Provide a decrease in FAR by a factor of two.\n- Provide a reduction in the probability of a hit on a High Value Unit (HVU) by a factor of two.\n- Improve the ability of the ASW Commander to position assets to increase coverage, reduce active system interference and deal effectively with competing missions.\n- Reduce training cost by greater than 80% and increase the frequency of training opportunities by greater than 600% relative to live training."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "ASW Research Prog - Cong"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "This effort provides research into sensor development and understanding environmental acoustic clutter and noise (scattering and propagation processes) in shallow and deep water, particularly in the Western Pacific.  Additional efforts focus on turbulent and surface wave processes important for ASW signature development.  Oceanographic institutions conduct extensive at-sea experimentation."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}