{
    "id": "cbb51c28eb14c681074fe9ef37941ca7bbfc5bb5",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605798D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Technology Analysis"
        },
        "R1LineItemNumber": {
            "val": "159"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "16.858"
            },
            "CurrentYear": {
                "val": "12.056"
            },
            "BudgetYearOne": {
                "val": "8.362"
            },
            "BudgetYearOneBase": {
                "val": "8.362"
            },
            "BudgetYearTwo": {
                "val": "17.380"
            },
            "BudgetYearThree": {
                "val": "18.880"
            },
            "BudgetYearFour": {
                "val": "17.998"
            },
            "BudgetYearFive": {
                "val": "18.252"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Critical Technology Assessments project transfers from the USD (A&T) Critical Technology Support program element (PE) 0605110D8Z to the Defense Technology Analysis PE 0605798D8Z in FY 2014."
        },
        "ProgramElementMissionDescription": {
            "val": "The Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) is the principal staff advisor to the Under Secretary of Defense for Acquisition, Technology & Logistics (USD(AT&L)) and the Secretary and Deputy Secretary of Defense for research and engineering (R&E) matters.  In this capacity, the ASD(R&E) has the responsibility to conduct analyses and studies; develop policies; provide technical leadership, oversight and advice; make recommendations; and issue guidance for DoD R&E programs.  Additionally, the ASD(R&E) provides technical support to the USD(AT&L) on R&E aspects of programs subject to review by the Defense Acquisition Board, to include assessments of technology maturity consistent with DoD acquisition policy.  The mission of the DoD R&E program is to create, demonstrate, prototype, and apply technology that enables affordable and decisive military superiority.  Pursuing the R&E mission requires attention to:  (1) identification and development of new technological opportunities; (2) insertion of new technologies into warfighting systems and operations; and (3) management and evaluation of the effectiveness of technology programs.  This program element provides mission support to the Office of the ASD(R&E) (OASD(R&E)) covering a wide range of studies and analysis in support of the R&E program and it impacts the Department's decision to fund RDT&E efforts.  \n\nThe program element provides funding for the Defense Laboratory Office within the OASD(R&E)).  The Defense Laboratory Office advocates and invests in the DoD laboratory system in three areas:  (1) facilities and infrastructure; (2) quality of workforce; and (3) global insight of critical or strategic technologies important to the Department and the Nation.\n\nThe program element provides engineering, scientific, and analytical support to the Office of the Deputy Assistant Secretary of Defense for Research in its responsibility for direction, overall quality, and content of the science and technology (S&T) program and ensures that the technology being developed is affordable and minimizes system development risk.  The Defense Technology Analysis program conducts assessments and analysis to ensure maximum utilization of research and development funds to accomplish the overall objectives of the S&T program.  Funds are required for technical, analytical and management support, equipment and supplies, travel, and publications.\n\nThe DoD's key expertise for reviewing and guiding R&E programs resides in the OASD(R&E).  The OASD(R&E) staff augment their responsibilities through their connections to technology experts in various fields throughout academia, industry, and government.  The Defense Support Teams project supports the directed responsibilities by building teams of technology experts to conduct program technical assessments.  The teams analyze the key engineering problem areas and offer adjustments in the development and test plan; alternate technical approaches; or new technologies that could enable successful development.  The teams provide unbiased reviews and gather advice from the Nation's leading technical experts.\n\nThe program element provides funding for Critical Technology Assessments within OASD(R&E).  Critical Technology Assessments provide the technical reference guidance in support of development and implementation of DoD technology security policies on international transfers of defense related goods, services, and technologies.  The program provides an ongoing assessment and analysis of global goods and technologies; determines significant advances in the development, production, and use of military capabilities by potential adversaries; and determines goods and technologies being developed worldwide with potential to significantly enhance or degrade U.S. military capabilities in the future."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "15.582"
                },
                "CurrentYear": {
                    "val": "12.056"
                },
                "BudgetYearOne": {
                    "val": "11.981"
                },
                "BudgetYearOneBase": {
                    "val": "11.981"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.858"
                },
                "CurrentYear": {
                    "val": "12.056"
                },
                "BudgetYearOne": {
                    "val": "8.362"
                },
                "BudgetYearOneBase": {
                    "val": "8.362"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.276"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.619"
                },
                "BudgetYearOneBase": {
                    "val": "-3.619"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.281"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.619"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.619"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.005"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 baseline adjustments reflective of DoD priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P796"
                    },
                    "ProjectTitle": {
                        "val": "Laboratory Resource Management"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.975"
                        },
                        "CurrentYear": {
                            "val": "4.819"
                        },
                        "BudgetYearOne": {
                            "val": "2.389"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.389"
                        },
                        "BudgetYearTwo": {
                            "val": "4.251"
                        },
                        "BudgetYearThree": {
                            "val": "4.850"
                        },
                        "BudgetYearFour": {
                            "val": "5.119"
                        },
                        "BudgetYearFive": {
                            "val": "5.168"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Laboratory Office provides advocacy, strategic planning, and policy for the DoD's in-house laboratories.  The DoD Laboratory Enterprise consists of 67 laboratories with approximately 65,000 employees and an annual budget of more than $20.000 billion.  The Defense Laboratory Office develops plans and investment strategies for laboratory infrastructure, technology programs, and personnel development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Laboratory Office"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.975"
                                            },
                                            "Text": {
                                                "val": "•\tThe ASD(R&E)\/Research Directorate Laboratory Office identified the Core Technical Competencies (CTC) of the Defense labs, Federally Funded Research and Development Centers (FFRDCs), University Affiliated Research Centers (UARCs) and Department of Energy (DOE) laboratories\n•\tDeveloped and delivered the Unified Research & Engineering Database (URED) which combines laboratory budget data, work unit summaries and programmatic information for the DoD labs.  Information on lab budget activity (BA) one through three tasks has been compiled; Phase II has been initiated which will collect BA four through seven information.  This data will be used to assess lab performance within the identified CTCs.\n•\tInitiated tasks in support of the DoD Human Capital Strategic Plan and assessment of the state of the technical health of the DoD lab workforce."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.819"
                                            },
                                            "Text": {
                                                "val": "The ASD(R&E)\/Research Directorate Laboratory Office will refine and continue to execute laboratory management responsibilities.  Areas of emphasis include:\n•\tContinue identification and validation of Department-wide  DoD laboratory in-house CTCs;\n•\tUnderstanding Service and laboratory performance within CTCs;\n•\tEnsuring that CTCs are performing at the cutting-edge of global science, technology, and engineering;\n•\tAdvocacy for investment in CTCs; and\n•\tMeasurement of performance of the Defense Laboratory Enterprise.\n•\tComplete Phase I of the Unified Research & Engineering database which will provide budgetary and programmatic information on the in-house defense labs; data will be used to assess laboratory technical health and performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.389"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.389"
                                            },
                                            "Text": {
                                                "val": "•\tExpand data collection and analysis of UARCs, FFRDCs, and DOE laboratories to understand technical health, performance and capabilities of all laboratories within the DoD technical base.\n•\tContinue refinement and analysis of laboratory core technical capabilities; ensure laboratories are maintaining and\/or developing needed capabilities in critical mission areas."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The performance of the Laboratory Resource Management project is based on the success of initiatives to implement strategic planning objectives.  Measures include the quality and timeliness of policy, plans, guidance, and processes."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P797"
                    },
                    "ProjectTitle": {
                        "val": "Defense Technology Analysis"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.128"
                        },
                        "CurrentYear": {
                            "val": "4.796"
                        },
                        "BudgetYearOne": {
                            "val": "2.633"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.633"
                        },
                        "BudgetYearTwo": {
                            "val": "7.597"
                        },
                        "BudgetYearThree": {
                            "val": "8.374"
                        },
                        "BudgetYearFour": {
                            "val": "7.513"
                        },
                        "BudgetYearFive": {
                            "val": "7.575"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "﻿The Defense Technology Analysis (DTA) project provides engineering, scientific and analytical support to the Office of the Deputy Assistant Secretary of Defense for Research in its responsibility for direction, overall quality, and content of the science and technology (S&T) program and ensures that the technology being developed is affordable and minimizes system development risk.  The DTA program conducts assessments and analyses to ensure maximum utilization of research and development funds to accomplish the overall objectives of the S&T program.  Funds are required for technical, analytical, and management support, travel, and publications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD Technology Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.128"
                                            },
                                            "Text": {
                                                "val": "The Defense Technology Analysis program funded over fifty efforts in FY 2012.  The funded efforts were primarily technical and programmatic support using Federally Funded Research and Development Centers (FFRDCs) and technical support services.  Activities included workshops, development of congressional reports, completion of focused studies, and access to technical expertise in support of the DoD research and engineering (R&E) program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.796"
                                            },
                                            "Text": {
                                                "val": "Provide engineering, scientific, analytical, and managerial support to the Office of the Deputy Assistant Secretary of Defense for Research in:\n•\tDeveloping strategies, plans, and policies to develop and exploit technology; \n•\tConducting technology analyses, making recommendations, and developing guidance for S&T plans and programs;\n•\tReviewing acquisition programs and making recommendations to optimize effectiveness of the DoD investments; \n•\tOversight of S&T issues and initiatives and responding to Congressional special interests;\n•\tSeeking opportunities for interdepartmental and international cooperation in high priority S&T.  Conduct intradepartmental coordination to achieve goals as necessary."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.633"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.633"
                                            },
                                            "Text": {
                                                "val": "Provide engineering, scientific, analytical, and managerial support to the Office of the Deputy Assistant Secretary of Defense for Research in:\n•\tDeveloping strategies, plans, and policies to develop and exploit technology; \n•\tConducting technology analyses, making recommendations, and developing guidance for S&T plans and programs;\n•\tReviewing acquisition programs and making recommendations to optimize effectiveness of the DoD investments; \n•\tOversight of S&T issues and initiatives and responding to Congressional special interests;\n•\tSeeking opportunities for interdepartmental and international cooperation in high priority S&T.  Conduct intradepartmental coordination to achieve goals as necessary."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Several indicators allow the Department to measure the success of the DTA program element:\n•\tThe number of efforts funded and completed satisfactorily and the OASD(R&E) influence on S&T program decisions serve as valuable indicators of the program’s effectiveness.\n•\tFeedback into the oversight mechanisms of the program to guide investment decisions serve as additional metrics."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P798"
                    },
                    "ProjectTitle": {
                        "val": "Defense Support Teams"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.755"
                        },
                        "CurrentYear": {
                            "val": "2.441"
                        },
                        "BudgetYearOne": {
                            "val": "2.400"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.400"
                        },
                        "BudgetYearTwo": {
                            "val": "4.502"
                        },
                        "BudgetYearThree": {
                            "val": "4.032"
                        },
                        "BudgetYearFour": {
                            "val": "3.715"
                        },
                        "BudgetYearFive": {
                            "val": "3.827"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department's key expertise for reviewing and guiding research and engineering (R&E) programs resides in the Office of the Assistant Secretary of Defense for Research and Engineering (OASD(R&E)).  The OASD(R&E) staff augments their responsibilities through connections to technology experts in various fields throughout academia, industry, and government.  The Defense Support Teams project supports the directed responsibilities by building teams of technology experts to conduct program technical health check-ups.  The teams analyze the key engineering problem areas and offer adjustments in the development and test plans; alternate technical approaches; or new technologies that could enable successful development.  The teams provide unbiased reviews and gather advice from the Nation’s leading technical experts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Support Teams"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.755"
                                            },
                                            "Text": {
                                                "val": "Established support teams and conducted technology analyses to support R&E program investment decisions.  Continued or completed teams established in FY 2011.  Reviewed in technical detail the respective program issues and offer technical solutions to program managers.  Assessed the maturity of technologies that are candidates for transitioning to an acquisition program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.441"
                                            },
                                            "Text": {
                                                "val": "Establish support teams and conduct technology analyses to support R&E program investment decisions.  For selected acquisition programs and efforts, review in technical detail the respective program issues and offer technical solutions to program managers. Assess the maturity of technologies that are candidates for transitioning to an acquisition program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Text": {
                                                "val": "Establish support teams and conduct technology analyses to support R&E program investment decisions.  For selected acquisition programs and efforts, review in technical detail the respective program issues and offer technical solutions to program managers.  Assess the maturity of technologies that are candidates for transitioning to an acquisition program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Several indicators allow the Department to measure the success of the DTA program element:\n•\tThe number of technological introspections as evidenced by completed support teams and OASD(R&E) influence on acquisition decisions serve as valuable indicators of the program’s effectiveness.\n•\tThe establishment and outputs of Defense Support Teams are additional indicators of program metrics.\n•\tFeedback into the oversight mechanisms of the S&T program to guide investment decisions serve as additional metrics."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P579"
                    },
                    "ProjectTitle": {
                        "val": "Critical Technology Assessments"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.940"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.940"
                        },
                        "BudgetYearTwo": {
                            "val": "1.030"
                        },
                        "BudgetYearThree": {
                            "val": "1.624"
                        },
                        "BudgetYearFour": {
                            "val": "1.651"
                        },
                        "BudgetYearFive": {
                            "val": "1.682"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This effort was realigned from PE 0605110D8Z USD(A&T) Critical Technology Support to PE 0605798D8Z Defense Technology Analysis, P579 Critical Technology Assessments beginning in FY 2014."
                        },
                        "ProjectMissionDescription": {
                            "val": "Critical Technology Assessments provide the technical reference guidance in support of development and implementation of DoD technology security policies on international transfers of defense related goods, services, and technologies.  The export control program provides an ongoing assessment and analysis of global goods and technologies.  Determines significant advances in the development, production, and use of military capabilities by potential adversaries.  Determines goods and technologies being developed worldwide with potential to significantly enhance or degrade U.S. military capabilities in the future.  Identified in the Export Administration Act of 1979 and extended by Presidential Executive Order to review militarily critical goods and technologies and to consider worldwide technology capabilities.  The Militarily Critical Technologies List (MCTL) is a congressionally mandated source document for identification of leading edge and current technologies monitored worldwide for national security, nonproliferation control of weapons of mass destruction, and advanced conventional weapons.\n\nSpecific activities include:\n- Monitor and assess dual-use and military technologies worldwide.\n- Assist in the development of proposals for negotiation in various multilateral export control regimes.\n- Provide limited worldwide technology capability assessments for the MCTL and other U.S. international critical technologies efforts.\n- Identify and determine technical parameters for proposals for international control of weapons of mass destruction.\n- Identify foreign technologies of interest to the DoD and opportunities for international cooperative research and development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Critical Technology Assessments"
                                    },
                                    "Description": {
                                        "val": "Critical Technology Assessments provide the technical reference guidance in support of development and implementation of DoD technology security policies on international transfers of defense related goods, services, and technologies.  The export control program provides an ongoing assessment and analysis of global goods and technologies.  Determines significant advances in the development, production, and use of military capabilities by potential adversaries.  Determines goods and technologies being developed worldwide with potential to significantly enhance or degrade U.S. military capabilities in the future.  Identified in the Export Administration Act of 1979 and extended by Presidential Executive Order to review militarily critical goods and technologies and to consider worldwide technology capabilities.  The Militarily Critical Technologies List (MCTL) is a congressionally mandated source document for identification of leading edge and current technologies monitored worldwide for national security, nonproliferation control of weapons of mass destruction, and advanced conventional weapons."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.940"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.940"
                                            },
                                            "Text": {
                                                "val": "- Maintain technical interface to export technology security organizations and functions.\n- Maintain interface with user community for critical technology assessments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0605110D8Z, P110"
                                    },
                                    "Title": {
                                        "val": "USD(A&T) Critical Technology Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.425"
                                        },
                                        "CurrentYear": {
                                            "val": "0.840"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "This effort was realigned from PE 0605110D8Z USD(A&T) Critical Technology Support to PE 0605798D8Z Defense Technology Analysis, P579 Critical Technology Assessments beginning in FY 2014."
                        },
                        "PerformanceMetrics": {
                            "val": "- Currency of the user community of critical technology assessments."
                        }
                    }
                }
            ]
        }
    }
}