{
    "id": "d2447b1f6229b7d0d6cabad034134e78d4dd0919",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0605151D8Z"
        },
        "ProgramElementTitle": {
            "val": "Studies and Analysis Support - OSD"
        },
        "R1LineItemNumber": {
            "val": "148"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "6.457"
            },
            "BudgetYearOne": {
                "val": "5.871"
            },
            "BudgetYearOneBase": {
                "val": "5.871"
            },
            "BudgetYearTwo": {
                "val": "6.327"
            },
            "BudgetYearThree": {
                "val": "6.083"
            },
            "BudgetYearFour": {
                "val": "6.161"
            },
            "BudgetYearFive": {
                "val": "6.853"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Service programs were established by the Secretary of Defense to improve the training and readiness of the Active and Reserve Components.  This project expedites the prototype development of new training and readiness technologies and Joint Service training and readiness systems, which improve the training and readiness effectiveness and enhance the performance of the military forces.  It facilitates the sharing of training and readiness information, while allowing for the transfer of emerging and innovative technologies among the Services and private sector.  In addition, this project supports OSD (P&R) and DoD training managers (OSD, Joint Staff, Unified Commands, and the Services) in promoting more efficient and effective use of training resources, increasing the effectiveness of military training, and enhancing the readiness and performance of the military forces.  Projects analyze the contributions to readiness of various training techniques and programs and use the results to expedite new training concepts and procedures that increase unit effectiveness or decrease costs.  Emphasis is placed on developing analytical tools and systematic methodologies to improve training resource allocations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "6.457"
                },
                "BudgetYearOne": {
                    "val": "6.460"
                },
                "BudgetYearOneBase": {
                    "val": "6.460"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "6.457"
                },
                "BudgetYearOne": {
                    "val": "5.871"
                },
                "BudgetYearOneBase": {
                    "val": "5.871"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.589"
                },
                "BudgetYearOneBase": {
                    "val": "-0.589"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.589"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.589"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Supports OSD (P&R) and DoD training managers (OSD, Joint Staff, Unified Commands, and the Services) in promoting more efficient and effective use of training resources, increasing the effectiveness of military training, and enhancing the readiness and performance of the military forces.  Projects analyze the contributions to readiness of various training techniques and programs and use the results to expedite new training concepts and procedures that increase unit effectiveness or decrease costs. Emphasis is placed on developing analytical tools and systematic methodologies to improve training resource allocations."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Training & Readiness System Development Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "6.457"
                        },
                        "BudgetYearOne": {
                            "val": "5.871"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.871"
                        },
                        "BudgetYearTwo": {
                            "val": "6.327"
                        },
                        "BudgetYearThree": {
                            "val": "6.083"
                        },
                        "BudgetYearFour": {
                            "val": "6.161"
                        },
                        "BudgetYearFive": {
                            "val": "6.853"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Service programs were established by the Secretary of Defense to improve the training and readiness of the Active and Reserve Components.  This project expedites the prototype development of new training and readiness technologies and Joint Service training and readiness systems, which improve the training and readiness effectiveness and enhance the performance of the military forces.  It facilitates the sharing of training and readiness information, while allowing for the transfer of emerging and innovative technologies among the Services and private sector.  In addition, this project supports OSD (P&R) and DoD training managers (OSD, Joint Staff, Unified Commands, and the Services) in promoting more efficient and effective use of training resources, increasing the effectiveness of military training, and enhancing the readiness and performance of the military forces.  Projects analyze the contributions to readiness of various training techniques and programs and use the results to expedite new training concepts and procedures that increase unit effectiveness or decrease costs.  Emphasis is placed on developing analytical tools and systematic methodologies to improve training resource allocations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Service Training & Readiness System Development"
                                    },
                                    "Description": {
                                        "val": "The Joint Service programs were established by the Secretary of Defense to improve the training and readiness of the Active and Reserve Components.  This project expedites the prototype development of new training and readiness technologies and Joint Service training and readiness systems, which improve the training and readiness effectiveness and enhance the performance of the military forces.  It facilitates the sharing of training and readiness information, while allowing for the transfer of emerging and innovative technologies among the Services and private sector.  In addition, this project supports OSD (P&R) and DoD training managers (OSD, Joint Staff, Unified Commands, and the Services) in promoting more efficient and effective use of training resources, increasing the effectiveness of military training, and enhancing the readiness and performance of the military forces.  Projects analyze the contributions to readiness of various training techniques and programs and use the results to expedite new training concepts and procedures that increase unit effectiveness or decrease costs.  Emphasis is placed on developing analytical tools and systematic methodologies to improve training resource allocations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "• Provided options for reducing force structure;\n• Developed alternative approaches to Force Generation and Management;\n• Developed a strategy for open source development of a virtual world (VW) software framework optimizing web-based communications protocols;\n• Developed flexible force structure concept plan for reduction and expansion of the force depending upon varying world situations;\n• Identified social media tools capable of data mining to enhance education by harnessing the large amounts of unstructured and structured data available to enhance an individual learner’s potential, this is foundation work for our partnership with the Department of Education;\n• Developed methodologies for preventing and managing prescription drug misuse among uniform personnel;\n• Assessed the effects on readiness and retention on the addition of synthetic cannabinomimetics to the panel of random tested drugs, completed initial work toward the development of cost effective screening techniques;\n• Provided options to lower or stop suicide rates, data collection research focused the Department’s ability to collect, standardize, and analyze related data;\n• Developed criteria for Cyberspace Operations Workforce;\n• Conducted capabilities based assessment (CBA) of stability operations, captured lessons learned;\n• Investigated options for use of agile software in training environments leading to more efficient methodologies;\n• Ensured 5th generation fighter training interoperability increasing training efficiencies;\n• Investigated radio frequency (RF) spectrum options for instrumented air combat training (ACT), future RF spectrum will be limited, so needed to plan now;\n• Assessed requirements for full-time support to the Reserve components as mandated by Congress (i.e., Section 514 of S.1253);\n• Determined the feasibility of the Regional Integrated Training Environment (RITE) concept prior to moving forward with a formal strategic communications and education effort and determine best approach for concept implementation;\n• Determined the knowledge, skills, and abilities for effective diversity management leaders;\n• Assessed prevalence of Total Force “reuse;”\n• Developed model to assess future enlisted force profiles in a dynamic environment;\n• Developed improved methods to identify potential security and insider threats; and\n• Evaluated and optimized training for sexual assault prevention and response as mandated by Congress (PL 111-383)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.457"
                                            },
                                            "Text": {
                                                "val": "• Continue to develop VW technology to support DoD training; a VW Framework (VWF) which includes an overarching architecture encompassing a number of VW applications, as well as a VW Roadmap and Governance process to implement the VWF with potential to drastically reduce the Department’s $9.1B modeling and simulation bill;\n• Continue to monitor and develop strategies to relieve stress on the force increasing overall health of the force;\n• Continue to analyze training requirement to support the new DoD Strategy for Operating in Cyberspace;\n• Continue to identify and analyze the specific benefits of early and effective incorporation of system training details into acquisition programs, particularly those with significant human systems interface requirements;\n• Provide SECDEF options for reducing force structure that will conform to budgetary limitations without creating a “hollow force;”\n• Continue to provide options to lower or stop suicide rates;\n• Continue to develop alternative approaches to Force Generation and Management that will include a reasonable capability for expansion to meet changing world situations;\n• Continue to examine alternative Courses of Action (COA) for moving RITE from concept to operational capability;\n• Continue to develop and test multiple COAs to provide OASD (RA) leadership with the means to make an informed decision on how best to engage with Services to generate future operational force training and facility cost efficiencies and effectiveness;\n• Continue to plan and assess training requirements for non-standard force requirements;\n• Assess lessons learned from this period of extended hostilities to include changes in accession standards, expanded family programs, etc.;\n• Continue to investigate the opportunities for a continuum of service; and \n• Continue the evaluation and optimization of training for sexual assault prevention and response."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.871"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.871"
                                            },
                                            "Text": {
                                                "val": "• Continue to develop VW technology to support DoD training; a VWF which includes an overarching architecture encompassing a number of VW applications, as well as a VW Roadmap and Governance process to implement the VWF;\n• Assess lessons learned on managing the force in a dynamic environment including self-selection for successive deployments;\n• Continue to assess workforce skills and analyze training requirement to support the DoD Strategy for Operating in Cyberspace;\n• Continue to identify and analyze the specific benefits of early and effective incorporation of system training details into acquisition programs, particularly those with significant human systems interface requirements;\n• Evaluate effectiveness of SECDEF options provided for reducing force structure;\n• Continue to review current programs and provide options to lower or stop suicide rates;\n• Implement policy changes from drug demand reduction program;\n• Continue collaborative efforts to validate the performance of the commercial screening technology, determine the prevalence of use of these drugs in Service member samples, develop appropriate screening and confirmation cutoff concentrations, and develop confirmation procedures;\n• Update alternative approaches to Force Generation and Management;\n• Continue to plan and assess training requirements for non-standard force requirements;\n• Assess changes in accession standards during the drawdown;\n• Develop and evaluate expanded family programs;\n• Continue to investigate the opportunities for a continuum of service; \n• Modify the Request for Forces(RFF) system and process to meet the needs of the COCOMs;\n• Develop a model that calculates the cost and discounted present value of alternative military career management paradigms; and\n• Continue analyses of existing cultural training programs and assess developments in the area of cultural competency training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Each project contained within this program contains specific metrics to determine progress towards completion. Metrics for all include completed and documented analysis provided by the performer. The completion date for that analysis varies with each project. In addition, to that analysis, each effort contains a roadmap addressing the best use of the findings throughout the department. If the results of the analysis show benefit to the Department, those findings are included in policy, doctrine, tactics and procedures."
                        }
                    }
                }
            ]
        }
    }
}