{
    "id": "d7177b6d4d3d2189725f4cf5d25143df2ae89d61",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603618D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Electronic Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "40"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.588"
            },
            "CurrentYear": {
                "val": "6.983"
            },
            "BudgetYearOne": {
                "val": "9.009"
            },
            "BudgetYearOneBase": {
                "val": "9.009"
            },
            "BudgetYearTwo": {
                "val": "14.196"
            },
            "BudgetYearThree": {
                "val": "14.474"
            },
            "BudgetYearFour": {
                "val": "13.613"
            },
            "BudgetYearFive": {
                "val": "10.281"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Department of Defense must be ready to meet the widespread and growing proliferation of asymmetric electronic threats that are proliferating at an alarming rate, enabled by widely available commercial electronic components and devices.  These range from improvised devices constructed from commercially available electronic and industrial components to dedicated military devices that could be used in ways that diminish our technological advantage in conflicts with nation-states.  The surprisingly fast appearance of these threats is accelerating and is now happening faster than the requirements and acquisition process can respond.\n\nThe use of asymmetric devices is well understood by terrorists and nation-states alike.  Using man portable air defense systems, mortars, and improvised explosive devices actuated by electronics components terrorists have attacked both air and ground forces and pose a threat in any region due to their portability.  Unmanned aircraft systems, also strongly enabled by electronics components are proliferating and pose a threat both as a military capability and as a potential terrorist weapons delivery mechanism.  \n\nTechnological surprise and speed of appearance are two asymmetries that highlight the need to rapidly develop and field Electronic Warfare, Information Operations and Asymmetric Warfare capabilities capable of neutralizing such threats in ways that are both fiscally and temporally responsive.  This program element investigates means to rapidly mitigate asymmetric threats by integrating advanced commercial and military off-the-shelf technologies in innovative ways and rapidly demonstrating new technological capabilities to augment and\/or reduce risk when inserted into service programs of record.  Efforts will also look for methods to employ asymmetric principles against our adversaries.\n\nBeginning in FY 2014, the Joint Electronic Advanced Technology (JEAT) project reorganized to be in better alignment with Assistant Secretary of Defense for Research and Engineering electronic warfare research priorities.  Particularly, JEAT establishes three pillars that will support the JEAT approach to innovation:  1) experimentation, 2) advanced concepts development\/demonstration, and 3) innovative technology exploration.  The overarching JEAT philosophy is to be adaptive and to help lead the pace of rapid electronic systems development and the evolving threat picture."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.112"
                },
                "CurrentYear": {
                    "val": "6.983"
                },
                "BudgetYearOne": {
                    "val": "7.634"
                },
                "BudgetYearOneBase": {
                    "val": "7.634"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.588"
                },
                "CurrentYear": {
                    "val": "6.983"
                },
                "BudgetYearOne": {
                    "val": "9.009"
                },
                "BudgetYearOneBase": {
                    "val": "9.009"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.524"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.375"
                },
                "BudgetYearOneBase": {
                    "val": "1.375"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.522"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.375"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.375"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 baseline adjustments are reflective of DoD S&T priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P619"
                    },
                    "ProjectTitle": {
                        "val": "Joint Electronic Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.588"
                        },
                        "CurrentYear": {
                            "val": "6.983"
                        },
                        "BudgetYearOne": {
                            "val": "9.009"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.009"
                        },
                        "BudgetYearTwo": {
                            "val": "14.196"
                        },
                        "BudgetYearThree": {
                            "val": "14.474"
                        },
                        "BudgetYearFour": {
                            "val": "13.613"
                        },
                        "BudgetYearFive": {
                            "val": "10.281"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) must be ready to meet the widespread and growing proliferation of asymmetric electronic threats that are proliferating at an alarming rate, enabled by widely available commercial electronic components and devices.  These range from improvised devices constructed from commercially available electronic and industrial components to dedicated military devices that could be used in ways that diminish our technological advantage in conflicts with nation-states.  The surprisingly fast appearance of these threats is accelerating and is now happening faster than the requirements and acquisition process can respond.\n\nThe use of asymmetric devices is well understood by terrorists and nation-states alike.  Using man portable air defense systems, mortars, and improvised explosive devices actuated by electronics components terrorists have attacked both air and ground forces and pose a threat in any region due to their portability.  Unmanned Aircraft Systems (UAS), also strongly enabled by electronics components are proliferating and pose a threat both as a military capability and as a potential terrorist weapons delivery mechanism.  \n\nTechnological surprise and speed of appearance are two asymmetries that highlight the need to rapidly develop and field Electronic Warfare, Information Operations and Asymmetric Warfare capabilities capable of neutralizing such threats in ways that are both fiscally and temporally responsive.  This program element investigates means to rapidly mitigate asymmetric threats by integrating advanced commercial and military off-the-shelf technologies in innovative ways and rapidly demonstrating new technological capabilities to augment and\/or reduce risk when inserted into service programs of record.  Efforts will also look for methods to employ asymmetric principles against our adversaries.\n\nBeginning in FY 2014, the Joint Electronic Advanced Technology (JEAT) project reorganized to be in better alignment with Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) electronic warfare research priorities.  Particularly, JEAT establishes three pillars that will support the JEAT approach to innovation:  1) experimentation, 2) advanced concepts development\/demonstration, and 3) innovative technology exploration.  The overarching JEAT philosophy is to be adaptive and to help lead the pace of rapid electronic systems development and the evolving threat picture.\n\nExperimentation:\n\nDistributed Electronic Effects Delivery (DEED) – An experimental venue (live, virtual and constructive) to assess emerging Electronic Warfare (EW) effects coordination and sensor technologies and catalyze the rapid creation of multi-point, collaborative delivery of EW services to warfighters.  This effort promotes innovative networked systems management capabilities to provide broad situational awareness and manage EW services delivery in a coordinated and collaborative manner.  All impacts on the ability to precisely deliver EW effects (environment, adversary spectrum activities, dynamic platform motion, etc.) while minimizing blue force side effects will be assessed.  Because this venue will employ many developmental and existing UAS, a goal is to include a component to allow assessment of the vulnerability of these UAS to EW effects.\n\nAdvanced Concepts Development\/Demonstration:\n\nAdvanced Threat Countermeasures – This effort focuses on the investigation of innovative, low cost, near-term Countermeasures (CM) solutions that can be rapidly fielded to counter new classes of advanced missile seekers.  It builds on prior work with the Services (signature collections and analyses of CM delivery mechanisms) to begin the process of assessing potential CM solutions.\n\nSoftware Programmable\/Spectrum Diverse Electronic Attack (EA) Capability – Opportunities exist to adapt existing technology used for communication and other purposes into highly configurable EA capability.  This technology will help counter adversary movement into advanced military purpose digital electronic systems.  Beginning in FY 2014 JEAT will begin to adapt software configurable communications technology to be used as part of a distributed, networked, EA capability that can be readily adapted for installation in a wide variety of host platforms.\n\nInnovative Technology Exploration:\n\nAdaptive\/Asymmetric Technology – This effort directly supports ASD(R&E), EW and CM by performing analyses and studies of emerging asymmetric threats.  Past efforts under this JEAT project include the Aircraft Survivability Equipment Joint Analysis Team and the Helicopter Survivability Task Force, both of which resulted in significant strategic technology investments by the Department."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Situational Awareness and Countermeasures"
                                    },
                                    "Description": {
                                        "val": "DoD aircraft currently use a federated architecture of sensors and CM to protect themselves against guided and unguided hostile threats while simultaneously avoiding collisions with the ground and other obstacles.  These sensors typically provide the pilot with separate displays of radar warning and missile warning to guide the pilot in selecting automatic or manual countermeasures against radar, laser, or radio frequency guided threats.  These unfused sensors create a serial information stream which can induce an inadequate response to the threat.  Federated systems consume weight, space, and power which are at a premium in small platforms.  Additionally, there currently is no coordinated effort to develop integrated situational awareness or control CM that include off-board systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.712"
                                            },
                                            "Text": {
                                                "val": "In FY 2012 Integrated Situational Awareness and Countermeasures efforts focused laying the groundwork for integrating the magnetic mirror technology into a multi-functional system that provides non-lethal hostile fire CM as well as Infrared CM.  Initial integration studies for feeding the magnetic mirror subsystem with information from advanced threat detectors were accomplished.  Also, parametric studies of the ability to provide free space laser communications and situational awareness in degraded visual environments were conducted, providing valuable information for future planning for an integrated capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Include efforts to study integration of free space laser communications capability based upon magnetically actuated optics and study\/begin to demonstrate feasibility of combining design elements with Infrared CM, Hostile Fire Detection\/CM and obstacle avoidance systems into an integrated package.\n\nRotorcraft Aircraft Survivability Equipment (RASE) Experiment – JEAT will complete its objectives during a RASE experiment in FY 2013, conducting the third and final annual RASE event.  Objectives for this event include geo-location of the point of origin of a hostile projectile, networking the point of origin information off-board and demonstrating the technical feasibility of delivering non-lethal countermeasures to the shooter."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost\/Near Term Counter Asymmetric Systems"
                                    },
                                    "Description": {
                                        "val": "Low cost, near term technologies solutions to asymmetric EW threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.996"
                                            },
                                            "Text": {
                                                "val": "In FY 2012 this project included evaluation of two advanced technology CM, Special Materials Aero Urban Decoy which was tested on the H-60 aircraft with positive results, and signature measurement of aircraft in a way that will support development of CM to a new group of advanced threats.  Finally, EW Systems Engineering Analysis focused on building knowledge base for decision makers in a critical area of interest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Complete JEAT funded efforts to gather information necessary to develop CM to an advanced new category of threats to fixed wing aircraft and rotorcraft.  \n\nBased upon the Office of the Secretary of Defense Advanced Threat study, completed in FY 2010, JEAT will continue efforts to study possible solutions to emerging threats.  JEAT will begin efforts to evaluate techniques to rapidly develop CM to advanced, fourth and fifth generation Infrared Missiles.  This will support signature measurements, modeling, technique development and evaluation as well as laboratory trials.  Create and populate data into the CM database available for broad joint service use."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Disruptive Technology Defeat and Utilization"
                                    },
                                    "Description": {
                                        "val": "Emerging and disruptive technologies analysis; rapid prototyping of technologies required to adapt counter-terrorism techniques to threats in Overseas Contingency Operations (OCO).  Primary payoff is an assessment of current system capabilities and limitations against the threat and capture of baseline system performance against the threat set for developing technologies.  JEAT will demonstrate rapid prototyping of technologies required to combat adaptive threats.  In FY 2013 the efforts of this mostly government team will include novel techniques to detect and locate the signatures of terrorist activities using electronic means.  Trident Spectre provides a venue for various members of Special Forces, Conventional Forces and Intelligence Community to collaborate on and evaluate technologies and techniques related to “Tactical Intelligence” in a technical, operational, and safe environment.  Trident Spectre provides an opportunity for capability developers (scientists, engineers, designers) to interact directly with tactical operators, collectors and analysts; and a process that correctly and efficiently reviews potential Tactical Intelligence technologies and techniques that will enhance the operational capability of the DoD activities in OCO.  Primary payoff is improved connectivity and more efficient collection and dissemination of Tactical Intelligence.  Customers include United States Central Command, Special Operations Command (SOCOM), ASD(R&E), DoD Conventional\/Special Forces, and members of the Intelligence Community.  Products include an after action report and a transition plan moving management activities from ASD(R&E)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.880"
                                            },
                                            "Text": {
                                                "val": "The primary achievement in this project in FY 2012 was the sponsorship of the Trident Spectre demonstration where a diverse set of technology (more than 100 experiments) from the DoD, Intelligence Community and industry was evaluated in a large, free play, demonstration.  This demonstration has in the past produced numerous direct technology insertions into the hands of warfighters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.983"
                                            },
                                            "Text": {
                                                "val": "Primary focus of FY 2013 efforts in Disruptive Technology Defeat and Utilization is sponsorship of the Trident Spectre demonstration for the final time before it transitions to SOCOM sponsorship in FY 2014.  Past Trident Spectre events have included more than 100 experiments and have produced technical solutions that transition directly and nearly immediately into the hands of warfighters and intelligence professionals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimentation"
                                    },
                                    "Description": {
                                        "val": "FY 2014 efforts will leverage the methodologies of past, successful JEAT experimentation efforts including the Black Dart counter UAS demonstration and the RASE to establish a new venue to investigate ways of providing distributed delivery of electronic effects.  This new venue called DEED will evaluate the ability to provide EW effects using a collaborative, distributed set of electronic systems which can provide a robust, adaptive and effective network of electronic attack delivery methods.  FY 2014 DEED participation will emphasize UAS, with future years adding surface and other delivery platforms."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.376"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.376"
                                            },
                                            "Text": {
                                                "val": "DEED – A demonstration venue (live, virtual and constructive) to assess emerging EW effects coordination and sensor technologies and catalyze the rapid creation of multi-point, collaborative delivery of EW services to warfighters.  This effort promotes innovative networked systems management capabilities to provide broad situational awareness and manage EW services delivery in a coordinated and collaborative manner.  All impacts on the ability to precisely deliver EW effects (environment, adversary spectrum activities, dynamic platform motion, etc.) while minimizing blue force side effects will be assessed.  Because this venue will employ many developmental and existing UAS, a goal is to include a component to allow assessment of the vulnerability of these UAS to EW effects is included."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Concepts Development\/Demonstration"
                                    },
                                    "Description": {
                                        "val": "Investigate low cost, near term technologies that could solve rapidly emerging, asymmetric EW problems and provide new advanced capabilities to United States forces.  Foci include threats, technological opportunity space and approaches that are not covered by existing programs of record, and include, but will not be limited to: assessment of existing military systems vulnerability to degradation by electronic attack (both air and surface domain) and UAS electronic attack vulnerability assessments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Advanced Threat Countermeasures - Focuses on the development of innovative, low cost, near-term CM solutions that can be rapidly fielded to counter new classes of advanced missile seekers.  Builds on prior work with the Services (signature collections and analyses of CM delivery mechanisms) to begin the process of assessing potential CM solutions.\n\nSoftware Programmable\/Spectrum Diverse Electronic Attack (EA) Capability – Opportunities exist to adapt existing technology used for communication and other purposes into highly configurable EA capability.  This technology will help counter adversary movement into advanced military purpose digital electronic systems.  Beginning in FY 2014 JEAT will begin to adapt software configurable communications technology to be used as part of a distributed, networked, EA capability that can be readily adapted for installation in a wide variety of host platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Innovative Technology Exploration"
                                    },
                                    "Description": {
                                        "val": "This effort directly supports ASD(R&E), EW and CM through analyses and studies of emerging asymmetric threats.  Past efforts under this JEAT project include the Aircraft Survivability Equipment Joint Analysis Team and the Helicopter Survivability Task Force, both of which resulted in significant strategic technology investments by the Department."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.633"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.633"
                                            },
                                            "Text": {
                                                "val": "Innovative Technology Exploration efforts will focus on creating an adjunct to the DEED venue which will seek to provide more direct and immediate use of Intelligence Community technology and capability in spectrum warfare.  Of particular emphasis is the use of near-real time analysis of an environment full of diverse commercial and military purpose emitters and quickly producing actionable, decision quality information that allows us to use the spectrum to our advantage.  The objective of this effort is to encourage better collaboration and capability development including the military services and the Intelligence Community.  In this first year of effort, JEAT will study opportunities for better utilization of Intelligence Community derived information and capability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}