{
    "id": "da2053f4e4ec520cede24ab363256c723cdf6b90",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA6_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605718A"
        },
        "ProgramElementTitle": {
            "val": "Army Modeling & Sim X-Cmd Collaboration & Integ"
        },
        "R1LineItemNumber": {
            "val": "149"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "3.312"
            },
            "CurrentYear": {
                "val": "1.545"
            },
            "BudgetYearOne": {
                "val": "1.283"
            },
            "BudgetYearOneBase": {
                "val": "1.283"
            },
            "BudgetYearTwo": {
                "val": "1.555"
            },
            "BudgetYearThree": {
                "val": "1.510"
            },
            "BudgetYearFour": {
                "val": "1.638"
            },
            "BudgetYearFive": {
                "val": "1.666"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "\"Army Modeling and Simulation Cross-Command Collaboration and Integration (M&SC3I)\" promotes the goal to achieve affordable, interoperable and networked Modeling and Simulation (M&S) capabilities.  In support of Army operations, Generating-Force functions and institutional processes, M&SC3I addresses analytical efforts underlying decision making, capability development, and life-cycle costs by capitalizing on M&S technologies (accomplished through collaborative efforts of the training\/operations and acquisition communities).  The RDTE component of M&SC3I encompasses efforts that (1) develop\/improve new\/existing models and simulations to reduce time, resources and risks associated with operational\/institutional decision making and the acquisition process and (2) advance the following disciplines: M&S research, analysis and experimentation; simulation technology; and M&S tools and services.  M&SC3I addresses development of tactics and doctrine, experimentation and exercises, traditional weapon system development, and assessment and transition of advanced technologies to operational capabilities.  The overarching goal of M&SC3I is to reduce time and cost of providing improved capabilities to the war fighter.  Emerging information-age technologies continue to revolutionize the Army's ability to collaborate among all stakeholders using data descriptions, digital representations, and virtual prototypes to improve understanding of required capabilities, shorten procurement time, reduce procurement and sustainment costs, and, ultimately, reduce total life-cycle cost.  M&SC3I advocates the use of advanced technologies to enable future capabilities through improved understanding of operational requirements, collaborative analyses of emerging technologies, and cross-community participation in experiments and exercises.  The following are discussions of efforts under the two projects of PE 0605718.  Under project S03, \"Analysis M&S Tools and Services,\" the Army develops M&S tools and services (e.g., hardware, software, infrastructure) for the Army's analysis community.  The primary users of these tools and services are the Training and Doctrine Command Analysis Center (TRAC), the Army Materiel Systems Analysis Activity (AMSAA), and the Center for Army Analysis (CAA).  Efforts focus on (1) development of analysis tools that will enable assessment of emerging technologies during concept exploration and (2) development of infrastructure and enabling technologies to support the Current and Future Force.  These critical efforts are required for (1) analysis-of-futures work to justify Army requirements, (2) assessment of alternative approaches to satisfy those requirements, (3) development of current and emerging war fighting doctrine from the tactical to the operational levels of warfare and (4) the closing of capability gaps in the areas of irregular warfare, M&S data and standards, cyberspace operations, army network modeling and non-lethal weapons.  Under project S05, \"Army Simulation Technology (SIMTECH),\" the Army enhances force effectiveness by inducing research organizations on a short-term basis to conduct high-priority, promising simulation research initiatives that are outside the scope of Small Business Innovative Research (SBIR) and Army Science and Technology (S&T) programs.  Beginning with FY14, SIMTECH activities fall under the project S03, \"Analysis M&S Tools and Services.\" Project S05 ends with FY13 programs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.415"
                },
                "CurrentYear": {
                    "val": "1.545"
                },
                "BudgetYearOne": {
                    "val": "1.283"
                },
                "BudgetYearOneBase": {
                    "val": "1.283"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.312"
                },
                "CurrentYear": {
                    "val": "1.545"
                },
                "BudgetYearOne": {
                    "val": "1.283"
                },
                "BudgetYearOneBase": {
                    "val": "1.283"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.103"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.103"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S03"
                    },
                    "ProjectTitle": {
                        "val": "Analysis M&S Tools and Services"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.891"
                        },
                        "CurrentYear": {
                            "val": "1.424"
                        },
                        "BudgetYearOne": {
                            "val": "1.283"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.283"
                        },
                        "BudgetYearTwo": {
                            "val": "1.555"
                        },
                        "BudgetYearThree": {
                            "val": "1.510"
                        },
                        "BudgetYearFour": {
                            "val": "1.638"
                        },
                        "BudgetYearFive": {
                            "val": "1.666"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY14-18 funds include those reprogrammed from PE0605718A, Project S05 - SIMTECH: 124K, 116K, 117K, 117K, 118K.  Reprogramming occurred during the POMBES14-18 cycle."
                        },
                        "ProjectMissionDescription": {
                            "val": "Under the project \"Analysis M&S Tools and Services\" the Army develops Modeling and Simulation (M&S) tools and services (e.g., hardware, software, infrastructure) for the Army's analysis community.  The primary users of these tools and services are the Training and Doctrine Command Analysis Center (TRAC); the Army Materiel Systems Analysis Activity (AMSAA); the Center for Army Analysis (CAA); the Army Materiel Command; the Program Executive Office for Simulation, Training and Instrumentation (PEO-STRI).  Efforts focus on (1) development of analysis tools to enable assessment of emerging technologies during concept exploration, (2) development of infrastructure and enabling technologies to support the Current and Future Force and (3) application of M&S capabilities to One Semi-Automated Forces (OneSAF) that increase overall use of OneSAF software and hence reduce Army life-cycle costs.  These critical efforts are required for four essential purposes: analysis-of-futures work to justify Army requirements; assessment of alternative approaches to satisfy those requirements; development of current and emerging war fighting doctrine from the tactical to the operational levels of warfare; and the closing of capability gaps in areas of irregular warfare, M&S data and standards, cyberspace operations, army network modeling, and non-lethal weapons. Project S03 also includes, beginning with FY14, the Army Simulation Technology (SIMTECH) program, which enhances force effectiveness by assisting Modeling and Simulation (M&S) research agencies and organizations in conducting low-cost, promising simulation technology research that is outside the scope of the Small Business Innovative Research (SBIR) and the Army science and technology programs.  The SIMTECH program provides a source of competitive funds to Army research agencies and organizations to stimulate high quality, innovative M&S research with significant opportunity for payoff in Army war fighting capability.  The SIMTECH program serves as a vehicle for major M&SC3I-relalted technology breakthroughs in war gaming, embedded simulation, collaboration cabability, rapid prototyping, commercial innovation and related simulation technology (M&SC3I = Modeling and Simulation Cross-Command Collaboration and Integration.) Performers of SIMTECH activities are the Army Materiel Command (AMC); the Army Corps of Engineers; the Army Research and Development Centers (ARDECs); the Army Research Institute; the Army Training and Doctrine Command Analysis Center (TRAC); the Program Executive Office for Simulation, Training and Instrumentation (PEO-STRI); White Sands Missile Range; the Space and Missile Defense Command (SMDC); Natick Soldier Research, Development and Engineering Center (NSRDEC), Edgewood Chemical and Biological Center (ECBC); and other Army agencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Irregular Warefare"
                                    },
                                    "Description": {
                                        "val": "Modeling for irregular warfare will put the Army on the path toward achieving its strategic objectives through indirect means with the same degree of dominance it employs in major combat operations.  Military operations\nassociated with irregular warfare are foreign internal defense, stability operations, counterinsurgency, combating terrorism, unconventional warfare, and application of the dynamics of cultural and human behavior."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.641"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 efforts are in the area of modeling for the following operations associated with irregular warfare: foreign internal defense, stability operations, counterinsurgency, combating terrorism, unconventional warefare, and application of the dynamics of cultural and human behavior.  The goal is to ensure the Army will retain the ability to conduct major combat operations while expanding the capabilities for irregular warfare."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": ":..FY13 efforts are in the area of modeling for one or more of the following operations associated with irregular warfare: foreign internal defense, stability operations, counterinsurgency, combating terrorism, unconventional warefare, and application of the dynamics of cultural and human behavior.  The goal is to ensure the Army will retain the ability to conduct major combat operations while expanding the capabilities for irregular warfare."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "M&S Data and Standards"
                                    },
                                    "Description": {
                                        "val": "M&S data and standards allow the Army M&S community to acquire an improved, robust data collection process; a robust data mining process; and an accessible data repository to enable more responsive, credible modeling\n(especially for current operating and generating environments).  These improvements will enable the Army to close current gaps in its ability to provide M&S support to the decision-making, concept development, operational assessment, and training processes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.682"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 efforts pertain to development of M&S data and standards to allow the Army M&S community to acquire an improved, robust data collection process; a robust data mining process; and an accessible data repository to enable more responsive, credible modeling (especially for current operating and generating environments).  Specific projects are selected by way of a request for proposals to the Army M&S community.  The request is issued by the Army Modeling and Simulation Office."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": ":..FY13 efforts pertain to development of M&S data and standards to allow the Army M&S community to acquire an improved, robust data collection process; a robust data mining process; and an accessible data repository to enable more responsive, credible modeling (especially for current operating and generating environments).  Specific projects are selected by way of a request for proposals to the Army M&S community.  The request is issued by the Army Modeling and Simulation Office."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyberspace Operations"
                                    },
                                    "Description": {
                                        "val": "Cyberspace operations are defined as the employment of cyber capabilities for the purpose of achieving objectives in and through cyberspace.  M&S cyberspace operations are directed toward computer network operations and operation\/defense of the Global Information Grid (GIG).  Cyberspace is a global domain within the information environment consisting of the interdependent networks of information technology infrastructures.  These include telecommunications networks, computer systems, and embedded processors and controllers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.176"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..:..FY12 efforts pertain to simulation enhancements for Extended Air Defense Simulation (EADSIM) cyber modeling and cyber operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Network Modeling"
                                    },
                                    "Description": {
                                        "val": "The Army Network is an enhanced, interoperable communications network that assists leaders in making timely, informed decisions and promotes organizational agility, lethality and sustainability.  The network links soldiers on the battlefield with space-based and aerial sensors, robots and command posts.  These systems provide situational awareness and control by locating the enemy, friendly forces and civilian populations; by revealing weapon-system availability at any given time; and by enabling the application of precise lethal fires."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.292"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 activities cover modeling for the Army Network to maximize the effectiveness and accuracy of systems (spaced-based and aerial sensors, robots, and command posts) that provide situational awareness and control."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "...FY13 activities cover modeling for the Army Network to maximize the effectiveness and accuracy of systems (spaced-based and aerial sensors, robots, and command posts) that provide situational awareness and control."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Lethal Weapons"
                                    },
                                    "Description": {
                                        "val": "Current M&S activities in the field of non-lethal weapons focus on two areas -- development of methodologies for establishing priority non-lethal weapons and enhancement of non-lethal weapon simulations now in operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 activies pertain to development of methodologies for establishing priority non-lethal weapons and enhancement of non-lethal weapon simulations now in operation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Application and Expansion of Modeling & Simulation (M&S) Capabilities to One\nSemi-Automated Forces (OneSAF)"
                                    },
                                    "Description": {
                                        "val": "Application and expansion of M&S capabilities to OneSAF increases overall use of the OneSAF software to reduce Army life-cycle costs.  Increasing OneSAF capabilities leads to the goal of implementing ONE TIME (rather than through the use of multiple software products) updates and changes associated with transformation, modernization and operations across the simulation life cycle. The reduction of reduncies; i.e., multiple software products with similar or interchangable features, is an esstential outcome of the expanded OneSAF domain.  Current efforts: threat-jamming precision-guided weapons in OneSAF; micro-satellite BF SIGINT capabilities; set of web-based XML services to support integrated initialization of simulation-based mission rehearsal, planning and training with C2 standards, C2 Core and JC3IEDM. XML = Extensible Markup Language.   BF SIGINT =   Blue-Force Signals Intelligence.   C2 = Command and Control.   JC3IEDM = Joint Command, Control and Consultation Information Exchange Data Model."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.524"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY13 efforts enhance the stability, interoperability and cross-community application of the OneSAF software.  We do this through two efforts.  First, we focus on the needs and capability gaps identified in the FY12 OneSAF functional review.  This review consolidates the needs of the OneSAF user community and integrates findings of the OneSAF Roadmap project.  Second, we focus on integration of emerging Army capabilities and needs into the simulation software to enable the analysis and training communities to run relevant simulation events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improvement of various components of Modeling and Simulation (M&S) in accordance with M&S focus areas established within the domain of Analysis M&S Tools and Services."
                                    },
                                    "Description": {
                                        "val": "Multiple projects under Analysis M&S Tools and Services are selected at the beginning of (and executed during) each fiscal year in accordance with the M&S focus areas of that year.  Project selections reflect the critical needs of the Army."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.283"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.283"
                                            },
                                            "Text": {
                                                "val": "..FY14 efforts will consist of multiple projects aimed at improving the many components of M&S.  Projects will be selected in accordance with the focus areas of FY14.  Projects will be requested by the Army M&S community [e.g., TRADOC Analysis Center (TRAC); US Army Research Lab; Army Research, Development and Engineering Centers] via data calls issued by the Army Modeling and Simulation Office (AMSO)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S05"
                    },
                    "ProjectTitle": {
                        "val": "SIMULATION TECHNOLOGY (SIMTECH) PROGRAM"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.421"
                        },
                        "CurrentYear": {
                            "val": "0.121"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY14-18 funds were reprogrammed to PE 605718A, Project S03 - Analysis M&S Tools and Services.  Reprogramming occurred during the POMBES14-18 cycle.  Project S05 ends with FY13."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Army Simulation Technology (SIMTECH) program enhances force effectiveness by assisting Modeling and Simulation (M&S) research agencies and organizations in conducting low-cost, promising simulation technology research that is outside the scope of the Small Business Innovative Research (SBIR) and the Army science and technology programs.  The SIMTECH program provides a source of competitive funds to Army research agencies and organizations to stimulate high quality, innovative M&S research with significant opportunity for payoff in Army war fighting capability.  The SIMTECH program focuses simulation technology research initiatives on immediate short-term Army capability requirements by including a theme in the annual call for proposals.  The SIMTECH program serves as a vehicle for major M&SC3I-relalted technology breakthroughs in war gaming, embedded simulation, collaboration cabability, rapid prototyping, commercial innovation and related simulation technology (M&SC3I = Modeling and Simulation Cross-Command Collaboration and Integration.) Performers of SIMTECH activities are the Army Materiel Command (AMC); the Army Corps of Engineers; the Army Research and Development Centers (ARDECs); the Army Research Institute; the Army Training and Doctrine Command Analysis Center (TRAC); the Program Executive Office for Simulation, Training and Instrumentation (PEO-STRI); White Sands Missile Range; the Space and Missile Defense Command (SMDC); Natick Soldier Research, Development and Engineering Center (NSRDEC), Edgewood Chemical and Biological Center (ECBC); and other Army agencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improvement of the various components of Modeling and Simulation (M&S) in accordance with M&S focus areas established within the SIMTECH program."
                                    },
                                    "Description": {
                                        "val": "SIMTECH projects are selected at the beginning of (and executed during) each fiscal year in accordance with the M&S focus areas of that fiscal year. Project selections reflect the critical needs of the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.836"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..:..FY12 efforts consist of a variety of projects aimed at improving the various components of M&S. Projects are selected in accordance with the M&S focus areas for FY12. Projects are requested by the Army M&S community; e.g., TRADOC Research and Acquisiton Center (TRAC); US Army Research Lab; Army Research, Development & Engineering Centers, via data calls and councils of colonels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.121"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY13 efforts consist of a variety of projects aimed at improving the various components of M&S. Projects are selected in accordance with the M&S focus areas for FY13. Projects are requested by the Army M&S community; e.g., TRADOC Research and Acquisiton Center (TRAC); US Army Research Lab; Army Research, Development & Engineering Centers, via data calls and councils of colonels.      \nOCO FY 2013 Description:"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Simulation Technology Program (SIMTECH) in Support of Advanced Technologies"
                                    },
                                    "Description": {
                                        "val": "The SIMTECH program accelerates advanced technologies to ensure battlefield superiority by enhancing force effectiveness through research and development of innovative, low-cost Modeling and Simulation (M&S). The program provides funds to organizations for low-cost, promising simulation technology research initiatives that are outside the scope of the Small Business Innovative Research Program (SBIR) and Army Technology Objectives (ATOs). SIMTECH projects provide high payoff opportunities in warfighting simulation capabilities such as a portable COA\/wargaming development and analysis tool, collaboration capability, embedded training, rapid prototyping, commercial innovation, and correlation of visual systems for simulators. (COA = Course of Action.)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.585"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "..FY12 efforts consist of a variety of SIMTECH projects selected by way of request for proposals to the Army M&S community and research agencies. The request for proposals is issued by the Army Modeling and Simulation Office (AMSO). AMSO selects SIMTECH projects that promise innovative M&S research with significant opportunity for payoff in Army war fighting capability.       ."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}