{
    "id": "dd1e7fe34aa8a0bd27dc69393de84635b3782eef",
    "meta": {
        "filename": "dod-2014_RDTE_2014_NAVY_BA1_3_RDTE_MasterJustificationBook_Navy_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Navy_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603563N"
        },
        "ProgramElementTitle": {
            "val": "Ship Concept Advanced Design"
        },
        "R1LineItemNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "105.690"
            },
            "PriorYear": {
                "val": "16.837"
            },
            "CurrentYear": {
                "val": "24.609"
            },
            "BudgetYearOne": {
                "val": "20.501"
            },
            "BudgetYearOneBase": {
                "val": "20.501"
            },
            "BudgetYearTwo": {
                "val": "16.049"
            },
            "BudgetYearThree": {
                "val": "15.848"
            },
            "BudgetYearFour": {
                "val": "8.008"
            },
            "BudgetYearFive": {
                "val": "8.100"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Explore alternative surface ship force structures, advanced surface ship and unmanned surface vehicles concepts, and the potential technologies for these force structures and advanced concepts in support of pre-acquisition mission needs analysis, mission area analysis, and planning. The objective is a more affordable, mission capable surface ship force including increased ship production capability; ships with reduce manning, reduced operating and support costs, and greater utilization of the latest technology. The program directly supports the Navy Shipbuilding Plan with state-of-the-art design tools and methods for surface ship force structure alternative studies, ship & unmanned vehicle concept studies, and the actual conduct of surface ship force structure alternative studies and advanced design concept studies for the ships that may become part of the shipbuilding plan.\n\nProject 2196 - This project funds concept development engineering, mission effectiveness analysis, and other analyses for formulation of future surface ship force structure along with development of the tools to accomplish these efforts. Advanced ship concept studies, ship and ship systems technology assessments, and the development and upgrade of\nship concept design and engineering tools, methods, and criteria.\n\nProject 3161 - This project funds a prioritized portfolio of time-sensitive initiatives supporting NAVSEA Technical Authority through integrated efforts in Cross Platform Systems Development (CPSD), furthering Sea Enterprise through the development of support elements for Technical Warrant Holders and meeting relevant needs of the warfare community.  The areas of exploration for CPSD include surface ship concept advanced development, submarine concepts, next generation unmanned surface vehicle, high speed ships\/crafts, tool integration and technical data exchange, embedded interoperability engineering, and mission capability systems engineering.  The research products developed by this project directly support and influence both immediate fleet requirements and future acquisition programs by providing a range of technically acceptable alternatives and evaluation of emerging technologies.  \n\nIn particular, tasks within this project continue to directly support interoperability testing and certification for Littoral Combat Ship (LCS) and other platforms in deploying battle groups, development and certification of Safe Operating Envelope (SOE) tools for surface combatants (CG 47, DDG 51, DDG 1000), American Bureau of Shipping (ABS) pilot program to determine engineering-based combatant service life values based on fatigue and other structural analyses, implementation of Component Commonality in current Navy ship acquisition to reduce total ownership and maintenance costs, Total Ownership Cost (TOC) pilot programs, and development of specifications and processes to reduce production costs of platforms.  \n\nTasks within this project continue to directly support the Test and Evaluation Master Plan (TEMP) execution for multiple ship classes including, LCS, JHSV, and DDG 1000 reducing Live Fire Test and Evaluation (LFT&E) costs, furthered validation of hydrodynamic simulation tool supporting DDG 1000 Hull Form Plan (HFP), have increased technology readiness level for aluminum combatants, developed tools to execute the CG 47 Cracking Task Force recommendations, increased situational awareness for deploying strike groups, and conducted feasibility studies of future Railgun capabilities.  This project supports NAVSEA's core mission and enhances its ability to conduct independent technical authority which allows for improved performance and reduced cost of current and future naval platforms."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.308"
                },
                "CurrentYear": {
                    "val": "24.609"
                },
                "BudgetYearOne": {
                    "val": "20.833"
                },
                "BudgetYearOneBase": {
                    "val": "20.833"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.837"
                },
                "CurrentYear": {
                    "val": "24.609"
                },
                "BudgetYearOne": {
                    "val": "20.501"
                },
                "BudgetYearOneBase": {
                    "val": "20.501"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.529"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.332"
                },
                "BudgetYearOneBase": {
                    "val": "-0.332"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.806"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.277"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.107"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.107"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.225"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.225"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Added funds in FY 12 for DDG 1000 hull form plan."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2196"
                    },
                    "ProjectTitle": {
                        "val": "Design, Tools, Plans and Concepts"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.518"
                        },
                        "CurrentYear": {
                            "val": "0.540"
                        },
                        "BudgetYearOne": {
                            "val": "0.545"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.545"
                        },
                        "BudgetYearTwo": {
                            "val": "0.489"
                        },
                        "BudgetYearThree": {
                            "val": "0.500"
                        },
                        "BudgetYearFour": {
                            "val": "0.505"
                        },
                        "BudgetYearFive": {
                            "val": "0.511"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides the foundation for an affordable and mission capable surface ship force. It also supports the next step in the development of a transformed naval force by accomplishing the pre-milestone A (especially pre-concept decision) efforts for all potential surface ships and craft. These efforts are the required first step in the integration of total ship systems, including combat systems, weapons systems and Hull, Mechanical and Electrical (HM&E) systems. Inadequate early planning and ship concept formulation can result in down-stream design, construction and operational problems. A more subtle and severely negative impact of neglecting this early effort is that the \"best\" concepts and technologies may never even be considered and our greatest potential ship design advances never realized. Designs and technologies must meet the threat. This project supports this requirement.\n\nThis project funds concept development engineering, mission effectiveness analysis, and other analyses for formulation of future surface ship force structure along with development of the tools to accomplish these efforts. Advanced ship concept studies, ship and ship systems technology assessments, and the development and upgrade of ship concept design and engineering tools, methods, and criteria are also funded in this project.\n\nThis project accomplishes the following: (1) Develops alternative surface ship force structure concepts including the ships and unmanned vehicles; (2) Evaluates the mission capability effectiveness and costs for these alternative surface fleet architectures; (3) Performs fleet war fighting\/mission effectiveness assessment studies; (4) Identifies future surface ship requirements and characteristics necessary to meet future threats and support mission needs; (5) Investigates new affordable ship concepts and evaluates technologies necessary to support these concepts; (6) Provides design methods and automated design tools to develop and evaluate ship concepts; and (7) Supports development of Initial Capabilities Documents (ICD) and analogous early requirements documents for future ships. These efforts are done to support mission analysis; mission needs development and technology assessment in support of future fleet concepts and potential ship acquisition programs. These efforts are fundamental to the Navy's formulation of the future fleet.\n\nSupports concept exploration and mission needs assessment for potential future ship acquisition programs, however, these are not direct efforts for specific, authorized shipbuilding programs. This project supports and maintains this country's naval ship design and engineering capabilities in the area of very early stage (Concept Design) design tools, criteria, and methods."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ship Concepts and Mission Need Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop ship concepts and perform analysis for potential ships and Force Architecture 5-10 years out in shipbuilding plan."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.447"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuation of concept designs for small and medium surface combatants with a broad mix of gun, missile, and other emerging weapon topics (high energy, etc), also to include energy and cost reducing technologies and concepts as related to ship systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.465"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuation of concept designs for small and medium surface combatants that develop agile, fuel efficient and flexible platforms capable of operating in required environments.  These efforts will enable the design of future affordable surface combatants with increased reliable, efficient, long range, high speed and optimized payload capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.471"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.471"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuation of concept designs for small and medium surface combatants that develop agile, fuel efficient and flexible platforms capable of operating in required environments.  These efforts will enable the design of future affordable surface combatants with increased reliable, efficient, long range, high speed and optimized payload capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Total Ship Technology Assessment (TSTA)"
                                    },
                                    "Description": {
                                        "val": "Analyze the benefits and impacts of new ship, Hull, Mechanical & Electrical (HM&E) concepts, technologies and warfare systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.071"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuation of expanded TSTA methodology with ASW, ASUW products developed under FY11 Concepts and Mission Needs Analysis, also to include energy and cost-reducing technologies and concepts as related to ship systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.075"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuation of FY12 TSTA tasks as well as integration of design of an advanced total platform energy monitoring system as well as reduced manning capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.074"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.074"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commence development on small scale tools to automate challenging and\/or labor intensive naval arch activities (such as weight reports, liquid loading vs. trim scenarios) and to add capability to existing software tools.  The products would be to aid in the in-house technical capability of the Navy in conducting pre-AoA studies for surface ships."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0204202N"
                                    },
                                    "Title": {
                                        "val": "DDG-1000"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "249.780"
                                        },
                                        "CurrentYear": {
                                            "val": "124.655"
                                        },
                                        "BudgetYearOne": {
                                            "val": "187.910"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "187.910"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "185.793"
                                        },
                                        "BudgetYearThree": {
                                            "val": "117.850"
                                        },
                                        "BudgetYearFour": {
                                            "val": "66.506"
                                        },
                                        "BudgetYearFive": {
                                            "val": "38.255"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603512N"
                                    },
                                    "Title": {
                                        "val": "Carrier Systems Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "61.909"
                                        },
                                        "CurrentYear": {
                                            "val": "106.876"
                                        },
                                        "BudgetYearOne": {
                                            "val": "82.926"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "82.926"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.195"
                                        },
                                        "BudgetYearThree": {
                                            "val": "50.881"
                                        },
                                        "BudgetYearFour": {
                                            "val": "47.344"
                                        },
                                        "BudgetYearFive": {
                                            "val": "46.022"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603564N"
                                    },
                                    "Title": {
                                        "val": "Ship Preliminary Design\/Feasibility"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.611"
                                        },
                                        "CurrentYear": {
                                            "val": "13.710"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.052"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.052"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.878"
                                        },
                                        "BudgetYearThree": {
                                            "val": "58.492"
                                        },
                                        "BudgetYearFour": {
                                            "val": "37.062"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.004"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0604567N"
                                    },
                                    "Title": {
                                        "val": "Ship Contract Design\/Live Fire T&E"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "121.008"
                                        },
                                        "CurrentYear": {
                                            "val": "196.737"
                                        },
                                        "BudgetYearOne": {
                                            "val": "155.254"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "155.254"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "123.970"
                                        },
                                        "BudgetYearThree": {
                                            "val": "63.337"
                                        },
                                        "BudgetYearFour": {
                                            "val": "54.620"
                                        },
                                        "BudgetYearFive": {
                                            "val": "50.031"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603582N"
                                    },
                                    "Title": {
                                        "val": "Combat System Integration"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "48.999"
                                        },
                                        "CurrentYear": {
                                            "val": "56.551"
                                        },
                                        "BudgetYearOne": {
                                            "val": "36.570"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "36.570"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "41.949"
                                        },
                                        "BudgetYearThree": {
                                            "val": "44.351"
                                        },
                                        "BudgetYearFour": {
                                            "val": "48.417"
                                        },
                                        "BudgetYearFive": {
                                            "val": "49.760"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This is a non acquisition program that develops, evaluates, and validates early stages of total ship concepts and technologies in support of SCN planning and potential future ship acquisition programs. This program also supports development, demonstration, evaluation, and validation of engineering tools, methods, and criteria for those concept designs and assessments."
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Contractors"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.234"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.166"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.153"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.153"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.168"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.196"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.189"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.189"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Contractors"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.178"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.129"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.129"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.062"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.074"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.074"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Demonstration & Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Contractors"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.029"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test & Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Contractors"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.020"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVSEA HQ"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.005"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.005"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3161"
                    },
                    "ProjectTitle": {
                        "val": "NAVSEA Tech Authority"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "105.690"
                        },
                        "PriorYear": {
                            "val": "16.319"
                        },
                        "CurrentYear": {
                            "val": "24.069"
                        },
                        "BudgetYearOne": {
                            "val": "19.956"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.956"
                        },
                        "BudgetYearTwo": {
                            "val": "15.560"
                        },
                        "BudgetYearThree": {
                            "val": "15.348"
                        },
                        "BudgetYearFour": {
                            "val": "7.503"
                        },
                        "BudgetYearFive": {
                            "val": "7.589"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project has been established to support NAVSEA Technical Authority through coordinated, collaborative, cross-platform systems development resulting in advanced capabilities across business lines through development adaptation and extension of processes, procedures, and tools necessary to develop and explore alternative surface ship and submarine force structures; advanced submarine, surface ship and unmanned surface vehicle concepts; interoperability; and development of systems level engineering criteria and options to support these force structures and advanced concepts as part of pre-acquisition mission needs analysis, mission area analysis, SCN, and R&D planning. The objective is the coordination of ongoing early-stage concept design and development efforts for cross-platform applicability to result in a more affordable, mission-capable, and interoperable surface ship and submarine forces including ships and submarines with reduced manning, increased ability to produce, reduced operating and support costs, and greater utilization of the latest technology.\n\nNAVSEA Tech Authority efforts under Project 3161, known as the Cross Platform Systems Development (CPSD) Program enhance ongoing efforts within Project 2196 and transition directly to early-stage ship design for Ship and Submarine Preliminary Design and Feasibility Studies and other Program Executive Office (PEO) ship and submarine design programs. While these efforts support concept exploration and mission needs assessment for potential future ship and submarine acquisition programs, they are not direct efforts for specific, authorized shipbuilding programs. This project is the only R&D effort (Government or commercial) that provides a coordinated, collaborative approach to the development of cross-platform naval ship, submarine, and weapon system design and engineering capabilities in the areas of design tools, criteria, and methods. This project also provides innovative solutions for current Fleet issues involving Technical Authority, such as current interoperability issues with new systems or platforms.\n\nNaval Ship System Engineering Tech Authority recapitalization and product development consolidates platform advanced concept development and design tool development in CPSD 1.0 (Platform Concept Advanced Development) and CPSD 2.0 (Platform Design and Certification Tools\/Engineering and Tech Data Exchange Development); and aligned standards and requirements development for modularity and system \/ component commonality within CPSD 3.0 (Ship Systems Engineering\/Modular Ship Systems Development). Program product areas support: platform-centric force architecture and concept development and tools (CPSD 1.0, CPSD 2.0), engineering products and system development (CPSD 3.0, CPSD 5.0), and system interoperability and mission capability for delivering ships and submarines (CPSDs 6.0, 8.0, 9.0). CPSD develops and transitions products to Technical Warrant Holder (TWH) community and develop prioritized plans and activities for future products from emerging cross platform technical requirements and associated capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Platform Concept Advanced Development (CPSD 1.0)"
                                    },
                                    "Description": {
                                        "val": "This effort directly supports the Navy's ability to understand risk and associated cost of surface and submarine warfare assets; Pre-Milestone A ship, craft, and unmanned surface vehicle (USV) design and analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.691"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to identify areas of improvement for the processes of identifying hull selection, general arrangement, machinery arrangement, structural density, access and other decisions and best practices in early stage design that decrease the overall total ownership costs associated with US Navy warships, supporting the Navy's goal of an affordable future fleet."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.616"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop the NAVSEA ship concept development processes for supporting the Long Range Shipbuilding Strategy (LRSS), Capability Based Analyses (CBAs), Analyses of Alternatives (AoAs), and new technology impact assessment. It will develop design space exploration methods that leverage previous Navy design tool investments by employing behavior models of higher fidelity, but more time consuming techniques. This will allow much more comprehensive trade studies in support of Capabilities Based Assessments and Analyses of Alternatives.  Continue next generation surface ship, submarine and unmanned vehicle concept exploration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.572"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.572"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop the NAVSEA ship concept development processes for supporting the Long Range Shipbuilding Strategy (LRSS), Capability Based Analyses (CBAs), Analyses of Alternatives (AoAs), inform ship design policy and new technology impact assessment. It will develop design space exploration methods that leverage previous Navy design tool investments by employing behavior models of higher fidelity, but more time consuming techniques. This will allow much more comprehensive trade studies in support of Capabilities Based Assessments and Analyses of Alternatives.  Continue next generation surface ship, submarine and unmanned vehicle concept exploration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Platform Design and Certification Tools\/Engineering and Tech Data Exchange (CPSD 2.0)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the development of validation tools to certify the safety and mission capability of platform concepts and subsequently ships and submarines; establishes the integrated NAVSEA suite to support the execution of NAVSEA Tech Authority.  This effort advances platform design methods, design validation tools, cost tools, manpower tools, and tools to aid in rapid total platform definition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.907"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the Advanced Ship Synthesis and Evaluation Tool (ASSET) synthesis program development to modularize its architecture to accommodate insertion of new modules and updating existing needed for advanced ship concepts and emerging ship technology.  Continued concept design tool development - implementation and validation; begin certification process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.678"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Transition the tool development to aide in early stage concept design including Advanced Ship Synthesis and Evaluation Tool (ASSET) and Leading Edge Architecture for Prototyping Systems (LEAPS) to the CONFORM line  (PE 0605152N) for funding and execution. Continue to develop tools that allow for reliable, efficient, long range, high speed platforms with optimized payload capabilities. Continue to develop early stage ship design tools supporting total ownership cost reductions through enhancements of performance based cost models and manpower assessments tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.626"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.626"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop tools that allow for reliable, efficient, long range, high speed platforms with optimized payload capabilities. Continue to develop early stage ship design tools supporting total ownership cost reductions through enhancements of performance based cost models and manpower assessments tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ship Systems Engineering \/Modular Ship Systems Development (CPSD 3.0)"
                                    },
                                    "Description": {
                                        "val": "This effort supports Ship system development with a focus on technology transition, modularity, ship system technology integration, and design standards for new ship classes for pre-Alternative of Analysis (AoA) studies and ongoing program of record (PoR) ship and submarine development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.554"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiated data population interface for previously developed design tools including Systems Engineering Application for Quickly Evaluating Shipboard Technologies (SEAQUEST)\/LEAPS interface enabling the combination of multiple cross-disciplinary models and applications together in a simulation process flow.  Continued analysis of fracture mechanics assessment for failure of aluminum structure after a cracking incident to determine inspection periodicity and temporary repair techniques for in-service LCS and JHSV platforms.  Initiated development of the Deck Simulating Shock Machine technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.782"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improve processes for technology upgrades during midlife overhauls that allow for affordable fleet\/force modernization.  Allow for long term strategic use of platform and system modularity to enable an affordable future fleet."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.199"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.199"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to improve processes for technology upgrades during midlife overhauls that allow for affordable fleet\/force modernization.  Allow for long term strategic use of platform and system modularity to enable an affordable future fleet.  Continued analysis of fracture mechanics assessment for failure of aluminum structure after a cracking incident to determine inspection periodicity and temporary repair techniques for in-service CG, DDG LCS, and JHSV platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed Ships and Craft Engineering (CPSD 5.0)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the development of concepts for future high speed ships and craft that promise improved mission effectiveness in mobility, survivability, and warfare mission areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.592"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the development of an advanced hydrodynamic simulation tool that has adequate fidelity for all environmental conditions required to define a Safe Operating Envelope (SOE).  The effort addresses this need for an analytic approach, which will be verified and validated through correlation with data obtained from analytic tests, sub-scale trials, and ultimately full scale trails.  The Hull Form Plan (HFP) Integrated Product Team (IPT) initiated the development of analytical tools, completed a prescribed set of model tests and extensive analyses to be developed over the next several years to support development of surface ship Safe Operating Envelope (SOE) and Heavy Weather (HW) Guidance products."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.052"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begin development of improved platform stealth and survivability.  Develop a R&D engineering model to supporting the development, design, acquisition, R&D testing and acceptance of a future modular mission ice capable surface combatant.  Continue development of analytical tools, complete a prescribed set of model tests and extensive analyses over the next several years to support development of surface ship Safe Operating Envelope (SOE) and Heavy Weather (HW) Guidance products. The analytical methods will include development of a simulation tool required to characterize ship motions in environments not within ability to test. The initial HW Guidance will develop from model scale testing and will not be certified. In addition to the development of the Heavy Weather Guidance and SOE, the Hull Form Plan will support the integration of the capability on the ship and associated training guidance for ships crew. This includes the development of the requirements for Human System Integration (HSI), Human Computer Interface (HCI), and training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.785"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.785"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the development of improved platform stealth and survivability.  Continue to develop a R&D engineering model to supporting the development, design, acquisition, R&D testing and acceptance of a future modular mission ice capable surface combatant.  Continue development of analytical tools, complete a prescribed set of model tests and extensive analyses over the next several years to support development of surface ship Safe Operating Envelope (SOE) and Heavy Weather (HW) Guidance products. The analytical methods will include development of a simulation tool required to characterize ship motions in environments not within ability to test. The initial HW Guidance will develop from model scale testing and will not be certified. In addition to the development of the Heavy Weather Guidance and SOE, the Hull Form Plan will support the integration of the capability on the ship and associated training guidance for ships crew. This includes the development of the requirements for Human System Integration (HSI), Human Computer Interface (HCI), and training."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Power Systems Engineering (CPSD 6.0)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates concepts for ships and craft with alternative power\/propulsion systems evaluating effectiveness in mobility, survivability, and warfare mission areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.196"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue investigation of alternative power\/propulsion systems evaluating effectiveness in mobility, survivability and warfare mission areas.  Begin targeted implementation of weapon systems roadmap.  Support modeling of propulsor out of plane force and moment modeling needed for Safe Operating Envelope ship dynamics simulations.  This work area supports hydrodynamic capabilities from design through certification."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.312"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begin volumetric vulnerability analysis as a part of the Alternate Propulsion Study.  Algorithms will be used to refine the estimates of ship damage associated with specified weapons effects supporting early stage design decisions for ship vulnerability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.214"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.214"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue volumetric vulnerability analysis as a part of the Alternate Propulsion Study.  Algorithms will be used to refine the estimates of ship damage associated with specified weapons effects supporting early stage design decisions for ship vulnerability.  Evaluation of pod propulsor for future ship concept design.  Develop and evaluate energy harvesting technology for mobility and primary mission systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Embedded Interoperability (I\/O) Engineering (CPSD 8.0)"
                                    },
                                    "Description": {
                                        "val": "This effort establishes and executes a dedicated process for evaluating the interoperability performance of warfare systems early in the acquisition cycle, prior to certification.  Embedded I\/O ensures that fewer mission critical system failures degrade the ultimately fielded war fighting capability.  Focus on emerging Open Architecture warfare systems, including LCS 1 and 2."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.745"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Focus on development of high performance, low cost communication solutions for improved information dominance and interoperability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.728"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.728"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the focus on development of high performance, low cost communication solutions for improved information dominance and interoperability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Capability Systems Engineering (CPSD 9.0)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the development of force-level systems engineering criteria and guidance at the Systems of Systems (SoS) and Family of Systems (FoS) level.  This effort allows for the enhanced warfighter and system performance with reduced personnel costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.379"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and established the standards and processes required to develop, test, and deploy Open Architecture as well as Automated Software Test and the Tactical Situation (TACSIT) systems to the Fleet."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.884"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Create design engineering standards incorporating human capacities into system performance.  Incorporate the human element into design and control of autonomous and robotic systems.  Improve standard that allow for the advancement of materials and improved design for lightweight body armor and equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.832"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.832"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the creation of design engineering standards incorporating human capacities into system performance.  Incorporate the human element into design and control of autonomous and robotic systems.  Continue to improve standards that allow for the advancement of materials and improved design for lightweight body armor and equipment.  Development of guidance algorithms against high speed moving targets.  Evaluate railgun technology for various applications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0204202N"
                                    },
                                    "Title": {
                                        "val": "DDG-1000"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "249.780"
                                        },
                                        "CurrentYear": {
                                            "val": "124.655"
                                        },
                                        "BudgetYearOne": {
                                            "val": "187.910"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "187.910"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "185.793"
                                        },
                                        "BudgetYearThree": {
                                            "val": "117.850"
                                        },
                                        "BudgetYearFour": {
                                            "val": "66.506"
                                        },
                                        "BudgetYearFive": {
                                            "val": "38.255"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603512N"
                                    },
                                    "Title": {
                                        "val": "Carrier Systems Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "61.909"
                                        },
                                        "CurrentYear": {
                                            "val": "106.876"
                                        },
                                        "BudgetYearOne": {
                                            "val": "82.926"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "82.926"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.195"
                                        },
                                        "BudgetYearThree": {
                                            "val": "50.881"
                                        },
                                        "BudgetYearFour": {
                                            "val": "47.344"
                                        },
                                        "BudgetYearFive": {
                                            "val": "46.022"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603564N"
                                    },
                                    "Title": {
                                        "val": "Ship Preliminary Design\/Feasibility Studies"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.611"
                                        },
                                        "CurrentYear": {
                                            "val": "13.710"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.052"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.052"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.878"
                                        },
                                        "BudgetYearThree": {
                                            "val": "58.492"
                                        },
                                        "BudgetYearFour": {
                                            "val": "37.062"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.004"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0604567N"
                                    },
                                    "Title": {
                                        "val": "Ship Contract Design\/Live Fire T&E"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "121.008"
                                        },
                                        "CurrentYear": {
                                            "val": "196.737"
                                        },
                                        "BudgetYearOne": {
                                            "val": "155.254"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "155.254"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "123.970"
                                        },
                                        "BudgetYearThree": {
                                            "val": "63.337"
                                        },
                                        "BudgetYearFour": {
                                            "val": "54.620"
                                        },
                                        "BudgetYearFive": {
                                            "val": "50.031"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603582N"
                                    },
                                    "Title": {
                                        "val": "Combat System Integration"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "48.999"
                                        },
                                        "CurrentYear": {
                                            "val": "56.551"
                                        },
                                        "BudgetYearOne": {
                                            "val": "36.570"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "36.570"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "41.949"
                                        },
                                        "BudgetYearThree": {
                                            "val": "44.351"
                                        },
                                        "BudgetYearFour": {
                                            "val": "48.417"
                                        },
                                        "BudgetYearFive": {
                                            "val": "49.760"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This is a non acquisition program that develops, evaluates, and validates early stages of total ship concepts and technologies in support of SCN planning and potential future ship and submarine acquisition programs. This program also supports development, demonstration, evaluation, and validation of engineering tools, methods, and criteria for those concept designs and assessments. This program supports the NAVSEA Technical Warrant Holders by providing validated engineering tools, methods, and criteria for ship, submarine and weapon system concept designs and assessments while fostering collaboration and coordination of efforts resulting in more effective use of funding."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Award Dates reflect estimated completion of incremental funding execution."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Contractors"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.701"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.360"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.605"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.330"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.330"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC, NUWC, CDSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "37.491"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.121"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.178"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.951"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.951"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DRS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Stevensville, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.742"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.346"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.287"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.287"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC, NUWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "36.753"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.105"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.215"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.982"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.982"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Demonstration & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.178"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.925"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.018"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.673"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.673"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Demonstration & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.922"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.090"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.075"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.075"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.966"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.517"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.558"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.558"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PM\/Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVSEA HQ"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.500"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DAWDF"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Specified"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not Specified"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.145"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.145"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2014PB_0603563N_3161_FILE2.PNG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 3161"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Platform Concept Advanced Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Platform Design and Certification Tools\/Engineering and Tech Data Exchange Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Ship Systems Engineering\/Modular Ship Systems Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "High Speed Ships and Craft Engineering"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Alternative Power Systems Engineering"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Embedded Interoperability Engineering"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mission Capability Systems Engineering"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2012"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}