{
    "id": "e1514dcfe9a5068f748e52717c8a6649e70719ea",
    "meta": {
        "filename": "dod-2014_RDTE_2014_CDBP_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (ATD)"
        },
        "R1LineItemNumber": {
            "val": "39"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "225.441"
            },
            "CurrentYear": {
                "val": "234.280"
            },
            "BudgetYearOne": {
                "val": "170.847"
            },
            "BudgetYearOneBase": {
                "val": "170.847"
            },
            "BudgetYearTwo": {
                "val": "154.659"
            },
            "BudgetYearThree": {
                "val": "163.156"
            },
            "BudgetYearFour": {
                "val": "190.335"
            },
            "BudgetYearFive": {
                "val": "194.897"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) demonstrates technologies that enhance the ability of U.S. forces to deter, defend against, and survive Chemical, Biological, and Radiological (CBR) warfare.  The PE funds advanced technology development for Joint Service and Service-specific requirements in both medical and physical sciences CBR defense areas.  The medical program (was TB3, TC3, TR3, but in FY13 these continue within one project, TM3), aims to produce biological diagnostic assays and reagents, diagnostic device platforms, pretreatments and therapeutics for bacterial, viral, and toxin threats as well as for chemical threats, and medical devices, as countermeasures for CBR threat agents.  Specific areas of medical investigation include: prophylaxis, pretreatment, antidotes and therapeutics, personnel and patient decontamination, and medical management of casualties.  In the physical sciences area (CB3), the focus is on demonstrations of CB defense technologies, including biological detection, chemical detection, information system technology for hazard prediction and systems performance, and protection, and decontamination. NT3 consolidated all efforts related to non-traditional agents (NTAs), including NTA chemical diagnostics, medical pretreatments, therapeutics, detection, and protection and hazard mitigation. The PE also provides for the conduct of advanced technology development in the areas of real-time sensing, accelerated biological warfare operational awareness, and the restoration of operations following a biological warfare or chemical warfare attack (project TT3).  The PE is dedicated to conducting proof-of-principle field demonstrations, and testing system-specific technologies to meet specific military needs.  Work conducted under this PE will transition to and will provide risk reduction for System Integration\/Demonstration (PE 0603884BP\/PE 0604384BP) activities.\n\nKey efforts within this PE are in support of the FY14 policy priorities for Countering Biological Threats.  Approximately $71.9M supports the priority to \"Promote global health security efforts through building and improving international capacity to prevent, detect, and respond to infectious disease threats, whether caused by natural, accidental, or deliberate events.\"  Approximately $60.0M supports the priority to \"Expand our capability to prevent, attribute, and apprehend those engaged in biological weapons proliferation or terrorism, with a focus on facilitating data sharing and knowledge discovery to improve integrated capabilities.\"  Approximately $75.4M supports the priority to \"Leverage science, technology, and innovation through domestic and international partnerships and agreements to improve global capacity to respond to and recover from biological incidents.\"\n\nTo recap, in FY13, all traditional agent Medical Biological and Medical Chemical Defense efforts (Projects TB3 and TC3) were re-aligned to Project TM3 - Techbase Medical Defense (ATD).  CB3 Advanced Technology Development efforts continue to pursue solutions against traditional agents.  All non-traditional agent (NTA)-dedicated research (both medical and non-medical) was re-aligned to Project NT3 - Techbase Non-Traditional Agents Defense (ATD).    Project TT3, Techbase Technology Transition, pursues efforts  to enhance military operational capability, concepts of operation, WMD elimination, and hazard mitigation following a biological warfare or chemical warfare attack."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "229.200"
                },
                "CurrentYear": {
                    "val": "234.280"
                },
                "BudgetYearOne": {
                    "val": "220.606"
                },
                "BudgetYearOneBase": {
                    "val": "220.606"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "225.441"
                },
                "CurrentYear": {
                    "val": "234.280"
                },
                "BudgetYearOne": {
                    "val": "170.847"
                },
                "BudgetYearOneBase": {
                    "val": "170.847"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.759"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-49.759"
                },
                "BudgetYearOneBase": {
                    "val": "-49.759"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.608"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.151"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-49.759"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-49.759"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY14\n-$49.759M Other Adjustments (CB3 -$252K;  NT3 -$7,531K; TM3 -$48,682K; TT3 +$6,706K)\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CB3"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.838"
                        },
                        "CurrentYear": {
                            "val": "20.034"
                        },
                        "BudgetYearOne": {
                            "val": "18.091"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.091"
                        },
                        "BudgetYearTwo": {
                            "val": "19.224"
                        },
                        "BudgetYearThree": {
                            "val": "18.348"
                        },
                        "BudgetYearFour": {
                            "val": "20.621"
                        },
                        "BudgetYearFive": {
                            "val": "19.960"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (CB3) demonstrates technology advancements for Joint Service application in the areas of detection, information systems technology, protection\/hazard mitigation, and technology transition efforts.  These activities will speed maturing of advanced technologies to reduce risk in system-oriented integration\/demonstration efforts.  This project also includes efforts dedicated to developing capabilities to protect against Non-Traditional Agents (NTAs).  Detection focuses on advanced development of technologies from applied research for standoff and point detection and identification of chemical and biological agents.  Information systems advanced technology focuses on areas of advanced warning and reporting, hazard prediction and assessment, simulation analysis and planning, and systems performance modeling.  Protection and Hazard Mitigation focuses on advanced development of technologies that protect and reduce the chemical\/biological\/radiological\/nuclear threat or hazard to the Warfighter, weapons platforms, and structures.  This project also funds advanced development of chemical and biological defense science and technology initiatives and transitions them to advanced development programs in Budget Activities 4 and 5, through prototypes that are evaluated in Advanced Technology Demonstration (ATDs) and Joint Warfighter Experimentation (JWE).  In FY13, all NTA-dedicated research from this Project was re-aligned to Project NT3 - Techbase Non-Traditional Agents Defense (ATD)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Detection"
                                    },
                                    "Description": {
                                        "val": "Chemical and Biological Stand-off Technology: Focuses on the detection and identification of chemical and biological threats in near real-time at a distance from the detector.  Future programs focus on the improvement of algorithms, excitation sources, and detector elements to increase range, reduce false positives, increase sensitivity, and reduce cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.325"
                                            },
                                            "Text": {
                                                "val": "Closed out development of test methodology for next generation chemical standoff technology.  Began processes of validating ground truth systems for point technologies (genomic and proteomic technology) field assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.852"
                                            },
                                            "Text": {
                                                "val": "Continue processes of validating ground truth systems for point technologies (genomic and proteomic technology) field assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.514"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.514"
                                            },
                                            "Text": {
                                                "val": "Continue processes of validating ground truth systems for point technologies (genomic and proteomic technology) field assessments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Detection NTA"
                                    },
                                    "Description": {
                                        "val": "Detection NTA: Focuses on technologies to provide Non-Traditional Agents (NTA) detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.340"
                                            },
                                            "Text": {
                                                "val": "Initiated the development of test methodology to validate signatures for chemical aerosols threat materials.  In FY13, all research in this area was re-aligned to Project NT3 - Techbase Non-Med - Detection NTA."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Information Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Warning and Reporting Information and Analysis: Emphasis on developing science and technologies for collaborative information management, fusion of disparate information from multiple sources, environmental databases and modeling, fusion of syndromic\/diseases surveillance data, and synthetic environments for model performance evaluation and acquisition decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.267"
                                            },
                                            "Text": {
                                                "val": "Conducted Verification and Validation (V&V) of source term estimation (STE) and hazard refinement (HR) algorithms for use in complex environments (e.g., variable terrain, urban, water, and building interiors).  Transitioned report on the use of meteorological ensemble predictions in dispersion models to Joint Effects Model (JEM)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Information Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Hazard Prediction: Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop predictive capability for the source term of releases of chemical, biological, and industrial materials from weapons and accidents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.913"
                                            },
                                            "Text": {
                                                "val": "Continued development of the high altitude post-missile intercept effects model for defensive use, eventual integration into hazard prediction and counterproliferation model frameworks by drawing upon existing modeling of other agencies and handling both successfully intercepted weapons as well as intentionally functioning weapons of a chemical, biological or nuclear payload.  Continued work on configuration management prototype to implement standard module interfaces to comply with advanced development program requirements.  Established field transport and dispersion databases and websites for accessible permanent test archiving."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.747"
                                            },
                                            "Text": {
                                                "val": "Continue implementation of new numerical schemes for transport and dispersion models.  Continue enhancement of urban transport and dispersion models which transitioned from CB2 efforts in FY12.  Continue with work on configuration management prototype to establish upgraded capabilities listed as valid requirements for JEM.  Complete development on the high altitude post-missile intercept effects model.  Continue with field transport and dispersion databases and websites for accessible permanent test archiving.  Continue implementation and testing of new numerical schemes for future establishment of 64-bit\/multi-core capable models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.739"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.739"
                                            },
                                            "Text": {
                                                "val": "Continue implementation of new numerical schemes and performance optimization for transport and dispersion models.  Continue enhancement of high fidelity urban transport and dispersion.  Continue with work on configuration management of science and technology prototype to establish upgraded capabilities listed as valid requirements for Hazard Prediction and Assessment Capability\/JEM (HPAC\/JEM).  Initiate final development and integration of the missile intercept\/functioning missile effects model (i.e., hazard predictions given an missile intercepted in flight and hazard predictions given a missile that correctly delivers its payload).  Continue providing field transport and dispersion databases and websites for community accessible permanent test archiving.  Continue implementation and testing of new numerical schemes for future establishment of 64-bit\/multi-core capable models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Information Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Operational Effects & Planning: Develop decision support tools and information management capabilities for planning and real-time analysis to determine and assess operational effects, risks, and impacts of CBRN incidents on decision making.  Focus areas include consequence management, population modeling, and human knowledge management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.412"
                                            },
                                            "Text": {
                                                "val": "Transitioned medical countermeasure models, to include: One Chemical Model: Organophosphate; and Five Biological Models: Anthrax, Plague, Lassa Fever, Burkholderia Pseudomallei, and Tularemia models.  In FY14, all System Performance Model development will be consolidated under the Operational Effects & Planning area."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Continue system performance model integration with advanced development programs and initiate development of second generation versions of systems performance models in individual protection, contamination avoidance and decontamination."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Information Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Data Analysis: Develop Chemical, Biological, Radiological and Nuclear (CBRN) data sharing capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Performed improvements in CBRN data management capabilities, with emphasis on enabling access to information for analysis within CBDP systems performance models.  Enhanced analysis toolset which provides the ability to evaluate decontaminants and decontamination systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.985"
                                            },
                                            "Text": {
                                                "val": "Continue to develop the Chemical and Biological Warfare Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB warfare agents on equipment, personnel, and operations, which was initiated in Information Systems Technology, Systems Performance & Information Analysis (CB2 - M&S).  Conclude development of initial versions of systems performance models in collective protection, individual protection, contamination avoidance and decontamination.  Initiate system performance model integration with advanced development for program-wide exploitation.  A portion of this effort is funded in Test & Evaluation (TE3).  In FY14, all System Performance Model development will be consolidated under the Operational Effects & Planning area."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.144"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.144"
                                            },
                                            "Text": {
                                                "val": "Integrate additional chapters of the Chemical and Biological Warfare Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB warfare agents on equipment, personnel, and operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Information Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Medical Surveillance & Information Analysis: Integrate existing disparate military and civilian datasets into advanced warning systems, and leverage and enhance epidemiological models and algorithms for disease prediction, impact and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into agent-based epidemiological modeling, medical resource estimation and decision support tools.  Focus areas include health\/human effects modeling (casualty estimation, agent-based epidemiological modeling and fusion of disease surveillance data)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.867"
                                            },
                                            "Text": {
                                                "val": "Began Validation and Verification (V&V) efforts for existing agent-based epidemiological models, to include underlying population data and disease spread algorithms, with regard to use in robust adaptive decision making.  In FY13, all research in this area was re-aligned into Techbase Med Bio-Diagnostics (TM3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Biosurveillance (BSV)"
                                    },
                                    "Description": {
                                        "val": "Biosurveillance\/Disease Surveillance: Integrate existing disparate military and civilian data sets into advanced warning systems, and leverage and enhance epidemiological models and algorithms for disease prediction, impact and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into agent-based epidemiological modeling, medical resource estimation and decision support tools.  Focus on agent-based epidemiological modeling and fusion of disease surveillance data."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.289"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.289"
                                            },
                                            "Text": {
                                                "val": "Complete effort initiated in Project TM3 (Diagnostics and Disease Surveillance) - of Verification and Validation (V&V) of existing agent-based epidemiological models, to include underlying population data and disease spread algorithms, along with biosurveillance data fusion, for use in robust adaptive decision making.  Demonstrate data stream (inclusive of point of need diagnostic data) integration for early warning and analytical capabilities of the BSV Ecosystem. Develop analytic capabilities to synthesize and interrogate multiple sources of data to provide high confidence in the prediction, early warning and forecasting (inclusive of mitigation strategies) of infectious disease outbreaks.  Continue the development of a scalable, replicable framework to serve as the basis for a biosurveillance cloud for government data.  Continue development of BioID, an infrastructure and integrated set of tools and methods for the collection, storage, recall, and cross comparison of a wide array of biologic-related data emerging from research, clinical testing, and diagnostics, and other diverse sources."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Lightweight Integrated Fabric: Demonstration of lightweight chemical and biological protective textiles that can be used as an integrated combat duty uniform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.691"
                                            },
                                            "Text": {
                                                "val": "Incorporated next phase of integrated textile systems into a complete second generation candidate ensemble for the Uniform Integrated Protective Ensemble (UIPE) Phase II program.  Provided a trade-space analysis of all government, industrial, and academic candidate materials for use in future UIPE phase initiations.  Transitioned human performance initial tool set to the Advanced Development - UIPE program so that it can be used in the optimization of protective ensemble design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.637"
                                            },
                                            "Text": {
                                                "val": "Continue to integrate next phase of integrated textile systems into a complete second generation candidate ensemble for the Uniform Integrated Protective Ensemble (UIPE) Phase II program as well as other applicable Advanced Technology Demonstrations that may materialize.  Continue the trade-space analysis of all government, industrial, and academic candidate materials for use in future UIPE phase initiations.  Continue to transition the human performance tool set to the Advanced Development - UIPE program so that it can be used in the optimization of protective ensemble design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.809"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.809"
                                            },
                                            "Text": {
                                                "val": "Continue to integrate next phase of integrated textile systems into a complete second generation candidate ensemble for the Uniform Integrated Protective Ensemble (UIPE) Phase II program as well as other applicable Advanced Technology Demonstrations that may materialize.  Transition new fabric technologies to the UIPE program.  Scale-up fabrics to ensemble prototypes and test in a relevant environment.  Continue the trade-space analysis of all government, industrial, and academic candidate materials for use in future UIPE phase initiations.  Complete transition the human performance tool set to the Advanced Development - UIPE program so that it can be used in the optimization of protective ensemble design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Low-Resistance, Low-Profile Filtration: Demonstration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.690"
                                            },
                                            "Text": {
                                                "val": "Continued demonstration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals.  Initiated transition of these technologies to the Joint Service General Purpose Mask (JSGPM) and Joint Service Aircrew Mask (JSAM) programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.292"
                                            },
                                            "Text": {
                                                "val": "Continue the integration and demonstration of latest generation novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals.  Continue transition of these technologies to the JSGPM and JSAM programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.937"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.937"
                                            },
                                            "Text": {
                                                "val": "Continue the integration and demonstration of latest generation novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals.  Continue transitioning these technologies to the JSGPM and JSAM programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Low-Burden Air Purifying Respirator: Demonstration of design alternatives for chemical and biological air-purifying respirators to provide enhanced protection with lower physiological burden and improved interface with mission equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.746"
                                            },
                                            "Text": {
                                                "val": "Advanced concept CBRN technologies were integrated within the confines of the Chem\/Bio protection component of the Helmet Electronics and Display System - Upgradable Protection (HEADS-UP) Army Technology Objective (ATO) program, which has multi-service participation for ground applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.467"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.467"
                                            },
                                            "Text": {
                                                "val": "Develop prototype respirator and conduct testing in a relevant environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Logistically Sustainable Air Purification for Collective Protection: Demonstration of chemical and biological air-purification alternative technologies that minimize or eliminate the need for expendable media within acceptable size, weight, and power constraints."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.204"
                                            },
                                            "Text": {
                                                "val": "Demonstrated breadboard concepts of a residual life indicator (RLI) for collective filtration systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Decontamination Family-of-Systems (DFoS): Demonstration of non-traditional decontamination technologies and approaches which gain significantly improved effectiveness by complementary application."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.271"
                                            },
                                            "Text": {
                                                "val": "Continued demonstration of non-traditional decontamination technologies and approaches which gain significantly improved effectiveness by complementary application.  Integrated robust surface chemistry and decontamination process analysis using ultra high vacuum system into technology maturation process for hazard mitigation.  Demonstrated Integrated Decontamination Test Evaluation System (IDTES) live agent testing facility that allows scaled relevant environment evaluations.  Pursued the optimization of reactive coatings (durable).  Transitioned research efforts \"Surfactant Technology for Surface Chemical\/Biological Agent Removal\" and \"Decontamination Assurance Spray.\""
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.397"
                                            },
                                            "Text": {
                                                "val": "Continue the development, demonstration, and transition of non-traditional decontamination technologies and approaches which gain significantly improved effectiveness by complementary application.  Continue to integrate and demonstrate robust surface chemistry and decontamination process analysis using ultra high vacuum system into technology maturation process for hazard mitigation.  Continue to develop coatings, innovative chemistries\/processes, enzyme approaches to hazard mitigation, human remains decontamination processes, and radiological\/nuclear decontamination\/hazard mitigation capabilities.  Transition quantitatively evaluated interim capability for radiological\/nuclear decontamination\/hazard mitigation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.192"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.192"
                                            },
                                            "Text": {
                                                "val": "Continue the development, demonstration, and transition of non-traditional decontamination technologies and approaches which gain significantly improved effectiveness by complementary application.  Continue to integrate and demonstrate robust surface chemistry and decontamination process analysis using ultra high vacuum system into technology maturation process for hazard mitigation.  Continue to develop coatings, innovative chemistries\/processes, enzyme approaches to hazard mitigation, human remains decontamination processes, and radiological\/nuclear decontamination\/hazard mitigation capabilities.  Transition quantitatively evaluated interim capability for radiological\/nuclear decontamination\/hazard mitigation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "14) Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Innovative Systems Concepts and Analysis: Development and systems analysis of novel system concepts for chemical and biological protection of occupants of buildings and platforms that integrates emerging technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.362"
                                            },
                                            "Text": {
                                                "val": "Transitioned research effort \"Reactive Airlock for Armored Vehicles, Shipboard and Shelter Applications.\""
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "15) Test and Evaluation (T&E)"
                                    },
                                    "Description": {
                                        "val": "Test and Evaluation, Information System Technology: Develop CBRN data sharing capabilities and simulation tools."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.124"
                                            },
                                            "Text": {
                                                "val": "Continue to develop the Test & Evaluation components of the Chemical and Biological Warfare Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB warfare agents on equipment, personnel, and operations.  Conclude development of initial versions of systems performance models in collective protection, individual protection, contamination avoidance and decontamination.  This project is being partially funded by CB3 Tech Base Non Med - Modeling and Simulation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB2"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "97.530"
                                        },
                                        "CurrentYear": {
                                            "val": "44.331"
                                        },
                                        "BudgetYearOne": {
                                            "val": "53.901"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "53.901"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "55.042"
                                        },
                                        "BudgetYearThree": {
                                            "val": "59.834"
                                        },
                                        "BudgetYearFour": {
                                            "val": "66.483"
                                        },
                                        "BudgetYearFive": {
                                            "val": "66.214"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TE3"
                                    },
                                    "Title": {
                                        "val": "TEST & EVALUATION (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.306"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "10.306"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CA4"
                                    },
                                    "Title": {
                                        "val": "CONTAMINATION AVOIDANCE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.432"
                                        },
                                        "CurrentYear": {
                                            "val": "3.038"
                                        },
                                        "BudgetYearOne": {
                                            "val": "26.853"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "26.853"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.788"
                                        },
                                        "BudgetYearThree": {
                                            "val": "40.163"
                                        },
                                        "BudgetYearFour": {
                                            "val": "34.595"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.873"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DE4"
                                    },
                                    "Title": {
                                        "val": "DECONTAMINATION SYSTEMS (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.755"
                                        },
                                        "CurrentYear": {
                                            "val": "12.374"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.870"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.870"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.611"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.174"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.337"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.500"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "IS4"
                                    },
                                    "Title": {
                                        "val": "INFORMATION SYSTEMS (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.219"
                                        },
                                        "CurrentYear": {
                                            "val": "13.831"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.199"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.199"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.845"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.360"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.100"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TE4"
                                    },
                                    "Title": {
                                        "val": "TEST & EVALUATION (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.458"
                                        },
                                        "CurrentYear": {
                                            "val": "4.994"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.671"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.671"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.408"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.872"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.044"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.044"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TT4"
                                    },
                                    "Title": {
                                        "val": "TECHBASE TECHNOLOGY TRANSITION (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.985"
                                        },
                                        "CurrentYear": {
                                            "val": "3.377"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "6.362"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NT3"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "31.916"
                        },
                        "BudgetYearOne": {
                            "val": "23.333"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.333"
                        },
                        "BudgetYearTwo": {
                            "val": "29.248"
                        },
                        "BudgetYearThree": {
                            "val": "30.727"
                        },
                        "BudgetYearFour": {
                            "val": "37.728"
                        },
                        "BudgetYearFive": {
                            "val": "40.975"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (NT3) develops future capabilities against emerging and novel threats and verifies current capabilities against Non-Traditional Agents (NTAs).  This project focuses on demonstrating fast and agile scientific responses to enhance or develop capabilities that address emerging threats.  Efforts in this project support an integrated approach to develop new or enhanced countermeasures against novel and emerging threats through innovative science and technology (S&T) solutions for detection, protection, decontamination and medical countermeasures (MCMs).  Efforts supply test methodologies and supporting science to verify capabilities, develop protection and hazard mitigation options, expand hazard assessment tools, and develop MCMs against NTAs.  This project is a comprehensive and focused effort for developing NTA defense capabilities, coordinated with specific interagency partners for doctrine, equipment, and training for the Warfighter and civilian population for defense against NTAs.  This project funds advanced technology development of NTA defense science and technology initiatives and transitions them to Budget Activities 4 and 5."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Techbase Medical Defense - NTA Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Chem Diagnostics NTA: Focuses on state-of-the-art laboratory\/fieldable methods that detect exposure to non-traditional agents in clinical samples.  It also targets the identification of biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.404"
                                            },
                                            "Text": {
                                                "val": "Continue development of mature technologies that can quickly diagnose pre-symptomatic NTA exposure.  Funding for this research area was re-aligned from Tech Base Med Defense - Diagnostics NTA (TC3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.574"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.574"
                                            },
                                            "Text": {
                                                "val": "Continue development of mature technologies that can quickly diagnose pre-symptomatic NTA exposure.  Transition method development for identification and validation of NTAs in clinical samples to the Laboratory Response Network."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Techbase Medical Defense - NTA Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Chemical Medical Pretreatments NTA: Develop nerve agent enzyme pretreatments that provide protection against non-traditional agents.  Enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high catalytic efficiency for the destruction of agents.  For enzyme approaches, one molecule of catalytic bioscavenger should be capable of detoxifying numerous molecules of nerve agents resulting in the capability for a small quantity of catalytic bioscavenger to protect against a large dose of nerve agent."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.503"
                                            },
                                            "Text": {
                                                "val": "Continue exploitation of alternative expression systems for production of recombinant butylcholinesterase (rBuChE).  Complete study of use of plasma derived human butylcholinesterase (huBChE) as prophylactic for all nerve agents.  Funding for this research area was re-aligned from Tech Base Med Chem - Pretreatments NTA (TC3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.960"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.960"
                                            },
                                            "Text": {
                                                "val": "Continue exploitation of alternative expression systems for production of rBuChE.  Pursue novel in-silico and\/or in vitro methods to facilitate high throughput screening and development of medical countermeasures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Techbase Medical Defense - NTA Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Chemical Medical Therapeutics NTA: Determine the toxic effects of agents by probable routes of field exposure and refine standard experimental routes.  Physiological parameters and pathological assessment will be used to establish the general mode and mechanisms of toxicity."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.055"
                                            },
                                            "Text": {
                                                "val": "Continue formulation and stability studies.  Begin safety studies in small animal model using selected formulation.  Funding for this research area was re-aligned from Tech Base Med Chem - Therapeutics NTA (TC3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.935"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.935"
                                            },
                                            "Text": {
                                                "val": "Continue formulation and stability studies of therapeutic compounds.  Continue small animal model safety studies of selected formulations of centrally active reactivator or anti-cholinergic compounds."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Techbase Non-Medical - Detection"
                                    },
                                    "Description": {
                                        "val": "Detection NTA: Focuses on technologies to provide NTA detection capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.373"
                                            },
                                            "Text": {
                                                "val": "Continue the development of test methodology to validate signatures for chemical aerosol threat materials.  Funding for this research area was re-aligned from Tech Base Non-Med Defense - Detection NTA (CB3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.322"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.322"
                                            },
                                            "Text": {
                                                "val": "Continue the development of test methodology to validate signatures for chemical aerosol threat materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Techbase Non-Medical - Modeling & Simulation"
                                    },
                                    "Description": {
                                        "val": "Modeling & Simulation NTA: Provide modeling of NTA materials for hazard prediction and development of defensive countermeasures.  Develop NTA source term algorithms for predicting CBRN hazards from intentionally functioning weapons, counter-proliferation scenarios (bomb on target), and missile intercept.  \"Intentionally Functioning Weapons\" refers to the case where a missile has released its chemical or biological payload as it was designed, rather than where the release was caused by our missile interdiction.  Transition NTA agent fate for secondary effects, environmental\/atmospheric chemistry, atmospheric and waterborne transport and dispersion, human effects, model Validation and Verification (V&V), scaled testing, casualty estimation, and supporting data management."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.288"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.288"
                                            },
                                            "Text": {
                                                "val": "Conduct analysis and oversight of the final year of NTA simulant testing related to creating and verifying NTA modeling source terms, for defense against CBRN hazards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Techbase Non-Medical - Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Protection & Hazard Mitigation - NTA Air Purification: Study and assessment of filter technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.348"
                                            },
                                            "Text": {
                                                "val": "Continue development, verification and demonstration of novel materials to improve performance against NTAs.  Transition these technologies to the Joint Service General Purpose Mask (JSGPM) and Joint Service Aircrew Mask (JSAM) programs.  Funding for this research area was re-aligned from Tech Base Non-Med Defense - Protection & Hazard Mitigation NTA (CB3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Techbase Non-Medical - Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Protection & Hazard Mitigation - NTA Percutaneous Protection: Study and assessment of protective technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.349"
                                            },
                                            "Text": {
                                                "val": "Continue the verification of protective fabrics against non-traditional agents.  Demonstrate and begin transition of low burden technologies (such as reduced thermal-burden fabrics, and lighter weight fabrics) to improve overall protective clothing performance against NTAs.  Funding for this research area was re-aligned from Tech Base Non-Med Defense - Protection & Hazard Mitigation NTA (CB3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.065"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.065"
                                            },
                                            "Text": {
                                                "val": "Continue verification, demonstration and transition of low burden technologies to improve overall protective clothing performance against NTAs.  Transition technologies to the Uniform Integrated Protective Ensemble (UIPE) program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Techbase Non-Medical - Protection & Hazard Mitigation"
                                    },
                                    "Description": {
                                        "val": "Protection & Hazard Mitigation - NTA Decontamination: Study and assessment of decontamination technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "Continue verification and demonstration of decontamination technologies against NTAs.  Continue to develop and demonstrate enzyme technology for low-impact decon of NTAs.  Continue to enhance NTA related understanding and capabilities of current decontamination and hazard mitigation technologies and develop additional processes for NTA hazard mitigation.  Funding for this research area was re-aligned from Tech Base Non-Med Defense - Protection & Hazard Mitigation NTA (CB3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.238"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.238"
                                            },
                                            "Text": {
                                                "val": "Continue verification, demonstration, and transition of decontamination technologies against NTAs to the Advanced Development - Decontamination Family of Systems (DFoS) program.  Continue to develop and demonstrate enzyme technology for low-impact decontamination of NTAs, and transition these technologies.  Continue to enhance NTA-related understanding and capabilities of current decontamination and hazard mitigation technologies and develop additional processes for NTA hazard mitigation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Techbase Non-Medical - Test & Evaluation"
                                    },
                                    "Description": {
                                        "val": "Test and Evaluation (T&E) NTA: Develops test and evaluation technologies and processes in support of NTA activities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.534"
                                            },
                                            "Text": {
                                                "val": "Complete initial select agent testing, and continue further prioritized agent testing.  Funding for this research area was re-aligned from Tech Base Non-Med Defense - Test & Evaluation NTA (TE3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.951"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.951"
                                            },
                                            "Text": {
                                                "val": "Continue further prioritized select agent testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NT2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "60.730"
                                        },
                                        "BudgetYearOne": {
                                            "val": "75.053"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "75.053"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "71.749"
                                        },
                                        "BudgetYearThree": {
                                            "val": "72.932"
                                        },
                                        "BudgetYearFour": {
                                            "val": "77.542"
                                        },
                                        "BudgetYearFive": {
                                            "val": "77.805"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CA4"
                                    },
                                    "Title": {
                                        "val": "CONTAMINATION AVOIDANCE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.432"
                                        },
                                        "CurrentYear": {
                                            "val": "3.038"
                                        },
                                        "BudgetYearOne": {
                                            "val": "26.853"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "26.853"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.788"
                                        },
                                        "BudgetYearThree": {
                                            "val": "40.163"
                                        },
                                        "BudgetYearFour": {
                                            "val": "34.595"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.873"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DE4"
                                    },
                                    "Title": {
                                        "val": "DECONTAMINATION SYSTEMS (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.755"
                                        },
                                        "CurrentYear": {
                                            "val": "12.374"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.870"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.870"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.611"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.174"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.337"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.500"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "IP4"
                                    },
                                    "Title": {
                                        "val": "INDIVIDUAL PROTECTION (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "1.102"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.708"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.708"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.811"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.680"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.300"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "15.601"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.697"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.705"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.114"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.920"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.186"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TE4"
                                    },
                                    "Title": {
                                        "val": "TEST & EVALUATION (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.458"
                                        },
                                        "CurrentYear": {
                                            "val": "4.994"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.671"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.671"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.408"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.872"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.044"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.044"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TB3"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL BIOLOGICAL DEFENSE (ATD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "168.684"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "168.684"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (TB3) supports preclinical and early phase clinical development of vaccines, therapeutic drugs, and diagnostic capabilities to provide safe and effective medical defense against validated biological threat agents or emerging infectious disease biothreats including bacteria, toxins, and viruses.  Innovative biotechnology approaches to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to biological threat agents will be evaluated.  Entry of candidate vaccines, therapeutics, and diagnostic technologies into advanced development is facilitated by the development of technical data packages that support the Food and Drug Administration (FDA) Investigational New Drug (IND) processes, DoD acquisition regulations, and the oversight of early phase clinical trials in accordance with FDA guidelines.  Categories of this project include biological defense capability areas such as Pretreatments, Diagnostics, and Therapeutics.  Pretreatment efforts conduct research and development (R&D) of promising vaccines, medications, and technologies provided prior to potential exposure to biological agents.  The goal is to reduce or to entirely prevent adverse effects of exposure.  Diagnostic efforts are aimed at screening procedures and analytical methods to verify exposure and determine the effects of exposure to biological warfare (BW) or other biothreat agents.  Therapeutic efforts provide medical solutions to sustain and protect the Warfighter in biological environments.  Specifically, therapeutic efforts are aimed at developing medical countermeasures to treat exposure to biological or emerging threats such as bacterial (plague, anthrax, glanders), viral (smallpox, encephalitic Alphaviruses), and toxin (ricin, botulinum neurotoxin, staphylococcal enterotoxin) agents. \n\nThis project includes the Transformational Medical Technologies Initiative (TMTI).  The program was launched to respond to the threat of emerging or intentionally engineered biological threats.  TMT's mission is to protect the Warfighter from genetically engineered or emerging infectious disease biological threats by providing a rapid response capability from identification of pathogens to the delivery of medical countermeasures.  This mission is accomplished through two main efforts: 1) developing broad spectrum (multi-agent) therapeutics against BW or emerging infectious disease agents (e.g. one drug that treats multiple agents); and 2) developing platform technologies to assist in the rapid development of medical countermeasures (MCMs) in response to BW or emerging infectious disease agents (e.g. developing new and innovative ways to mass produce drugs in the event of a biological incident).  Effective FY12 this effort was funded as the Transformational Medical Technologies (TMT) Program. \n\nThe Medical Countermeasures Initiative (MCMI) was established to coordinate inter-related advanced development and flexible manufacturing capabilities providing a dedicated, cost-effective, reliable, and sustainable MCM process that meets the Warfighter and national security needs.  Specifically, the MCMI will provide the capability for the advanced development and flexible manufacturing of biological MCM (to include TMT developed MCMs) to address CBRN threats, including novel and previously unrecognized, naturally-occurring emerging infectious diseases.  MCMI efforts within science and technology (S&T) are concentrated in three areas: 1) transition of novel platform\/expression systems for MCMs, 2) transition advancement of regulatory science, and 3) integration of novel platforms with MCM advanced development and manufacturing.\n\nIn FY13, all research in this Project (TB3) was re-aligned to Project TM3 - Techbase Medical Defense (ATD)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Medical Countermeasures Initiative (MCMI)"
                                    },
                                    "Description": {
                                        "val": "The MCMI will integrate the regulatory science and manufacturing technologies and processes developed into the advanced development and flexible manufacturing capability (MCM-Advanced Development and Manufacturing (ADM))."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.878"
                                            },
                                            "Text": {
                                                "val": "Initiated and refined the development of multi-product\/multi-use MCM technology platforms for the advanced development of MCMs for CBRN threats and emerging infectious diseases.  Evaluated and exploited the regulatory advantages of such systems, with the intent that FDA regulatory approval of the same platform for one product will simplify subsequent regulatory approvals of other products based on the same system.  Initiated and refined development of new technologies and approaches that facilitate and accelerate the development and regulatory review of medicinal products.  In FY13, all research in this area was re-aligned into Techbase Med Defense - Medical Countermeasures Initiative (TM3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Diagnostics (Biosurveillance)"
                                    },
                                    "Description": {
                                        "val": "Diagnostic Technologies: Development and verification of rapid, sensitive and specific tests for the identification of Biological Warfare Agents (BWAs) and their expressed toxins in biological fluids of Warfighters for the diagnosis of exposure\/infection.  Discovery of biomarkers of response to exposure.  Evaluation of next generation diagnostic technologies including portable instrument platforms, highly parallel and informative testing formats, and nanotechnology applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.285"
                                            },
                                            "Text": {
                                                "val": "Validated and submitted pre-EUA (Emergency Use Authorization) data to FDA for high priority BWA and emerging threat assays to preposition for biopreparedness.  Transitioned portable sequence based genetic analyzer and verified assays for top ten priority agents.  Transitioned technology watch report and mature candidate platform technologies of sufficient utility for advanced development as Next Generation Diagnostics System and\/or Biosurveillance platform.  Transitioned data packages for detection of antibiotic (Cipro) resistance.  Validated and transitioned scale-up protocols for single domain biosynthetic (recombinant) antibodies to bacterial and viral BWA targets for use in austere environments.  Supplemented\/continued accrual of geographically\/genetically representative strain collection and transfer to repository; developed quantitative cell culture for an additional emerging threat agent of high genetic variability.  Transitioned atlas\/database of phenotypic and genotypic characteristics of relevant BWA bacterial strains to advanced developer.  In FY13, all research in this area was re-aligned into Project TM3 - Techbase Med Bio - Diagnostics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Bacterial\/Toxin Vaccines: Evaluates the best single agent bacterial and toxin vaccines for effectiveness against aerosol challenge in large animal models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.564"
                                            },
                                            "Text": {
                                                "val": "Performed final analysis of data from Phase I Clinical trial.  Assembled final Ricin vaccine data package.  In FY13, all research in this area was re-aligned into Project TM3 - Techbase Med Bio - Pretreatments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Viral Vaccines: Evaluates the best vaccine candidates for Alphaviruses and Filoviruses for effectiveness and duration of protective immune response against aerosol challenge in large animal models.  Animal models will be developed to support FDA licensure of mature vaccine candidates.  The purpose of developing these animal models is to support pivotal animal studies under the \"Animal Rule\"."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.530"
                                            },
                                            "Text": {
                                                "val": "Completed remaining aerosol efficacy studies for the Ebola Zaire and Ebola Sudan vaccine components in non-human primates.  Conducted formulation studies of Ebola and Marburg vaccine components.  Initiated the development of Filovirus and Alphavirus immunological assays to support advanced development.  Coordinated with the advanced developer to fulfill S&T needs in support of the Filovirus vaccine transition.  For Alphavirus DNA vaccines, completed an Investigational New Drug (IND) package for the Venezualan Equine Encephalomyelitis (VEE) component, submitted the IND package to the FDA and initiated a Phase I clinical trial.  As a part of this trial, assessed alternative methodologies for vaccine delivery (i.e., electroporation) via intra-muscular or intra-dermal administration, manufactured clinical grade (sufficient quality to be administered to humans in a Phase I clinical trial) lots of the EEE (Eastern) and WEE (Western) DNA components.  Conducted pre-clinical studies on a trivalent VEE, EEE, WEE DNA formulation.  For the Alphavirus replicon vaccine, conducted pre-clinical studies.  Continued development of animals models for Alphaviruses (EEE and WEE), and Filoviruses (Ebola Sudan, Ebola Zaire, Ebola Bundibugyo, and Marburg), to fulfill future FDA 'Animal Rule' requirements necessary for vaccine licensure.  Although the Filovirus vaccines were transitioned in FY11, work continued on the selected candidate(s) to fill knowledge gaps.  In FY13, all research in this area was re-aligned into Project TM3 - Techbase Med Bio - Pretreatments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Vaccine Platforms and Research Tools: Conducts studies to determine potential immune interference between lead vaccine candidates, the effect of alternative vaccine delivery methods and thermo-stabilization technologies on the efficacy of lead vaccine candidates.  Identifies correlates of protection in humans, and predicts the success of lead vaccine candidates in humans.  Work conducted under Vaccine Platforms and Research Tools are distinct from those performed under Viral Vaccines because the focus is on the use of novel technologies to support vaccine candidates, not on the vaccine candidates themselves.  Vaccine Platforms and Research Tools utilize novel technologies to stabilize advanced vaccine candidates as well as alternative delivery modalities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.450"
                                            },
                                            "Text": {
                                                "val": "Continued evaluation of the safety and immune stimulating capability of mature Filovirus and Alphavirus vaccine candidates in humans by using the Modular Immune In Vitro Construct (MIMIC) technology.  Continued formulation studies to produce a thermo-stable, spray-dried formulation of an advanced vaccine candidate.  Evaluated additional stabilization technologies that provide thermal stability to multiple classes of vaccines such as viral vectored vaccines and subunit protein vaccines.  Tested alternative (needle-free) vaccine delivery technologies such as inhalers or skin patches for the delivery of mature vaccine candidates.  Evaluated clinical samples from Filovirus and Alphavirus outbreaks in multiple international locations to determine human immune responses.  In FY13, all research in this area was re-aligned into Project TM3 - Techbase Med Bio - Pretreatments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Viral Therapeutics: Identify, optimize and evaluate potential therapeutic candidates effective against designated viral threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.029"
                                            },
                                            "Text": {
                                                "val": "Evaluated polyclonal immunotherapies for Filoviruses in non-human primate models.  Initiated projects to develop monoclonal antibody-based therapies for Filovirus infection.  Continued evaluation of optimized lead compounds against Alphaviruses in animal models of infection.  Continued evaluation of Filovirus vaccines as treatments for post-exposure Filovirus infection.  Identified and evaluate FDA approved drugs and combinations of drugs for activity against Filoviruses and Alphaviruses in cell culture.  Evaluated select FDA-approved drugs for efficacy against Filoviruses in animal models of infection.  Initiated an expanded screening program to determine efficacy of FDA approved compounds against other viral infectious diseases (i.e. Flavivirus, Arenavirus, Bunyavirus).  Identified and optimized novel host-directed small molecule inhibitors, with activity against Biothreat Viruses (i.e., Filovirus, Flavivirus, Arenavirus, and Bunyavirus).  In FY13, all research in this area was re-aligned to Project TM3 - Techbase Med Bio-Therapeutics (ATD)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Bacterial Therapeutics: Identify, optimize, and evaluate potential therapeutic compounds effective against bacterial threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.753"
                                            },
                                            "Text": {
                                                "val": "Evaluated Protein Design Process optimized anthrax capsule depolymerase (CapD) in murine challenge models of Anthrax infection.  Transitioned data package demonstrating efficacy of FDA approved compounds against lethal challenge of aerosolized Y. pestis in nonhuman primate models.  Conducted studies to determine efficacy against FDA approved compounds against Burkholderia, Francisella tularensis in murine animal models.  Evaluated small molecule inhibitors targeting Y. pestis ATPase enzyme in small animal models.  In FY13, all research in this area was re-aligned to Project TM3 - Techbase Med Bio-Therapeutics (ATD)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Transformational Medical Technologies"
                                    },
                                    "Description": {
                                        "val": "Multiagent (Broad Spectrum) Medical Countermeasures: Continues efforts previously funded under the Transformational Medical Technologies Initiative to develop candidate countermeasures for Hemorrhagic Fever Virus (HFV) and Intracellular Bacterial Pathogen (IBP).  Focuses on the initiation and completion of preclinical studies for candidate countermeasures, to include safety, toxicity, efficacy, and scalability work in accordance with the product's intended use.  The ability to formulate Good Manufacturing Practices (GMP), pilot lots and further mature promising drug candidates will be the focus of activities in this capability area.  The preclinical drug discovery process culminates in the submission of an Investigational New Drug (IND) application to the Food and Drug Administration (FDA), to determine if candidate countermeasures are suitable for safety evaluation in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "38.603"
                                            },
                                            "Text": {
                                                "val": "Continued pre-clinical research required to submit IND applications to the FDA for additional products or additional product indications to refresh the HFV, IBP, and Emerging Infectious Disease (EID product) pipelines.  Continued planning for Phase 1 clinical trials and additional studies for INDs as required by the FDA prior to safety evaluation in humans.  Continued the development of animal models for future advanced development of MCMs currently in the S&T phase of development, incorporating feedback from the FDA and Services into requirements.  In FY13, all research in this area was re-aligned to Project TM3 - Techbase Med-Bio Therapeutics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Transformational Medical Technologies"
                                    },
                                    "Description": {
                                        "val": "Development of Platform Technologies: Continues efforts previously funded under the Transformational Medical Technologies Initiative.  Platform Technologies are stand alone enabling technologies that support MCM development and when strategically aligned, provide a system of systems response capability to an adverse biological event - from the identification of an unknown pathogen to the development of an approved countermeasure ready for delivery to the Warfighter and the nation.  The enabling technologies are divided into five platform areas: Pathogen Characterization, Target Identification, Countermeasure Discovery, Countermeasure Evaluation, and Bioinfomatics.  Efforts focus on advanced technology and development activities for Platform Technologies to include the maturation of components that will begin the process of integrating a countermeasure response pipeline.  Off-the-shelf technologies will be identified, evaluated, and refined to demonstrate the ability to provide drug development capabilities.  Advanced manufacturing platforms will continue to mature and the technology application will focus on the type of specific therapeutics under development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "53.592"
                                            },
                                            "Text": {
                                                "val": "Invested to fund Bio-Surveillance efforts and integrated stand-alone platforms into system-wide capabilities.  Continued development of rapid drug discovery and development platform technologies, and built upon early success to fully integrate the entire system using robust bioinformatics capabilities, validated the integrated bioinformatics platform.  Increased investment to mature and accelerate manufacturing platform technologies for biological drugs to comply with regulatory guidelines.  Supported compliance and quality measures that are mandatory for future FDA submissions.  Fully integrated pathogen characterization, target identification, countermeasure discovery and countermeasure evaluation platform areas into a rapid response capability supported by a centralized bioinformatics capability that link geographically separated performers from government agencies, industry and academia.  In FY13, all research in this area was re-aligned to Project TM3 - Techbase Med-Bio Diagnostics."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "182.330"
                                        },
                                        "BudgetYearOne": {
                                            "val": "122.717"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "122.717"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "99.930"
                                        },
                                        "BudgetYearThree": {
                                            "val": "107.506"
                                        },
                                        "BudgetYearFour": {
                                            "val": "123.790"
                                        },
                                        "BudgetYearFive": {
                                            "val": "126.110"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "121.170"
                                        },
                                        "CurrentYear": {
                                            "val": "133.254"
                                        },
                                        "BudgetYearOne": {
                                            "val": "122.936"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "122.936"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "95.724"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.461"
                                        },
                                        "BudgetYearFour": {
                                            "val": "41.661"
                                        },
                                        "BudgetYearFive": {
                                            "val": "30.014"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "197.907"
                                        },
                                        "CurrentYear": {
                                            "val": "212.056"
                                        },
                                        "BudgetYearOne": {
                                            "val": "263.443"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "263.443"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "228.199"
                                        },
                                        "BudgetYearThree": {
                                            "val": "183.390"
                                        },
                                        "BudgetYearFour": {
                                            "val": "151.455"
                                        },
                                        "BudgetYearFive": {
                                            "val": "184.222"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (OP SYS DEV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.371"
                                        },
                                        "CurrentYear": {
                                            "val": "0.498"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.499"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.499"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.414"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.551"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.816"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.277"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TC3"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL CHEMICAL DEFENSE (ATD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.182"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "21.182"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (TC3) supports the advanced development of medical countermeasures to include prophylaxes, pretreatments, antidotes, skin decontaminants and therapeutic drugs against identified and emerging chemical warfare threat agents.  Analytical stability studies, safety and efficacy screening, and preclinical toxicology studies are performed prior to full-scale development of promising pretreatment or treatment drug compounds.  Entry of candidate pretreatment\/prophylaxes, therapeutics, and diagnostic technologies into advanced development (i.e., efforts funded in Budget Activities 4 and 5) is facilitated by the development of technical data packages that support the Food and Drug Administration (FDA) Investigational New Drug (IND) application and licensure processes, as well as Department of Defense (DoD) acquisition regulations.  Categories for this project include Pretreatments, Diagnostics, and Therapeutics to address Chemical Warfare Agent (CWA) and Non-Traditional Agents (NTAs) exposure.  In FY13, all non-NTA research in this Project (TC3) was re-aligned to Project TM3 - Techbase Medical Defense (ATD).  All NTA-dedicated research in this Project was re-aligned to Project NT3 - Techbase Non-Traditional Agents Defense (ATD)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Diagnostic Technologies: Focuses on state-of-the-art laboratory\/fieldable methods that detect exposure to chemical warfare agents (CWA) (e.g., nerve agents and vesicants) in clinical samples.  It also targets the identification of biomolecular targets that can be leveraged as analytical methodologies, as well as laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.876"
                                            },
                                            "Text": {
                                                "val": "Expanded the current set of analytical methods to more sensitive analytical platforms for the detection of CWAs.  In FY13, all research in this area was re-aligned to Project TM3 - Techbase Med Chem - Diagnostics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Chem Diagnostics NTA"
                                    },
                                    "Description": {
                                        "val": "Chem Diagnostics NTA: Focuses on state-of-the-art laboratory\/fieldable methods that detect exposure to non-traditional agents in clinical samples.  It also targets the identification of biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.431"
                                            },
                                            "Text": {
                                                "val": "Continued evaluation of mature technologies that can quickly diagnose pre-symptomatic NTA exposure.  In FY13, all research in this area was re-aligned to Project NT3 - Techbase Med Defense - NTA Diagnostics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Nerve Agent, Pretreatments: Develop pretreatments that provide protection against all organophosphorous nerve agents.  The enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high enzymatic efficiency for the destruction of agents.  For enzyme approaches, one molecule of catalytic bioscavenger should be capable of detoxifying numerous molecules nerve agents resulting in the capability for a small quantity of catalytic bioscavenger to protect against a large dose of nerve agent."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.367"
                                            },
                                            "Text": {
                                                "val": "Refined methods and expression systems for large-scale production and purification of enzymes.  Continued testing of improved pretreatment delivery methods and retention approaches in animal models, including physiologically based pharmacokinetics (PBPK).  Developed binding proteins in animal models for safety and efficacy.  In FY13, all research in this area was re-aligned to Project TM3 - Techbase Medical Defense - Pretreatments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Chem Pretreatments NTA"
                                    },
                                    "Description": {
                                        "val": "Chem Pretreatments NTA: Develop nerve agent enzyme pretreatments that provide protection against non-traditional agents.  Enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high catalytic efficiency for the destruction of agents.  For enzyme approaches, one molecule of catalytic bioscavenger should be capable of detoxifying numerous molecules nerve agents resulting in the capability for a small quantity of catalytic bioscavenger to protect against a large dose of nerve agent."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.880"
                                            },
                                            "Text": {
                                                "val": "Tested improved nerve agent enzyme pretreatment delivery methods and retention approaches in animal models, including physiologically based pharmacokinetics.  Further developed binding proteins in animal models for safety and efficacy.  In FY13, all research in this area was re-aligned to Project NT3 - Techbase Medical Defense - NTA Pretreatments"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Cutaneous and Ocular: Focuses on minimizing injuries to dermal and ocular tissues resulting from exposure to chemical warfare agents (CWA).  This work is designed to support eventual Food and Drug Administration (FDA) licensure of new compounds or new indications for licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.645"
                                            },
                                            "Text": {
                                                "val": "Determined the most effective cell-based approaches to facilitate healing of skin and eye wounds due to sulfur mustard exposure.  Completed evaluation of potential wound healing products for advanced development.  Evaluated candidate approaches to decontaminate penetrating wounds that have been exposed to CWAs.  Continued to assess molecular biology approaches in animal models to treat skin and eye injuries as a result of sulfur mustard exposure.  In FY13, all research in this area was re-aligned to Project TM3 - Techbase Med Chem - Therapeutics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Neurologic: Focuses on therapeutic strategies to effectively minimize neurologic injuries resulting from exposure to chemical warfare agents (CWA).  This effort involves the development of neuroprotectants, anticonvulsants, and improved neurotransmitter restorers.  Supports eventual Food and Drug Administration (FDA) licensure of new compounds or new indications for licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.355"
                                            },
                                            "Text": {
                                                "val": "Continued animal model evaluation of novel and\/or FDA approved drugs not previously tested for treatment of nerve agent exposure.  Continued development of animal models related to nerve agent exposure.  Maintained core capabilities for standardization of in vitro and in vivo testing of therapeutic candidates.  In FY13, all research in this area was re-aligned to Project TM3 - Techbase Medical Chemical - Therapeutics"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Chem Therapeutics NTA"
                                    },
                                    "Description": {
                                        "val": "Non-Traditional Agents (NTA): Determine the toxic effects of agents by probable routes of field exposure and refine standard experimental routes.  Physiological parameters and pathological assessment will be used to establish the general mode and mechanisms of toxicity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.628"
                                            },
                                            "Text": {
                                                "val": "Completed characterization of a novel therapeutic for manufacturability and pharmacology.  Established formulation for safety testing and stability.  This work continues efforts initiated in prior years within the Project TC3 - Chemical Therapeutics capability area.  In FY13, all research in this area was re-aligned to Project NT3 - Techbase Medical Defense - NTA Therapeutics."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "118.208"
                                        },
                                        "BudgetYearOne": {
                                            "val": "98.111"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "98.111"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "104.361"
                                        },
                                        "BudgetYearThree": {
                                            "val": "102.546"
                                        },
                                        "BudgetYearFour": {
                                            "val": "99.523"
                                        },
                                        "BudgetYearFive": {
                                            "val": "103.441"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "182.330"
                                        },
                                        "BudgetYearOne": {
                                            "val": "122.717"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "122.717"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "99.930"
                                        },
                                        "BudgetYearThree": {
                                            "val": "107.506"
                                        },
                                        "BudgetYearFour": {
                                            "val": "123.790"
                                        },
                                        "BudgetYearFive": {
                                            "val": "126.110"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.697"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.705"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.114"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.920"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.186"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.336"
                                        },
                                        "CurrentYear": {
                                            "val": "9.642"
                                        },
                                        "BudgetYearOne": {
                                            "val": "55.087"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "55.087"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "58.342"
                                        },
                                        "BudgetYearThree": {
                                            "val": "57.675"
                                        },
                                        "BudgetYearFour": {
                                            "val": "47.340"
                                        },
                                        "BudgetYearFive": {
                                            "val": "28.759"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "259.181"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TE3"
                    },
                    "ProjectTitle": {
                        "val": "TEST & EVALUATION (ATD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.306"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "10.306"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (TE3) supports the development of test and evaluation methodologies and protocols as new science and technology efforts are discovered and transitioned to advanced development programs.  It includes methodology development for chemical and biological defense test and evaluation capabilities, with an emphasis on Non Traditional Agents (NTAs).  These methodologies support development testing and operational testing with regard to advanced development programs that have unique chemical and biological defense requirements.  These new methodologies and testing capabilities include the development of protocol and standards for use of chemical and biological simulants.  In FY13, all NTA-dedicated research was re-aligned to Project NT3 - Techbase Non-Traditional Agents Defense (ATD).  All non-NTA related T&E efforts were completed in FY12."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Test and Evaluation (T&E)"
                                    },
                                    "Description": {
                                        "val": "Test and Evaluation, Information System Technology: Develop test and evaluation technologies and processes in support of Information System Technology activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.649"
                                            },
                                            "Text": {
                                                "val": "Continued the development of CBRN data management capabilities for test and evaluation, with emphasis on enabling access to information for analysis within CBDP systems performance models.  Enhanced ability to evaluate decontaminants and decontamination systems by continuing to develop simulation capabilities for decontamination processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Test and Evaluation (T&E) NTA"
                                    },
                                    "Description": {
                                        "val": "Develops test and evaluation technologies and processes in support of NTA activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.657"
                                            },
                                            "Text": {
                                                "val": "Completed facility design efforts by conducting large particle dissemination development and proof of principle tests with several agents.  Initiated select agent testing.  In FY13, all research in this area was re-aligned to Project NT3 - Techbase Non-Med Test & Evaluation (NTA)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.838"
                                        },
                                        "CurrentYear": {
                                            "val": "20.034"
                                        },
                                        "BudgetYearOne": {
                                            "val": "18.091"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.091"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "19.224"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.348"
                                        },
                                        "BudgetYearFour": {
                                            "val": "20.621"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.960"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TE4"
                                    },
                                    "Title": {
                                        "val": "TEST & EVALUATION (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.458"
                                        },
                                        "CurrentYear": {
                                            "val": "4.994"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.671"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.671"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.408"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.872"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.044"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.044"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TE5"
                                    },
                                    "Title": {
                                        "val": "TEST & EVALUATION (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.235"
                                        },
                                        "CurrentYear": {
                                            "val": "6.394"
                                        },
                                        "BudgetYearOne": {
                                            "val": "26.202"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "26.202"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.033"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.200"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.700"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.200"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TE7"
                                    },
                                    "Title": {
                                        "val": "TEST & EVALUATION (OP SYS DEV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.549"
                                        },
                                        "CurrentYear": {
                                            "val": "4.156"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.690"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.690"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.642"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.846"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.846"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.846"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TM3"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE MED DEFENSE (ATD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "182.330"
                        },
                        "BudgetYearOne": {
                            "val": "122.717"
                        },
                        "BudgetYearOneBase": {
                            "val": "122.717"
                        },
                        "BudgetYearTwo": {
                            "val": "99.930"
                        },
                        "BudgetYearThree": {
                            "val": "107.506"
                        },
                        "BudgetYearFour": {
                            "val": "123.790"
                        },
                        "BudgetYearFive": {
                            "val": "126.110"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (TM3) funds preclinical and early phase clinical development of vaccines, therapeutic drugs, and diagnostic capabilities to provide safe and effective medical defense against validated biological threat agents or emerging infectious disease biothreats including bacteria, toxins, and viruses.  Innovative biotechnology approaches to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to biological threat agents will be evaluated.  In addition this project supports the advanced development of medical countermeasures to include prophylaxes, pretreatments, antidotes, skin decontaminants and therapeutic drugs against identified and emerging chemical warfare threat agents.  Entry of candidate vaccines, therapeutics, and diagnostic technologies into advanced development is facilitated by the development of technical data packages that support the Food and Drug Administration (FDA) Investigational New Drug (IND) processes, DoD acquisition regulations, and the oversight of early phase clinical trials in accordance with FDA guidelines.  This project also supports the advanced development of medical countermeasures to protect the Warfighter against radiological\/nuclear exposure.\n\nThe Medical Countermeasures Initiative (MCMI) was established to coordinate inter-related advanced development and flexible manufacturing capabilities, providing a dedicated, cost-effective, reliable, and sustainable MCM process that meets the Warfighter and national security needs. MCMI efforts within science and technology (S&T) are concentrated in advancing two areas: 1) regulatory science and 2) flexible manufacturing technologies and processes for MCMs.  Efforts conducted in these areas are enablers supporting the DoD Medical Countermeasures Advanced Development and Manufacturing (MCM-ADM) capability.\n\nIn FY13, all research in Project (TB3) was re-aligned into Project TM3 - Techbase Medical Defense (ATD)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Techbase Med Defense - Medical Countermeasures Initiative"
                                    },
                                    "Description": {
                                        "val": "Medical Countermeasures Initiative (MCMI): The MCMI will integrate the regulatory science and manufacturing technologies and processes developed into the Advanced Development and Manufacturing (MCM-ADM) as enablers of the advanced development and flexible manufacturing capability."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.237"
                                            },
                                            "Text": {
                                                "val": "Further the development of human in vitro immune mimetic assays for FDA acceptance to enable rapid and accurate prediction of the human response to experimental vaccines and other MCMs.  Continue to develop and make practical improvements to existing agile, flexible, manufacturing bioprocesses for the purpose of accelerating access to biodefense MCMs.  Continue the development of a plant-based virus-like particle (VLP) vaccine.  Identify additional ex-vivo cell\/tissue mimetics such as precision cut tissue slices to serve as predictive surrogates for accelerated MCM efficacy and safety evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "Continue development of human in vitro immune mimetic assays for FDA acceptance to enable rapid and accurate prediction of the human response to experimental vaccines and other MCMs.  Continue to develop and make practical improvements to existing agile, flexible, manufacturing bioprocesses for the purpose of accelerating access to biodefense MCMs.  Continue the development of a plant-based virus-like particle (VLP) vaccine.  Identify additional ex-vivo cell\/tissue mimetics such as precision cut tissue slices to serve as predictive surrogates for accelerated MCM efficacy and safety evaluation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Techbase Med Bio - Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Biosurveillance\/Disease Surveillance: Integrate existing disparate military and civilian data sets into advanced warning systems, and leverage and enhance epidemiological models and algorithms for disease prediction, impact and biological threat assessment.  Contribute to the development of global, near real time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into agent-based epidemiological modeling, medical resource estimation and decision support tools.  Focus on agent-based epidemiological modeling and fusion of disease surveillance data. This subject area was previously referred to as \"Disease Surveillance\/Epidemiological and Predictive Modeling\"."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.550"
                                            },
                                            "Text": {
                                                "val": "Continue effort of Verification and Validation (V&V) of existing agent-based epidemiological models, to include underlying population data and disease spread algorithms, along with biosurveillance data fusion, for use in robust adaptive decision making.  Funding for this research area was re-aligned from Tech Base Non-Med Defense - Modeling & Simulation (CB3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Techbase Med Bio - Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Biological Diagnostic Assays and Reagents: Development and verification of rapid, sensitive, and specific tests for the identification of Biological Warfare Agents (BWAs) and their expressed pathogens and toxins in clinical specimens from Warfighters for the diagnosis of exposure\/infection.  Discovery of host biomarkers generated in response to exposure to biological threat agents.  This subject area was previously referred to as \"Biological Diagnostic Technologies\"."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.649"
                                            },
                                            "Text": {
                                                "val": "Translate laboratory, data fusion informatic methodologies and specimen pipelines into robust and well-characterized signatures required to identify and bio-type emerging, re-emerging, and synthetic threat agent strains, identify antibiotic resistant mutations and phenotypes, and therapeutic and vaccine response markers.  Develop and transition thermostable reagents\/scale-up protocols to advanced development for use in austere biosurveillance environments.  Transition agent characterization dossiers to developers of: Medical Counter Measures, microbial forensics capabilities, and assays developers to augment existing biosurveillance infrastructure performing vector surveys, zoonotic epidemiology and provide a direct link between medical diagnostic, disease surveillance and MCM development.  Submit pre-Emergency Use application data packages to FDA Office for in vitro diagnostics.  Funding for this research area was re-aligned from Tech Base Med Bio - Diagnostics (TB3) and Techbase Med Bio - TMT Platform Technologies (TB3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.945"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.945"
                                            },
                                            "Text": {
                                                "val": "Continue to develop laboratory, data fusion informatics methodologies and specimen pipelines into robust and well-characterized signatures required to identify and bio-type emerging, re-emerging, and identify antibiotic resistant mutations and phenotypes.  Develop and transition an additional thermostable reagents\/scale-up protocols to advanced development for use in austere biosurveillance environments.  Collaborate with the Centers for Disease Control (CDC) to improve diagnostic and surveillance capabilities needed to counter traditional, engineered, emerging and biological threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Techbase Med Bio - Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Next Generation Technologies: Development of next generation diagnostic technologies including portable diagnostic platforms, highly parallel and informative testing formats, and nanotechnology applications.  Development of novel assay formats and hardware solutions to enable point of need diagnostic capabilities, allowing for rapid guidance of medical decisions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.770"
                                            },
                                            "Text": {
                                                "val": "Perform pre-clinical validation studies in relevant animal models and human\/zoonotic disease states to stratify pre-symptomatic biomarker panel positive and negative predictive values.  Funding for this research area was re-aligned in FY13 from Tech Base Med Bio - Diagnostics (TB3) and Techbase Med Bio - TMT Platform Technologies (TB3).  In FY14 the funding for this research is consolidated into Biological Diagnostic Device Platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Techbase Med Bio - Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Biological Diagnostic Device Platforms: Diagnostic device development to include systems able to harness next generation technologies to revolutionize clinical diagnostics in care facilities and in hospital laboratories.  This investment will incorporate capabilities such as next generation sequencing and advanced biomolecular methods to harness both host and pathogen biomarkers in a threat agnostic approach that will serve all echelons of military medical care."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.880"
                                            },
                                            "Text": {
                                                "val": "Provide documented assessments of candidate devices potential for transition to advanced developers to support the deployment of point of care diagnostic capabilities.  Verify clinical utility of host and pathogen biomarkers and integrate onto diagnostic platform prototype(s) that confers the ability to identify and type novel infectious agents as a function of their relationship to previously characterized pathologies.  Funding for this research area was re-aligned from Tech Base Med Bio - Diagnostics (TB3) and Techbase Med Bio - TMT Platform Technologies (TB3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.849"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.849"
                                            },
                                            "Text": {
                                                "val": "Continue to develop candidate devices for potential transition to advanced developers to support the deployment of point of care diagnostic capabilities.  Development of hardware solutions and assay formats to enable point of need diagnostic capabilities.  Verify clinical utility of host and pathogen biomarkers and integrate onto diagnostic platform prototype(s) that confers the ability to identify and type novel infectious agents as a function of their relationship to previously characterized pathologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Techbase Med Bio - Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Pretreatments - Bacterial\/Toxin Vaccines: Evaluates the best single agent bacterial and toxin vaccines for effectiveness against aerosol challenge in large animal models."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.510"
                                            },
                                            "Text": {
                                                "val": "Deliver final data package for Ricin vaccine.  Funding for this research area was re-aligned from Tech Base Med Bio - Pretreatments (TB3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.459"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.459"
                                            },
                                            "Text": {
                                                "val": "Coordinate with the advanced developer to fulfill S&T needs in support of the Ricin vaccine transition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Techbase Med Bio - Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Pretreatments - Viral Vaccines: Evaluates the best vaccine candidates for Alphaviruses and Filoviruses for effectiveness and duration of protective immune response against aerosol challenge in large animal models.  Animal models will be developed to support FDA licensure of mature vaccine candidates.  The purpose of developing these animal models is to support pivotal animal studies under the \"Animal Rule\"."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.038"
                                            },
                                            "Text": {
                                                "val": "Coordinate with the advanced developer to fulfill S&T needs in support of the Filovirus vaccine transition.  Continue development of Filovirus and Alphavirus immunological assays to support product development.  Complete Phase I clinical trial of Venezuelan Equine Encephalitis (VEE) DNA vaccine delivered by in vivo electroporation via intra-muscular or intra-dermal administration.  Complete pre-clinical studies on a trivalent VEE, Eastern and Western Equine Encephalitis (EEE, WEE) DNA formulation.  Continue to conduct pre-clinical studies of the Alphavirus replicon vaccine in coordination with the advanced developer.  Continue the development of animals models for Alphaviruses (EEE and WEE), and Filoviruses (Ebola Sudan, Ebola Zaire, Ebola Bundibugyo, and Marburg), to fulfill future FDA 'Animal Rule' requirements necessary for vaccine licensure.  Although the Filovirus vaccines transitioned in FY11, work will continue on the selected candidate(s) to fill knowledge gaps.  Funding for this research area was re-aligned from Tech Base Med Bio - Pretreatments (TB3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.135"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.135"
                                            },
                                            "Text": {
                                                "val": "Continue development of Alphavirus immunological assays to support product development.  Conduct Good Lab Practices (GLP) animal efficacy studies of the VEE DNA vaccine delivered by in vivo electroporation via intra-muscular or intra-dermal administration.  Continue to conduct pre-clinical studies of the Alphavirus replicon vaccine in coordination with the advanced developer.  Continue the development of animals models for Alphaviruses (EEE and WEE), to fulfill future FDA 'Animal Rule' requirements necessary for vaccine licensure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Techbase Med Bio - Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Pretreatments - Vaccine Platforms and Research Tools: Conducts studies to determine potential immune interference between lead vaccine candidates, the effect of alternative vaccine delivery methods and thermo-stabilization technologies on the efficacy of lead vaccine candidates.  Identifies correlates of protection in humans, and predicts the success of lead vaccine candidates in humans.  Work conducted under Vaccine Platforms and Research Tools are distinct from those performed under Viral Vaccines because the focus is on the use of novel technologies to support vaccine candidates, not on the vaccine candidates themselves.  Vaccine Platforms and Research Tools utilize novel technologies to stabilize advanced vaccine candidates as well as alternative delivery modalities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "Continue formulation studies to produce a thermo-stable, spray-dried formulation of an advanced vaccine candidate.  Continue to evaluate stabilization technologies that provide thermal stability to multiple classes of vaccines such as viral vectored vaccines and subunit protein vaccines.  Continue to evaluate alternative (needle-free) vaccine delivery technologies such as inhalers or skin patches for the delivery of mature vaccine candidates.  Utilize clinical samples from Filovirus or Alphavirus outbreaks in multiple international locations to help define clinically relevant correlates of immunity.  Funding for this research area was re-aligned from Tech Base Med Bio - Pretreatments (TB3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.880"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.880"
                                            },
                                            "Text": {
                                                "val": "Continue formulation studies to produce a thermo-stable, spray-dried formulation of an advanced vaccine candidate.  Continue to evaluate stabilization technologies that provide thermal stability to multiple classes of vaccines such as viral vectored vaccines and subunit protein vaccines.  Continue to evaluate alternative (needle-free) vaccine delivery technologies such as inhalers or skin patches for the delivery of mature vaccine candidates.  Utilize clinical samples from Filovirus or Alphavirus outbreaks in multiple international locations to help define clinically relevant correlates of immunity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Techbase Med Bio - Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Viral Therapeutics: Identify, optimize and evaluate potential therapeutic candidates effective against designated viral threat agents."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.100"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation of immunotherapies for Filoviruses in non-human primate models.  Develop immune modulators for the treatment of Filovirus infection.  Continue screening program to determine efficacy of FDA approved compounds against emerging infectious diseases (i.e. Alphavirus, Filovirus, Flavivirus, Arenavirus, Bunyavirus).  Continue pre-clinical research required to submit Investigational New Drug (IND) applications to the FDA for additional products or additional product indications to refresh the viral therapeutics product pipeline.  Funding for this research area was re-aligned from Tech Base Med Bio - Therapeutics (TB3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.773"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.773"
                                            },
                                            "Text": {
                                                "val": "Evaluate immunotherapies for Filoviruses in non-human primate models.  Continue development of antibody-based therapies for Filovirus infections.  Continue screening program to determine efficacy of FDA approved compounds against emerging infectious diseases.  Evaluate FDA-approved host-directed tyrosine kinase inhibitors for efficacy against Alphavirus, Filovirus, Flavivirus, Arenavirus, Bunyavirus, and Orthopoxvirus.  Continue pre-clinical research required to submit IND applications to the FDA for additional products or additional product indications to refresh the viral therapeutics product pipeline.  In FY14, research previously conducted under the Multiagent Broad Spectrum Countermeasure thrust area will be transitioned into the Viral Therapeutics program under BA3 Techbase Med Defense - Bio CM (TM3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Techbase Med Bio - Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Bacterial Therapeutics: Identify, optimize and evaluate potential therapeutic compounds effective against bacterial threat agents."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "Evaluate FDA approved compounds for efficacy in non-human primate models against aerosolized challenge of Y. pestis and F. tularensis.  Develop small molecule inhibitors of the electron transport chain and the ATP synthase bacterial biothreat agents.  Perform pharmacokinetic studies of humanized CapD in mouse models.  Continue pre-clinical research required to submit IND applications to the FDA for additional products or additional product indications to refresh the bacterial therapeutics product pipeline.  Funding for this research area was re-aligned from Tech Base Med Bio - Therapeutics (TB3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.170"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.170"
                                            },
                                            "Text": {
                                                "val": "Evaluate FDA approved compounds for efficacy in non-human primate models against aerosolized challenge of Y. pestis and F. tularensis.  Continue development of small molecule inhibitors of the electron transport chain and the ATP synthase bacterial biothreat agents.  Perform pharmacokinetic studies of human CapD in mouse models.  Continue pre-clinical research required to submit IND applications to the FDA for additional products or additional product indications to refresh the bacterial therapeutics product pipeline.  In FY14, research previously conducted under the Multiagent Broad Spectrum Countermeasure thrust area will be transitioned into the Bacterial Therapeutics program under BA3 Techbase Med Defense - Bio CM (TM3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Techbase Med Bio - Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Toxin Therapeutics: Identify, optimize and evaluate potential therapeutic candidates effective against biological toxin threat agents."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.645"
                                            },
                                            "Text": {
                                                "val": "Evaluate small molecule non-peptidic inhibitors for pharmacokinetic and toxicology profiles.  Test novel small molecule inhibitors in mouse model of BoNT A intoxication for efficacy.  Funding for this research area was re-aligned from Tech Base Med Bio - Therapeutics (TB3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.521"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.521"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation of small molecule non-peptidic inhibitors for pharmacokinetic and toxicology profiles.  Test novel small molecule inhibitors in mouse model of BoNT A intoxication for efficacy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Techbase Med Bio - Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Multiagent (Broad Spectrum) Medical Countermeasures: Continues efforts previously funded under the Transformational Medical Technologies Initiative to develop candidate countermeasures for Hemorrhagic Fever Virus (HFV) and Intracellular Bacterial Pathogen (IBP).  Focuses on the initiation and completion of preclinical studies for candidate countermeasures, to include safety, toxicity, efficacy, and scalability work in accordance with the product's intended use.  The ability to formulate Good Manufacturing Practices (GMP), pilot lots and further mature promising drug candidates will be the focus of activities in this capability area.  The preclinical drug discovery process culminates in the submission of an Investigational New Drug (IND) application to the Food and Drug Administration (FDA), to determine if candidate countermeasures are suitable for safety evaluation in humans. In FY14, research under this thrust area will be transitioned into the Bacterial and Viral Therapeutics program under BA3 Techbase Med Defense - Bio CM (TM3)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "48.225"
                                            },
                                            "Text": {
                                                "val": "Continue pre-clinical research required to submit IND applications to the FDA for additional products or additional product indications to refresh the Hemorrhagic Fever Virus (HFV), Intracellular Bacterial Pathogen (IBP) and Emerging Infectious Disease (EID) product pipelines.  Continue planning for Phase 1 clinical trials and additional studies for INDs as required by the FDA prior to safety evaluation in humans.  Continue the development of animal models for future advanced development of MCMs currently in the S&T phase of development, incorporating feedback from the FDA and Services into requirements.  Funding for this research area was re-aligned from Tech Base Med Bio - Transformational Medical Technologies (TB3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Techbase Med Chem - Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Chemical Diagnostics: Focuses on state-of-the-art laboratory\/fieldable methods that detect exposure to chemical warfare agents (CWA) (e.g., nerve agents and vesicants) in clinical samples.  It also targets the identification of biomolecular targets that can be leveraged as analytical methodologies, as well as laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.469"
                                            },
                                            "Text": {
                                                "val": "Expand the current set of analytical methods to more sensitive analytical platforms for the detection of CWAs.  Funding for this research area was re-aligned from Tech Base Med Chem - Diagnostics (TC3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.460"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.460"
                                            },
                                            "Text": {
                                                "val": "Continue to expand the current set of analytical methods to more sensitive analytical platforms for the detection of CWAs in clinical samples."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "14) Techbase Med Chem - Pretreatments"
                                    },
                                    "Description": {
                                        "val": "Chemical Medical Pretreatments - Nerve Agent, Pretreatments: Develop pretreatments that provide protection against all organophosphorous nerve agents.  The enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high enzymatic efficiency for the destruction of agents.  For enzyme approaches, one molecule of catalytic bioscavenger should be capable of detoxifying numerous molecules nerve agents resulting in the capability for a small quantity of catalytic bioscavenger to protect against a large dose of nerve agent."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.122"
                                            },
                                            "Text": {
                                                "val": "Continue characterization of recombinant human butyrylcholinesterase (rHuBChE) bioscavenger product of selected alternative expression systems.  Funding for this research area was re-aligned from Tech Base Med Chem - Pretreatments (TC3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "15) Techbase Med Chem - Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Chemical Medical Therapeutics - Neurologic: Focuses on therapeutic strategies to effectively minimize neurologic injuries resulting from exposure to chemical warfare agents (CWA).  This effort involves the development of neuroprotectants, anticonvulsants, and improved neurotransmitter restorers.  Supports eventual Food and Drug Administration (FDA) licensure of new compounds or new indications for licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.633"
                                            },
                                            "Text": {
                                                "val": "Complete studies developing appropriate animal models.  Maintain core capability for in vitro and in vivo testing.  This core capability for product testing, using standardized methodologies under well-controlled laboratory conditions (e.g., Good Laboratory Practice or GLP), is needed to ensure quality and consistency of study test data submitted in applications to FDA in support of regulatory actions.  Funding for this research area was re-aligned from Tech Base Med Chem - Therapeutics (TC3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.525"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.525"
                                            },
                                            "Text": {
                                                "val": "Continue efforts supporting regulatory science to facilitate FDA licensure including in vitro and in vivo testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "16) Techbase Med Defense - Rad CM"
                                    },
                                    "Description": {
                                        "val": "Radiological Medical Countermeasures: Develops medical countermeasures to protect the Warfighter against radiological\/nuclear exposure.  The Department of Defense is the only governmental agency currently developing medical prophylaxis to protect Warfighters or other responders in the event of a radiological incident."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.202"
                                            },
                                            "Text": {
                                                "val": "Further explore the development of a biodosimetry hand-held diagnostic device that is minimally invasive, accurate, rapid, high-throughput and suitable for medical triage.  Funding for this research area was re-aligned from Tech Base Med Rad - Radiation Countermeasures (TR3)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "118.208"
                                        },
                                        "BudgetYearOne": {
                                            "val": "98.111"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "98.111"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "104.361"
                                        },
                                        "BudgetYearThree": {
                                            "val": "102.546"
                                        },
                                        "BudgetYearFour": {
                                            "val": "99.523"
                                        },
                                        "BudgetYearFive": {
                                            "val": "103.441"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "121.170"
                                        },
                                        "CurrentYear": {
                                            "val": "133.254"
                                        },
                                        "BudgetYearOne": {
                                            "val": "122.936"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "122.936"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "95.724"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.461"
                                        },
                                        "BudgetYearFour": {
                                            "val": "41.661"
                                        },
                                        "BudgetYearFive": {
                                            "val": "30.014"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.697"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.705"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.114"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.920"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.186"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "197.907"
                                        },
                                        "CurrentYear": {
                                            "val": "212.056"
                                        },
                                        "BudgetYearOne": {
                                            "val": "263.443"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "263.443"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "228.199"
                                        },
                                        "BudgetYearThree": {
                                            "val": "183.390"
                                        },
                                        "BudgetYearFour": {
                                            "val": "151.455"
                                        },
                                        "BudgetYearFive": {
                                            "val": "184.222"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.336"
                                        },
                                        "CurrentYear": {
                                            "val": "9.642"
                                        },
                                        "BudgetYearOne": {
                                            "val": "55.087"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "55.087"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "58.342"
                                        },
                                        "BudgetYearThree": {
                                            "val": "57.675"
                                        },
                                        "BudgetYearFour": {
                                            "val": "47.340"
                                        },
                                        "BudgetYearFive": {
                                            "val": "28.759"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "259.181"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (OP SYS DEV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.371"
                                        },
                                        "CurrentYear": {
                                            "val": "0.498"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.499"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.499"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.414"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.551"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.816"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.277"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TR3"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL RADIOLOGICAL DEFENSE (ATD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.431"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "1.431"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (TR3) funds advanced technology development of medical countermeasures against radiological exposure.  Specifically, innovative technical approaches will be used to develop, refine, and transition promising products to advanced development efforts to mitigate health consequences resulting from Acute Radiation Exposure (ARS) and Delayed Effects of Acute Radiation Exposure (DEARE).  Promising products and pertinent science and technology data will be used to support Investigational New Drug (IND) applications and Food and Drug Administration (FDA) licensure processes, with an emphasis on the development of pretreatments to protect military responders in the event of a radiological incident.  Research efforts and data are collaboratively shared with other government agencies so that more mature and promising product candidates will be quickly transitioned to advanced development efforts.  In FY13, all research in this Project (TR3) was re-aligned to Project TM3 - Techbase Medical Defense (ATD)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Radiological Medical Countermeasures"
                                    },
                                    "Description": {
                                        "val": "Radiation Medical Countermeasures: Develops medical countermeasures to protect the Warfighter against radiological\/nuclear exposure.  The Department of Defense is the only governmental agency currently developing medical prophylaxis to protect Warfighters or other responders in the event of a radiological incident."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.431"
                                            },
                                            "Text": {
                                                "val": "Completed mechanism of action studies for potential therapeutics for radiological exposure.  In FY13, all Project TR3 research was re-aligned into Techbase Medical Defense - RAD CM (TM3)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "118.208"
                                        },
                                        "BudgetYearOne": {
                                            "val": "98.111"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "98.111"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "104.361"
                                        },
                                        "BudgetYearThree": {
                                            "val": "102.546"
                                        },
                                        "BudgetYearFour": {
                                            "val": "99.523"
                                        },
                                        "BudgetYearFive": {
                                            "val": "103.441"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TR2"
                                    },
                                    "Title": {
                                        "val": "MEDICAL RADIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.935"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "0.935"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "182.330"
                                        },
                                        "BudgetYearOne": {
                                            "val": "122.717"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "122.717"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "99.930"
                                        },
                                        "BudgetYearThree": {
                                            "val": "107.506"
                                        },
                                        "BudgetYearFour": {
                                            "val": "123.790"
                                        },
                                        "BudgetYearFive": {
                                            "val": "126.110"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MR4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL RADIOLOGICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "4.050"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.610"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MR5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL RADIOLOGICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "2.027"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "2.027"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT3"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE TECHNOLOGY TRANSITION"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.706"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.706"
                        },
                        "BudgetYearTwo": {
                            "val": "6.257"
                        },
                        "BudgetYearThree": {
                            "val": "6.575"
                        },
                        "BudgetYearFour": {
                            "val": "8.196"
                        },
                        "BudgetYearFive": {
                            "val": "7.852"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (TT3) validates high-risk\/high-payoff technologies, concepts-of-operations, and a new Joint Combat Development concept development and experimentation process that could significantly improve Warfighter capabilities in preparation for transition of mature technologies to advanced development programs requiring chemical and biological (CB) defense technologies.  These programs offer an opportunity to identify and efficiently mature emerging technologies including limited objective experiments, laboratory experiments, risk reduction efforts, engineering and integration.  These demonstrations and programs seek to demonstrate the potential for enhanced military operational capability and\/or cost effectiveness.  This project addresses four family of products areas: Biological Resiliency, Weapons of Mass Destruction (WMD) Elimination, Hazard Mitigation and Facilities Protection.  Biological resiliency efforts are targeted to reduce biological threats by: (1) improving Department of Defense (DoD) access to the life sciences to combat infectious disease regardless of its cause; (2) establishing and reinforcing DoD concept of operations (CONOPS) against the misuse of the life sciences; and (3) instituting a suite of coordinated DoD and interagency activities that collectively will help influence, identify, inhibit, and\/or interdict those who seek to misuse the life sciences.  WMD Elimination addresses detection, identification, verification and baseline assessments in support of expeditionary forces deployed in non-permissive environments.  Hazard Mitigation addresses Chemical, Biological, and Radiological (CBR) remediation and decontamination processes and demonstrates technologies and methods to restore assets such as mobile equipment, fixed sites, critical infrastructures, personal, and equipment to operational status as a result of having reduced or eliminated CBR contamination.  Facilities protection transitions mature technologies to improve individual and critical infrastructure protection capabilities for U.S. and coalition Warfighters."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Experiment & Technology Demonstrations"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.706"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.706"
                                            },
                                            "Text": {
                                                "val": "Conduct technical and operational demonstrations for persistent and contagious bio agent scenarios in the US European Command Area of Responsibility (EUCOM AOR).  Initiate bio-resiliency planning efforts in a second AOR.  Conduct and complete a series of vignettes addressing sampling and analysis (to include forensics preparation), wide area decontamination and medical\/epidemiological management.  Complete Coalition Warfare Program science and technology (S&T) efforts with international partner in EUCOM AOR.  Conduct a field experiment process to assess early technology capability contributions towards the WMD Elimination mission area, in collaboration with the CBDP Joint Combat Developer and with outcomes to support the creation of an initial capabilities document (ICD).  Demonstrate decontamination technologies for the interior of airframes against bio agents as part of a JCTD initiative with US TRANSCOM.  Initiate analysis and market research for a complete facilities protection system that is rapidly deployable, to include threat detection, building hardening, and personal protection."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB2"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "97.530"
                                        },
                                        "CurrentYear": {
                                            "val": "44.331"
                                        },
                                        "BudgetYearOne": {
                                            "val": "53.901"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "53.901"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "55.042"
                                        },
                                        "BudgetYearThree": {
                                            "val": "59.834"
                                        },
                                        "BudgetYearFour": {
                                            "val": "66.483"
                                        },
                                        "BudgetYearFive": {
                                            "val": "66.214"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.838"
                                        },
                                        "CurrentYear": {
                                            "val": "20.034"
                                        },
                                        "BudgetYearOne": {
                                            "val": "18.091"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.091"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "19.224"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.348"
                                        },
                                        "BudgetYearFour": {
                                            "val": "20.621"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.960"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TT4"
                                    },
                                    "Title": {
                                        "val": "TECHBASE TECHNOLOGY TRANSITION (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.985"
                                        },
                                        "CurrentYear": {
                                            "val": "3.377"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "6.362"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}