{
    "id": "e51a336a0e033b5ae1b4f19e5da0ed4904e02ca4",
    "meta": {
        "filename": "dod-2014_RDTE_2014_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2014.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0902298J"
        },
        "ProgramElementTitle": {
            "val": "Management Headquarters"
        },
        "R1LineItemNumber": {
            "val": "249"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "2.807"
            },
            "PriorYear": {
                "val": "2.730"
            },
            "CurrentYear": {
                "val": "4.100"
            },
            "BudgetYearOne": {
                "val": "3.533"
            },
            "BudgetYearOneBase": {
                "val": "3.533"
            },
            "BudgetYearTwo": {
                "val": "5.530"
            },
            "BudgetYearThree": {
                "val": "5.146"
            },
            "BudgetYearFour": {
                "val": "5.086"
            },
            "BudgetYearFive": {
                "val": "5.479"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Management Headquarters provides the financial resources necessary to support future TJS operations. Across the Joint Staff, Management Headquarters supports various efforts including network infrastructure, civilian pay accounts, supplies, travel, training, portfolio management, business process reviews and transformation initiatives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.730"
                },
                "CurrentYear": {
                    "val": "4.100"
                },
                "BudgetYearOne": {
                    "val": "4.019"
                },
                "BudgetYearOneBase": {
                    "val": "4.019"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.730"
                },
                "CurrentYear": {
                    "val": "4.100"
                },
                "BudgetYearOne": {
                    "val": "3.533"
                },
                "BudgetYearOneBase": {
                    "val": "3.533"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.486"
                },
                "BudgetYearOneBase": {
                    "val": "-0.486"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.486"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.486"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Joint Staff Information Network (JSIN)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.807"
                        },
                        "PriorYear": {
                            "val": "2.730"
                        },
                        "CurrentYear": {
                            "val": "4.100"
                        },
                        "BudgetYearOne": {
                            "val": "3.533"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.533"
                        },
                        "BudgetYearTwo": {
                            "val": "5.530"
                        },
                        "BudgetYearThree": {
                            "val": "5.146"
                        },
                        "BudgetYearFour": {
                            "val": "5.086"
                        },
                        "BudgetYearFive": {
                            "val": "5.479"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Management Headquarters provides the day-to-day financial resources necessary to support TJS operations. Across the Joint Staff, Management Headquarters supports various efforts including network infrastructure, civilian pay accounts, supplies, travel, training, portfolio management, business process reviews, and transformation initiatives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Staff Information Network (JSIN)"
                                    },
                                    "Description": {
                                        "val": "Provides RDT&E funds for the Joint Staff Information Network (JSIN). JSIN is the network infrastructure (for both classified and unclassified information) enabling collaboration and information-sharing among the Joint Staff, Combatant Commands (CCMD) and the Services.  The JSIN also provides crucial business-related, decision-making information and workflow support affecting military operations in support of the JCS.  JSIN improves actions processing for faster coordination of critical issues with CCMDs, Services, and agencies, as well as within the Joint Staff."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.730"
                                            },
                                            "Text": {
                                                "val": "Established independent government cost analysis; enhanced cost controls for $21M IT projects – cutting overruns by 15%. Consolidated software licensing process between Pentagon and Hampton Roads, reducing additional contract overhead and gaining renewal cost efficiencies with centralized management and consolidated procurement. Established a framework for a JS-wide robust Portfolio Management process, integrated with organizational processes, to enhance senior leaders’ JS-wide IT investment oversight, decision-making and ability to improve strategic alignment with JS mission & vision, enterprise initiatives and DoD Business Efficiencies guidance. Led DoD as five person member of the DISA mobility pilot – Testing five iPhones; first testers to request an organizational account. Led Windows 7 migration on an accelerated schedule; reduced security risks by 40%. Prioritized and led IT analyses for multiple JS initiatives such as: Thin Client (S\/U), DISA Enterprise Content Management Services (DECMS\/U), Desktop Server and Application virtualization, Mobile Computing, and the JS-ITA Service Desk Consolidation effort, which guaranteed C4ISR support to the joint force while providing resource efficiencies and improved network security posture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Provide planning and support to Joint Staff Information Technology initiatives, including planning and letter estimates for DECC migration for JS applications, Thin Client (S) and the VDI proof of concept, Defense Enterprise Email (DEE) (S), Defense Enterprise Portal Services (DEPS) (U), Desktop, Server and Application Virtualization (S), Cross Domain Services IOC, DISA Enterprise Content Management (DECMS) (U), Mobile Computing solutions, Unified Communications Capabilities, Enterprise Services Implementation and Joint Information Environment (JIE) planning, JS Service Desk optimization plan, and Identity and Access Management capabilities  to achieve efficiencies, improve mission effectiveness, and strengthen our security posture. Research, analyze, architect, plan the transition to, and support the sequencing and dependencies for this portfolio of Core IT investments as well as Mission systems within the Joint Staff."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.533"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.533"
                                            },
                                            "Text": {
                                                "val": "Provide planning and support to Joint Staff Information Technology initiatives, including continued Defense Enterprise Computing Center (DECC) migration for JS applications, Thin Client (U) and Mobile Computing, Defense Enterprise Portal Services (DEPS) (S), continue Application Virtualization (S) and (U), Cross Domain Services FOC, DISA Enterprise Content Management (DECMS) (U) optimization and integration, Mobile Computing solutions, Unified Communications Capabilities transition to VOIP\/VoSIP, Enterprise Services Implementation including Enterprise Task Management (U\/S), JS Service Desk optimization implementation, Identity and Access Management capabilities and Cloud Computing readiness to achieve efficiencies, improve mission effectiveness, and strengthen our security posture."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "- Reduce technical support hours per desktop minimum of 10% through deployment of thin client and virtualized management of the IT baseline \n- Cost avoided for technology refresh of NIPR and SIPR desktops via the proper planning, testing and piloting of a Joint Staff Thin Client solution\n- Reduce the cost of building, operating and maintaining Joint staff specific solutions through implementation of enterprise capabilities and adoption of new cost models for execution (DEE, DEPS, Enterprise Task management, and Unified Communications)\n- Reduce redundancies in Core and Mission IT Capabilities through implementation of a comprehensive Portfolio management policy and avoid cost through the institutionalization of investment management governance model"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.730"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.131"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.555"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.555"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.969"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.978"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.978"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}