{
    "id": "e5f95f2f1c204b64f1c78b16a3fa3ccf663b4b77",
    "meta": {
        "filename": "dod-2014_RDTE_2014_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2014.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604787J"
        },
        "ProgramElementTitle": {
            "val": "Joint Systems Integration"
        },
        "R1LineItemNumber": {
            "val": "108"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "3.273"
            },
            "BudgetYearOne": {
                "val": "7.402"
            },
            "BudgetYearOneBase": {
                "val": "7.402"
            },
            "BudgetYearTwo": {
                "val": "7.546"
            },
            "BudgetYearThree": {
                "val": "7.655"
            },
            "BudgetYearFour": {
                "val": "7.754"
            },
            "BudgetYearFive": {
                "val": "7.902"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "In support of the Chairman’s responsibility for the assessment of the capability and adequacy of United States forces to successfully execute the national military strategy the Joint Systems Integration (JSI) Program Element provides mission funding for the Joint Staff J6 C4 Assessments Division (C4AD). C4AD conducts interoperability assessments and develops solutions\/recommendations to improve integration of Service, Defense Agency, and coalition systems. \n\nC4AD's Persistent Command and Control Environment replicates an operational environment and provides Combatant Commands, Services, Agencies and Coalition partners at the joint force headquarters level, a laboratory and assessment venue for the warfighter and capability developer to identify and solve interoperability and integration issues with current and near-term joint and coalition capabilities. With this capability, C4AD assesses system of systems interoperability, operational capability, procedural compliance and technical suitability of emerging and existing systems and programs to confirm readiness for deployment.  \n\nBy establishing ground truth for interoperability and suggesting remedies for demonstrated shortfalls, C4AD is an enabler for the Chairman’s priorities to: pioneer new ways to combine and employ emergent capabilities, drive Jointness deeper, sooner in capability development, move quickly toward Joint information and simulation networks that support secure and agile command and control, expand the envelope of interagency and international cooperation, and promote multilateral security approaches and architectures."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "3.273"
                },
                "BudgetYearOne": {
                    "val": "3.275"
                },
                "BudgetYearOneBase": {
                    "val": "3.275"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "3.273"
                },
                "BudgetYearOne": {
                    "val": "7.402"
                },
                "BudgetYearOneBase": {
                    "val": "7.402"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.127"
                },
                "BudgetYearOneBase": {
                    "val": "4.127"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.127"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.127"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Additional resources allocated to support mission requirements that transitioned to the Joint Staff after U.S. Joint Forces Command disestablishment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P787"
                    },
                    "ProjectTitle": {
                        "val": "Joint Systems Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.273"
                        },
                        "BudgetYearOne": {
                            "val": "7.402"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.402"
                        },
                        "BudgetYearTwo": {
                            "val": "7.546"
                        },
                        "BudgetYearThree": {
                            "val": "7.655"
                        },
                        "BudgetYearFour": {
                            "val": "7.754"
                        },
                        "BudgetYearFive": {
                            "val": "7.902"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In support of the Chairman’s responsibility for the assessment of the capability and adequacy of United States forces to successfully execute the national military strategy the Joint Systems Integration (JSI) Program Element provides mission funding for the Joint Staff J6 C4 Assessments Division (C4AD). C4AD conducts interoperability assessments and develops solutions\/recommendations to improve integration of Service, Defense Agency, and coalition systems. \n\nC4AD's Persistent Command and Control Environment replicates an operational environment and provides Combatant Commands, Services, Agencies and Coalition partners at the joint force headquarters level, a laboratory and assessment venue for the warfighter and capability developer to identify and solve interoperability and integration issues with current and near-term joint and coalition capabilities. With this capability, C4AD assesses system of systems interoperability, operational capability, procedural compliance and technical suitability of emerging and existing systems and programs to confirm readiness for deployment.  \n\nBy establishing ground truth for interoperability and suggesting remedies for demonstrated shortfalls, C4AD is an enabler for the Chairman’s priorities to: pioneer new ways to combine and employ emergent capabilities, drive Jointness deeper, sooner in capability development, move quickly toward Joint information and simulation networks that support secure and agile command and control, expand the envelope of interagency and international cooperation, and promote multilateral security approaches and architectures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interoperability Assessments (IA) and Interoperability Technology Demonstration Center (ITDC)"
                                    },
                                    "Description": {
                                        "val": "Primary outcome for this effort is seamless interoperability between DoD and coalition C2 systems supporting the warfighter.  IA supports the interoperability assessment of systems in five categories: operational, system of systems, technical, software, and procedural.  These assessments provide supporting justification for continued development of a program within the acquisition system and resolve capability shortfalls of fielded systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.276"
                                            },
                                            "Text": {
                                                "val": "Continue the efforts initiated for FY 2012 and respond to unpredictable operational issues and shortfalls.  Interoperability assessments will be conducted to solve warfighter problems, including coalition challenges.  FY 2013 assessment objectives are focused on; Operations and Intelligence Integration, Tactical Edge Integration, Joint Fires Capabilities, Integrated Air Missile Defense, Data Strategy Implementation, and Information Sharing Capabilities.   \n\nFuture Mission Network (FMN) Development and Assessment – Provide interoperability assessments of selected U.S. and Coalition systems in support of FMN. \n \nAfghanistan Mission Network (AMN) Coalition Interoperability Assurance Validation (CIAV) Assessments – AMN is the primary Coalition, Command, Control and Communications and Computers, Intelligence, Surveillance, and Reconnaissance (C5ISR) network for International Assistance Forces (ISAF) in Afghanistan.  C4AD is supporting the assessment of Coalition Mission Threads (CMTs) and Coalition Tactics, Techniques and Procedures (CTTPs) to identify and correct ISAF interoperability problems.  FY 2013 AMN mission areas include: Joint ISR, Battlespace Awareness, and Service Management.  \nBold Quest (BQ) 2013 Technical Support and Mode V\/IFF (identify frend or foe) Interoperability Assessments – Assess interoperability and document identified deficiencies of select systems within the joint fires mission thread during Bold Quest 13 operational venues.  \n\nJoint Fires Support Joint Mission Thread (JFS JMT) – Develop, assess, and document identified deficiencies in the operational fire support system interoperability matrix.  Initial fire support systems to be evaluated include: Advanced Field Artillery Tactical Data System (AFATDS), Distributed Command Ground Station (DCGS), Joint Automated Deep Operations Coordination System (JADOCS), Theater Battle Management Core System (TBMCS), and Joint Targeting Tool-Kit (JTT).\n\nC4 – Intelligence, Surveillance, Reconnaissance (C4ISR) Interoperability Assessments of DCGS and GCCS-J – Verify correction of interoperability issues identified in FY 12 assessments of the Global Command and Control System-Joint (GCCS-J) to Distributed Common Ground Station-Army (DCGS-A) and GCCS-J to DCGS Integration Backbone (DIB) interfaces.\n\nJoint Integrated Air and Missile Defense Organization (JIAMDO) Assessment Joint Tactical Air Picture (JTAP) Support – Assess the integration of tactical data into a capability approaching single integrated air picture standards for track reporting, timeliness, and joint interoperable data sharing of both friendly and threat air and missile defense tracks during JTAP events.\n\nUnified Cross Domain Management Office (UCDMO) Enterprise Cross Domain Solutions (ECDS) Owl File Transfer Interoperability Assessment - Conduct a capability assessment of the Owl Enterprise Cross Domain Solution, measuring the functional strengths and weaknesses against UCDMO prescribed criteria.\n\nCoalition Warrior Interoperability Experiment (CWIX) 2013 Interoperability Assessments – Conduct interoperability assessments between selected systems within the following mission areas; Coalition fires, Coalition Intelligence, Surveillance, Reconnaissance (ISR), and Coalition Ballistic Missile Defense during the CWIX event.\n\nTactical Infrastructure Enterprise Services (TIES) JCTD Assessment – Assess the capability of sharing data from authoritative data sources using web services in a C2 Core conformant, standardized data format.  \n\nJoint Cross Domain eXchange (JCDX) Interoperability Assessment – Assess JCDX, a multi-level security capability, to exchange the common operation picture and support record\/tactical communications interfaces between U.S. and Coalition forces.\n\nItaly-U.S. Command and Control Interoperability Assessment – Continue assessing the exchange of C2 data between the U.S. Global Command and Control System Joint (GCCS-J) and the Italian SIACCON (Sistema Automatizzato di Commando e Controllo) system.  SIACCON is a distributed C2 system that provides battle management support across a range of functions for the Italian Army."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.894"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.894"
                                            },
                                            "Text": {
                                                "val": "Continue the efforts initiated for FY2013 and respond to unpredictable operational issues and shortfalls. Interoperability assessments will be conducted to solve warfighter problems, including coalition challenges.  FY2014 assessment objectives are focused on; Cyberspace, Operations and Intelligence Integration, Tactical Edge Integration, Joint Fires Capabilities, Integrated Air Missile Defense, Data Strategy Implementation, and Information Sharing Capabilities.\n  \nAfghanistan Mission Network (AMN) Coalition Interoperability Assurance Validation (CIAV) Transition and Assessments – AMN is the primary Coalition, Command, Control and Communications and Computers, Intelligence, Surveillance, and Reconnaissance (C5ISR) network for International Assistance Forces (ISAF)in Afghanistan.  C4AD is supporting the assessment of Coalition Mission Threads (CMTs) and Coalition Tactics, Techniques and Procedures (CTTPs) to identify and correct ISAF interoperability problems.  \n\nBold Quest (BQ) 2014 Technical Support and Interoperability Assessments – Assess interoperability and document identified deficiencies of select systems within the joint fires mission thread during BQ 2014 operational venues.\n\nDigitally-Aided Joint Fires Support and Assessment – Assess the implementation of various  messaging standards for Close Air Support (CAS) mission execution. \n\nCoalition Warrior Interoperability Experiment (CWIX) 2014 Interoperability Assessments – Conduct interoperability assessments between selected systems within the following mission areas; Coalition fires, Coalition Intelligence, Surveillance, Reconnaissance (ISR), and Coalition Ballistic Missile Defense during the CWIX event.\n\nTerminal Fury 2014 Joint Automated Deep Operations Coordination System (JADOCS)Interoperability Assessment – Assess the system interoperability of JADOCS during Terminal Fury 2014.\n\nC4-Intelligence, Surveillance, Reconnaissance (C4ISR) Interoperability Assessments – Assess interoperability of Service systems to Global Command and Control System-Joint (GCCS-J).\n\nUnified Cross Domain Management Office (UCDMO) Enterprise Cross Domain Solutions (ECDS) Capability Assessment - Conduct a capability assessment of the specified ECDS, measuring the functional strengths and weaknesses against UCDMO prescribed criteria.\n\nMission Partner Environment (MPE) U.S. Development and Assessment and Federated Mission Network (FMN)Development and Support – Provide interoperability assessments of selected U.S. and Coalition systems.\n\nNetwork Integration Evaluation (NIE) Facility and Interoperability Assessment Support – Assess potential networked and non-networked capabilities in a robust operational environment.\n\nJoint Staff J7\/J6 Partnership for the Operational Assessment Test (OAT) of the Joint Live Virtual Constructive (JLVC)Modeling and Simulation (M&S) Federation – Assess networked systems as directed. \n\nTactical Infrastructure Enterprise Services (TIES) Limited Technology Experiment (LTE) JCTD Assessment – Assess the capability of sharing data from authoritative data sources using web services in a C2 cCore conformant, standardized data format."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical Assessments and Integration (TA&I)"
                                    },
                                    "Description": {
                                        "val": "Primary Outcome (objective) for this effort is near-term technical solutions for integration, assessment and delivery of operational capabilities that address near-term operational and tactical requirements.  TA&I uses organic laboratory resources, equipment, and technical personnel to integrate emerging technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.080"
                                            },
                                            "Text": {
                                                "val": "Continue FY 2012 initiatives investigating impacts of technology advances in wireless devices, mesh and ad-hoc networking, satellite modem technology, and small lightweight secure digital capabilities on warfighter command and control capabilities and match emerging critical warfighter requirements with the technologies to identify near-term technology solutions supporting Combatant Commanders.  Areas of concentration include Tactical Edge Integration and Joint Command and Control Capabilities.\n\nCelestial Reach Joint Capability Technical Demonstration (JCTD) Assessment – Continue integrating a wide-band antenna solution for joint air, ground, and maritime operations and assessing the capability’s utility in providing wide-band communications that support Command and Control (C2) and Intelligence Surveillance and Reconnaissance (ISR) applications to enroute users.\n\nNational Security Agency (NSA) Commercial Solutions for Classified (CSfC) Secure Wireless Local Area Network (SWLAN) Integration Assessment – Continue assisting NSA in the development and assessment of a Suite B software encryption solution. This capability supports communicating over SECRET wireless networks without using Type-1 hardware solutions (e.g., SecNet 54, Talon, or KG-250s).\n\nAir\/Event Information Sharing Service (A\/EISS) Integration Assessment – Integrate an automated data handling capability that fuses and shares decision support data from national level authoritative sources enabling senior decision makers to make time-critical decisions during air events over North America via desktop or mobile devices.\n\nUS Navy 4G Long Term Evolution (LTE) Afloat Sea Trial Integration and Assessment – Integrate innovations in Fourth Generation (4G) LTE Cellular technologies and mobile Ka band spread spectrum satellite communications to deliver megabits of data to mobile and dismounted teams equipped with mobile devices in support of the counter-piracy mission.\n\nC2 Applications over Broadband Cellular (C2 ABC) Integration and Assessment – Integrate and assess emerging C2 and tailored applications using broadband cellular technologies to provide the warfighter at the tactical edge with expanded situational awareness.\n\nJoint Operational Long Term Evolution Deployable (JOLTED) – Tactical Cellular System (TACTICS) JCTD Technical Manager - JOLTED-TACTICS is an Internet Protocol (IP) based system designed to provide robust communications to dismounted Special Operations Forces (SOF) teams and General Purpose Company and below tactical users.  This system leverages innovations in Fourth Generation (4G) LTE Cellular technologies and mobile Ka band spread spectrum satellite communications to deliver megabits of data to mobile and dismounted teams armed with mobile devices such as smartphones or netbooks.\n\nTactitical Mobility Security Integration and Assessment (TMSIA) Spiral II – Integrate in partnership with the National Security Agency a security architecture for lightweight, man-portable communications-on-demand packages that allow the user to quickly establish secure 4G cellular wireless networks.\n\nDigitally-aided Personnel Recovery (DaPR) Personnel Recovery Support System (PRSS) 1B Integration and Assessment – Integrate a digital solution to provide standardized increment 1B digital messages and forwarding rules for direct machine to machine transmissions to applicable C2 systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.429"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.429"
                                            },
                                            "Text": {
                                                "val": "Continue FY2013 initiatives investigating impacts of technology advances in wireless devices, mesh and ad-hoc networking, satellite modem technology, and small lightweight secure digital capabilities on warfighter command and control capabilities and match emerging critical warfighter requirements with the technologies to identify near-term technology solutions supporting Combatant Commanders.  Areas of concentration include Tactical Edge Integration and Joint Command and Control Capabilities.\n\nJoint Operational Long Term Evolution Deployable (JOLTED) – Tactical Cellular System (TACTICS) Integration Project - JOLTED-TACTICS is an Internet Protocol (IP) based system designed to provide robust communications to dismounted Special Operations Forces (SOF) teams and General Purpose Company and below tactical users.  This system leverages innovations in Fourth Generation (4G) LTE Cellular technologies and mobile Ka band spread spectrum satellite communications to deliver megabits of data to mobile and dismounted teams armed with mobile devices such as smartphones or netbooks.\n\nJoint Operational Long Term Evolution Deployable (JOLTED) – Tactical Cellular System (TACTICS) JCTD Technical Manager – Serve as the JCTD technical manager.\n\nC2 Applications over Broadband Cellular (C2 ABC) Integration and Assessment – Integrate and assess emerging C2 and tailored applications using broadband cellular technologies to provide the warfighter at the tactical edge with expanded situational awareness.\n\nCelestial Reach Joint Capability Technical Demonstration (JCTD) Assessment – Continue integrating a wide-band antenna solution for joint air, ground, and maritime operations and assessing the capability’s utility in providing wide-band communications that support Command and Control (C2) and Intelligence Surveillance and Reconnaissance (ISR) applications to enroute users.\n\nMaritime\/Event Information Sharing Service (M\/EISS) Integration and Assessment – Integrate an automated data fusion capability into the Maritime Domain Awareness process.\n\nNational Security Agency (NSA) Commercial Solutions for Classified (CSfC) Secure Wireless Local Area Network (SWLAN) Integration Assessment – Continue assisting NSA in the development and assessment of a Suite B software encryption solution. This capability supports communicating over SECRET wireless networks without using Type-1 hardware solutions (e.g., SecNet 54, Talon, or KG-250s).\n\nJoint Command and Control Adaptive Planning and Execution (APEX) Assessment – Integrate a common user interface that allosws warfighters to customize their desktop to preference and present capabilities that fit mission needs through cloud computing and enterprise collaboration services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Command and Control Environment"
                                    },
                                    "Description": {
                                        "val": "The persistent command and control environment provides a reconfigurable Joint Task Force national and coalition laboratory that supports the rapid assessment and integration of existing and emerging C4 capabilities.  It is a venue for the Department and allied partners to collaborately assess capability and interoperability of current and future warfighting systems and when connected with other joint, service, agency, and coalition laboratories provides a robust and tailorable system of systems assessment and engineering environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.917"
                                            },
                                            "Text": {
                                                "val": "Continue FY 2012 initiatives by engaging the Services and Communities of Interest (COI) to leverage the capabilities of the Persistent Command and Control Environment by bringing joint solutions through C4AD's integration and operational assessment process.  Also continue to expand existing relationships with Service and Coalition laboratory and engineering organizations.\n\nC4AD Project Engineering Support – Provide infrastructure, communications, network, information assurance, security, and engineering support as required."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.079"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.079"
                                            },
                                            "Text": {
                                                "val": "Continue FY 2013 initiatives by engaging the Services and Communities of Interest (COI) to leverage the capabilities of the Persistent Command and Control Environment by bringing joint solutions through C4AD's integration and operational assessment process.  Provide a comprehensive Joint Task Force (JTF) environment required to also support cyber training, cyber capability development, and cyber assessment by expanding the connectivity and capability of the existing persistent environment to support the Enterprise Cyber Range Environment focused on  user requirements, architectures, standards, measures, metrics, instrumentation, and data collection. \n\nC4AD Project Engineering Support – Provide infrastructure, communications, network, information assurance, security, and engineering support as required."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "C4AD supports interoperability of systems selected for acquisition, integration and fielding.  C4AD is a forcing function to discover and provide interoperable joint solutions as a means to foster rapid, near-term insertion of command and control technology by promoting the ability to meet the DoD direction for spiral development and evolutionary acquisition.  Services and Defense Agencies are responsible for conducting acquisition activities in Programs of Record (POR)."
                        },
                        "PerformanceMetrics": {
                            "val": "FY 2013 Strategic Goals Supported:  Chairman’s Priorities to “Achieve our National Objectives in our Current Conflicts and Develop Joint Force 2020” by:\n- Driving resolution of C4 interoperability problems with actionable recommendations stemming from technical and operational demonstrations and assessments of existing and emerging C4 capabilities.\n\n- Integrating and assessing technical solutions that provide gap-filling capabilities to satisfy near-term operational requirements.\n\n- Providing a persistent C4 environment replicating an operational Joint Task Force Headquarters and\/or subordinate elements to conduct interoperability, capability, and integration assessments."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "General\/Contractor Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamics"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hampton Roads, VA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.340"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.102"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.102"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various DoD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various DoD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.392"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various DoD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various DoD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.134"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Communications Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various DoD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various DoD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.252"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PC4 Environment\/Laboratories"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.155"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}