{
    "id": "e6bc9218bde928fa6bee89f0d96d763018f19a8e",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602000D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Munitions Technology"
        },
        "R1LineItemNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.298"
            },
            "CurrentYear": {
                "val": "20.615"
            },
            "BudgetYearOne": {
                "val": "20.065"
            },
            "BudgetYearOneBase": {
                "val": "20.065"
            },
            "BudgetYearTwo": {
                "val": "21.556"
            },
            "BudgetYearThree": {
                "val": "22.172"
            },
            "BudgetYearFour": {
                "val": "22.536"
            },
            "BudgetYearFive": {
                "val": "22.974"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program addresses applied research associated with improving the lethality, reliability, safety, and survivability of munitions and weapon systems.  The goal is to develop and demonstrate joint enabling technologies that can be used by the Program Executive Officers (PEOs) as they develop their specific weapon programs.  The program invests in and demonstrates technologies from a Joint Service perspective, thus ensuring the development of technology with the broadest applicability while avoiding duplication of efforts.\n\nMunition Area Technology Groups (MATGs) and Fuze Area Technology Groups (FATGs) have been established for each munition and capability area and are tasked with: 1) coordinating, establishing, and maintaining five, ten, and fifteen year technology development plans and roadmaps, 2) coordinating biannual meetings to review technical and programmatic details of each funded and proposed effort, 3) developing and submitting Technology Transition Agreements in coordination with appropriate PEOs for insertion in their Insensitive Munitions (IM) Strategic Plans \/ Fuze Technology Development Plan, and 4) interfacing with other MATGs \/ FATGs and IM \/ fuze science and technology projects as appropriate.  The Joint Insensitive Munitions Technology Program (JIMTP) and Joint Fuze Technology Program (JFTP) will utilize a Technical Advisory Committee (TAC) (consisting of senior Department of Defense (DoD) and Department of Energy (DOE) laboratory representatives, and senior Munitions PEO representatives) to provide program oversight, policy, direction, and priorities during its annual meeting.\n\nThe Insensitive Munitions (IM) effort will demonstrate enabling technologies needed to develop weapons in compliance with requirements established in United States Code, Title 10, Chapter 141, Section 2389 and DoD Instruction 5000.1.  This effort will take promising technologies demonstrated at the laboratory scale and transition them into demonstration programs utilizing generic hardware based on priority munitions identified in the PEO IM Strategic Plans.  Mature demonstrated IM technology can be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other non-compliant munitions within their portfolios.\n\nThe JIMTP investments focus on five Munition Areas:  1) High Performance Rocket Propulsion (HPP), 2) Minimum Signature Rocket Propulsion (MSP), 3) Blast and Fragmentation Warheads (BFW), 4) Anti-Armor Warheads (AAW), and 5) Propulsion (GP).  MATGs, under tri-service leadership, have developed technology roadmaps for each Munition Area that are used to guide investments based on goals consistent with the DoD IM Strategic Plan.  These IM technologies, alone or in combination, will be developed and tested at the small-scale, and for eventual incorporation in hardware, simulating real-world munitions, to demonstrate their utility and feasibility. \n\nThe Enabling Fuze Technology effort will also demonstrate fuze enabling technologies needed to develop weapons that address priority capability areas identified in the Guidance for Development of the Force (GDF), the Secretary of Defense Memorandum, DoD Policy on Cluster Munitions and Unintended Harm to Civilians, and shortfalls in current weapon systems.  This effort will develop fuzing technologies and mature them for transition into advanced technology (6.3) programs and\/or design tools and protocols for weapon fuzing.  In this way, the Service and Industrial base weapon and fuze will be able to heavily leverage and apply these emerging and promising technologies in fuzing modeling and simulation tools, multi-point initiation, high reliability fuze architectures, survivable components, modular fuze packaging, and fuze sensor. \n\nThe Joint Fuze Technology Program investments focus on four specific capability areas that have been identified by Department strategic guidance and current shortfalls in weapon systems and will be validated by the PEOs and the Heads of the Service Science and Technology (S&T) communities.  These capability areas are:  1) Hard Target Survivable Fuzing, 2) Tailorable Effects Weapon Fuzing, 3) High Reliability Fuzing, and 4) Enabling Fuze Technologies and Common Architecture."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.328"
                },
                "CurrentYear": {
                    "val": "20.615"
                },
                "BudgetYearOne": {
                    "val": "20.840"
                },
                "BudgetYearOneBase": {
                    "val": "20.840"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.298"
                },
                "CurrentYear": {
                    "val": "20.615"
                },
                "BudgetYearOne": {
                    "val": "20.065"
                },
                "BudgetYearOneBase": {
                    "val": "20.065"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.030"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.775"
                },
                "BudgetYearOneBase": {
                    "val": "-0.775"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.024"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.775"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.775"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.006"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 baseline adjustments are reflective of DoD S&T priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P000"
                    },
                    "ProjectTitle": {
                        "val": "Insensitive Munitions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.474"
                        },
                        "CurrentYear": {
                            "val": "14.216"
                        },
                        "BudgetYearOne": {
                            "val": "13.936"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.936"
                        },
                        "BudgetYearTwo": {
                            "val": "14.615"
                        },
                        "BudgetYearThree": {
                            "val": "15.041"
                        },
                        "BudgetYearFour": {
                            "val": "15.220"
                        },
                        "BudgetYearFive": {
                            "val": "15.516"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Insensitive Munitions (IM) Technology Program (JIMTP) aims at developing the enabling technologies needed to build weapons in compliance with requirements established in statute (United States Code, Title 10, Chapter 141, Section 2389) and regulation (DoDI 5000.1 and CJCSI 3170.01F).  This effort will take promising technologies developed at the laboratory scale and transition them into demonstration programs utilizing generic hardware based on the priority munitions identified in the DoD IM Strategic Plan.  Mature and demonstrated IM technology can be transitioned, thereby decreasing the program costs and schedule risk.  This will additionally promote spin-offs to other non-compliant munitions within the DoD portfolio.  Without new technology, future variants of current weapon systems will have the same, or worse, response to IM stimuli.  New weapon developments will face similar challenges. \n\nThe JIMTP investments focus on five Munition Areas:  1) High Performance Rocket Propulsion, 2) Minimum Signature Rocket Propulsion, 3) Blast and Fragmentation Warheads, 4) Anti-Armor Warheads, and 5) Gun Propulsion.  Munition Area Technology Groups (MATGs), under tri-service leadership, have developed technology roadmaps for each Munition Area that are used to guide investments based on goals consistent with the DoD IM Strategic Plan.  The program is structured around these five areas with clear cross-cutting tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Performance Rocket Propulsion (HPP)"
                                    },
                                    "Description": {
                                        "val": "High Performance Rocket Propulsion (HPP) focuses on the development and demonstration of technologies to improve the IM response of HPP systems (rocket motors with Ammonium Perchlorate and with or without a metal fuel) for rockets and missiles launched from air, ground, and sea platforms.  These technologies, when applied to rocket motors, improve IM response to one or more threats, while not degrading the response to other IM threats and at least maintaining munition performance.  Technologies include, but are not limited to, rocket propellant ingredients (including synthesis, characterization and scale-up), reduced smoke or smoky propellants (including formulation, characterization and scale-up), rocket motor case design, materials for active and passive thermal mitigation, shock mitigation materials and techniques, passive and active coatings, active and passive venting techniques for motor cases or containers, ignition systems, sensors, and thrust mitigation techniques.  Operating conditions may be controlled or widely varying in both temperature and vibration.  The five, ten, or fifteen year goals of the HPP MATG are concentrated on solving the IM response of missile propulsion systems due to Fragment Impacts and Slow Cook Off for the majority of HPP rocket motors, and solving the Fast Cook Off response of very large HPP motors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.880"
                                            },
                                            "Text": {
                                                "val": "•  Scaled-up reduced smoke propellant to the five gallon scale with acceptable processing, conducted small-scale motor and impact testing, developed liner, and conducted slow cook off IM test.   \n•  Completed reduced smoke propellant evaluation, small-scale motor testing, accelerated aging, and IM tests.  Conducted propellant formulation efforts to produce burn or no-reaction response for fragment impact, bullet impact, and slow cook off and fast cook off events.\n•  Determined the thermal and mechanical response and the mechanical strength of the fabricated composite cases impregnated with additives with continued safety and environmental testing.\n•  Completed scale-up of high performance rocket propellants to one gallon size batches, refined processing procedures and conducted sensitivity and safety testing.\n•  Designed, analyzed, and built small-scale motors and conducted safety and environmental tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.656"
                                            },
                                            "Text": {
                                                "val": "•  Study thermal and mechanical responses of composite cases to slow cook off and aerodynamic heating. \n•  Complete scale up of high performance rocket propellants to five gallon size batches, refine processing procedures and conduct sensitivity and safety testing.\n•  Complete final assembly and conduct slow and fast cook off IM tests.\n•  Characterize novel ionic liquid candidates for high performance propulsion.  Downselect, scale-up to one pound, and conduct mechanical property testing.\n•  Complete burn rate measurements and dynamic mechanical analysis of novel binder materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.772"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.772"
                                            },
                                            "Text": {
                                                "val": "•  Determine the IM response of composite cases by conducting IM testing on eight inch diameter analogue motors.\n•  Conduct slow cook off, fragment impact, and hazard classification gap testing of high performance rocket propellants.\n•  Characterize pot life and processing of novel binder materials.  Measure mechanical properties, perform slow cook off visualization and STEX testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minimum Signature Rocket Propulsion (MSP)"
                                    },
                                    "Description": {
                                        "val": "Minimum Signature Rocket Propulsion (MSP) focuses on the development and demonstration of technologies to improve the IM response of MSP systems.  The development and demonstration of minimum signature (MS) rocket technologies, when applied to munition systems, will improve munition IM response to one or more threats, while not degrading the response to other IM threats and at least maintaining munition performance.  Technologies include but are not limited to MS rocket propellant formulations, ingredients for MS propellant formulations (including synthesis, characterization and scale-up), case and packaging design, active and passive venting techniques, rocket motor case design, ignition systems and thrust mitigation techniques. Of particular interest are technologies that provide a higher burning rate minimum signature propellant with state-of-the-art energy and reduced shock sensitivity.  The five, ten, and fifteen year goals of the MSP MATG are concentrated on solving the IM response of missile propulsion systems due to Fragment Impact, Slow Cook Off, and Shaped Charge Jet (SCJ) threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.957"
                                            },
                                            "Text": {
                                                "val": "•  Optimized propellant candidates were scaled-up to further characterize their initial ballistic performance and sensitivity properties.  Conducted sub-scale motor performance testing via seven inch baseline motor configuration, strand burner ballistics test, thermal cook off, and impact IM tests.\n•  Completed binder system alternatives full-scale testing using one gallon size mixes for transition to budget activity (BA) 6.3 project. \n•  Conducted additional impact and shock testing on alternative composite minimum signature propellant.  Manufactured analogue motors and selected best candidate for transition to BA 6.3.\n•  Scaled-up to one pint mixes novel propellant and conducted impact and cook off testing to determine IM responses of formulation.\n•  Scaled-up unique propellant and synthesized to 25, 50, 100 grams, and pint scale, and conducted small-scale IM tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.598"
                                            },
                                            "Text": {
                                                "val": "•  Generate 500 grams of novel coated material.  Characterize new materials, including safety and compatibility testing.  Perform small-scale IM tests on best candidates.\n•  Mix pint-sized batches of coated materials and conduct mechanical, safety, and ballistic testing of the mixes.\n•  Synthesize, scale-up, and perform safety testing on state of the art energetic materials.  Perform predictive thermochemical calculations for potential formulations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.651"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.651"
                                            },
                                            "Text": {
                                                "val": "•  Generate kilogram batches of novel coated materials.  Produce gallon-scale mixes of two promising minimum signature propellants.\n•  Determine the thermophysical properties of selected formulations from state of the art energetic materials.  Refine casting powder."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast and Fragmentation Warheads (BFW)"
                                    },
                                    "Description": {
                                        "val": "Blast and Fragmentation Warheads (BFW) focuses on the development and demonstration of technologies to improve the IM response of Blast\/Fragmentation munitions.  The development and demonstration of explosive ingredients and explosives and warhead and fuze technologies that, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and at minimum maintain munition performance.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability and reliability may be critically important depending on the intended munition application.  Technologies include but are not limited to new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection or packaging materials and systems, shock mitigation liners, initiation devices, techniques, and technologies.  Applications vary but include high performance warhead fills, booster explosives, bulk demolition charges, and bulk fills for blast and\/or fragmentation charges.  The five, ten, and fifteen year goals of the BFW MATG are concentrated on solving the IM response of blast fragment warheads to the Sympathetic Detonation, Fast Cook Off, and SCJ threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.984"
                                            },
                                            "Text": {
                                                "val": "•  Down-selected novel ingredient material formulation, completed sub-scale testing, and began transition to BA 6.3 project. \n•  Concluded second generation proof of concept experiments and started weaponization study of unique warhead explosive material.\n•  Began down-selecting materials and the sensitization process in order to conduct device scale testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.758"
                                            },
                                            "Text": {
                                                "val": "•  Conclude manufacturing studies and weaponization study for Compounded HE Composites and prepare to demonstrate IM characteristics of unique warhead explosive material. \n•  Conclude down-selecting materials and the sensitization process in order to conduct device scale testing to validate the process and transition to BA 6.3 project. \n•  Conduct characterization studies on novel explosive material. \n•  Conduct laboratory scale formulation, processing and analysis of melt cast enhanced blast and environmentally friendly explosive fill. \n•  Optimize novel explosive fill formulation for general purpose bombs. \n•  Conduct initial synthesis of unique booster materials for explosives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.796"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.796"
                                            },
                                            "Text": {
                                                "val": "•  Perform one kilogram scale-up of additional composite materials.  Formulate and test IM characteristics of the material.  Synthesize 60 kilograms of new explosive ingredients and formulate explosives on the ten gallon scale.  Determine mid-scale performance and IM properties of new formulations.\n•  Conduct thermal cycling and IM testing on novel explosive material. \n•  Scale up to one gallon mix melt cast enhanced blast explosive fill and perform sensitivity and performance testing. Prepare to transition to Task under PE 603000D8Z\/P301. \n•  Conduct characterization and performance testing, as well as IM assessments for novel general purpose bomb explosive fill formulation. Conduct characterization testing and down selected unique explosive booster material."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Armor Warheads (AAW)"
                                    },
                                    "Description": {
                                        "val": "Anti-Armor Warheads (AAW) focuses on the development and demonstration of explosive ingredients, explosives, warhead and fuze technologies for improving IM of AAW munitions.  The development of explosive ingredients, explosives and warhead and fuze technologies that, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and at minimum maintain munition performance.  Technologies include but are not limited to new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection\/packaging materials and systems, shock mitigation liners, and initiation devices, techniques, and technologies.  Applications vary but include high performance warhead fills, booster explosives, and all other technology to mitigate the violent response of Anti-Armor Warhead munitions to IM threats.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability, and reliability may be critically important depending on the intended munition application.  The five, ten, and fifteen year goals of the AAW MATG are concentrated on solving the IM response of anti-armor warheads to the Fragment Impact and Slow Cook Off threats and a five year goal of solving Sympathetic Detonation threats, with a ten and fifteen year goal of resolving the IM response to the Shaped Charge Jet threat."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.136"
                                            },
                                            "Text": {
                                                "val": "•  Conducted IM technology studies in the areas of initiation\/booster technology, explosive formulations, and warhead venting to develop warheads capable of producing deflagration and explosive type reactions for shaped charge jet and fragment impact threats.\n•  Scaled-up the baseline configuration to ten gallon, the spray coated melt-case to one and ten gallon, and the pressed formulations with spray coated HMX explosive."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.912"
                                            },
                                            "Text": {
                                                "val": "•  Conduct critical diameter and slow cook off IM tests of down-selected formulations.\n•  Conduct formulation and initial screening of explosive material to determine physical and performance characteristics.   Prepare to transition to Task under PE 603000D8Z.\n•  Conducted initial formulation work and baseline testing on cast cured explosive, using fine grain materials. \n•  Scale up to pint mixes formulations of energetic materials with less nitramine content and enhanced insensitivity. \n•  Conduct scale-up to one pound batch and demonstrated acceptable fragment testing for novel, cast cured, multi-effects explosives formulation.Conducted engineering assessment and began production of precursor materials for high energy melt-phase explosive.\n•  Develop baseline data for modeling explosive reactions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.557"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.557"
                                            },
                                            "Text": {
                                                "val": "•  Scale up formulations to 50 pound batches.  Perform standard IM tests on surrogate AAW.\n•  Conduct larger scale formulation (five pounds) of explosive material and perform intermediate scale IM and performance tests.\n•  Down-select optimized formulation and conduct IM testing on cast cured explosive, using fine grain material.  Prepare to transition to Task under PE 603000D8Z. \n•  Scale up and conduct IM testing of energetic materials with less nitramine content and enhanced insensitivity. \n•  Scale up to five gallon mix, conduct initial testing, complete aging study, and conduct standard IM tests on novel, cast cured, multi-effects explosives formulation. \n•  Scale up high energy pressed explosive and conduct performance testing. \n•  Characterize materials, formulate, and down-select high energy melt-phase explosive. \n•  Assess additional explosive materials to validate the baseline model data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gun Propulsion (GP)"
                                    },
                                    "Description": {
                                        "val": "Gun Propulsion (GP) focuses on the development and demonstration of technologies in the area of Gun Propulsion systems.  The development and demonstration of gun propulsion technologies, that when applied to munition systems, will improve munition IM response to one or more threats, while not degrading the response to other IM threats and at least maintaining munition performance.  Technologies include but are not limited to gun propellant formulations, ingredients for gun propellant formulations (including synthesis, characterization and scale-up), cartridge case and packaging design, active and passive venting techniques, reduced sensitivity primer propellant and primer systems, and robust primers for insensitive propellants.  Applications vary, but include both large and medium caliber munitions, as well as propelling charges for mortars and shoulder launched munitions.  Operating requirements vary, and other factors such as barrel life and operation over varying environmental conditions may be critically important depending on the intended munition application.  The five, ten, or fifteen year goals of the GP MATG are concentrated on solving the IM response of gun propulsion munitions to Fragment Impact and Slow Cook Off threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.517"
                                            },
                                            "Text": {
                                                "val": "•  Manufactured large-scale quantities and completed full-scale IM tests of down-selected propellant formulation mixes of novel propellant binder.  Conducted sub-scale ballistic and IM testing.\n•  Conducted instrumented ballistic simulator tests, fabricated hardware, and finalized venting solution for fragment impact and slow cook off. \n•  Continued formulation development to produce optimum IM properties and scale-up to manufacture three kilogram batches.  Conducted various tests to validate IM properties and suitability for gun propellant."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.292"
                                            },
                                            "Text": {
                                                "val": "•  Establish design of experiments test matrix and complete subsequent modeling effort.  \n•  Conduct IM and mechanical tests on containers and compare results with the models’ predictions.  \n•  Optimize formulation and conduct IM tests to determine viability of down-select candidate for gun propellants.  \n•  Continue formulation development to manufacture three kilogram batches for extrusion into 15 pounds of propellant.  \n•  Conduct various tests to validate IM properties and suitability for gun propellant.  \n•  Perform initial characterization of ignition propellants after exposure to novel ignition methodology. \n•  Scale up novel binder material to 25 gram batches and characterize material thermal and sensitivity properties. \n•  Conduct thermal and sensitivity testing on propellant formulation effort using unique less sensitive binder propellant. \n•  Conduct initial testing on representative samples to develop small-scale slow cookoff testing protocol."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.160"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.160"
                                            },
                                            "Text": {
                                                "val": "•  Conduct performance testing of down-selected candidates for gun propellants.\n•  Continue formulation development to manufacture six kilogram batches for extrusion into 30 pounds of propellant.  Conduct various tests to validate IM properties and suitability for gun propellant.\n•  Develop properties of ignition propellants after exposure to novel ignition methodology.  Perform sub-scale performance testing. Produce one gallon mixes of novel binder to complete IM testing. \n•  Scale up six pounds of unique less sensitive binder propellant formulation and conduct characterization testing. \n•  Design and fabricate apparatus to test propellants and develop modeling code for small-scale slow cookoff protocol."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603000D8Z P002"
                                    },
                                    "Title": {
                                        "val": "BA 3 Insensitive Munitions Advanced Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.529"
                                        },
                                        "CurrentYear": {
                                            "val": "20.819"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.843"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.843"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.153"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.812"
                                        },
                                        "BudgetYearFour": {
                                            "val": "23.055"
                                        },
                                        "BudgetYearFive": {
                                            "val": "23.503"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "1) Transitions of technologies developed by the Program are tracked and documented using DoD\/NASA Technical Readiness Level (TRL) scale. \n2) Munition Area Technology Group Technology Roadmaps are prepared, evaluated, and analyzed by Joint Insensitive Munitions Technology Program management and technical staff. \n3) Chairman's Annual Assessments for each MATG are critically reviewed by the Technical Advisory Committee to determine progress, transition plans, and relevance of each project.  \n4) Project progress toward goals and milestones is assessed at each MATG meeting.  \n5) Annual technical reports and papers are tracked and documented for the Program. \n6) External Peer Review of Projects conducted as part of Joint Army\/Navy\/NASA\/Air Force meetings."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P204"
                    },
                    "ProjectTitle": {
                        "val": "Enabling Fuze Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.824"
                        },
                        "CurrentYear": {
                            "val": "6.399"
                        },
                        "BudgetYearOne": {
                            "val": "6.129"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.129"
                        },
                        "BudgetYearTwo": {
                            "val": "6.941"
                        },
                        "BudgetYearThree": {
                            "val": "7.131"
                        },
                        "BudgetYearFour": {
                            "val": "7.316"
                        },
                        "BudgetYearFive": {
                            "val": "7.458"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This RDT&E effort will demonstrate fuze enabling technologies needed to develop weapons that address priority capability areas identified in the Guidance for Development of the Force (GDF), the Secretary of Defense Memorandum, DoD Policy on Cluster Munitions and Unintended Harm to Civilians, and shortfalls in current weapon systems.  This effort will develop enabling technologies at the laboratory scale and transition them into 6.3 demonstration programs for weapons where priority capabilities and technology needs have been identified and validated by the Program Executive Officers (PEOs) and the Heads of the Service Science and Technology (S&T) communities.  Mature 6.2 fuze technologies will be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other munitions within their portfolios.\nUnder the Joint Fuze Technology Program (JFTP), investments are focused on specific capability areas that have been identified by Department strategic guidance and current shortfalls in weapon systems and validated by the PEOs and Heads of the Service S&T communities.  These four capability areas are: 1) Hard Target Survivable Fuzing, 2) Tailorable Effects (TE) Weapon Fuzing, 3) High Reliability Fuzing, and 4) Enabling Fuze Technologies and Common Architecture."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hard Target Fuzing"
                                    },
                                    "Description": {
                                        "val": "The Hard Target Fuzing challenges are grouped into three Technology Areas.  First, improved modeling and simulation capabilities provide the validated computational tools necessary for hard target applications.  Second, basic phenomenology and understanding of the Fuze Environment is the science-based endeavor of providing the test equipment, instrumentation, and analysis techniques for experimentation and data gathering necessary for next generation fuzing.  Third, hard target survivable fuze components are developed to increase the effectiveness of facility denial munitions by improving the prediction tools and testing methodologies to evaluate the survivability and functionality of legacy and future fuzes.  Development of these technologies will enable next generation boosted and hypersonic penetrators to execute missions against hardened and deeply buried targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.642"
                                            },
                                            "Text": {
                                                "val": "-  Developed underlying technologies and testing methods to define the high-speed penetration environment.\n-  Completed of hydrocode\/EPIC 22 modeling and simulation tools via hard target instrumented characterization testing.\n-  The hard target weapon community began integrating the testing protocol in future boosted and high speed penetrator development programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.661"
                                            },
                                            "Text": {
                                                "val": "-  Develop and validate modeling and simulation code using high fidelity, multi-scale simulation techniques.\n-  Develop survivable modular fuze technology for multi-common miniature munitions with distributed\/embedded fuzes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.574"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.574"
                                            },
                                            "Text": {
                                                "val": "-  Adapt and transition Joint Fuze Technology Program developed testing protocol in boosted and high speed penetrator development programs.\n- Demonstrate and transition survivable modular fuze technology for multi-role common miniature munitions with distributed\/embedded fuzes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tailorable Effects Fuzing"
                                    },
                                    "Description": {
                                        "val": "This area focuses on developing fuzing for tailorable effects weapons that encompasses the ability to selectively vary the output of the weapon (Dial-a-Yield) and\/or the ability to generate selectable effects (directed blast, fragmentation); developing initiation and multi-point technologies to include electronic safe and arm based multi-point initiators for tunable output – scalable yield warheads; MicroElectro-Mechanical Systems (MEMS) based multi-point initiators for tunable output\/scalable yield warheads; and smart fuzing for tailorable effects weapons.  These technologies will enable weapons that can effectively defeat a variety of targets while minimizing unintentional collateral effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.694"
                                            },
                                            "Text": {
                                                "val": "-  Designed controllable explosive sensitivity technologies that provide the ability to selectively vary the sensitivity of energetic materials.\n-  Conducted explosive testing of miniature fire-set components for 6.3 tailorable effects initiation warhead."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.712"
                                            },
                                            "Text": {
                                                "val": "-  Continue to develop Tailorable Effects modeling and simulation using hydrocode.\n-  Develop hardened, Tailorable Effects firing systems for missile and projectile warheads to survive the high-g shock environments associated with impact with Military Operations in Urban Terrain (MOUT) targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.555"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.555"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate and transition into 6.3 advanced technology development of detonator, initiation, and fireset technologies.\n-  Apply initiation architecture and control technologies for application in the Services’ warhead development programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Reliability Fuzing"
                                    },
                                    "Description": {
                                        "val": "Develop high reliability fuzing architectures, fuzing components, and Unexploded Ordnance (UXO) reduction features.  These technologies will enable the next generation of cluster munitions to achieve the required greater than 99 percent reliability goal.  Evolving DoD emphasis on increased weapon system reliability is driving the need to consider new and novel approaches for achieving increased fuze reliability while maintaining or enhancing fuze design safety.  DoD policy, higher weapon reliability expectations and harsher weapon system operational requirements are dictating the need for higher fuze reliability than available using current technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.514"
                                            },
                                            "Text": {
                                                "val": "-  Designed high reliability fuze technology components, including MEMS sensors and safety devices that satisfy reliability while maintaining safety by eliminating single-point and common-mode failures.\n-  Developed fuze reliability predictive analysis that is being applied by the Services’ weapon community (e.g. cluster munitions, bomb fuzing)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.574"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate high reliability fuze architecture concepts that satisfy reliability while maintaining safety by eliminating single-point and common-mode failures.\n-  Apply next generation cluster monitions fuze design and architecture, fabricate component technology prototypes, and conduct performance and reliability tests in ballistic and harsh environment testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.514"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.514"
                                            },
                                            "Text": {
                                                "val": "-  Research and develop novel technologies for UXO reduction features including fuze mechanisms and initiation energetic to eliminate any unexploded ordnance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Fuze Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop common\/modular fuze architecture; innovative fuze component technologies; sensors; next generation fuze setting capability, tools and modeling; and fuzing power sources.  These fuzing technologies will provide smaller, more cost effective solutions while meeting or exceeding the performance of existing technologies.  Development of these technologies will enable future weapon applications to be more mission adaptive and smaller along with improved target detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.974"
                                            },
                                            "Text": {
                                                "val": "- Designed and tested phase one exploitation resistant proximity fuze sensors and electronics technology hardware for detecting targets, impact, voids, and media.\n- Designed fuze power source technology and concepts that include functionality that precludes the inadvertent release of \"stored energy\" such as Micro power sources and energy harvesting components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.452"
                                            },
                                            "Text": {
                                                "val": "-  Establish next generation system interface architecture between various fuze subsystems.\n-  Evaluate proximity fuze sensor, electronics and algorithm technologies in performance and functional testing in air-gun and ballistic environments.\n-  Transition to 6.3 development of exploitation resistant proximity fuze sensors and electronics technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.486"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.486"
                                            },
                                            "Text": {
                                                "val": "-  Conduct assessments of common fuze architecture technologies: safety components, modular electronics, sensors, interfaces, and packaging."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603000D8Z P301"
                                    },
                                    "Title": {
                                        "val": "BA 3 Enabling Fuze Advanced Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.077"
                                        },
                                        "CurrentYear": {
                                            "val": "4.793"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.411"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.411"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.887"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.112"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.373"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.536"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1) Transitions of technologies developed by the Program are tracked and documented using DoD\/NASA Technical Readiness Level (TRL) scale.\n2) Fuze Area Technology Group (FATG) Technology Roadmaps are prepared, evaluated, and analyzed by Joint Fuze Technology Program management and technical staff.\n3) Chairman's Annual Assessments for each FATG are critically reviewed by the Technology Advisory Committee to determine progress, transition plans, and relevance of each project.\n4) Project progress toward goals and milestones is assessed at each FATG meeting.\n5) Annual technical reports and papers are tracked and documented for the Program.\n6) Technology Transition Agreements in place with Munitions programs."
                        }
                    }
                }
            ]
        }
    }
}