{
    "id": "e78d3e8a18755478867a492f1651acefb0418cad",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OTE_RDTE_JustificationBook_Operational_Test_and_Evaluation,_Defense_PB_2014.zzz_unzipped_RDTE_JustificationBook_Operational_Test_and_Evaluation,_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Operational Test and Evaluation, Defense",
        "appropriation_code": "0460",
        "appropriation_name": "Operational Test and Evaluation, Defense"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605814OTE"
        },
        "ProgramElementTitle": {
            "val": "Operational Test Activities and Analyses"
        },
        "R1LineItemNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "AppropriationCode": {
            "val": "0460"
        },
        "AppropriationName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "113.467"
            },
            "CurrentYear": {
                "val": "63.566"
            },
            "BudgetYearOne": {
                "val": "62.157"
            },
            "BudgetYearOneBase": {
                "val": "62.157"
            },
            "BudgetYearTwo": {
                "val": "63.545"
            },
            "BudgetYearThree": {
                "val": "63.892"
            },
            "BudgetYearFour": {
                "val": "63.412"
            },
            "BudgetYearFive": {
                "val": "56.561"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Starting in FY 2013 the Joint Technical Coordinating Group for Munitions Effectiveness (JTCG\/ME) and the Joint Aircraft Survivability Program (JASP) initiatives are realigned from the Operational Test Activities and Analyses program element (0605814OTE) to the Live Fire Test and Evaluation program element (0605131OTE).  Since the JTCG\/ME and JASP programs focus on the survivability of currently fielded systems the two programs are more appropriately funded within the Live Fire Test and Evaluation program element."
        },
        "ProgramElementMissionDescription": {
            "val": "The Operational Test Activities and Analyses (OTA&A) programs are continuing efforts that provide management and oversight of test and evaluation functions and expertise to the Department of Defense (DoD).  The OTA&A programs consist of three activities:  Joint Test and Evaluation (JT&E); Threat Systems (TS); and Center for Countermeasures (CCM).\n\nJoint Test and Evaluation projects are test and evaluation activities conducted in a joint military environment that develop process improvements.  These multi-Service projects, chartered by the Office of the Secretary of Defense and coordinated with the Joint Staff, appropriate combatant commanders, and the Services, provide non-materiel solutions that improve:  joint interoperability of Service systems, technical and operational concepts, joint operational issues, development and validation of joint test methodologies, and test data for validating models, simulations, and test beds.  The JT&E projects address relevant joint war fighting issues in a joint test and evaluation environment by developing and providing new tactics, techniques, and procedures to improve joint test capabilities and methodologies.\n\nThreat Systems, based on a memorandum of agreement between the Director, Operational Test and Evaluation (DOT&E) and the Defense Intelligence Agency, provides DOT&E support in the areas of threat resource analysis, intelligence support and threat systems investments.  Threat Systems provides threat resource analyses on the availability, capabilities and limitations of threat representations (threat simulators, targets, models, U.S. surrogates and foreign materiel) and analysis of test resources used for operational testing to support DOT&E’s assessment of the adequacy of testing for those programs designated for oversight by DOT&E and the Office of the Under Secretary of Defense for Acquisition, Technology and Logistics (OUSD(AT&L)).  Threat Systems provides DOT&E assessment officers and other DOT&E activities with program specific threat intelligence support.  Threat Systems also funds management, oversight, and development of common-use threat specifications for threat simulators, threat representative targets, and digital threat models used for test and evaluation. \n\nThe Center, a Joint Service Countermeasure (CM) Test and Evaluation Center, serves as DoD’s independent evaluator for electro-optical systems with emphasis on rotary wing survivability, precision guided weapons (PGWs), CMs\/ counter-countermeasures (CCMs) employment, and warning devices.  The Center conducts tests, analyzes test results and provides CM expertise that benefits the Services, Joint activities, T&E Agencies, DoD Acquisition Community, the Intelligence Community, Homeland Defense and Overseas Contingency Operations (OCO).  Data collected during Center test activities provides valuable information to OSD assessment officers for select oversight programs.  The Center assesses current and developing systems, using carefully developed test and evaluation methodologies to provide the basis for understanding how CMs might affect systems used in current and future battlefields.  Additionally, the Center develops CM specific test equipment that can be used for both Title 10 programs and OCO urgent operational needs.\n\nThis Program Element is budgeted in Budget Activity 6, RDT&E Management Support, to support management activities for the DOTE oversight responsbilities of test and evaluation functions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "115.467"
                },
                "CurrentYear": {
                    "val": "63.566"
                },
                "BudgetYearOne": {
                    "val": "63.382"
                },
                "BudgetYearOneBase": {
                    "val": "63.382"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "113.467"
                },
                "CurrentYear": {
                    "val": "63.566"
                },
                "BudgetYearOne": {
                    "val": "62.157"
                },
                "BudgetYearOneBase": {
                    "val": "62.157"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.225"
                },
                "BudgetYearOneBase": {
                    "val": "-1.225"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Progam Realignment\/Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.225"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.225"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program Realignment made in support of an administrative contract."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0605814OTE"
                    },
                    "ProjectTitle": {
                        "val": "OTA&A"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "113.467"
                        },
                        "CurrentYear": {
                            "val": "63.566"
                        },
                        "BudgetYearOne": {
                            "val": "62.157"
                        },
                        "BudgetYearOneBase": {
                            "val": "62.157"
                        },
                        "BudgetYearTwo": {
                            "val": "63.545"
                        },
                        "BudgetYearThree": {
                            "val": "63.892"
                        },
                        "BudgetYearFour": {
                            "val": "63.412"
                        },
                        "BudgetYearFive": {
                            "val": "56.561"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Operational Test Activities and Analyses (OTA&A) programs are continuing efforts that provide management and oversight of test and evaluation functions and expertise to the Department of Defense (DoD).  The OTA&A programs consist of three activities:  Joint Test and Evaluation (JT&E); Threat Systems (TS); and the Center for Countermeasures (CCM).  Starting in FY 2013 the JTCG\/ME and JASP programs are realigned from the Operational Test Activities and Analyses program element (0605814OTE) to the Live Fire Test and Evaluation program element (0605131OTE).  Since the JTCG\/ME and JASP programs focus on the survivability of currently fielded systems the two programs are more appropriately funded within the Live Fire Test and Evaluation program element."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Test Activities and Analyses"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "113.467"
                                            },
                                            "Text": {
                                                "val": "Joint Test and Evaluation (JT&E)\n\nIn FY 2012 the JT&E Program leadership began re-engineering the program’s business processes after notification of a 43 percent budget reduction starting in FY 2013.  The JT&E staff and the program’s stakeholders developed a concept of operations (CONOPS), which provides the details of the new business model, based on the revised budget.  This CONOPS was briefed to DOT&E leadership and reviewed by Senior Advisory Council (SAC), Executive Steering Group (ESG), and the Technical Advisory Board (TAB), the program’s governing bodies, for concurrence.\n\nThe program had two joint tests close and four joint tests continue past the fiscal year.  The Joint Integration of Maritime Domain Awareness for Homeland Defense Joint Test, which developed joint tactics, techniques, and procedures to synchronize information concerning the maritime domain for key decision markers across operations centers for homeland defense, closed in October 2012.  The Joint Jamming Assessment and Mitigation Joint Test also closed in October 2012 after developing joint tactics, techniques, and procedures to sustain operations in the presence of purposeful interference of satellite communications.\n\nThreat Systems \n\nAs part of the Secretary of Defense FY 2012 efficiency initiatives, Threat Systems eliminated the Target Management Initiative (TMI) and reduced funding for investments in advanced threat surrogate developments.  TMI elimination will make the Services solely responsible for the development and acquisition of new threat representative targets and target control systems.  Reducing threat surrogate investments will slow but not eliminate development of advanced threat surrogates used in operational test and evaluation.\n\nThreat Systems completed the four-year project to integrate current intelligence community-based missile models into all DoD Hardware-In-The-Loop countermeasure test facilities, continued test planning working group participation to identify threat shortfalls; conducted special studies and provided current intelligence support tailored to specific U.S. weapon systems acquisition; developed an unmanned aerial vehicle Global Positioning Satellite jamming capability using micro jammers to increase threat realism at test ranges, and used existing live fire data to verify and compare MANPAD laboratory and hardware-in-the-loop facility testing capabilities to increase confidence in using other than open air live fire events for operational testing.  Initiatives for FY 2012 included development of a modeling and simulation (M&S) roadmap to identify projects that support effective testing of US and Allied countermeasure systems; integration of authoritative, DIA-approved models into simulations used for testing advanced systems in an integrated air defense network; data collection to support the development of a hostile fire signature model for use in testing new hostile fire indicator technologies being developed by the Army and Navy; investigations into digital radio frequency memory use against threat air defense systems; assessments of next generation GPS jammers and their potential impact of US weapon systems; and translation of all source technical intelligence on a battle management and command, control, communications and computer system into a model to support test and evaluation.\n\nThese activities help DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable and promotes common solutions to Service threat representation needs.\n\nThe Center \n\nThe Center tested, analyzed, and reported on more than 40 systems, with special emphasis on rotary wing survivability, CMs\/counter-countermeasures (CCMs) employment, warning and targeting systems and PGWs.  Each program supported received an independent assessment of our data\/findings and test support for CM\/CCM evaluations.  Approximately 52% of the Center’s efforts were spent on Aircraft Survivability Equipment (ASE) testing; with the majority of these efforts in support of rotary wing aircraft.  About 17% of the Center’s efforts were spent on PGW, foreign system, and other types of field testing not related to ASE.  Approximately 6% of the Center’s efforts were dedicated to OCO support with emphasis on CM–based, pre-deployment training for rotary wing units.  Twenty-three percent of the Center’s efforts were spent on internal programs to improve test capabilities and to develop test methodologies for new types of T&E activities, much of which was accomplished in concert with the Central Test and Evaluation Investment Program (CTEIP).  Programs include the CTEIP-sponsored, Joint IRCM Threat System (JMITS), Towed Aerial Plume Simulator (TAPS) and Multi-Spectral Sea and Land Target Simulator (MSALTS).  In addition to the Center’s internal improvements and modernization efforts, additional funding to support unfunded requirements for MSALTS was received and forwarded to meet program needs.  These systems, as well as a new remote launch system (RLS) and the Hostile Fire Signature (HSIG) Models, will be used in support of testing for both Title 10 programs and OCO ASE urgent operational needs.  Our support was distributed across all the Services as well as intelligence agencies and research and development activities.\n\n\tAbout 2% of the Center’s efforts consisted of providing subject matter expertise and other support not related to scheduled test activities.  The Center provided expertise to many organizations and was actively involved in the following panels:  Joint Expendable Countermeasures (JECM) Integrated Product Team, Joint Infrared Countermeasures Multi Sensing Symposia Working Group (MSS IRCM WG), Joint Aircraft Survivability Program (JASP), Foreign Material Exploitation Working Group, Foreign Material Program T&E Subcommittee, Joint Project Mallari Working Group, Joint  Countermeasures T&E Working Group (JCMT&E WG), and  JCMT&E WG Hostile Fire Indicator (HFI) subgroup lead."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "63.566"
                                            },
                                            "Text": {
                                                "val": "Joint Test and Evaluation (JT&E) \n\nIn FY 2013 the program will implement the CONOPS developed the previous year.  The most significant changes in the new model are shorter timelines for project development and execution, as well as the designation of permanent Joint Test Units to house test teams.  These two changes will allow test teams to share resources, as well as start and execute projects quickly.  Additionally, the life cycles of the program’s quick reaction tests and joint tests will be aligned so that the program’s governing bodies will meet concurrently to maximize customer availability and minimize travel cost.\n\nThe program expects to have two joint tests close and four joint tests continue through the fiscal year.  One of the two tests to close is the Joint Cyber Operations Joint Test that is developing tactics, techniques, and procedures to enable the use of an adaptive cyber defense strategy for critical C2 services against cyber threats across the DoD Global Information Grid.  The other test is Joint UAS Digital Information Exchange Joint Test that is developing joint tactics, techniques, and procedures to standardize the information exchange methods and dissemination paths to integrate UAS-derived information across the Services to support both deliberate and dynamic targeting requirements.\n\nThe program will conduct two feasibility studies and establish one new joint test during FY 2013.   \n\nThreat Systems\n\nThreat Systems will continue test planning working group participation to identify threat shortfalls; conduct special studies and provide current intelligence support tailored to specific U.S. weapon systems acquisitions; continue the development of Global Positioning Satellite jamming capabilities to increase threat realism at our test ranges, and continue the development of an ammunition and rocket propelled grenade signature model for use in hostile fire indicator systems.  We will propose candidate threat systems from the various intelligence agencies and develop models for use in test and evaluation.  We will investigate the integration of digital radio frequency memory (DRFM) technology to develop modern threat jammers.  \n\nNew initiatives for FY 2013 include implementation of M&S roadmap projects to ensure threats to US and Allied infrared countermeasure systems are available for testing by initiating a performance model sustainment capability, investigating ballistic missile related threats, development of next generation threat GPS jammers and their potential impact on US weapon systems, providing representative cyber warfare threats for testing, and identify and provide alternative test resources that represent land and sea threats.  In addition, we will concentrate on improving our understanding of WESTPAC threats by initiating a series of technical analyses to determine those characteristics we need to provide to the test community to emulate the threats and their densities in potential engagements.\n\nThese activities help DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, and promotes common solutions to Service threat representation needs.\n\nThe Center\n\nThe Center will test, analyze, and report on more than 30 systems with emphasis on rotary wing survivability, CMs\/CCMs employment, warning and targeting systems and PGWs.  Each program supported will receive an independent assessment of our data\/findings and test support for CM\/ CCM evaluations.  We will continue to emphasize support of the DOT&E enterprise, with a clear focus on Title 10 weapons systems, aircraft survivability and hostile fire initiatives.  Additionally, a large percentage of ongoing efforts will focus on aircraft survivability testing in support of current OCO.  In addition to these test activities, the Center will continue to provide CM expertise in pre-deployment events and training, as well as CM\/CCM-focused tactics and procedures (TTP) development.  The Center will continue to develop the CTEIP-sponsored, MSALTS, which will be used in support of testing for both Title 10 programs and OCO ASE urgent operational needs.  The Center will continue working with the Threat Simulator Working Group (TSWG) sponsored HSIG model.  Our support will be distributed across all the Services as well as intelligence agencies and research and development activities.\n \nThe Center will provide expertise to many organizations and will continue to be actively involved in the following panels:  JECM Integrated Product Team, Joint Infrared Countermeasures Multi Sensing Symposia Working Group (MSS IRCM WG), JASP, Foreign Material Exploitation Working Group, Foreign Material Program T&E Subcommittee, Joint Project Mallari Working Group, JCMT&E WG, and JCMT&E WG HFI subgroup lead."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "62.157"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "62.157"
                                            },
                                            "Text": {
                                                "val": "Joint Test and Evaluation (JT&E)\n\nBy FY 2014 the program will be on the nomination-selection-execution cycle developed in FY 2012, but will continually adjust the business model to improve the program. \n\nIn FY 2014 JT&E has two projects slated for closing and an estimated two projects ongoing from FY 2013.  The Joint Advanced Capability Employment Joint Test, anticipated to close in August 2014, is developing tactics, techniques, and procedures to enable the joint task force commander to employ advanced capabilities to overcome complex targeting challenges.  The Joint Deployable Integrated Air and Missile Defense Joint Test, scheduled to close in June 2014, is developing, test, and evaluate tactics, techniques, and procedures to enable the joint task force commander to employ integrated deployable air, cruise missile, and theater ballistic missile defense capabilities.\n\nFour new feasibility studies will be conducted in FY 2014, two of which will be selected to conduct joint tests.\n\nThreat Systems\n\nThreat Systems will continue test planning working group participation and perform technical analyses to identify threat shortfalls; conduct special studies and provide current intelligence support tailored to specific U.S. weapon systems acquisitions; continue the development of Global Positioning Satellite jamming capabilities to increase threat realism at our test ranges, and complete the development of an ammunition and rocket propelled grenade signature model for use in hostile fire indicator systems.  We will propose candidate threat systems from the various intelligence agencies and develop models for use in test and evaluation.  We will continue efforts to maintain a standard set of threat performance models for use in test and evaluation facilities and complete the initial hostile fire indicator model for small arms and RPGs and continue investigating ballistic missile related threats.\n\nNew initiatives for FY 2014 include investigations into advanced threat capabilities including multi-spectral threats and missile imaging seekers; adding threat signature sustainment for missiles, small arms and rockets to augment performance models for use in infrared countermeasures testing; determine how best to incorporate threats into unmanned aerial vehicles to service testing including use in GPS-deprived environments; continue investigation into producing representative threats for cyber testing; and consider addition of more small arms threats to the hostile fire indicator model.\n\nThese activities help DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, and promotes common solutions to Service threat representation needs.\n\nThe Center\n\nThe Center will test, analyze, and report on more than 30 electro-optical systems with special emphasis on rotary wing survivability, CMs\/CCMs employment, warning and targeting systems and PGWs.  Each program supported will receive an independent assessment of our data\/findings and test support for CM\/ CCM evaluations.  We will continue to emphasize support of the DOT&E enterprise, with a clear focus on Title 10 weapons systems, aircraft survivability and hostile fire initiatives.  Additionally, a large percentage of ongoing efforts will focus on aircraft survivability testing in support of current OCO.  Furthermore, the Center will continue to provide CM expertise in pre-deployment events and training, as well as CM\/CCM-focused TTP development.  The Center will continue to develop the CTEIP-sponsored MSALTS, which will be used in support of testing for both Title 10 programs and OCO ASE urgent operational needs.  The Center will continue to work with the TSWG-sponsored HSIG model.  Our support will be distributed across all the Services as well as intelligence agencies and research and development activities.\n \nThe Center will provide expertise to many organizations and will continue to be actively involved in the following panels:  JECM Integrated Product Team, Joint Infrared Countermeasures Multi Sensing Symposia Working Group (MSS IRCM WG), JASP, Foreign Material Exploitation Working Group, Foreign Material Program T&E Subcommittee, Joint Project Mallari Working Group, JCMT&E WG, and JCMT&E WG HFI subgroup lead."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "(U) PERFORMANCE METRICS:\n\nPerformance Measure:  Percentage of required products, such as test planning documents, tactics, techniques, procedures, threat characteristics, assessments, and reports that are developed and delivered to program managers and customers on time.\n\nActual Performance and Goals:\n\n\nOperational Test Activities and Analyses\t    FY 2012 (Actual)        FY 2013 (Goal)        FY 2014 (Goal)\nOn-Time Completion Rate\t                                  94%                            95%\t                96%\n\nThe on-time completion rate was computed on the basis of the number of required products that were submitted within established time standards relative to the total number of such products that fell due during the fiscal year.  DOT&E plans to maintain its on-time completion rates for FY 2013 and FY 2014 through increased management emphasis on timely delivery of required products to customer activities."
                        }
                    }
                }
            ]
        }
    }
}