{
    "id": "e7dc0e3b69ec8c501ddebaf2fc2f41f2de1798f9",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0607210D8Z"
        },
        "ProgramElementTitle": {
            "val": "Industrial Base Analysis and Sustainment Support"
        },
        "R1LineItemNumber": {
            "val": "185"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "14.000"
            },
            "BudgetYearOneBase": {
                "val": "14.000"
            },
            "BudgetYearTwo": {
                "val": "12.000"
            },
            "BudgetYearThree": {
                "val": "8.000"
            },
            "BudgetYearFour": {
                "val": "4.000"
            },
            "BudgetYearFive": {
                "val": "2.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This is a new start program with a strategic goal of strengthening the industrial base in support of DoD supply chain and defense manufacturing requirements."
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense-wide Industrial Base Analysis and Sustainment (IBAS) program element provides the Department with a comprehensive ability to achieve the strategic goal of strengthening the industrial base in support of DoD supply chain and defense manufacturing requirements. This program maintains or improves the health of essential parts of the defense industry to avoid reconstitution costs for capability after a Defense procurement hiatus on major investment programs or critical supply chain products where affordable and innovative mechanisms are available to work with the producers in the interim.\n\nA stated purpose of the program is to provide for sustainment of the industrial base through a break in production.  Criteria for project selection will include factors such as 1) identifiable path of preservation, transformation or innovation between an existing capability and a capability with a very high probability of being needed in the short to medium term (< 5 years); 2) loss of the capability is likely in the absence of the proposed project; 3) analysis showing that the project results in a lower overall cost to the department than if capability is developed from scratch when needed; and 4) preference is given to projects supporting multiple programs or services with no clearly identifiable principle beneficiary."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "14.000"
                },
                "BudgetYearOneBase": {
                    "val": "14.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "14.000"
                },
                "BudgetYearOneBase": {
                    "val": "14.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Industrial Base Sustainment (new start program)"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "14.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "14.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 $14.0 Industrial Base Sustainment:  Funds realigned to this DoD high priority issue to achieve the strategic goal of strengthening the industrial base in support of DoD supply chain and defense manufacturing requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "819"
                    },
                    "ProjectTitle": {
                        "val": "Industrial Base Analysis and Sustainment"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "14.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.000"
                        },
                        "BudgetYearTwo": {
                            "val": "12.000"
                        },
                        "BudgetYearThree": {
                            "val": "8.000"
                        },
                        "BudgetYearFour": {
                            "val": "4.000"
                        },
                        "BudgetYearFive": {
                            "val": "2.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "OSD Acquisition, Technology and Logistics (AT&L) investments under this program are informed by the Department's industrial assessment tools to include the Sector by Sector, Tier by Tier (S2T2) repository of defense industrial base information maintained by Deputy Assistant Secretary of Defense (Manufacturing and Industrial Base Policy) (DASD(MIBP)).  These tools collaboratively identify elements of the industrial base where current acquisition programs will not invest enough in production and\/or research to support the minimum sustaining rate that would keep critical suppliers viable.  While industrial base risks identified through these assessment tools are to be mitigated primarily through direct engagement with military departments, agencies, and industry, exceptional cases will require defense-wide intervention via investment accounts, often in collaboration with multiple Services and agencies, to ensure adequate industrial capability to support future defense needs.\n\nThis funding is a key tool for addressing supply chain risks and diminishing manufacturing sources.  Investments are prioritized though a careful analysis at every tier of the supply chain according to a numerical scale of risk-area's fragility and criticality.  Criticality examines characteristics that make a specific product or service difficult to replace if disrupted; fragility examines characteristics that make small deviations in the status quo likely to have substantial effects on an industry \/ supplier.  These concepts underpin AT&L’s core mission and inform critical investment, budgetary, and programmatic decision-making."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Industrial Base Sustainment"
                                    },
                                    "Description": {
                                        "val": "Under Industrial Base Sustainment (IBS), fragility and criticality analysis would be applied across the DoD enterprise to invest in priority areas, closely integrating the results of S2T2 with applied research to enhance industrial productivity and sustain essential defense design teams. Projects will have impact across all industrial base sectors: aircraft; Command, Control, Communications and Computers (C4); missiles; ground vehicles; radar & Electronic Warfare (EW) and others.  Projects will be improvements of existing capabilities with a very high probability of success."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "Address supply chain vulnerabilities and early indicators of program risk and make corrective and innovative investments in essential defense supply chains."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Goal is to insert industrial base considerations consistently in program review\nTo make informed investment and production decisions\nTo avoid reconstitution costs for capability that we will need again soon"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "All efforts directly supporting system development and delivery to include primary contracts, major component contracts, contracted services, in-house support provided by the Services\/Agencies, and government furnished property"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Projects - Selection in Process"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leverage Current Efforts"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.650"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.650"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Efforts associated with services provided in support of program office management and administration processes such as:   program oversight, resource justification, budget and programming, milestone and schedule tracking"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services for DASD(MIBP)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DASD(MIBP)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, dc"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.350"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.350"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}