{
    "id": "e935cce3347192f679126fe97b618affd114d6ac",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604759F"
        },
        "ProgramElementTitle": {
            "val": "Major T&E Investment"
        },
        "R1LineItemNumber": {
            "val": "100"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "60.388"
            },
            "CurrentYear": {
                "val": "42.236"
            },
            "BudgetYearOne": {
                "val": "34.841"
            },
            "BudgetYearOneBase": {
                "val": "34.841"
            },
            "BudgetYearTwo": {
                "val": "47.821"
            },
            "BudgetYearThree": {
                "val": "49.479"
            },
            "BudgetYearFour": {
                "val": "47.688"
            },
            "BudgetYearFive": {
                "val": "48.546"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This PE provides planning, improvements, and modernization for test capabilities at three Air Force Test Center (AFTC) organizations: 96 Test Wing at Eglin AFB FL (to include 96 Test Group at Holloman AFB NM, and operating locations at Wright-Patterson AFB OH), Arnold Engineering Development Complex (AEDC) at Arnold AFB TN and the 412 Test Wing at Edwards AFB CA.  The purpose is to help test organizations improve and develop their test infrastructure and capabilities to keep pace with improvements in weapon system technologies.  \n\nThe improvement and modernization (I&M) requirements are defined through the AF Test Investment Planning & Programming (TIPP) Process.  All projects have been reviewed through the Tri-Service Reliance process (to communicate AF efforts to the other Services and avoid unwarranted duplication of effort) and are documented in the Technology Development Acquisition Program (TDAP) database.  Each project has its own planning, development, equipment acquisition, equipment installation, and checkout phases which often require significant differences in funding from one year to the next.  As such, the changes in category funding from year to year do not necessarily indicate program growth, but rather a planned phasing of improvement and modernization efforts.  The test capabilities at these locations enable testing through all phases of weapon system acquisition, from system concept exploration through component and full scale integrated weapon system testing to operational testing.  These test organizations are a part of the Major Range and Test Facility Base (MRTFB), operated and maintained by the Air Force for DoD test and evaluation.  These national test assets are available to others requiring their unique capabilities.\n\nThe 96TW, at Eglin AFB FL, conducts and supports developmental test and evaluation (DT&E) of non-nuclear air armaments; Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; navigation systems; provides a climatic simulation capability; determines target\/test item spectral signatures; and provides Cyber testing capabilities as part of the Joint Information Operations (IO) Range.  The 96TG at Holloman AFB, NM provides independent test and evaluation of inertial, Global Positioning System and integrated systems used for aircraft navigation and missile guidance systems including vulnerability to electronic interference; provides the liaison function for coordinating and scheduling all US Air Force test operations at White Sands Missile Range; provides subsonic through hypersonic ground testing of aircraft and missiles in a flight-representative environment under highly instrumented conditions; and executes flight test and test support for advanced avionics and weapons development of joint, international and commercial test programs.\n\nAEDC, at Arnold AFB TN, provides pre-flight and reliability ground environmental test support for DoD aeropropulsion, flight systems, and space and missile programs.  The center has 53 test facilities providing: aerodynamic testing of scale model aircraft, missiles, and space systems; testing of large and full-scale satellites, sensors, and space vehicles in a simulated space environment; altitude environmental testing for aircraft, missile, and spacecraft propulsion systems; and testing of large-scale models such as space boosters together with their propulsion systems.\n\nThe 412th Test Wing, at Edwards AFB CA, conducts and supports DT&E and Operational Test and Evaluation (OT&E) of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery\/systems, and cargo handling systems.\n\nI&M efforts within this PE are identified in four mission area categories:  Airframe\/Propulsion\/Avionics (APA); Armament\/Munitions (A\/M); Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR); and Space.  These categories describe general types of effort that will be conducted in this PE.  APA provides planning, improvements, and modernization needed for test capabilities to conduct and support DT&E and OT&E of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery systems, cargo handling systems, and turbine engines.  APA focuses on evaluation of the vehicle airframe, propulsion system, and avionics systems, as well as overall systems integration testing.  It encompasses both ground test facilities and open-air range infrastructure, including instrumentation and data processing.  A\/M provides planning, improvements and modernization to conduct DT&E of air-to-ground and air-to-air armaments and munitions, which include gun, chaff and flare systems as well as aerial decoy and target systems.  The A\/M category encompasses the full range of DT&E from digital modeling and simulation, to precision measurement testing, to hardware-in-the-loop and installed systems testing, to open-air range testing.  Elements of A\/M DT&E include environmental, warhead effectiveness, arena blast\/fragmentation, guidance navigation and control, aerodynamics, propulsion, electromagnetic interference and compatibility, mass properties, seeker and signature measurement, survivability, lethality, integration, reliability, net-centric and terminal effects testing.  A\/M also involves the design and development of systems needed to support A\/M DT&E including the design and development sleds, targets, range support systems and various instrumentation and measurement systems.  C4ISR provides planning, improvements and modernization to conduct DT&E of systems that support C2 functions which range from air campaign planning at the theater level to wing level C2 operations, to planning individual missions, to putting weapons on target using concepts such as machine to machine targeting.  C4ISR includes ground and flight performance testing of airborne C2 networks and tactical data links, air operation centers, mission planning systems, multi-level security systems, radio and communication systems, ISR systems, information assurance systems, and radar systems such as those used by JSTARS and air traffic control systems.  C4ISR conducts DT&E on a full range of systems covering the sensor (detection) to the shooter (weapon), including functional and environmental testing of these systems.  C4ISR includes DT&E for offensive and defensive Cyber capabilities.  Space provides planning, improvements, and modernization needed for test capabilities to perform developmental and operational testing for space and launch acquisition and sustainment programs.  Test capabilities include launch vehicle, satellite, missile, sensor, thermal protection system, signature, hardness, and interface testing.  The capabilities reside at Vandenberg, Kirtland, Arnold, Patrick, Schriever, Peterson, Holloman Air Force Bases and others.  Infrastructure includes launch sites, mobile control units, thermal vacuum chambers, sled track, arc heated wind tunnels, ballistic test ranges, signature collection, and the requisite personnel.  \n\nBudget Activity Justification:  This program is in Budget Activity 6, RDT&E Management Support, because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "62.206"
                },
                "CurrentYear": {
                    "val": "42.236"
                },
                "BudgetYearOne": {
                    "val": "43.044"
                },
                "BudgetYearOneBase": {
                    "val": "43.044"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "60.388"
                },
                "CurrentYear": {
                    "val": "42.236"
                },
                "BudgetYearOne": {
                    "val": "34.841"
                },
                "BudgetYearOneBase": {
                    "val": "34.841"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.818"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-8.203"
                },
                "BudgetYearOneBase": {
                    "val": "-8.203"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.818"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-8.203"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.203"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY12:  $1.818M decrease reflects SBIR transfer.  \n\nFY14:  $8.203M decrease reflects a realignment for higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "664597"
                    },
                    "ProjectTitle": {
                        "val": "Air Force Test Investments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "60.388"
                        },
                        "CurrentYear": {
                            "val": "42.236"
                        },
                        "BudgetYearOne": {
                            "val": "34.841"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.841"
                        },
                        "BudgetYearTwo": {
                            "val": "47.821"
                        },
                        "BudgetYearThree": {
                            "val": "49.479"
                        },
                        "BudgetYearFour": {
                            "val": "47.688"
                        },
                        "BudgetYearFive": {
                            "val": "48.546"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE provides planning, improvements, and modernization for test capabilities at three Air Force Test Center (AFTC) organizations: 96 Test Wing at Eglin AFB FL (to include 96 Test Group at Holloman AFB NM, and operating locations at Wright-Patterson AFB OH), Arnold Engineering Development Complex (AEDC) at Arnold AFB TN and the 412 Test Wing at Edwards AFB CA.  The purpose is to help test organizations improve and develop their test infrastructure and capabilities to keep pace with improvements in weapon system technologies.  \n\nThe improvement and modernization (I&M) requirements are defined through the AF Test Investment Planning & Programming (TIPP) Process.  All projects have been reviewed through the Tri-Service Reliance process (to communicate AF efforts to the other Services and avoid unwarranted duplication of effort) and are documented in the Technology Development Acquisition Program (TDAP) database.  Each project has its own planning, development, equipment acquisition, equipment installation, and checkout phases which often require significant differences in funding from one year to the next.  As such, the changes in category funding from year to year do not necessarily indicate program growth, but rather a planned phasing of improvement and modernization efforts.  The test capabilities at these locations enable testing through all phases of weapon system acquisition, from system concept exploration through component and full scale integrated weapon system testing to operational testing.  These test organizations are a part of the Major Range and Test Facility Base (MRTFB), operated and maintained by the Air Force for DoD test and evaluation.  These national test assets are available to others requiring their unique capabilities.\n\nThe 96TW, at Eglin AFB FL, conducts and supports developmental test and evaluation (DT&E) of non-nuclear air armaments; Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; navigation systems; provides a climatic simulation capability; determines target\/test item spectral signatures; and provides Cyber testing capabilities as part of the Joint Information Operations (IO) Range.  The 96TG at Holloman AFB, NM provides independent test and evaluation of inertial, Global Positioning System and integrated systems used for aircraft navigation and missile guidance systems including vulnerability to electronic interference; provides the liaison function for coordinating and scheduling all US Air Force test operations at White Sands Missile Range; provides subsonic through hypersonic ground testing of aircraft and missiles in a flight-representative environment under highly instrumented conditions; and executes flight test and test support for advanced avionics and weapons development of joint, international and commercial test programs.\n\nAEDC, at Arnold AFB TN, provides pre-flight and reliability ground environmental test support for DoD aeropropulsion, flight systems, and space and missile programs.  The center has 53 test facilities providing: aerodynamic testing of scale model aircraft, missiles, and space systems; testing of large and full-scale satellites, sensors, and space vehicles in a simulated space environment; altitude environmental testing for aircraft, missile, and spacecraft propulsion systems; and testing of large-scale models such as space boosters together with their propulsion systems.\n\nThe 412th Test Wing, at Edwards AFB CA, conducts and supports DT&E and Operational Test and Evaluation (OT&E) of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery\/systems, and cargo handling systems.\n\nI&M efforts within this PE are identified in four mission area categories:  Airframe\/Propulsion\/Avionics (APA); Armament\/Munitions (A\/M); Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR); and Space.  These categories describe general types of effort that will be conducted in this PE.  APA provides planning, improvements, and modernization needed for test capabilities to conduct and support DT&E and OT&E of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery systems, cargo handling systems, and turbine engines.  APA focuses on evaluation of the vehicle airframe, propulsion system, and avionics systems, as well as overall systems integration testing.  It encompasses both ground test facilities and open-air range infrastructure, including instrumentation and data processing.  A\/M provides planning, improvements and modernization to conduct DT&E of air-to-ground and air-to-air armaments and munitions, which include gun, chaff and flare systems as well as aerial decoy and target systems.  The A\/M category encompasses the full range of DT&E from digital modeling and simulation, to precision measurement testing, to hardware-in-the-loop and installed systems testing, to open-air range testing.  Elements of A\/M DT&E include environmental, warhead effectiveness, arena blast\/fragmentation, guidance navigation and control, aerodynamics, propulsion, electromagnetic interference and compatibility, mass properties, seeker and signature measurement, survivability, lethality, integration, reliability, net-centric and terminal effects testing.  A\/M also involves the design and development of systems needed to support A\/M DT&E including the design and development sleds, targets, range support systems and various instrumentation and measurement systems.  C4ISR provides planning, improvements and modernization to conduct DT&E of systems that support C2 functions which range from air campaign planning at the theater level to wing level C2 operations, to planning individual missions, to putting weapons on target using concepts such as machine to machine targeting.  C4ISR includes ground and flight performance testing of airborne C2 networks and tactical data links, air operation centers, mission planning systems, multi-level security systems, radio and communication systems, ISR systems, information assurance systems, and radar systems such as those used by JSTARS and air traffic control systems.  C4ISR conducts DT&E on a full range of systems covering the sensor (detection) to the shooter (weapon), including functional and environmental testing of these systems.  C4ISR includes DT&E for offensive and defensive Cyber capabilities.  Space provides planning, improvements, and modernization needed for test capabilities to perform developmental and operational testing for space and launch acquisition and sustainment programs.  Test capabilities include launch vehicle, satellite, missile, sensor, thermal protection system, signature, hardness, and interface testing.  The capabilities reside at Vandenberg, Kirtland, Arnold, Patrick, Schriever, Peterson, Holloman Air Force Bases and others.  Infrastructure includes launch sites, mobile control units, thermal vacuum chambers, sled track, arc heated wind tunnels, ballistic test ranges, signature collection, and the requisite personnel.  \n\nBudget Activity Justification:  This program is in Budget Activity 6, RDT&E Management Support, because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airframe\/Propulsion\/Avionics T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Airframe\/Propulsion\/Avionics (APA)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "38.077"
                                            },
                                            "Text": {
                                                "val": "The Advanced Range Systems Upgrade (ARSU) project fielded critical infrastructure upgrades to the operational control center, digital data handling systems, and data display & analysis systems at the 412TW range to manage obsolescence.  The Joint Airborne Instrumentation Integration (JAII) effort completed hardware and data instrumentation system modifications to about five percent of the test fleet's instrumented airborne platforms.  The Telemetry Systems Integration and Support (TSIS) effort improved telemetry (TM) acquisition systems completing C-band upgrades to all the mobile TM systems and finalize plans for fixed TM system upgrades at Edwards AFB.  The Von Karman Facility (VKF) Plant Modernization project completed additional motor rewinds and control room modifications improving efficiency, performance, reliability and maintainability of the VKF compressor facility that supplies high pressure air to all AEDC test cells.  The Tunnel 4T Modernization effort continued fabrication of new nozzle actuator and control systems, design and procurement of a new Captive Trajectory System (CTS), and installation and checkout of a new data acquisition system (DAS) for AEDC's transonic wind tunnel.  The Tunnels A\/B\/C Modernization project continued installation and checkout of new nozzle actuator and control systems, installation and checkout of a new DAS, and modernized the flow-field visualization system for AEDC's continuous flow supersonic and hypersonic wind tunnels. The Advanced Large Military Engine Capability (ALMEC) project completed fabrication, installation, and checkout of the temperature-controlled test cell cooling system and finished preliminary design activities on the exhaust intercoolers, plant control systems, main drive exciters, and air supply water system to upgrade the C1\/C2 aero-propulsion test cells for testing advanced high-speed air-breathing engines.  The Advanced Small Military Engine Capability (ASMEC) project completed technical requirements and preliminary designs on the air supply, mechanical bypass, gas heater and control systems to upgrade the T3 test facility supporting high-Mach small-engine propulsion test requirements.  The Ultra-High Accuracy Reference System (UHARS) effort completed design and initiated procurement efforts to develop a high-accuracy inertial-based TSPI truth source reference system for testing and evaluating future navigation and guidance systems.  The T&E Board of Directors led tri-service investment and joint T&E Reliance activities as directed by the Service Secretaries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.227"
                                            },
                                            "Text": {
                                                "val": "ARSU will complete critical upgrades to data and video distribution systems, switching networks, interactive display and analysis software, and mission control rooms at the 412TW range.  JAII will continue executing instrumentation systems upgrades to the test fleet's instrumented airborne platforms per the test fleet modernization plan.  TSIS will begin C-band upgrades to the fixed TM antenna sites at Edwards AFB.  ALMEC will advance the design and initiate development activities on the exhaust intercoolers, plant control systems, main drive exciters, and air supply water system for the C1\/C2 aero-propulsion test cells.  ASMEC will complete design efforts on the air supply, mechanical bypass, gas heater and control systems for the T3 test facility.  Tunnel 4T will complete fabrication and installation of the new nozzle actuator and control systems, the CTS rig, and the DAS and begin checkout at AEDC's transonic wind tunnel.  Tunnels A\/B\/C will complete installation & checkout of the new nozzle actuator, control systems, and DAS and begin final acceptance activities.  UHARS procurement efforts of GPS and non-GPS based reference systems begin delivery and initiate integration activities.  The T&E Board of Directors will continue to lead tri-service investment and joint T&E Reliance efforts as directed by the Service Secretaries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.091"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.091"
                                            },
                                            "Text": {
                                                "val": "JAII will continue executing instrumentation systems upgrades to the test fleet's instrumented airborne platforms per the test fleet modernization plan.  TSIS will continue improvements to fixed TM acquisition systems by upgrading and integrating C-band ground-based receiver systems and airborne instrumentation pallets.  ALMEC will complete the design and development and initiate procurement activities on the exhaust intercoolers, plant control systems, main drive exciters, and air supply water system for the C1\/C2 aero-propulsion test cells.  ASMEC will begin procurement efforts on the air supply, mechanical bypass, gas heater and control systems to upgrade the T3 test facility.  UHARS will initiate fielding, installation and checkout of the GPS and non-GPS based reference systems needed to test and evaluate future navigation and guidance systems.  The Common Range Integrated Instrumentation System (CRIIS) effort will begin design, development and procurement efforts to upgrade range TSPI instrumentation capabilities.  The Improved Transonic Test Capability (ITTC) will begin design and development efforts to upgrade the 16T transonic wind tunnel systems to increase productivity and efficiency.  The Test Instrumentation, Data Systems & Control (TIDSC) project will begin design and development efforts to provide instrumentation and data system upgrades across AEDC test infrastructure.  The T&E Board of Directors will continue to lead tri-service investment planning and joint T&E Reliance efforts as directed by the Service Secretaries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armament\/Munitions T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Armament\/Munitions (A\/M)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.733"
                                            },
                                            "Text": {
                                                "val": "The Advanced Command Destruct System (ACDS) project completed procurement and continued integration efforts to upgrade the command destruct systems supporting test missions at Eglin AFB and Edwards AFB.  The Advanced Range Telemetry (ARTM) project continued to procure and integrate new antenna and receiver systems to modernize critical TM capabilities at the 96 TW.  The Advanced Munitions Test Improvement (AMTI) project continued development of a Millimeter Wave (MMW) simulator, target models, and an advanced GPS simulator to provide new HITL capabilities for testing advanced multi-mode seeker\/sensor guidance technologies.  The Gulf Range Test and Training Center (GRTTCC) project continued procurement and integration of range data systems, including high-resolution video systems, network router and firewall systems, mission control room computer systems, and data storage systems.  The Joint Gulf Range Area Network Development (JGRAND) project continued to procure and implement advanced fiber optic, data transport, and network security systems to improve range communication capabilities at the 96TW.  The Combined High-Speed\/High-Resolution (CHSHR) EO\/IR Imaging project began design, development and procurement efforts to provide improved tracking capabilities for small, high-speed A\/M, missiles and airborne platform testing.  The Next Generation Munitions Test Environment (NGMTE) project began design, development and procurement efforts to upgrade aging gun and munitions test capabilities to support advent of modern, smarter weapon systems requiring more precise data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.509"
                                            },
                                            "Text": {
                                                "val": "AMTI will continue development of a MMW simulator, an advanced GPS simulator, and low observable target and countermeasure models for testing advanced multi-mode seeker\/sensor guidance technologies.  GRTTCC will continue procurement and integration efforts to upgrade range data systems, including digital switching systems, high resolution video encoders and decoders, TM processing equipment, mission control room equipment, data storage systems, and fiber data links.  JGRAND will continue to procure and implement advanced fiber optic and network security systems and begin development of a network operations control center to improve range communication capabilities at the 96TW.  CHSHR EO\/IR Imaging will continue procurement and integration of new high-speed digital cameras, modernization of long-range Cine-T photo optic tracking systems, and upgrade weather data systems to provide improved tracking capabilities.  NGMTE will continue to develop and procure new ballistic scoring and fragmentation recording systems supporting gun and munitions test capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.250"
                                            },
                                            "Text": {
                                                "val": "GRTTCC will complete procurement and integration efforts to upgrade range data systems including range communication, range interface, and data display systems.  JGRAND will continue to integrate advanced fiber optic systems and develop a network operations control center to improve range communication capabilities at the 96TW.  CHSHR EO\/IR Imaging will continue procurement and integration of new high-speed digital cameras, modernization of long-range Cine-T photo optic tracking systems, and upgrade weather data systems to provide improved tracking capabilities.  NGMTE will continue to develop and procure common data instrumentation and acquisition systems and replace environmental test chambers supporting gun and arena test capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate C4ISR"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.578"
                                            },
                                            "Text": {
                                                "val": "The Command and Control Test Operations Center (C2TOC) project continued to develop a Joint Air Operations Center (AOC) level test capability to support C2 weapon systems, including modernization of C2 computer systems, network firewalls and equipment, and test tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "C2TOC will continue to develop a Joint AOC level test capability by incorporating additional connectivity and links to support C2 end-to-end weapon system testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "C2TOC will continue to procure and integrate network servers and performance monitoring and instrumentation systems to support C2 end-to-end weapon system testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0604256F"
                                    },
                                    "Title": {
                                        "val": "Threat Simulator Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "26.473"
                                        },
                                        "CurrentYear": {
                                            "val": "22.812"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.690"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.690"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.213"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.542"
                                        },
                                        "BudgetYearFour": {
                                            "val": "20.523"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.892"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605807F"
                                    },
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "737.697"
                                        },
                                        "CurrentYear": {
                                            "val": "722.071"
                                        },
                                        "BudgetYearOne": {
                                            "val": "742.658"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "742.658"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "698.869"
                                        },
                                        "BudgetYearThree": {
                                            "val": "704.063"
                                        },
                                        "BudgetYearFour": {
                                            "val": "708.671"
                                        },
                                        "BudgetYearFive": {
                                            "val": "714.639"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605976F"
                                    },
                                    "Title": {
                                        "val": "Facility Restoration & Modernization - T&E"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "44.547"
                                        },
                                        "CurrentYear": {
                                            "val": "42.597"
                                        },
                                        "BudgetYearOne": {
                                            "val": "44.160"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "44.160"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "43.765"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.774"
                                        },
                                        "BudgetYearFour": {
                                            "val": "28.970"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.492"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605978F"
                                    },
                                    "Title": {
                                        "val": "Facility Sustainment - T&E Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.953"
                                        },
                                        "CurrentYear": {
                                            "val": "27.301"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.643"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.643"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "28.698"
                                        },
                                        "BudgetYearThree": {
                                            "val": "23.898"
                                        },
                                        "BudgetYearFour": {
                                            "val": "24.301"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.739"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This program element uses several different contracting strategies to provide the most cost effective T&E investment solutions.  The main acquisition strategy is to use full and open competition wherever possible to improve and modernize existing test capabilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}