{
    "id": "ea0df76056a42832a9411a7ae293d14fbc2dbac3",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602783A"
        },
        "ProgramElementTitle": {
            "val": "COMPUTER AND SOFTWARE TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.433"
            },
            "CurrentYear": {
                "val": "9.830"
            },
            "BudgetYearOne": {
                "val": "10.439"
            },
            "BudgetYearOneBase": {
                "val": "10.439"
            },
            "BudgetYearTwo": {
                "val": "10.501"
            },
            "BudgetYearThree": {
                "val": "10.411"
            },
            "BudgetYearFour": {
                "val": "11.065"
            },
            "BudgetYearFive": {
                "val": "11.155"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 increase for language translation efforts."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) develops and evaluates hardware and software algorithms enabling enhanced understanding and accelerating the decision cycle time for commanders and leaders operating in a mobile, dispersed, highly networked environment.  Project Y10 supports research on information and communications technology.  \n\nWork in this PE complements and is fully coordinated with efforts in PE 0602705A (Electronics and Electronic Devices), 0602716A (Human Factors Engineering Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), and PE 0603008A (Command, Control, Communications Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL) at the Adelphi and Aberdeen Proving Ground, MD locations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.577"
                },
                "CurrentYear": {
                    "val": "9.830"
                },
                "BudgetYearOne": {
                    "val": "8.939"
                },
                "BudgetYearOneBase": {
                    "val": "8.939"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.433"
                },
                "CurrentYear": {
                    "val": "9.830"
                },
                "BudgetYearOne": {
                    "val": "10.439"
                },
                "BudgetYearOneBase": {
                    "val": "10.439"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.144"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.500"
                },
                "BudgetYearOneBase": {
                    "val": "1.500"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.144"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.500"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "Y10"
                    },
                    "ProjectTitle": {
                        "val": "COMPUTER\/INFO SCI TECH"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.433"
                        },
                        "CurrentYear": {
                            "val": "9.830"
                        },
                        "BudgetYearOne": {
                            "val": "10.439"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.439"
                        },
                        "BudgetYearTwo": {
                            "val": "10.501"
                        },
                        "BudgetYearThree": {
                            "val": "10.411"
                        },
                        "BudgetYearFour": {
                            "val": "11.065"
                        },
                        "BudgetYearFive": {
                            "val": "11.155"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and evaluates information and communications processing software to automate the delivery of  information for planning, rehearsal, and execution by ground commanders. Efforts develop communication\/network architectures and software and the information fusion software necessary to simplify the understanding and interactions from humans to humans, humans to computers, computers to humans.  Research results in enable enhanced understanding of many information sources and for accelerating the decision cycle time for commanders and leaders operating in mobile, dispersed, highly networked environment envisioned for the future force.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence portfolio.  Work in this project is fully coordinated with PE 0603008A (Command, Control, Communications Advanced Technology)and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research Laboratory (ARL), Adelphi and Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Processing"
                                    },
                                    "Description": {
                                        "val": "This effort develops and evaluates fusion software to improve the completeness and timeliness of decision-making in command and control (C2) operations. The goal of this effort is to develop software applicable to the Distributed Common Ground Station-Army (DCGS-A) architecture (an integrated architecture of all ground\/surface systems) and for future force assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.293"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extended network analysis tools, interfaces, and visualization routines for Army intelligence to parallel architectures\/algorithms and evaluated them in relevant tactical exercises, like Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) On-the-Move."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.222"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop scalable decision support and social network analysis algorithms; evaluate network and information visualization software for cellular wireless environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.237"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.237"
                                            },
                                            "Text": {
                                                "val": "Will extract\/resolve and exploit social network information from multi-source data in order to provide timely accurate assessments of social and cultural influences for small unit decision making."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Assurance"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates software for the protection of information and networks in wireless tactical environments.  The goal is to develop software algorithms that detect and defeat malicious activities of adversaries in the bandwidth constrained tactical networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.982"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated techniques for trading off intrusion detection system (IDS) system performance and overall network performance in terms of network security metrics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.166"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and evaluate new software algorithms and architectures, along with predictive models, for distributed intrusion detection of cyber attacks in bandwidth-constrained environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.180"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.180"
                                            },
                                            "Text": {
                                                "val": "Will evaluate experimental implementation of intrusion detection software algorithms and architectures; develop and analyze predictive models for distributed intrusion detection of cyber attacks in bandwidth-constrained environments, efforts will improve our ability to detect and defeat malicious activities on Army networks and hosts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Exchange"
                                    },
                                    "Description": {
                                        "val": "This effort will investigate and develop software that integrates sensor data from local and external information sources. The goal is to enable tactical users to cooperatively share relevant and timely tactical information within a distributed wireless environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.177"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extended experiments to social network analysis, fusion and collection techniques in a wireless distributed fusion environment, and developed metrics for assessing their overall effectiveness within the DCGS-A Cloud architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.249"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and assess fusion and information exchange software to reduce network bandwidth necessary to transmit information; evaluate the software using tactically realistic equipment and text\/video data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.264"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.264"
                                            },
                                            "Text": {
                                                "val": "Will develop workflow and algorithms to enable end-user's ability to define and refine the collection, correlation, and aggregation of raw and processed data from both local and higher echelon information sources to produce summaries that are directly relevant to the user's current operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Language Translation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and assesses computational multilingual algorithms and software frameworks to enable commanders and troops to bridge language barriers in order to counter adversaries and collaborate with allies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.579"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated additional tools to automate development of new optical character recognition and machine translation (OCR\/MT) rapidly from prepared data and developed and evaluated use of mobile applications for language translation functions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.631"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and evaluate adaptive OCR\/MT workflow analysis software to improve the quality of automated reasoning techniques when applied to human intelligence documents (both foreign and English)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.134"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.134"
                                            },
                                            "Text": {
                                                "val": "Will develop an experimental framework for evaluation of state-of the-art academic OCR\/MT, entity extraction, and entity resolution algorithms using realistic, representative data; develop, refine, and test advanced algorithms to improve multilingual and machine translation technologies in three areas: (a) OCR of noisy and degraded document images typical of field-captured materials, (b) domain-specific machine translation targeting domains and genres outside of commercial interest, and (c) recognition of key content in handwritten documents typical of pocket litter and other materials commonly encountered in the field to facilitate the rapid transition of promising candidate technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Theory"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs theory based software models to evaluate and validate emerging network protocols and structures.  The goal of this effort is to develop software algorithms that maintain effective communications in networks in spite of disruptive effects such as task reorganization, mobility of friendly forces, and adversarial attacks on friendly networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.851"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated and evaluated techniques for controlling the behavior of hybrid networks using a measure of information quality to enhance the overall network performance for improved decision making."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.865"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate and evaluate algorithms to improve delivery time and quality of information in unreliable tactical mobile networks; investigate and evaluate software algorithms that exploit network user movement and usage to improve communication and information delivery."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.887"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.887"
                                            },
                                            "Text": {
                                                "val": "Will investigate and evaluate techniques for improving network performance and Soldier decision making by adapting data processing and delivery behaviors based on current network abilities and user information quality preferences; develop and evaluate non-traditional communications techniques (i.e. optical and Ultra Violet) to provide alternative means of communications in RF-challenged environments; investigate techniques for using mobile infrastructure and user movement to improve communication networks and information delivery in hybrid (wired & wireless) networks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Heterogeneous Computing and Computational Sciences"
                                    },
                                    "Description": {
                                        "val": "This effort researches and develops software algorithms to allow information processing across different computing hardware platforms. The goal of this research is to provide high performance computing (HPC) equivalent processing capabilities to the Soldier on the battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.980"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated scalable interface algorithms on heterogeneous computing systems for battlefield and biometric applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.033"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and evaluate scalable algorithms for battle command applications, such as modeling electromagnetic propagation in urban areas on a HPC cloud hybrid computing platform; evaluate algorithm performance and accuracy for developing high fidelity models of complex battlefield scenarios."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.045"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.045"
                                            },
                                            "Text": {
                                                "val": "Will develop, implement and validate discrete mathematical algorithms for high fidelity electromagnetic propagation and electromagnetic interference for use in real time modeling and optimization of ad hoc mobile networks; test, analyze, and optimize the performance of current and proposed mobile ad hoc network simulations; develop code enabling algorithm deployment for extremely large networks using inter-core load balancing between standard computing cores and specialized accelerators such as Graphics Processing Units, and perform validation of the models and results based on standard battle command benchmark problems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Material Modeling-Force Protection"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates software to improve parallel processing for computational intensive physics.  Intent is to create a computational science environment to assist researchers from different disciplines to work collaboratively and to exchange models and results."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.571"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Explored innovative approaches in developing a parallel computational framework for next generation petaflop high-performance computers (both cluster and hybrid computers) to study coupled nonlinear multi-scale material problems on a massive scale."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.664"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design new parallel computational science environment architecture, as well as theory and implementation strategies for coupling multi-physics modeling software; Evaluate new data models and formats for using petascale data from multi-physics applications to enable higher resolution\/fidelity simulations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.692"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.692"
                                            },
                                            "Text": {
                                                "val": "Will develop parallel computational common software environment on emerging multi-core petaflop HPC computing systems; implement interface algorithm, data models and formats to solve multi-scale\/multi-physics software developed for coupling between molecular dynamics and finite element methods."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}