{
    "id": "eeab5f1d66e4ed5d6e5b64c6e386d3249f0e2b00",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0207134F"
        },
        "ProgramElementTitle": {
            "val": "F-15E Squadrons"
        },
        "R1LineItemNumber": {
            "val": "135"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "184.665"
            },
            "CurrentYear": {
                "val": "192.677"
            },
            "BudgetYearOne": {
                "val": "244.289"
            },
            "BudgetYearOneBase": {
                "val": "244.289"
            },
            "BudgetYearTwo": {
                "val": "426.331"
            },
            "BudgetYearThree": {
                "val": "459.242"
            },
            "BudgetYearFour": {
                "val": "427.772"
            },
            "BudgetYearFive": {
                "val": "335.936"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The F-15 is the most versatile fighter in the world today.  The F-15C\/D continues to provide air superiority with an undefeated and unmatched aerial combat record.  The F-15E retains this air superiority capability and adds systems, such as advanced imaging and targeting systems, to meet the requirement for all-weather, deep penetration, and night\/under-the-weather, air-to-surface attack.  Configured with conformal fuel tanks (CFTs), the F-15E deploys worldwide with minimal tanker support and arrives combat-ready.  A mainstay in operations both domestic and abroad, upgrades to the F-15 (avionics, armament, airframe, and engines) are critical to maintaining combat viability (lethality, survivability, and supportability). Projected to remain in service past 2030, avionics modernization is key to long-term weapon system viability.  This modernization is built on a foundation of technical and acquisition support studies (both internal to the Air Force and through outside contractors), forestalling obsolescence, exploiting proven technological advances, and leveraging new technology.  Major avionics upgrades center around radar modernization (both hardware and software upgrades) and the exploitation of enhanced capability via precision timing, data delivery and processing technology, precision registration systems, cockpit Head Up Display (HUD), instrumentation digitization and modernization, central computer processing power increases, digital mission event recording systems and an infrared (IR) based fire control system.  Funds are also used, as required, to resolve Diminishing Manufacturing Sources and Material Shortage (DMSMS) issues. The proliferation of fourth generation enemy aircraft and sophisticated \"double-digit\" anti-aircraft missile systems pose a significant threat to F-15 survivability.  A fully integrated electronic warfare suite holds the promise of providing survivability as well as expanded electronic attack capability. Nearly all improvements are linked to an aircraft operational flight program update schedule that works to integrate new capabilities with the airframe.  These updates are a responsive way to increase the offensive and defensive capability and survivability of the F-15.  Incorporation of corresponding spiral and\/or phased technology\/equipment improvements that include support equipment, mission planning systems, and training device upgrades will improve performance, supportability, and aircrew training\n\n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "194.831"
                },
                "CurrentYear": {
                    "val": "192.677"
                },
                "BudgetYearOne": {
                    "val": "354.193"
                },
                "BudgetYearOneBase": {
                    "val": "354.193"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "184.665"
                },
                "CurrentYear": {
                    "val": "192.677"
                },
                "BudgetYearOne": {
                    "val": "244.289"
                },
                "BudgetYearOneBase": {
                    "val": "244.289"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-10.166"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-109.904"
                },
                "BudgetYearOneBase": {
                    "val": "-109.904"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-4.412"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.754"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-109.904"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-109.904"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2012: Funding decrease for higher Air Force priorities.\n\nFY2014: Funding decreases for the Eagle Passive\/Active Warning Suvivability System (EPAWSS), the Advanced Display Core Processor (ADCP) II, and higher Air Force priorities; add funding to start new weapons integration effort."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "670131"
                    },
                    "ProjectTitle": {
                        "val": "Initial Operational Test and Evaluation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "121.548"
                        },
                        "CurrentYear": {
                            "val": "92.555"
                        },
                        "BudgetYearOne": {
                            "val": "74.975"
                        },
                        "BudgetYearOneBase": {
                            "val": "74.975"
                        },
                        "BudgetYearTwo": {
                            "val": "203.496"
                        },
                        "BudgetYearThree": {
                            "val": "227.037"
                        },
                        "BudgetYearFour": {
                            "val": "174.600"
                        },
                        "BudgetYearFive": {
                            "val": "83.476"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Operational Flight Program (OFP) Development efforts and Flight test have been moved to BPAC 676020"
                        },
                        "ProjectMissionDescription": {
                            "val": "This includes development of the F-15E APG-82(V)1 Active Electronically Scanned Array (AESA) radar, the F-15C\/D and F-15E Advanced Display Core Processor (ADCP) II and the F-15C\/D and F-15E Eagle Passive\/Active Warning Survivability System (EPAWSS).\n\nThe APG-82(V)1 will supply the F-15E with a digital radar that will provide improved range and resolution, as well as a significant improvement in reliability.  This AESA radar has the ability to provide electronic attack and protection capabilities.  \n\nThe ADCP II will develop a common mission computer for the F-15C\/D and F-15E.  The current mission computers of both platforms have reached their limits of speed, memory and throughput.  Additionally, digital systems have changed the security requirements of both platforms and the older mission computers cannot be upgraded to meet these new requirements.  A common mission computer is expected to reduce overall development costs as well as long term maintenance costs.  The program will also develop a new F-15C\/D cockpit display to replace an obsolete one.\n\nEPAWSS will replace the obsolete Tactical Electronic Warfare System (TEWS), which will help the aircraft survive in high threat environments.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "F-15E Radar Modernization Program (RMP) APG-82(V)1"
                                    },
                                    "Description": {
                                        "val": "New digital AESA radar replacing legacy analog APG-70 radars on all F-15E aircraft.  This includes technical and acquisition related studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "53.776"
                                            },
                                            "Text": {
                                                "val": "Continued DT&E and completed modification of test aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.823"
                                            },
                                            "Text": {
                                                "val": "Complete DT&E and IOT&E.  Upgrade trainers.  Complete EMD phase of program"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Eagle Passive\/Active Warning Survivability System (EPAWSS)"
                                    },
                                    "Description": {
                                        "val": "Planned replacement of the existing F-15 self-protection, Tactical Electronic Warfare System (TEWS).  This includes technical and acquisition related studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.082"
                                            },
                                            "Text": {
                                                "val": "New Start FY13.  Evaluate EPAWSS integration requirements and interface characteristics.  Early acquisition planning, security planning and  specification development.  Technical and acquisition related studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "Continue acquisition planning, security planning and specification development.  Technical and acquisition related studies.  Develop EMD procurement package for award of EMD contract to design, fully integrate, test and install EPAWSS on the F-15C\/D and F-15E."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Display Core Processor (ADCP) II (formerly known as Computer Processor Modernization Program and Advanced Display Core Processor Plus w\/Vertical Situation Display.  FY12 combined programs)"
                                    },
                                    "Description": {
                                        "val": "New central computer for both F-15E and F-15C\/D modernization.  Program provides a central computer upgrade for 219 F-15Es to replace ADCP.  F-15C\/D provides 175 modern computers and a high resolution color display to replace the current F-15C\/D Vertical Situation Display (VSD).  This includes technical and acquisition related studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "66.398"
                                            },
                                            "Text": {
                                                "val": "Subsystem System Requirements Review (SRR), Preliminary Design Review\n(PDR), Aircraft SRR, Subsystem Critical Design Review (CDR).  Continued software prototyping.  Began EMD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "79.490"
                                            },
                                            "Text": {
                                                "val": "Continue EMD. Critical Design Review (CDR). Initial hardware build. OFP Suite 8E rehost for F-15 C\/D. Software development and testing on prototype hardware.  Vertical Situation Display Replacement (VSDR) design and integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "54.055"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "54.055"
                                            },
                                            "Text": {
                                                "val": "Continue EMD.  Initial EMD ADCP II units.  Complete initial Common OFP (Suite 8E rehost for F-15 C\/D).  Software development and testing on EMD hardware.  Begin system stability and endurance testing.  Finalize installation TCTO for flight test.  Flight Test Readiness Review for Operational Assessment.  Delivery of VSDR EMD units."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Mgt Support Costs"
                                    },
                                    "Description": {
                                        "val": "Program Management Support Costs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.374"
                                            },
                                            "Text": {
                                                "val": "Program Management Support Costs"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.160"
                                            },
                                            "Text": {
                                                "val": "Program Management Support Costs"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.920"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.920"
                                            },
                                            "Text": {
                                                "val": "Program Management Support Costs"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # F01500"
                                    },
                                    "Title": {
                                        "val": "Aircraft Modification: F-15: PEs 0207130\/0207134\/0207445\/0809731"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "255.586"
                                        },
                                        "CurrentYear": {
                                            "val": "148.378"
                                        },
                                        "BudgetYearOne": {
                                            "val": "354.624"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "354.624"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "497.514"
                                        },
                                        "BudgetYearThree": {
                                            "val": "518.373"
                                        },
                                        "BudgetYearFour": {
                                            "val": "372.220"
                                        },
                                        "BudgetYearFive": {
                                            "val": "475.079"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA07: Line Item # 000071"
                                    },
                                    "Title": {
                                        "val": "Aircraft Replacement Support Equip (BP12)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.545"
                                        },
                                        "CurrentYear": {
                                            "val": "3.536"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "1.545"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA07: Line Item # F0150P"
                                    },
                                    "Title": {
                                        "val": "F-15 Post Production Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.076"
                                        },
                                        "CurrentYear": {
                                            "val": "2.363"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.403"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.403"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.448"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.492"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.537"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.583"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA06: Line Item # 000999"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\/Repair Parts (BP16)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.474"
                                        },
                                        "CurrentYear": {
                                            "val": "22.654"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.125"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.125"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.752"
                                        },
                                        "BudgetYearThree": {
                                            "val": "46.991"
                                        },
                                        "BudgetYearFour": {
                                            "val": "48.650"
                                        },
                                        "BudgetYearFive": {
                                            "val": "38.065"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Program is a continuation of effort which includes the development for all F-15 models.  Funds are executed organically in support of equipment improvement, study, analysis, and test.  Acquisition and management strategies for each program are independently developed and use a variety of contract methods and types to accomplish program objectives."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "The individual program reference to \"various\" contract methods addresses other government costs for trainers, test, hardware, special studies, telemetry kits, etc. that are required to meet each program's objectives.  The execution vehicles between these DoD entities vary by effort.\n\nFY12PB - Project 670131 includes APG-82(V)1 and ADCP II programs only.  All other programs funded under Project 676020.\n\nFY13PB - Project 670131 includes APG-82(V)1, ADCP II and EPAWSS only. All other programs funded under Project 676020.\n\nFY14PB - Project 670131 includes APG-82(V)1, ADCP II and EPAWSS only.  All other programs funded under Project 676020."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "F-15E RMP EMD Contract"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St Louis, MO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "22.538"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.471"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15E RMP"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "31.238"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.352"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 ADCP II"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St. Louis, MO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "30.620"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "30.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "30.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "30.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 ADCP II Various"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "35.778"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "49.490"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "24.055"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "24.055"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 EPAWSS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.082"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "20.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "20.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "The individual program reference to \"various\" contract methods addresses other government costs for trainers, test, hardware, special studies, telemetry kits, etc. that are required to meet each program's objectives.  The execution vehicles between these DoD entities vary by effort."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.374"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.160"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.920"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.920"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207134F_BPAC_670131_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "F-15E APG-82(V)1 RMP EMD - Complete"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15E APG-82(V)1 RMP LRIP 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15E APG-82(V)1 RMP LRIP 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15E APG-82(V)1 RMP LRIP 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADCP II EMD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADCP II MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADCP II Production contract award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EPAWSS--FY13 New Start"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EPAWSS MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EPAWSS EMD contract award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676020"
                    },
                    "ProjectTitle": {
                        "val": "F-15"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "63.117"
                        },
                        "CurrentYear": {
                            "val": "100.122"
                        },
                        "BudgetYearOne": {
                            "val": "169.314"
                        },
                        "BudgetYearOneBase": {
                            "val": "169.314"
                        },
                        "BudgetYearTwo": {
                            "val": "222.835"
                        },
                        "BudgetYearThree": {
                            "val": "232.205"
                        },
                        "BudgetYearFour": {
                            "val": "253.172"
                        },
                        "BudgetYearFive": {
                            "val": "252.460"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project 676020 was created in the FY 2012 President's Budget to improve management of F-15 development.  Funds were moved from Project 670131 to Project 676020."
                        },
                        "ProjectMissionDescription": {
                            "val": "This effort includes development of F-15 Electronic Protection (EP) capabilities and provides funding for Operational Flight Program (OFP) upgrades and for Flight Testing.\n\nEP will enhance digital Active Electronic Scanned Array (AESA) radar capabilities to counter sophisticated electronic threats.  The development of F-15 EP will maximize Key System Attibutes (KSA) and EP techniques for F-15E Radar Modernization Program (RMP) in Suite 8E; ensure remaining KSAs and EP techniques for F-15E RMP are included in Suite 9; ensure legacy EP for F-15C APG-63(v)3, commensurate with the APG-63(v)1 radar legacy EP capability, is included in Suite 9; and maximize additional advanced EP for F-15C APG-63(v)3 in Suite 9.\"  \n\nFor the F-15 to maintain operational effectiveness, the program must continuously provide the platforms with improved capabilities.  To accomplish this there is an on-going need to develop software upgrades and to flight test new capabilities and systems.   The OFP funding line allows the Air Force to release software upgrades approximately every 3 years.  At any one time the program has three OFP upgrades in work: one in requirements definition\/pricing, one in code writing and test, and one in flight test and release preparation.  The flight Test funding line allows the Air Force to fund the on-going test effort.  \n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Flight Program (OFP) Development Efforts"
                                    },
                                    "Description": {
                                        "val": "Provides OFP program software and hardware updates to integrate new capabilities on all F-15 aircraft.  This includes technical and acquisition related studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.179"
                                            },
                                            "Text": {
                                                "val": "Continued Suite 8E Phase 1 and initiated S8E Phase 2 planning and contracting actions. Continued Suite 7C (otherwise known as Suite 7M)  development efforts and complete Critical Design Review (CDR). Continuation of organic software support and Special Projects development efforts.  Trainer upgrades."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "74.366"
                                            },
                                            "Text": {
                                                "val": "Complete S8E requirements definition and initiate S8E Phase 2 development.  Continue Suite 7C (otherwise known as Suite 7M) development and CDR.  Integrate Alpha 2 Lite into the OFP. Continuation of organic software support and Special Projects development efforts. Trainer upgrades."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "107.745"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "107.745"
                                            },
                                            "Text": {
                                                "val": "Finish coding, conduct bench testing and begin flight testing of S8E.  Complete S7C development and operational flight testing, conduct verification and validation of technical publications, prepare for delivery.  Complete integration of Alpha 2 Lite and begin integration of Joint-Air-to-Surface Standoff Missile-Extended Range (JASSM-ER) into the OFP.  Begin Phase I Suite 9 development.  Continuation of organic software support and Special Projects development efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Test"
                                    },
                                    "Description": {
                                        "val": "Flight testing of improvements initiated in prior years.  Baseline infrastructure and personnel support for F-15 Developmental Test (DT) and Operational Test (OT) operations.  Purchases long-lead test support assets and unique aircraft test instrumentation.  This includes technical and acquisition related studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.741"
                                            },
                                            "Text": {
                                                "val": "F-15 Flight Test Support provides prime contractor support cadre at Eglin and Nellis for DT\/OT support, avionics integration lab Operations and Maintenance (O&M), Combined Test Force (CTF) O&M, and long-lead test unique equipment, i.e., program specific aircraft instrumentation, weapons instrumentation kits, weapons simulators, data reduction\/handling equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.049"
                                            },
                                            "Text": {
                                                "val": "F-15 Flight Test Support provides prime contractor support cadre at Eglin and Nellis for DT\/OT support, avionics integration lab O&M, CTF O&M, and long-lead test unique equipment, i.e., program specific aircraft instrumentation, weapons instrumentation kits, weapons simulators, data reduction\/handling equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.328"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.328"
                                            },
                                            "Text": {
                                                "val": "F-15 Flight Test Support provides prime contractor support cadre at Eglin and Nellis for DT\/OT support, avionics integration lab O&M, CTF O&M, and long-lead test unique equipment; i.e., program specific aircraft instrumentation, weapons instrumentation kits, weapons simulators, data reduction\/handling equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-15C\/D BLOS"
                                    },
                                    "Description": {
                                        "val": "Provide F-15C\/D beyond line of sight (BLOS) communications capability on all long term aircraft.  This includes technical and acquisition related studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.157"
                                            },
                                            "Text": {
                                                "val": "Software development and qualification."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-15 Radar Enhancements"
                                    },
                                    "Description": {
                                        "val": "Improvements to F-15 Electronic Protection (EP) and other radar enhancements.  This includes technical and acquisition related studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.784"
                                            },
                                            "Text": {
                                                "val": "Initial EP capability integration, technology maturation, hardware purchases for radar lab development and testing.  Assessment of existing EP effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.732"
                                            },
                                            "Text": {
                                                "val": "EP software development, technology maturation, and OFP risk reduction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "44.161"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "44.161"
                                            },
                                            "Text": {
                                                "val": "Continue implementation of EP into Suite 8E.  Continue technology acceleration efforts for Suite 9.  Initiate Suite 9 EP implementation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management Support Costs"
                                    },
                                    "Description": {
                                        "val": "Program Management Support Costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.256"
                                            },
                                            "Text": {
                                                "val": "Program Management Support Costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.975"
                                            },
                                            "Text": {
                                                "val": "Program Management Support Costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.080"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.080"
                                            },
                                            "Text": {
                                                "val": "Program Management Support Costs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # F01500"
                                    },
                                    "Title": {
                                        "val": "F-15 Modification of In-Service Aircraft,  PEs 0207130\/0207134\/0207445\/0809731"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "255.586"
                                        },
                                        "CurrentYear": {
                                            "val": "148.378"
                                        },
                                        "BudgetYearOne": {
                                            "val": "354.624"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "354.624"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "497.514"
                                        },
                                        "BudgetYearThree": {
                                            "val": "518.373"
                                        },
                                        "BudgetYearFour": {
                                            "val": "372.220"
                                        },
                                        "BudgetYearFive": {
                                            "val": "475.079"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA06: Line Item # 000999"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\/Repair Parts (BP16)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.474"
                                        },
                                        "CurrentYear": {
                                            "val": "22.654"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.125"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.125"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.752"
                                        },
                                        "BudgetYearThree": {
                                            "val": "46.991"
                                        },
                                        "BudgetYearFour": {
                                            "val": "48.650"
                                        },
                                        "BudgetYearFive": {
                                            "val": "38.065"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA07: Line Item # F0150P"
                                    },
                                    "Title": {
                                        "val": "F-15 Post Production Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.076"
                                        },
                                        "CurrentYear": {
                                            "val": "2.363"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.403"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.403"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.448"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.492"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.537"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.583"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA07: Line Item # 000071"
                                    },
                                    "Title": {
                                        "val": "Aircraft Replacement Support Equip (BP12)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.545"
                                        },
                                        "CurrentYear": {
                                            "val": "3.536"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "98.302"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Program is a continuation of effort which includes the development of all F-15 models.  Funds are executed organically in support of equipment improvement, study, analysis, and test.  Acquisition and management strategies for each program are independently developed and use a variety of contract methods and types to accomplish program objectives."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "The individual program reference to \"various\" contract methods addresses other government costs for trainers, test, hardware, special studies, telemetry kits, etc. that are required to meet each program's objectives.  The execution vehicles between these DoD entities vary by effort."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "OFP Suite 7\/8\/9 Development and Test"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St. Louis, MO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "20.179"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "51.887"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "84.862"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "84.862"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "OFP Suite 7\/8\/9 Development and Test Various"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "22.479"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.883"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.883"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 Beyond Line of Sight (BLOS)--FY12 New Start"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.157"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 Radar Enhancement"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St Louis, MO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "19.784"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.732"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "40.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "40.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-15 Radar Enhancement Various"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.161"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.161"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "The individual program reference to \"various\" contract methods addresses other government costs for trainers, test, hardware, special studies, telemetry kits, etc. that are required to meet each program's objectives.  The execution vehicles between these DoD entities vary by effort."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Boeing (Contractor Test Support)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St. Louis, MO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.741"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Flight Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.249"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.328"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.328"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "The individual program reference to \"various\" contract methods addresses other government costs for trainers, test, hardware, special studies, telemetry kits, etc. that are required to meet each program's objectives.  The execution vehicles between these DoD entities vary by effort."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Mgt Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.256"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.975"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.080"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.080"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207134F_BPAC_676020_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "OFP Continuous Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OFP Suite 7C Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OFP Suite 8E Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15C\/D BLOS Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15C\/D BLOS Production Start"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Radar Enhancements Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Radar Enhancements Suite 8E Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Infrared Search and Track Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}