{
    "id": "ef8eaf3311f434838efb50d5a478c6474068ac4d",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604055D8Z"
        },
        "ProgramElementTitle": {
            "val": "Operational Energy Capability Improvement"
        },
        "R1LineItemNumber": {
            "val": "70"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "23.909"
            },
            "CurrentYear": {
                "val": "26.244"
            },
            "BudgetYearOne": {
                "val": "52.001"
            },
            "BudgetYearOneBase": {
                "val": "52.001"
            },
            "BudgetYearTwo": {
                "val": "37.120"
            },
            "BudgetYearThree": {
                "val": "37.791"
            },
            "BudgetYearFour": {
                "val": "38.296"
            },
            "BudgetYearFive": {
                "val": "38.948"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds innovation that will improve the Department’s operational effectiveness via targeted operational energy science and technology investments.  It contains two projects this year.\n\nP455 The Operational Energy Capability Improvement Fund (OECIF) incentivizes long term change in the science and technology portfolio of the Department to be more in line with the Department-wide Operational Energy Strategy and generally fosters innovation to improve operational energy performance.  This mission has two key aspects.  First, to develop and\/or demonstrate and rapidly transition into the force operational energy technologies or practices that will improve the Department’s military capabilities and\/or reduce its costs.  Second, to establish within the military Services sustainable institutional capacities that will continue to research, develop and adopt operational energy innovations.  OECIF funds serve as “seed money” to consolidate or start promising operational energy programs or directions to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects.\n\nP456 The Hybrid Energy Storage Module (HESM) project explores advanced technology development of hybrid energy storage associated with providing the capability to enhance fuel efficiency, maximize performance and reliability, and enable future high power weapons and sensors systems on legacy and next generation Army and USMC battlefield generators and vehicles, Air Force and Navy aircraft and Navy ships.  This project will demonstrate scalable energy storage systems with high power and energy densities, high rate capability that: reduce total logistics replenishment of fuel and material; increase platform and vehicle ability to sustain operations during engagement; and reduce maintenance and other events that interfere with mission capability.  Post the demonstration completion, this technology will be further sustained by the Services."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "23.909"
                },
                "CurrentYear": {
                    "val": "26.244"
                },
                "BudgetYearOne": {
                    "val": "32.653"
                },
                "BudgetYearOneBase": {
                    "val": "32.653"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.909"
                },
                "CurrentYear": {
                    "val": "26.244"
                },
                "BudgetYearOne": {
                    "val": "52.001"
                },
                "BudgetYearOneBase": {
                    "val": "52.001"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "19.348"
                },
                "BudgetYearOneBase": {
                    "val": "19.348"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "19.348"
                                },
                                "BudgetYearOneBase": {
                                    "val": "19.348"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The change is a result of funding the Hybrid Energy Storage Module- HESM ($16.5M) that explores the advanced technology development of hybrid storage enhanced fuel efficiency and enables future high power weapons and sensor systems be placed on generators, vehicles, aircraft and ships.  Additionally, funding ($2.8M) was realigned to accommodate other higher priority programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P455"
                    },
                    "ProjectTitle": {
                        "val": "Operational Energy Capability Improvement"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.659"
                        },
                        "CurrentYear": {
                            "val": "26.244"
                        },
                        "BudgetYearOne": {
                            "val": "35.501"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.501"
                        },
                        "BudgetYearTwo": {
                            "val": "37.120"
                        },
                        "BudgetYearThree": {
                            "val": "37.791"
                        },
                        "BudgetYearFour": {
                            "val": "38.296"
                        },
                        "BudgetYearFive": {
                            "val": "38.948"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Operational Energy Capability Improvement Fund (OECIF)"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Energy Capability Improvement"
                                    },
                                    "Description": {
                                        "val": "The Operational Energy Capability Improvement Fund (OECIF) incentivizes long term change in the science and technology portfolio of the Department to be more in line with the Department-wide Operational Energy Strategy and generally fosters innovation to improve operational energy performance.  This mission has two keys aspects.  First, to develop and\/or demonstrate and rapidly transition into the force operational energy technologies or practices that will improve the Department’s military capabilities and\/or reduce its costs.  Second, to establish within the military Services sustainable institutional capacities that will continue to research, develop and adopt operational energy innovations.  OECIF funds serve as “seed money” to consolidate or start promising operational energy programs or directions to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.659"
                                            },
                                            "Text": {
                                                "val": "The primary emphasis in FY 2012 was the establishment of five programs devoted to reducing the energy loads of expeditionary outposts.  Consistent with the mission of this funding, these programs are being executed by the Services and PACOM.  An Army\/Navy program to improve the efficiency of vapor compression cooling systems in forward areas began work on various component technologies and environmental data reduction and model development.  A complementary Navy\/ARPA-E program to pursue high risk, high reward deployable cooling technologies determined the needed capabilities and began a process to select ARPA-E technologies to leverage.  An Army\/Air Force program to develop energy efficient soft shelters\/tents established technical baselines and thermal models of shelter systems, began to identify and mature technologies to reduce energy consumption and coordinated a variety of related technology, test and demonstration activities.  A Navy program to improve the energy efficiency of containerized living units (CLUs) began testing component technologies and investigating new shelter configurations\/designs for a super-efficient CLU.  A PACOM\/DOE program to evaluate an array of technologies to reduce energy loads in tropical environments, partly through a deployable testbed, conducted some initial tests and set up its outreach network, which is designed to reach a variety of organizations that offer promising technologies.\n\nThese five programs were complemented by several other efforts.  One such effort involves establishing a quantitative basis for energy use of expeditionary outposts in Afghanistan; this program instrumented and began collecting data on various equipment in the field.  Another is a joint program with the Strategic Environmental Research and Development program (SERDP) to develop practical, deployable waste to energy systems; that program awarded contracts to develop conceptual designs and test prototypes.  Finally, there is a program to develop modeling and simulation technology to assess operational energy effects in ground operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.244"
                                            },
                                            "Text": {
                                                "val": "The energy load reduction, waste to energy programs and data collection programs begun in FY 2012 will be continued.  The Army\/Navy cooling technology program will continue its development\/investigation of various component technologies and move into developing integrated cooling systems for demonstration and testing.  The Navy\/ARPA-E program will select and further develop innovative ARPA-E cooling technologies for expeditionary applications, such as energy efficient dehumidification and compact, low cost absorption heat pumps.  The Army\/Air Force soft shelters\/tent program will conduct first generation technical testing in relevant locales to validate reductions in energy consumption compared to the baseline and continue improving energy efficiency through thermal modeling, further technology maturation, and optimizing second generation, system-level designs.  The Navy CLU program will continue testing various component technologies as potential upgrades for existing CLUs and design and prototype a new super-efficient CLU.  The PACOM\/DOE program will test additional technologies during several exercises and continue to build-up and improve its outreach network.  The data collection program in Afghanistan will finish collecting data and then analyze the results.  The waste to energy program with SERDP will complete the design of waste-to-energy systems and construct prototype systems. \n\nThe key new initiative in FY 2013 will be the start up of broad efforts to improve DoD’s operational energy performance particularly by involving nontraditional innovators and small businesses in meeting DoD’s operational energy challenges.  These new programs will emphasize the use of innovative business methods, such as consortia, to establish standing forums for sustained interaction between DoD and a broad variety of non-government organizations.  Possible topics for these consortia or similar organizations include dismounted power, power supply networks for expeditionary outposts, and tactics, techniques and procedures for energy efficient operations.  These programs will be executed by the Services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.501"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.501"
                                            },
                                            "Text": {
                                                "val": "For FY 2014, the load reduction, waste to energy and operational energy consortia established in FY 2012 and FY 2013 will be continued, provided individual programs are proceeding properly.  The Army\/Navy cooling program will complete its integrated cooling systems and demonstrate them at key Army evaluations designed to promote transition.  The Navy\/ARPA-E cooling program will complete the technology development programs under its sponsorship while pursuing transition opportunities.  The Army\/Air Force soft shelters\/tent program will conduct second generation technical testing in relevant locales to validate a 50 percent reduction in energy consumption compared to the baseline and transition technologies to appropriate programs.  The Navy CLU program will finalize the design and conduct a field test of the super-efficient CLU.  The PACOM\/DOE program will test and refine additional load reduction technologies for tropical environments, validate the data collected in previous assessments, and look for additional DoD partners with similar or related challenges.  The waste to energy program with SERDP will evaluate the prototype systems using waste streams that simulate those encountered at expeditionary base camps.\n\nFY 2014 new starts will focus on filling one or more of the operational energy technology gaps identified in a technology gap assessment completed by ASD(R&E) at the end of FY 2012.  Consistent with the mission of this funding, these new programs will aim to fill some of the identified gaps by funding the startup of sustainable S&T programs within the Services.  The five top priority gaps are: High Efficiency Energy Conversion; Energy Integrated Design and Simulation; High Efficiency Propulsion; Environmental Control Units; Flexible and Adaptive Power Distribution."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P456"
                    },
                    "ProjectTitle": {
                        "val": "Hybrid Energy Storage Module (HESM)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.250"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "16.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.500"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project explores advanced technology development of hybrid energy storage associated with providing the capability to enhance fuel efficiency, maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation Army and USMC battlefield generators and vehicles, Air Force and Navy aircraft, and Navy ships. This project will demonstrate scalable energy storage systems with high power and energy densities, high rate capability that: reduce total logistics replenishment of fuel and material; increase platform and vehicle ability to sustain operations during engagement; and reduce maintenance and other events that interfere with mission capability.  Post the demonstration completion, this technology will be further sustained by the Services. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy’s Advanced Research Projects Agency – Energy (ARPA-E). AMPED technology will be used to potentially extend the operational performance benefits and safety for these applications beyond the hybrid storage module baseline design configurations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Energy Storage Module (HESM)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.250"
                                            },
                                            "Text": {
                                                "val": "The primary emphasis in FY 2012 was the establishment of efforts devoted to hybrid energy storage research of application oriented model development, establishment of test-beds and device limitation characterization at the service laboratories for military specific applications, design architecture for plug-and-play capabilities, definition of safety metrics, and validation & verification of advanced complex controls.  Further efforts established system level metrics for HESM demonstrations and concept of operations in all demonstration areas.  Efforts associated with Army and USMC battlefield generator and vehicle HESM demonstrator development was initiated.  These efforts are executed by the Services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The HESM efforts begun in FY 2012 will be continued.  The key new initiatives in FY 2013 will be the initiation of Air Force and Navy aircraft, and Navy ships HESM demonstrator development. Further energy storage technology demonstration effort associated with safe operation of energy storage impacting all three military application areas will be initiated. The goal of this effort is to develop and demonstrate a safe energy storage structure which is capable of not only buffering against life-reducing high operating temperatures due to aggressive cycling operations but also preventing or limiting thermal runaway conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.500"
                                            },
                                            "Text": {
                                                "val": "For FY 2014, the HESM established in FY 2012 and 2013 will be continued, provided individual programs are proceeding properly. The Army and USMC battlefield generator and vehicle HESM unit will be demonstrated and transitioned to the Services. Based on results of development and demonstration, operational impact and definition of standards for varieties of energy storage devices and HESM modules for insertion into current and future military platforms will be assessed."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    }
                }
            ]
        }
    }
}