{
    "id": "f10d536e44f485e49f804d4eaebc049b2a700921",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603662D8Z"
        },
        "ProgramElementTitle": {
            "val": "Networked Communications Capability"
        },
        "R1LineItemNumber": {
            "val": "42"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.856"
            },
            "CurrentYear": {
                "val": "25.393"
            },
            "BudgetYearOne": {
                "val": "20.000"
            },
            "BudgetYearOneBase": {
                "val": "20.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Networked Communications Capability Program (NCCP) seeks to accelerate the wireless mobile networking capability of Department of Defense’s (DoD) current and planned investments in response to national military strategy and ever growing needs.  Warfighter’s today rely more and more on communications networks to support and enable actions from targeting and shooting weapons to video-conferencing.  Though military basic infrastructure capabilities follow the mainstream commercial internet, for many reasons (security, mobility, and robustness), commercial telecommunications especially commercial wireless (tactical edge) communications are not well-matched with the requirements of today’s warfighter.  These trends will continue as the military data load becomes more diverse and heavy.  These tactical edge technology challenges cut across all warfare domains (space, air, ground, and sea).  In response to recognized technical problems today, as well as anticipated problems in the future, this research will focus on two key problems in networked technologies:  The need for \"Joint interoperability\" and  \"expanded reach\" (resilient and robust) where no communication infrastructure exists.  The main research objectives of this program are to:\n\n– Perform Network Communications Analysis to establish the scientific foundations for tactical mobile networking with a specific emphasis on integrating heterogeneous Networks and Integrated NetOps for tactical networks.\n– Complete the enhancements of joint integrated capability to predict performance of heterogeneous communication networks and expand the reach\/connectivity and capacity. \n– Jointly manage and operate existing and planned diverse communications networks, services and applications.\n– Create mature products for transition to programs of record (POR) or directly to field.\n\t- -  Wireless mobile network design, development & operations, spectrum management, information assurance and information dissemination management software tools.\n\t- -  Joint Aerial Layer Networking (JALN), services and applications packages including hardware and software systems and integrated\/joint network operations software tools and new information architectures.\n\nThis research provides the technical basis to standardize the implementation of military network communications capabilities in the areas of joint airborne network gateways and network communications analysis across the military services, Joint Staff, Office of the Secretary of Defense, and defense agencies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "23.185"
                },
                "CurrentYear": {
                    "val": "25.393"
                },
                "BudgetYearOne": {
                    "val": "30.395"
                },
                "BudgetYearOneBase": {
                    "val": "30.395"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.856"
                },
                "CurrentYear": {
                    "val": "25.393"
                },
                "BudgetYearOne": {
                    "val": "20.000"
                },
                "BudgetYearOneBase": {
                    "val": "20.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.329"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-10.395"
                },
                "BudgetYearOneBase": {
                    "val": "-10.395"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.322"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-10.395"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.395"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 baseline adjustments are reflective of DoD priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P663"
                    },
                    "ProjectTitle": {
                        "val": "Network Communications Analysis"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.856"
                        },
                        "CurrentYear": {
                            "val": "25.393"
                        },
                        "BudgetYearOne": {
                            "val": "20.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Tactical Mobile Networking - As studies have suggested, for instance, the National Research Council’s Network Science Report (2005) and Army Mobile Ad-hoc Network (MANET) JASON's Report (January 2006), the type of networking projected to meet military tactical requirements is not supported by network theory, network design, and analysis tools.  This research will define those technical parameters important to military tactical mobile networking environments, investigate the status of network design and analysis tools, and evaluate how modeling and simulation is conducted to support tactical mobile networking environments.  The role of network experimentation with respect to network modeling will be explored.  Further development and analysis will be conducted to improve the awareness of the condition of tactical mobile networking technologies.  Design tools, architectures, and technical approaches will be recommended to acquisition programs as a result of this research.  \n  \nNetwork Management Tools and Analysis - Network management in the commercial world is a highly organized, synchronized activity that has excellent tools to monitor activity and repair disrupted networks as needed.  These same tools are ill-matched for management in the wireless world, and specifically for military tactical mobile networking.  In addition, the military tactical mobile networking environment lacks the infrastructure (connectivity) and support (helpdesk) because resources (spectrum, people, and equipment) are scarce (not in harm's way).  As the complexity of networking grows and as network capabilities are introduced, improved network management is required.  For military operations, assured delivery may be needed for specific information and operations.  This requires management tools to be in place to ensure continued secure and robust operations, which is not achieved with commercial wireless technologies.  This research will assess network management tools in place for the military tactical mobile networking environment and develop technology and tools to address shortfalls with the goal to transition technology to operational systems.   \n  \nSpectrum Management Tools and Analysis - For wireless, tactical mobile networking, the management of the use of spectrum effects network operations.  The demand for spectrum is increasing due to the expanded use of sensors, imagery, and voice.  This demand increases the pressure on the limited shared radio frequency (RF) spectrum for military tactical networking.  The current Department of Defense (DoD) frequency planning and management infrastructure will have a limited ability to cope with this demand through operational planning, Coalition Joint Spectrum Management Planning Tool (CJSMPT) Joint Capability Technology Demonstration (JCTD), and the Global Electromagnetic Spectrum Information System (GEMSIS).  Advanced spectrum management concepts such as sense and adapt, spectrum sharing, and dynamic reallocation are under investigation but not yet mature support operations.  This research will evaluate opportunities for more efficient and effective use of the frequency spectrum within DoD.  Technology advances are expected to advance the concept of cognitive radio and cognitive antenna devices to sense and adapt operations based on spectrum policy and usage, the management of multi-band and multifunction apertures, and the use of spectrum efficient waveforms for use in military environments.  This research will develop the models and tools to demonstrate capabilities for operational planning and monitoring of spectrum as these technologies are introduced.  \n  \nIntegrated Network Management Capability - Network management becomes more complex as more and different types of networking capability become available.  Integrated network management across heterogeneous systems, especially wireless systems, requires definition, design, and development.  Operationally, network management assumes all functions required to share networking resources and ensure proper operation for participants.  This research will define integrated network operations tools for all aspects of network resource management and to prioritize across operational spectrum management, security management, network management, and information management.  This research will also develop test beds especially to validate models and simulations used to develop and test network management tools, and conduct experimentation on approaches developed. \n\nTactical Networking Evolution and Expansion - Fielded and about-to-be-fielded tactical networks can be vastly expanded and evolved from their current capabilities by developing and applying new techniques (or existing techniques developed in basic research) to the existing systems, providing modern capability to the warfighter without the large expense to the DoD of developing new systems.  This research will focus on developing and applying new DoD specific techniques to create leap-ahead approaches to Anti-Jam resistance of tactical networks, larger, more fully exploited networks, and expanded capabilities for signal\/data processing and data compression in radios and across the networks.  This research will take advantage of new software defined radios about to be fielded by the Department, as well as focus on the existing legacy systems, using the successful approach we developed when fielding the Netted Iridium capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Mobile Networking"
                                    },
                                    "Description": {
                                        "val": "This project is for the development of new applications and standards that can be used on existing tactical networks to improve data retrieval and discovery by the tactical warfighter.  In addition, research is conducted into tactical communications architectures to develop models useful for optimizing and exploiting tactical networks.  New applications and architectures will be tested in a joint federated experimental emulation test bed being developed within this program.  Project collaboratively executed by the Navy and Air Force.  Results planned for transition to programs of record as maturity of models allow.   Research efforts include Wireless Computational Networking Architectures (WCNA), Tactical Edge Protocol Evaluation and Experimentation (TEPEE), Mission Aware Reasoning for Tactical Edge Network Services (MARTENS)\/Semantically Augmented Resource Manager (SARM), Dynamic Transport Protocol, SATCOM and Tactical NetOps, MANET Project (w\/ NSA), Cooperative Heterogeneous Communications, Inter-domain Routing, Communications for Autonomous Systems, Network Visualization, Tactical Edge Group-Wise Networking, Advanced Tactical Data Links, Reliable Data Transport, Channel Modeling for Software Defined Radios in Real Atmospheric Environments, and Loss Tolerant Transmission Control Protocol (LT-TCP) for Mobile Wireless Networks.\n \nOverall goal:  Increase understanding of the condition of tactical mobile networking technologies.  Improve specification of technical standards and policy for tactical mobile networking.  Refine fidelity modeling and simulation to support operations analysis and the articulation of operational requirements and performance parameters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.283"
                                            },
                                            "Text": {
                                                "val": "-  Designed compressive sensing (CS) based protocols for massive antenna arrays.  Implemented compressive sensing decode on a Global Processing Unit (GPU).  Designed small unmanned airborne systems (SUAS) flight test for distributed spectrum sensing.\n-  Completed the TEPEE project.\n-  Transitioned the SARM project into a new effort called MARTENS.  Developed prototype implementation of semantic reasoner.  Demonstrated the initial SARM\/MARTENS prototype.\n-  Initiated Dynamic Transport Protocol project.  Evaluated candidate protocols and completed initial dynamic protocol design.  Created emulation environment for protocol concept evaluation.\n-  Completed design methodology on how to better link tactical terrestrial network operations (NetOps) planning and tools with the Joint Satellite Communications (SATCOM).  Completed architectural analysis on dynamic SATCOM access schemes.\n-  Initiated MANET project in conjunction with NASA.  Developed and matured prototype software code and standards.  Developed a common (standards-based) radio networking stack and a common management capability prototype.\n-  Developed new protocols utilizing network coding to leverage multi-path routing.\n-  Developed a test bed environment to explore the impact of Border Gateway Protocol (BGP) routing policy settings in a joint networked environment.\n-  Developed simulation model and metrics to evaluate impact of communications on autonomous systems.  Evaluated mission autonomy strategies.\n-  Initiated Network Visualization project.  Executed a series of simple prototype to test a variety of visualization strategies.\n-  Completed network group forwarding and structural analysis with group-oriented network protocols.  Researched adaptive rate reliable video and NACK-Oriented Reliable Multicast (NORM) transport proxy.  Researched survivable, serverless messaging and chat solutions, and Disruption Tolerant Networking (DTN) for heterogeneous operations.\n-  NRL completed the Advanced Tactical Data Links effort.\n-  Initiated reliable data transport project.  Conducted robust distributed network transport workshop (June 2012).  Drafted test plan for tactical network testbed.\n-  Completed Channel Modeling for Software Defined Radios in Real Atmospheric Environments project.\n-  Initiated the LT-TCP effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.297"
                                            },
                                            "Text": {
                                                "val": "-  Perform distributed spectrum sensing SUAS experiments.  Investigate integration of compressive sensing based compression and encryption.  Demonstrate Capability Enabler Network enabling advanced collaborative\/secure networks.\n-  Complete extension of the system for operation in tactical environments.  Develop enhanced user interface functionality.  Integrate MARTENS capability into NATM (AFRL) and JINX (CERDEC) systems.\n-  Develop location and path aware protocol tuning mechanisms.  Design basic protocol architecture integrating multiple transport protocols.  Emulate protocol architecture to analyze performance in realistic tactical environments.\n-  Create and complete SATCOM planning and control software early prototypes.  Evaluate design architectures for using the Mobile User Objective Systems (MUOS).  Develop implementation methods to apply Precision Polarization for Terrestrial SATCOM.\n-  Test and mature prototype software code and standards.  Analyze, model and design prototype server-less Voice over Internet Protocol (VOIP) systems.  Evaluate and develop new Stochastic Routing protocols for Disruption Tolerant Networking (DTN).\n-  Explore opportunities to transition advances in the protocol development to programs or services.  Extend the network coding protocols to different scenarios.\n-  Explore alternatives to BGP that can handle the dynamics of mobile tactical networks, with potential applications to emerging networks across programs and services (WIN-T, JALN, etc.).\n-  Define communication risk environment.  Develop autonomous decision making algorithms.\n-  Collect feedback on the initial prototypes from networking research staff.  Expand visualization prototypes which hold the most promise.  Define specifications for a full-featured Network Visualization Toolkit.\n-  Conduct initial field experiment at Naval Post-graduate School (NPS) Tactical Network Testbed (TNT) facility.  Complete development of network protocol mechanisms to support distributed, autonomous group-wise communication.  Enhance the Adaptive Reliable Video Service (ARVIS).\n-  Perform S&T in efficient dissemination backbones and adaptive ad hoc routing.  Investigate performance trade-off of reliable multicast and unicast transport methods for mobile tactical edge communications.  Research, develop, and transition decentralized mobile service discovery mechanisms.  Research and transition serverless group messaging capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Management Tools and Analysis"
                                    },
                                    "Description": {
                                        "val": "This project is for the development of joint standards and tools for policy-based and measurement-based tactical network management.  New standards and applications will be tested in a joint federated experimental emulation test bed being developed within this program.  This project is jointly executed by the Navy, Air Force and Army, with technology transition agreements being pursued with programs of record.  Research efforts include Network Agent Technology for Management (NATM), Joint Integrated Network Management System Exchange (JINX), Tiger Team Analysis, Tactical Resource Management and Control, End-to-End Network Management (NEEMO), NRL Information Assurance, Optimal Scheduling in Time Division Multiple Access (TDMA) Networks, and Dynamic Policy Management (DPM).\n \nOverall goal:  Increased understanding of the complexity of the tactical network management.  Determination of the support required for tactical network operations.  Evaluation of technology to support transition and fielding to operational capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.821"
                                            },
                                            "Text": {
                                                "val": "-  Integrated AFRL NATM and NRL NEEMO capabilities.  Developed basic Anomaly Detection capabilities.  Initiated transition of NATM capabilities into Joint Warfighting Integrated NetOps (JWIN) Joint Concept Technology Demonstration (JCTD).\n-  Completed the JINX Project.  Matured and completed development of bridging technology to facilitate application level Joint Force information sharing.  Matured and completed development of network Common Operating Picture (COP) visualization technologies to facilitate understanding of the network's impact on Joint missions, and converting the Joint Information Dissemination and Management (JINX) technology into Systems Center Operations Manager (SCOM) management packs.  Technology transitioned to the JWIN JCTD.\n-  Conducted analysis of future network technologies and developed research roadmaps outlined required technology developments for waveforms, tactical networking, and Satellite Communications (SATCOM).\n-  Demonstrated using a single network management interface to control real radios and emulated radios.  Drafted a Common Open Research Emulator (CORE) Management Information Base (MIB) for tactical radios.\n-  Tested NEEMO installation on the USS Blue Ridge and the USS Mt. Whitney.  Participated in Communications AirBorne Layer Expansion (CABLE) JCTD.  Participated in JWIN JCTD (Terminal Fury 12 and Valiant Shield)\n-  Transitioned NRL Information Assurance work to the OSD Cyber Security Program Line.\n-  Completed the Optimal Scheduling in Time Division Multiple Access (TDMA) Networks project.\n-  Successfully developed and demonstrated multi-party negotiation algorithm.  Developed greater complexity use cases with various tactical services and multiple types of networks.  Researched, designed, and developed prototype policy negotiation user interface software that supports collaborative distributed negotiation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.599"
                                            },
                                            "Text": {
                                                "val": "-  Develop Enhanced Anomaly Detection.  Augment system to support Dynamic Spectrum Access decisions.  Initialize integration with Net Design capability.\n-  Evaluate requirements for integrating physical layer and networking layer designs for the multifunctional waveform to provide a complete solution.  Evaluate results of integration studies for implementing Mobile User Objective System (MUOS) satellite systems into tactical networks.\n-  Integrate real radios and networks into emulation environment to demonstrate operation of a universal interface and verify the feasibility of configuring and monitoring real communications equipment.\n-  Research requirements and develop capabilities to provide mobile tactical warfighters with automated indications of network health, and research requirements for deployment into heterogeneous tactical network environments.  Research methods for obtaining network topologies from flow-based monitoring techniques, and research implementation of methods for dynamic analysis and mapping of cross-domain quality of service (QoS) requirements.  Research utilizing network data analysis to optimize network bandwidth usage.\n-  Research solutions to address the fair negotiation human factor problem.  Mature the Dynamic Policy Management (DPM) algorithm and software.  Integrate policy negotiation to Policy-based Network Management (PBNM) systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectrum Management Tools and Analysis"
                                    },
                                    "Description": {
                                        "val": "This project is for the development of measurement-based spectrum management tools.  Applications will be developed and tested in a laboratory environment.  Project is executed by the Army and results are available to the Navy and Air Force through the Joint NETOPS Integrated Collaborative Working Group.  Research efforts include Spectrum Analysis and Experimentation in Dynamic Operational Environments (SAEDOE), Agile Spectrum and Network Testbench (ASPECT), Dynamic Spectrum Access (DSA) Spectrum Analysis Software, Cognitive Networking Radio Algorithmic Fusion, Integrating Comm and Electronic Attack. SIGINT-assisted Spectrum Management and Control, Cognitive Radio Technology, Networking for Spectrum Aware Cognitive Radios, DSA Enhancements, Spectrum Sharing Trade Study, and Directional Ad hoc Networking Technology - 2 (DANTE - 2).\n \nOverall goal:  Develop the technical basis to support changes regarding the operational use of spectrum both within the military and among spectrum regulatory bodies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.934"
                                            },
                                            "Text": {
                                                "val": "-  Completed collection of airborne spectrum characterization data.  Developed Dynamic Spectrum Access (DSA) simulation environment.  Completed initial assessment of DSA algorithms.\n-  Initiated the ASPECT project.  Developed initial testbench framework design and architecture.\n-  Developed algorithms and analytical methods for the performance of Dynamic Spectrum Access (DSA) systems in heterogeneous networks where background emitters operate with differing bandwidths.  Demonstrated the DSA Policy automation, creation, and simulation software tool and coexistence policies between DSA and legacy systems.  Demonstrated a complete capability to generate, disseminate, and execute a DSA policy in the laboratory environment.\n-  Completed development of a Radio Network test bed that supports development, evaluation, and demonstration of wireless networking technologies enabling the capability of passing realistic user communications traffic using both simulated and live radio networks.\n-  Demonstrated medium access control (MAC) layer attack on the 802.11 waveform.  Investigated additional spectrum efficient modulated attacks on specific communications waveforms.\n-  Added distributed sensors into the non-central channel control algorithm in the spectrum management simulation.  Studied interpolation approaches for distributed sensors using spatial correlation of the power spectrum.  Improved the control algorithms in the spectrum management model (results to be published in MILCOM 2012).  Enhanced the run-time performance of the simulation.\n-  Completed evaluation of current version of Shared Spectrum Company Dynamic Spectrum Access (SSC DSA-2100) radios with security assessment.  Released initial capture spectral environments to DoD Wireless Networking Library, and completed basic Matlab model of DSA in a simulated environment.  Increased the number of development nodes to four with general applicability to larger collection of nodes, and demonstrated multi-node multicast and asynchronous node interactions.\n-  Advanced the use of channel state information (CSI) in cognitive radio networks and its impact on the stability region of a two-user cognitive radio network.  Developed a set of criteria to determine the capacity scaling laws for ad-hoc networks under different physical layer technologies.  Developed joint optimal relay selection and resource allocation under bandwidth exchange (BE) to enable incentivized cooperative forwarding.\n-  Completed the DSA Enhancements Study.\n-  Initiated the Spectrum Sharing Trade Study.  Developed generic incumbent system models.  Developed generic entrant system models.  Determined the dynamic spectrum access (DSA) rule parameters for different incumbent radio types including the limiting DSA factors.\n-  Began low rate initial production (LRIP) on one GHz and two GHz DANTE systems for a classified application.  Directional Ad-hoc Networking Technology- 2 (DANTE-2) has been proven at five GHz and transitioned at one GHz and two GHz."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.914"
                                            },
                                            "Text": {
                                                "val": "-  Complete airborne spectrum data collection.  Implement DSA algorithm hardware.  Validate previously simulated DSA techniques via experiments.\n-  Complete prototype RF control software development.  Implement three node prototype controllable spectrum capability.  Conduct initial experimentation utilizing framework.\n-  Complete development of measurement-based dynamic spectrum access (DSA) and policy management software.  Develop and test on a radio emulation test bed negotiated spectrum access algorithms and evaluate its possible inclusion into current tactical waveforms.  Test and demonstrate real time DSA algorithm.  Develop spectrum sharing mechanisms with commercial providers\/systems to address the limitation imposed on tactical networks by the National Broadband Plan.\n-  Investigate generalized MAC layer electronic attack techniques.  Research joint networked comm\/jammer waveform.  Demonstrate promising capabilities.  Complete investigations of joint Network comm\/jamming architectures.\n-  Complete SIGINT-assisted Spectrum Management and Control project.\n-  Develop a set of spectral scenarios to evaluate DSA radios, including individual and environmental radios.  Expand and increase the fidelity of the modeled environment and explore Electronic Attack (EA) effectiveness against cognitive jammers.  Create cooperative sensing strategies for heterogeneous environment and real-time RF channel emulation interface RF with propagation models to EMANE.\n-  Develop scheduling mechanisms in wireless networks that employ multi-user detection (MUD) for allowing simultaneous transmissions.  Analyze the multicast throughput and stability for a two-user cognitive radio system and analyze the capacity-delay tradeoffs in cognitive radio networks.  Develop throughput maximization schemes for secondary nodes in a cognitive network under the transparent co-existence paradigm, and complete development of a protocol framework of BE-based networking.\n-  Develop alternate spectrum architectures.  Estimate incumbent and entrant implementation and recurring costs for each architecture.  Develop test plan to validate key assumptions and results.\n-  Extend DANTE to other frequencies.  Extend network topology automation to multiple frequencies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Network Management Capability"
                                    },
                                    "Description": {
                                        "val": "This project is for the development of joint integrated network management tools, and three federated experimental test beds for the development and evaluation of integrated tactical network management and spectrum management.  The project is executed jointly by the Navy, Army and Air Force.  The plan is to also establish a Joint Network Operations (NETOPS) Integrated Collaborative Working Group for the establishments of standards and joint development in support of all projects in this program.  Membership includes the research community from the Navy, Marine Corps, Army and Air Force as well as developers from acquisition programs such as Warfighter Information Network-Tactical (WIN-T) and Joint Tactical Radio System (JTRS).  Future plans call for further joint infrastructure test bed development to include DoD PlanetLab as well as joint networking tools in support of NETOPS.  The results of this research will transition to future increments of JTRS and WIN-T, and if successful, to the field through a joint integrated tactical NETOPS program. Research efforts include MlabCUNE \/Edge Network Visualization and Emulation (ENVE), Tactical Edge Network Integration and Operational Environment Testbed, Joint Network Management Interoperability, Wireless Networking Library (WNL), Network Emulation and Experimentation, and Tactical Edge Wireless Experimentation.  \n \nOverall goal:  Common integrating framework to support interoperability among various aspect of developmental network operations and management to include spectrum management, network management, security management, and information management.  Reduce the cost to develop, procure, and support networks through the integration across networks and functions within networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.882"
                                            },
                                            "Text": {
                                                "val": "-  Completed the mlabCUNE\/ENVE project\n-  Completed the Tactical Edge Network Integration and Operational Environment Testbed project.\n-  Completed Development of a Joint emulation capability for testing\/evaluation of tactical network applications without software code modification.  Completed development of a common integrating framework to support interoperability among various aspects of joint Network Operations.  Completed design and implementation of a flexible Network Management policy approach supporting multiple application domains and platforms.  Completed integration of KAoS with Spectrum Managements Tools on a radio emulation test bed.\n-  Expanded WNL user base to over 100 users across dozens of Department of Defense (DoD) organizations.  WNL demonstrated at MILCOM 2011.\n-  Expanded library of emulated waveforms with an MIT-LL developed EMANE emulation of the Network-Centric Waveforms (NCW).  Transferred emulation platform technology to other programs (such as Project Manager Warfighter Information Network-Tactical (PM WIN-T)).\n-  Released EMANE 0.7.3 with enhanced “Universal PHY” and other features and improvements.  Conducted fourth collaborative DoD Mobile Network Modeling Workshop (February 2012).  Pursued EMANE use for ONR (Office of Naval Research) Advanced Tactical Data Link (ATDL) modeling."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.857"
                                            },
                                            "Text": {
                                                "val": "-  Conduct routine administration and maintenance of the WNL. Demonstrate WNL at targeted conferences.  Examine technology refresh and additional software features.\n-  Perform and complete work on verification and validation (V&V) of waveforms and protocols in the scalable emulation.  Improve the ability to set up and operate large scale emulations.  \n Transition capability to other DoD programs.\n-  Complete CORE and EMANE development.  Mature Network Modeling Framework (NMF) and additional wireless models.  Collect and analyze field test data to validate emulation modeling through various test, visualization, and data analysis tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Networking Evolution and Expansion"
                                    },
                                    "Description": {
                                        "val": "This project is for the development of new applications and approaches that can be used on existing tactical networks to improve the physical and networking layers for the tactical warfighter.  It will explore new ways to build architectures, antennas, and signal and data processing or exploit waveforms to improve Anti-Jam resistance, network throughput and scale, or network packet routing, and improve these metrics at low cost and without sacrificing interoperability.  Research efforts include Joint Aerial Layer Network (JALN) Network Management\/Control Concept Analysis, Advanced Tactical High-Performance Network Architecture (ATHENA), Network Radio Characterization Limited Objective Experiment (LOE), Multi-Function Wave Form (Resilient EW\/Comms), and the Asymmetric Broadcast Command and Control System (ABC2) Anti-Access\/Area Denial (A2\/AD) Demonstration  \n\nOverall goal:  Next generation tactical networking in the fielded tactical systems, with vastly increased capabilities, at the lowest cost possible to the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.936"
                                            },
                                            "Text": {
                                                "val": "-  Conducted Joint Concept process analysis.\n-  Identified and categorized current, emerging, and new ATDL applications as well as their network service requirements.  Modulated and enhanced code that enable reuse of Link 16 RF hardware and operation in Link 16 spectrum.  Designed modular network architecture to enable interoperability.  Developed IP Robust Header Compression (ROHC) functionality in OPNET and developed new IP header compression protocol MANET IP Header Compression.  Completed initial evaluation of MANET routing protocols in airborne networks.\n-  Initiated Network Radio Characterization LOE project.  Completed bench testing with Marine Corps Trellisware radios.\n-  Initiated Multi-Function Wave Form effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.726"
                                            },
                                            "Text": {
                                                "val": "-  Test Joint Concept process inserts.  Complete Joint Concept analysis documentation.\n-  Perform and complete algorithmic and architectural improvements to the ATHENA physical, MAC, and network layer designs, incorporating feedback from network simulation and emulation performance experiments.  Create and finalize a hardware implementation of the ATHENA algorithms and architectures as an integrated air tactical domain solution.\n-  Conduct a field demonstration of various application layer tools and network services in a heterogeneous tactical network.\n-  Develop a Multifunctional Electronic Warfare (EW) and Communications Waveform components capable of providing simultaneous communications and EW functions.  Develop hardware interface and software architectures.  Develop scheduling algorithms advanced routing features and Physical\/Media Access features.  Develop integrated comms\/EW models.\n-  Field test and demonstrate the Integrated COMMS\/EW models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "- Begin the ABC2 demonstration planning phase in order to serve as preparation, planning, and requirements gathering activities, such that the ABC2 demonstration will be properly lined up with relevant exercises taking place during late FY 2014 in the U.S. Pacific Command Area of Responsibility aligned with strategic needs for A2\/AD.  This will include operational planning, technical requirements gathering, and programmatic and acquisition planning."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Netted Iridium (NI) capability will be transitioned directly to production and sustainment to the DTCS-Army program by the Army for use in the U.S. Central Command Area of Responsibility.  Other program capabilities will be transitioned to acquisition programs as successful and appropriate."
                        },
                        "PerformanceMetrics": {
                            "val": "Strategic Goals Supported: Net-Centric Warfare\/Joint Interoperable Communication.  Meet current needs of tactical warfighter.\n\nExisting Baseline: Prototype relays and gateways; initial federated, laboratory test beds; and prototype joint network management tools.\n\nPlanned Performance Improvement \/ Requirement Goal:  Link expansion in prototype relays and gateways; and continued integration in federated test beds; demonstration of prototypes and software tools.\n\nActual Performance Improvement:  Prototype and transition able relays and gateways; usage of federated test beds; and demonstration of prototypes and software tools.\n\nPlanned Performance Metric \/ Methods of Measurement:  Utilization of federated test beds; and demonstration of prototypes and software tools.\n\nActual Performance Metric \/ Methods of Measurement:  Progress on test bed development; prototype software demonstrated; and prototype architectures developed."
                        }
                    }
                }
            ]
        }
    }
}