{
    "id": "f1cb50d44811de42fb90a13e8da4de79b98e1eda",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604828D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Fires Integration and Interoperability Team"
        },
        "R1LineItemNumber": {
            "val": "109"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.965"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Joint Deployable Analysis Team  Program Element 0604828D8Z will transfer from OUSD AT&L to The Joint Staff in FY13."
        },
        "ProgramElementMissionDescription": {
            "val": "The JDAT mission is to employ scientific methods to research, investigate, test, assess, and evaluate current and emergent Joint command and control (C2) information systems and associated procedures. These activities measure capabilities and limitations, identify shortfalls and root cause, recommend and verify solutions, and validate joint capabilities. The resultant empirical outcomes influence Joint Capability development in areas such as Policy; Joint Doctrine; Tactics, Techniques and Procedures; integration of capabilities; and digital interoperability. JDAT provides decision-quality data and cogent solutions to customers and stakeholders responsible for improving Joint C2 information systems integration and interoperability to inform acquisition decisions and ensure that Services and Agencies field interdependent and interoperable systems.\n\nThe emphasis of JDAT assessment efforts is the evaluation of C2 Information Systems and Procedures to provide Services and Agencies findings and recommendations based on quantifiable data in order to improve Joint C2 integration and interoperability. JDAT collects and analyzes data and provides observations, findings, conclusions, and recommendations to identify policy; Joint doctrine; tactics, techniques, and procedures (TTP); and material solutions and products that promote capability improvement. Evaluations range from small, single-focus events to large, multi-event\/venue exercises."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.008"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.965"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.043"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.043"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P857"
                    },
                    "ProjectTitle": {
                        "val": "Joint Deployable Analysis Team"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.965"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The JDAT mission is to employ scientific methods to research, investigate, test, assess, and evaluate current and emergent Joint command and control (C2) information systems and associated procedures. These activities measure capabilities and limitations, identify shortfalls and root cause, recommend and verify solutions, and validate joint capabilities. The resultant empirical outcomes influence Joint Capability development in areas such as Policy; Joint Doctrine; Tactics, Techniques and Procedures; integration of capabilities; and digital interoperability. JDAT provides decision-quality data and cogent solutions to customers and stakeholders responsible for improving Joint C2 information systems integration and interoperability to inform acquisition decisions and ensure that Services and Agencies field interdependent and interoperable systems.\n\nThe emphasis of JDAT assessment efforts is the evaluation of C2 Information Systems and Procedures to provide Services and Agencies findings and recommendations based on quantifiable data in order to improve Joint C2 integration and interoperability. JDAT collects and analyzes data and provides observations, findings, conclusions, and recommendations to identify policy; Joint doctrine; tactics, techniques, and procedures (TTP); and material solutions and products that promote capability improvement. Evaluations range from small, single-focus events to large, multi-event\/venue exercises."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Deployable Analysis Team (JDAT) - Command and Control (Ce) Information Systems and Procedures Capability Assessments"
                                    },
                                    "Description": {
                                        "val": "Description: JDAT conducts assessments in conjunction with Service and Combatant Command (CCMD) exercises, experiments, and test and evaluation events. \n\nThe primary outputs and efficiencies include:\n\n- Improvement in the Services’ ability to employ Joint C2 information systems\n- Recommendations for system integration and interoperability\n- Ability to include Joint context during new system acquisition or development\n- Updates and revisions to related CJCS Instructions and Manuals\n- Development of related Universal Joint Tasks (UJT) and Additional Task Detail (ATD)\n- Updates and revisions to doctrine, TTP, and other Joint publications\n- Development and refinement of analytical tools (i.e. Data Collection Architecture for Analytical Feedback (DCAAF), Track Event Reconstruction Application (TERA), \n\nJoint Windows-based Warfare Assessment Model (JWinWAM))\n\n- Recommended solutions integrated within the Joint Requirements Oversight Council (JROC) Joint Capabilities Integration Development System (JCIDS) and OSD Joint C2 Capability Portfolio Manager (JC2 CPM) processes\n- Identification of specific key performance parameters (KPPs) and key system attributes (KSAs) for new systems that meet Joint warfighter operational requirements to ensure Services and Agencies field interdependent and interoperable systems\n- Increased effectiveness and confidence in combat identification and a reduction in fratricide\n- Increased effectiveness and confidence in C2 information systems and procedures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.965"
                                            },
                                            "Text": {
                                                "val": "FY 2012 Accomplishments\n-Provided analytical support to Joint Staff capability development assessments of coalition and U.S. C2 information systems and procedures at Exercise Bold Quest 12.  Provided instrumentation, data collection, data capture, real-time mission monitoring, and feedback to participants via daily debriefings. Benefits include improved ability to assess various participating coalition and US systems, improved joint task execution, and an effective assessment of emergent U.S. C2 information systems while greatly reducing the timeline required to provide fact-based recommendations.\n-Teamed with U.S. Army Test and Evaluation Command to conduct DOT&E directed interoperability and mission assurance assessments for USEUCOM during Exercise Austere Challenge 12.  Objective was to investigate and recommend solutions to identified interoperability issues between Air Defense System Integrator (ADSI) and Global Command and Control System – Joint (GCCS-J) impacting the Joint Common Operational Picture.  Provided data collection, analysis, and display using JDAT developed tools in the air and space operations center during the event function test.  At the request of a participating Nation, exercise execution was delayed from May 2012 to Nov 2012.\n- Teamed with U.S. Army Test and Evaluation Command to conduct a DOT&E directed interoperability assessment for USSOUTHCOM during Exercise PANAMAX 2012.  Objective was to investigate and recommend solutions to identified interoperability issues between Air Defense System Integrator (ADSI) and Global Command and Control System – Joint (GCCS-J) impacting the Joint Common Operational Picture.  Provided data collection, analysis, and display using JDAT developed tools in the air and space operations center during the event function test.  Benefit includes improvement in the Joint Force Commander’s Common Operational Picture.\n-Provided analytical support to assess technology integration and interoperability during JIAMDO Joint Tactical Air Picture spiral 1 event.  This was a risk reduction event for the assessment to be conducted in November 2012.  Provided data collection, analysis and display using JDAT developed tools.  Benefit includes an improved tactical air picture for battle-space managers.  \n- Executed three risk reduction events (Joint Operational Test Approach 1, USAF Exercise Red Flag 12-3 and USAF Weapons School Mission Event 12A) in preparation for Department of Defense Joint Operational Test Approach (JOTA) 2, which is the Interim Operational Capability (IOC) event for Identification Friend or Foe (IFF) Mode 5 Level 1.  JDAT, as the lead analytical organization in support of Commander, Operational Test and Evaluation Force (COMOPTEVFOR) during JOTA 2, validated integration and interoperability of fielded Mode 5 systems. Developed data collection and analysis methodologies, design and determine data collection architectures that meet JOTA 2 objectives.  Benefit includes efficient Mode 5 data collection and analysis techniques for all weapons systems during JOTA 2.\n-Provided C2 data collection and analytical support to the Joint Fires Support Executive Steering Committee (JFS ESC). Chaired the ESC chartered Digitally Aided Close Air Support (DACAS) Engineering Change Implementation Group. Conducted Digitally Aided Close Air Support (DACAS) Coordinated Implementation risk reduction assessments to validate service compliance with requisite Engineering Change Proposals. Planned and executed testing and validation of DACAS engineering change proposals and coordinated implementation across the Department of Defense and partner nations.  Benefit included recommendations for Doctrine and Tactics, Techniques, and Procedures in the areas of standardization and digital interoperability and development of associated Universal Joint Tasks\n-Provided policy updates to CJCSI 3265.01, Command and Control Governance and Management and CJCSM 3500.04, Universal Joint Task Manual.\n-Provided doctrine updates to JP 3-09.3, Close Air Support; JP 3-13, Information Operations; JP 3-33, Joint Task Force Headquarters; and JP 3-60, Joint Targeting\n- Provided subject matter expertise and tier 2 architecture products on development of the Joint Close Air Support (CAS) and Joint Fires Joint Mission Threads.\n-Developed the Track Event Reconstruction Application (TERA) to increase track-match accuracy and shorten analytical times for air picture assessments.\n-Provided observations, findings, conclusions, and recommendations from field assessments and subject matter expert support to DOD forums and boards (Joint Mission Environment Test Capability Program, NATO Technical Panel 8, Joint Fire Support Executive Steering Committee, Combat Identification – Friendly Force Tracker Executive Steering Committee, Joint Mission Thread Architecture and Testing Working Group, and Joint C4I Partnership Working Group)in developing and advancing capabilities and products."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "JDAT delivers Joint solutions for operational and tactical forces deployed to Combatant Commands (CCMDs) and Joint and Service Program managers. Deliverables may include: discrete improvements to training processes; doctrine; Tactics, Techniques, & Procedures (TTPs); and\/or technical system performance specifications and standards; validated Doctrine, Organization, Training, Material, Leadership, Personnel, Facilities, and Policy (DOTmLPF-P) recommendations; timely delivery of quality feedback to exercise participants and developers for systems under test; or improvements to Joint context of testing and training venues. JDAT works with Joint Staff, CCMDs, and Services to approve the annual agenda of work and validate results."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.965"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Operational Test & Planning, Publications"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}