{
    "id": "f380fc43dd2b313301c1ad57de113adf8735c20b",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA2_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602303A"
        },
        "ProgramElementTitle": {
            "val": "MISSILE TECHNOLOGY"
        },
        "R1LineItemNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "65.591"
            },
            "CurrentYear": {
                "val": "49.383"
            },
            "BudgetYearOne": {
                "val": "51.528"
            },
            "BudgetYearOneBase": {
                "val": "51.528"
            },
            "BudgetYearTwo": {
                "val": "55.038"
            },
            "BudgetYearThree": {
                "val": "51.649"
            },
            "BudgetYearFour": {
                "val": "46.764"
            },
            "BudgetYearFive": {
                "val": "44.507"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 funding increase reflects renewed priority on large scale rocket propulsion systems."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) designs, fabricates and evaluates advanced component technologies for tactical missiles, rockets, guided munitions, and their launch systems in order to increase lethality, precision, and effectiveness under adverse battlefield conditions while reducing system cost, size and weight. Major goals in Project 214 include enhancing the survivability of the munition, launch and fire control systems; and increasing kill probabilities against diverse targets.\n\nThe work in this PE is complimentary to PE 0603313A (Missile and Rocket Advanced Technology), and fully coordinated with PE 0602307A (Advanced Weapons Technology), PE 0602618A (Ballistics Technology, Robotics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603004A (Weapons and Munitions Advanced Technology), and PE 0708045A (End Item Industrial Preparedness Activities).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nThe work in this PE is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "67.079"
                },
                "CurrentYear": {
                    "val": "49.383"
                },
                "BudgetYearOne": {
                    "val": "43.650"
                },
                "BudgetYearOneBase": {
                    "val": "43.650"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "65.591"
                },
                "CurrentYear": {
                    "val": "49.383"
                },
                "BudgetYearOne": {
                    "val": "51.528"
                },
                "BudgetYearOneBase": {
                    "val": "51.528"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.488"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.878"
                },
                "BudgetYearOneBase": {
                    "val": "7.878"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.488"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "7.878"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.878"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "214"
                    },
                    "ProjectTitle": {
                        "val": "Missile Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "49.620"
                        },
                        "CurrentYear": {
                            "val": "49.383"
                        },
                        "BudgetYearOne": {
                            "val": "51.528"
                        },
                        "BudgetYearOneBase": {
                            "val": "51.528"
                        },
                        "BudgetYearTwo": {
                            "val": "55.038"
                        },
                        "BudgetYearThree": {
                            "val": "51.649"
                        },
                        "BudgetYearFour": {
                            "val": "46.764"
                        },
                        "BudgetYearFive": {
                            "val": "44.507"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project designs, fabricates, and evaluates missile and rocket component technologies that support demonstration of affordable, lightweight, highly lethal missiles and rockets. Major areas of research include: guidance, navigation, and controls; target acquisition systems; multi-spectral seekers; high-fidelity simulations; sustainment; aerodynamics and structures; launch systems, fire control technologies; payloads; and propulsion including research to help solve the insensitive munitions requirements. A theme embedded throughout the efforts in this project is smaller, lighter, and cheaper (SLC) missile technology to reduce the cost and logistics burden of precision munitions. \n\nThis project supports the ground portfolio.\n\nMajor products of this PE transition to PE 0603313A (Missile and Rocket Advanced Technology). \n \nThe cited work is consistent with the Director, Defense Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Smaller, Lighter, Cheaper Tactical Missile Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates innovative smaller, lighter, and cheaper component technologies as well as system concepts to reduce ground tactical precision missile cost per kill and\/or logistics burden to meet urban and emerging threats.  These technologies transition to PE 0603313A for maturation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.496"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed trade studies and began initial critical component design for a small, light, low power navigation-grade sensor package that can detect and maintain track of the direction north; conducted initial packaging of single chip inertial sensor module; conducted trade studies for small, low cost components for precision munitions; designed component technologies for the next generation of precision weapon systems including: 1) reduced cost, advanced light weight materials; 2) reduced cost, advanced seeker technologies for increased detection range; 3) lethality technologies for performance against increased target sets; and 4) advanced propulsion and controls technology for multiple mission capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.187"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue design and development of a small, light weight, low power navigation sensor for applications such as precision targeting and miniature precision munitions, and single chip Inertial Measurement Units; based on trade studies for low cost, precision munition components and system concepts, design, fabricate, and evaluate component technologies for the next generation of precision weapon systems including reduced cost, advanced light weight materials; lethality technologies for performance against increased target sets; advanced sensor and tracking technologies for improved target acquisition, and advanced propulsion for multiple mission scenarios."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.450"
                                            },
                                            "Text": {
                                                "val": "Will finalize design of a small, light weight, low power, robust navigation sensors developed for on-the-move targeting; complete integration and test of a lightweight composite housing for far target location systems; complete initial design of extended-range, reduced time-of-flight, smaller form-factor insensitive propulsion technology for multiple-mission applications; continue trade studies of the next-generation close-combat, precision weapon systems for performance against increased target sets (e. g., lethality, guidance); develop advanced sensor and tracking technologies for improved target acquisition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Seeker Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the design and maturation of missile seekers, sensors, and software.  The goal is to increase performance of missile seekers through improvement of algorithms, imaging, and thermal management.  Beginning in FY13, Fire control seeker technology will be captured in the Sustainment, Simulations, Launchers, and Fire Control Systems effort below."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.962"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began to address thermal issues for affordable phased array seeker technologies; continued optimization of phased array seeker operating power levels; began integration of affordable phased array technologies to demonstrate a seeker array with appropriate power levels and in a form factor for missile applications; continued design of the next-generation imaging seeker components including technologies for thermal loading reduction to minimize cool-down time and significantly reduce the cost of infrared seekers; evaluated missile system health monitor performance in a relevant environment; designed reconfigurable Synthetic Aperture Radar (SAR) evaluation test-bed for demonstration of tactical missile applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.525"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Address thermal issues for phased array seekers; optimize operating power levels; integrate components into seeker sub-arrays; design, fabricate, and demonstrate lower cost imaging infrared seekers with advanced cooling technologies; design and fabricate an autonomous radar frequency seeker for miniature guided munitions and evaluate in a laboratory; fabricate evaluation test-bed to demonstrate radio frequency seekers in tactical missile applications; design algorithms to improve image processing, tracking, and handover from air platform capabilities for missile seekers; and evaluate nanotechnology for power storage, sensors, and guidance in small guided munitions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.860"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.860"
                                            },
                                            "Text": {
                                                "val": "Will integrate and demonstrate sub-components for beam steering, power generation, and thermal management of phased array seeker designs; develop, integrate, and evaluate affordable phased array seeker solutions that enable all-weather operation; complete fabrication and integration of seeker components for very small interceptors to counter unmanned aviation systems (UAS) and integration into reduced-weight weapons to arm small U.S. UAS designs; characterize and field-test novel infra-red camera microcooler technology with performance comparable to current uncooled seekers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Guidance, Navigation and Controls Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates and evaluates guidance, navigation, and control systems and software, as well as information and signal processing systems for rocket and missile applications. Goals of this effort include more affordable missile guidance; miniaturization of guidance electronics; maintaining performance in global positioning system denied environments; improved image processing; improved missile power systems; improved communication with ground and other systems; technologies to track and respond to swarms of incoming and outgoing munitions; and electrical connections embedded in missile structures. Beginning in FY13, the Structural Electronics effort below will be included in this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.272"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated image gyro system hardware and software for captive flight demonstration; completed laboratory and limited environmental evaluation of a one-piece, integrated optical data pipe module; designed enhanced miniaturized image stabilization hardware module for transition to the Small Organic Precision Munition effort in PE 0603313 Project 263; investigated technologies for increased accuracy and precision of acceleration measurements for navigation in a Global Positioning System denied environment; and completed data combination for infrared and millimeter wave multi-mode seeker algorithm development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.052"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate and demonstrate the image gyro navigation solution for image based navigation; continue design of an enhanced miniaturized image stabilization and tracker hardware module; evaluate reduced size, weight, and power inertial navigation systems with increased accuracy and guidance technologies to reduce reliance on global positioning system for missiles; and continue to design and develop structural electronics in missile subsystems and apply to the missile as a whole."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.745"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.745"
                                            },
                                            "Text": {
                                                "val": "Will continue the design, development, integration and evaluation of high-precision inertial components and systems that allow faster\/higher-accuracy positional alignment of far target location systems, and missile navigation in environments of high dynamic-maneuvers as well as environments where reliance on the Global Positioning System (GPS) cannot be assured; develop and evaluate emerging low-cost terrain\/stellar navigation technologies (including algorithms) for application to precision long-range stand-off fires that have the capability to operate in an environment where reliance on the GPS is not assured; design, and evaluate second-iteration embedded structural electronics that enable smaller, lower-cost airframe designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Sustainment, Simulations, Launchers, and Fire Control Systems"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates advanced health monitoring technologies to increase missile useful life; advanced simulations to increase performance and reduce size, weight, and cost in missile systems; launchers to deliver effects from the air and ground platforms; and fire control systems for area protection and air defense.  Beginning in FY13, Fire Control efforts from the Missile Seeker Technologies will be captured in this effort and the Missile Aerodynamics efforts will be presented in the Missile Propulsion, Structures, Lethality, and Aerodynamic Technology section below."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.995"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed aerodynamic prediction codes for hypersonic flight, dynamic damping derivatives prediction methods, airfoil section enhancements, and inlet aerodynamics; designed an integrated baseline system engineering tool for system-level simulations linking missile component models to system capability; designed and evaluated health monitoring technologies for current and future missile systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of integrated missile design tool for system-level analysis; design, evaluate, and demonstrate next generation of health monitoring technologies for current fielded applications and future missile system needs; analyze advanced interfaces between launcher and weapon to provide more targeting information to the missile; design and demonstrate small signature, slow air target classification algorithms for fire control radars; and integrate and demonstrate a state-of-the-art, affordable active electronically steered aperture architecture with enhanced target range and classification into a radar test bed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.398"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.398"
                                            },
                                            "Text": {
                                                "val": "Will develop application-ready missile health monitoring technologies for shelf-life sensing of high-payoff components that improves the quality and quantity of missile health source data, reduces missile sustainment costs, and increases readiness; further develop the Non Cooperative Target combat identification algorithms and integrate into air defense radars; evaluate and quantify performance of Electronic Steered Arrays for air defense radars."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Propulsion, Structures, Lethality, and Aerodynamic Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates, evaluates, and demonstrates missile enabling technologies including:  advanced missile propulsion with reduced launch signatures; increased lethality and range of lethality options; improved structural integrity of light weight missile cases; and beginning in FY13, increased understanding of missile aerodynamic interactions previously captured under the High Fidelity Simulation effort above."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.112"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated high performance propellants; performed signature evaluations of current Army ignition materials as a baseline for the signature metrics; and developed, screened for sensitivity, and characterized candidate ignition materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.239"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Formulate, synthesize, and evaluate higher performance energetic materials for minimum smoke missile propulsion while improving insensitive munitions performance; design, fabricate, and evaluate lightweight thermal barriers for next generation extended range propulsion systems; evaluate and simulate the integration of first iteration variable effects warhead in a missile system form factor; evaluate energetic technologies to enable effects against electronic devices; continue design, fabrication, and evaluation of composite structural components for missile systems and their launchers; continue to design simulations to evaluate high speed missile aerodynamics and separation effects of missiles on weaponized unmanned aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.158"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.158"
                                            },
                                            "Text": {
                                                "val": "Will fully characterize the most promising minimum-signature propellants with enhanced cold temperature strain capability that can be used in operational-environment temperature extremes encountered by unmanned aviation systems; based on the testing in FY13, conduct static tests of advanced thermal barriers for pulsed-motors; design novel ignition systems that reduce propulsion system ignition delay and increase the energy release efficiency; continue rocket motor survivability\/reliability assessments and prediction modeling; evaluate high performance compact warhead designs in collaboration with the Armaments Research, Development, and Engineering Center."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Role Missile Technology"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates critical technology and designs component for future affordable rockets and missiles to provide overwhelming defeat of conventional and asymmetrical threats in all environments.  Beginning in FY13, the Swarming Missiles Technologies effort below will be captured here. Successful technologies are matured and demonstrated in PE 603313A Project 263."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.647"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate components and subsystem technologies including: 1) miniaturized and reduced cost guidance electronics, seekers, and sensors; 2) more efficient and insensitive munitions compliant propulsion systems for small guided munitions; 3) warhead integration for effects against diverse targets; and 4) fire control using hardware-in-the-loop evaluation, live-fire evaluation, and, appropriate test-beds to determine component and subsystem performance as well as suitability to various missions; and continue trade studies to optimize component, subsystem, and system design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform system and component level trade studies to design a long range missile; design and evaluate modular components for a lightweight missile system with multiple configurations launched from manned and unmanned aircraft, and refine the design of the lightweight air launched missile based on evaluation of critical components and begin integration for a system-level demonstration; and design and evaluate guidance and tracking algorithms as well as sensor technology to support attack of a large array of targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.039"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.039"
                                            },
                                            "Text": {
                                                "val": "Will continue identification of critical component technology for next-generation air defense and long-range fires systems, conduct component performance trade studies and begin the component designs, conduct initial laboratory evaluations of the component technologies, and finalize an integrated system architecture; update the all-digital simulation to reflect new navigation component technology designs and propulsion energy management technologies for long-range stand-off missiles; complete evaluation of component designs for lightweight multi-role (air-to-ground\/air-to-air) missiles that can be integrated onto all sizes of unmanned aviation systems as well as manned rotary wing platforms; perform laboratory testing to determine feasibility to support attack of a larger target set."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Swarming Missile Technology"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates advanced sensors, guidance, control, and fire control components for employing low-cost swarming missile concepts against individual as well as large arrays of air and ground targets.  Beginning in FY13, this effort will be captured in Multi-Role Missile Technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.856"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalized key component technology identification based on trade studies performed; began key component technology design; began guidance and control algorithm design to support attack of large arrays of targets; evaluated options for low cost advanced sensor design for tracking of large arrays of targets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Structural Electronics"
                                    },
                                    "Description": {
                                        "val": "This effort investigates innovative processes to embed electrical connections into the missile case structure for use in smaller missile designs. Beginning in FY13, this effort is captured in Missile Guidance, Navigation, and Control Technology above."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.280"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated and evaluated sample missile electronics subsystems based on prior year results; evaluated suitability for missile system application; and documented design guidelines based on results."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Large Long Range Future Fires"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and develops technologies and performs necessary trade studies to provide the key components for maturation and demonstration for a large long range future fires missile in PE 603313A Project 263."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will develop a simulation and conduct analyses of large long-range fires propulsion system requirements; develop candidate propulsion system designs and perform trade studies to distinguish the most promising technologies; develop detailed propulsion system design(s) of the most promising technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Micro Inertial Navigation Sensor for Networked Javelin Command Launch Unit (CLU) with External Far Target Locator (FTL)"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the design, fabrication, and evaluation of reduced size, weight, and power advanced inertial sensor technology for use in highly-accurate robust targeting by a man-portable system to support Technology Enabled Capability Demonstration 2.a, Overburdened - Physical Burden."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will finalize initial design of a small, light weight, low power navigation sensor developed for robust man-portable close-combat targeting performance with on-the-move capabilities (both targeting and navigation) to include operation in environments where reliance on the Global Positioning System cannot be assured."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Unmanned Aerial Systems"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and develops technologies and performs necessary trade studies to provide the key components for maturation and demonstration of counter unmanned aerial systems missiles in PE 603313A Project 263."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.878"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.878"
                                            },
                                            "Text": {
                                                "val": "Will identify, characterize, and test effects of lethality mechanisms against potential UAS threats. Develop models based on results to predict effectiveness of lethal mechanisms against UAS.  Evaluate other components, such as power sources, tracker algorithms, and fire control for counter UAS mission."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "G05"
                    },
                    "ProjectTitle": {
                        "val": "MISSILE TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.971"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional special interest item restoring unjustified reductions for missile lethality and precision research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Missile Lethality and Precision Research"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.971"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed analysis and trade studies for emerging programs in PE 0603313A (e. g., Low Cost-Tactical Extended Range Missile and Low Cost Extended Range Air Defense interceptor); developed missile systems models, simulations, and environments for system performance analysis and assessment; recoverable, short-range air-defense interceptor live-fire testbed; conducted Hostile Fire Sensor System Technology Development and Demonstration in support of counter-battery target detection, identification, and rapid counter-fire mission execution; developed novel materials for increasing missile ballistic performance; component risk reduction for the Lethal Miniature Aerial Munition System\/Small Organic Precision Munition requirement."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}