{
    "id": "f3d1333b6c659610197b186864d5a024acea475a",
    "meta": {
        "filename": "dod-2014_RDTE_2014_AIRFORCE_V1_RDTE_MasterJustificationBook_Air_Force_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Air_Force_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602202F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Applied Research"
        },
        "R1LineItemNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "93.034"
            },
            "CurrentYear": {
                "val": "89.319"
            },
            "BudgetYearOne": {
                "val": "89.483"
            },
            "BudgetYearOneBase": {
                "val": "89.483"
            },
            "BudgetYearTwo": {
                "val": "94.584"
            },
            "BudgetYearThree": {
                "val": "99.553"
            },
            "BudgetYearFour": {
                "val": "102.529"
            },
            "BudgetYearFive": {
                "val": "101.686"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program conducts applied research in the area of airmen training, airmen system interfaces, bioeffects, deployment and sustainment of airmen in extreme environments, and understanding and shaping adversarial behavior.  The Learning and Operational Readiness project conducts research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  The Human Dynamics Evaluation project conducts research to advance information operations and intelligence operator-aiding technologies by developing and applying human-focused research to create and influence behavior signatures of existing and emerging adversaries.  The Sensory Evaluation and Decision Science project conducts research to revolutionize the manner in which the human optimizes the capabilities of Air Force systems, including remotely piloted aircraft (RPA) and adaptive teams of humans and machines.  The Performance Evaluation in Extreme Environments project conducts research to enhance human sensory, cognitive, and physical capabilities to increase airmen survivability and performance.  The Bioeffects project conducts research on the effects of human exposure to electromagnetic energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "86.663"
                },
                "CurrentYear": {
                    "val": "89.319"
                },
                "BudgetYearOne": {
                    "val": "92.192"
                },
                "BudgetYearOneBase": {
                    "val": "92.192"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "93.034"
                },
                "CurrentYear": {
                    "val": "89.319"
                },
                "BudgetYearOne": {
                    "val": "89.483"
                },
                "BudgetYearOneBase": {
                    "val": "89.483"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "6.371"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.709"
                },
                "BudgetYearOneBase": {
                    "val": "-2.709"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "7.223"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.852"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.709"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.709"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2014 is due to higher DoD priorities.\n\nReprogrammed for specific projects in accordance with Section 219 of the Duncan Hunter National Defense Authorization Act for Fiscal Year (FY) 2009, as amended by Section 2801 of the National Defense Authorization Act for FY 2010."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621123"
                    },
                    "ProjectTitle": {
                        "val": "Learning and Operational Readiness"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.790"
                        },
                        "CurrentYear": {
                            "val": "13.517"
                        },
                        "BudgetYearOne": {
                            "val": "14.480"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.480"
                        },
                        "BudgetYearTwo": {
                            "val": "16.617"
                        },
                        "BudgetYearThree": {
                            "val": "18.086"
                        },
                        "BudgetYearFour": {
                            "val": "20.913"
                        },
                        "BudgetYearFive": {
                            "val": "18.448"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  Research is conducted in two focus areas:  continuous learning and aiding and cognitive and behavioral modeling.  The continuous learning and aiding effort creates live, virtual, and constructive (LVC) environments for use in developing revolutionary simulation technologies to increase training capabilities and enhance training effectiveness and efficiency by using learning theory to improve military training and mission performance.  Cognitive and behavioral modeling creates realistic models and simulations of human behavior to advance the understanding of how people perform complex tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Research enhances Distributed Mission Operations (DMO) and LVC environments and identifies technology requirements for training in live and immersive environments.  Continuous learning\/aiding strategies improve mission training, command and control (C2), intelligence, surveillance, and reconnaissance (ISR), and cyber missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.634"
                                            },
                                            "Text": {
                                                "val": "Investigated technologies that enable accurate training across multiple security levels in LVC environments.  Developed common tools to define scenario and content compatible with different training and operational environments.  Completed validation of fidelity analysis methods and models for use in identifying alternative training and operational environment characteristics.  Developed learning management tools for use in LVC contexts.  Demonstrated mission performance-based after action review tools.  Identified key requirements for RPA personnel training.  Demonstrated persistent training and operations event tracking for individual and small team proficiency and squadron readiness assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.027"
                                            },
                                            "Text": {
                                                "val": "Develop methods to manage mission performance data across LVC contexts.  Develop technology solution tools to monitor the credibility of virtual and constructive players to augment live operational training and rehearsal.  Integrate manned and unmanned DMO systems in common training scenarios.  Develop scenarios for cyber team training in a Red Flag exercise environment.  Develop after action review and analysis tools for C2, ISR, and cyber team training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.315"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.315"
                                            },
                                            "Text": {
                                                "val": "Extend methodologies for managing learning and performance to apply across combat operations, tactical C2 and ISR teams in LVC environments.  Initiate evaluations of technologies required for a complementary family of trainers.  Evaluate rule-sets for training across multiple security levels in LVC environments.  Evaluate scenarios for integrated C2\/ISR\/cyber team training in a Red Flag exercise environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Modeling"
                                    },
                                    "Description": {
                                        "val": "Research explores application of cognitive science for performance improvement by enhancing training in mission-relevant environments (e.g., flight simulators)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.156"
                                            },
                                            "Text": {
                                                "val": "Improved human behavior representation in synthetic teammates by incorporating prediction intervals, an enhanced knowledge base, and decision heuristics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.490"
                                            },
                                            "Text": {
                                                "val": "Identify and validate mechanisms to explain and predict human cognitive performance.  Develop technologies that facilitate optimized model development for applications\/synthetic entities that are complex, dynamic, and require orders of magnitude more knowledge than traditional cognitive models for laboratory tasks.  Investigate math models of skill acquisition and vigilance as they relate to mission tasks for, but not limited to, ISR analysts, RPA operators, and pilots."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.165"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.165"
                                            },
                                            "Text": {
                                                "val": "Complete predictive performance optimization for cognitively valid readiness tracking in Air Force training.  Initiate research in mechanisms of human knowledge learning and seeking and their interaction.  Validate the ability of a first generation synthetic teammate to perform effectively in a team environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625328"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics Evaluation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.955"
                        },
                        "CurrentYear": {
                            "val": "22.467"
                        },
                        "BudgetYearOne": {
                            "val": "23.304"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.304"
                        },
                        "BudgetYearTwo": {
                            "val": "24.640"
                        },
                        "BudgetYearThree": {
                            "val": "27.167"
                        },
                        "BudgetYearFour": {
                            "val": "26.511"
                        },
                        "BudgetYearFive": {
                            "val": "27.013"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Note: In FY 2013, Measurement and Signature Intelligence (MASINT) moves from Project 627184 to Thrust 4 in this Project to better align the efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to advance machine intelligence, information operations, and operator-aiding technologies for advanced intelligence, surveillance, and reconnaissance (ISR) capabilities.  It develops and applies science and technology to detect and exploit a variety of human-centered signatures, including behavioral, nano-, bio-, and molecular aspects of existing and emerging adversaries.  Research is focused in the following areas:  human analyst augmentation, human trust and interaction, and human signatures.  The human analyst augmentation area develops, integrates, and evaluates human-centric analyst technology solutions, such as adversarial modeling and cross-cultural communication, leading to more operationally effective ISR for the Air Force.  The human trust and interaction area studies relevant human threat and vulnerability patterns in the context of everyday life and seeks to understand human interaction with autonomous systems.  The human signatures area discovers, characterizes, and integrates signature information to enable rapid and accurate human MASINT."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhance Human Cyber Operations"
                                    },
                                    "Description": {
                                        "val": "Identify methods to enhance mission-essential human capabilities for cyber operations.  Develop measures of effectiveness for cyber capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.888"
                                            },
                                            "Text": {
                                                "val": "Conducted research into enhancing cognitive cyber performance.  Developed technologies that increase situational awareness within cyber operations and researched metrics to accurately assess attacks from adversaries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Effort completed in FY 2012."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Conduct research to enhance human components of ISR.  Develop ability to anticipate, influence, and dominate adversary's air, space, and cyber ISR systems, processes, and organizations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.061"
                                            },
                                            "Text": {
                                                "val": "Developed framework and knowledge-based foundation for intelligence analysis.  Conducted studies and incorporated feedback from the intelligence community to enhance methodologies for exploiting unstructured and cognitively complex data and information."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.075"
                                            },
                                            "Text": {
                                                "val": "Develop new multi-intelligence analysis concepts and prototypes based upon analyst evaluations.  Conduct studies to evaluate new prototypes for signatures, patterns, and other exploited intelligence data to augment analysis effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.668"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.668"
                                            },
                                            "Text": {
                                                "val": "Expand multi-intelligence analysis prototypes to include autonomous systems and human performance augmentation technologies.  Provide robust situation awareness to enhance decision-makers' understanding and knowledge by improving ISR capabilities and data processing, exploitation, and dissemination."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Conduct research to develop technology base for anticipatory C2 intelligence decision support.  Conduct research in cross-cultural communications and automated speech translation tools for Air Force missions.  Develop models\/metrics to predict\/evaluate organizational effectiveness alignment and collaboration readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.280"
                                            },
                                            "Text": {
                                                "val": "Developed methods to enhance an analyst's ability to assess possible threats as a logical consequence of observed human and organizational behavior.  Began integration of cognitive modeling architectures and cultural modeling techniques to initiate framework for estimating adversary intent and possible courses of action.  Researched foreign language speech-to-speech translation applications that support automated, cross-cultural communications.  Refined and expanded advanced, automated algorithms for measures of effectiveness analyses supporting improved influence operations capabilities.  Developed methods applicable to theaters of operation that enhance warfighter situational awareness of adversarial location, intent, and predictability of hostile action.  Developed decision aid concepts to exploit operator trust between people and trust of automation.  Conducted trust-based experimentation, discourse analysis and built vulnerability modeling tools.  Completed organizational vulnerabilities research; illustrated and documented modes\/simulations that will show the impact of improved work design, engaged organizational culture and enhanced collaboration readiness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.524"
                                            },
                                            "Text": {
                                                "val": "Explore multicultural potential avenues of influence and develop adversary effects models and simulations.  Develop tools, algorithms, and techniques for rapid development of speech recognition, machine translation, and natural language processing components in new languages and domains.  Develop methods for speech recognition and translation of previously unencountered words in languages that have complex prefix and suffix structures in order to improve threat warning.  Explore methods and develop theories for quantification of trust between people and real-time metrics of human trust of automation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.306"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.306"
                                            },
                                            "Text": {
                                                "val": "Mature speech recognition and machine translation capabilities for new languages and domains.  Assess speech recognition and machine translation technologies against data sets representative of general ISR applications.  Investigate how to adapt these algorithms to evolving contexts such as changing topics.  Investigate strategies and methodologies for combing multiple algorithms simultaneously to optimize system performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Signatures"
                                    },
                                    "Description": {
                                        "val": "Develop databases of human motion and features collected from air\/space platforms.  Identify human threat signatures across diverse populations for ISR and force protection applications.  Conduct surveillance and counterproliferation research to support detection, identification, and assessment of threat agents in support of Air Force operational missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.726"
                                            },
                                            "Text": {
                                                "val": "Initiated 3-D human activity replication using 3-D human models.  Developed a human motion repository to identify human threat and performance signatures.  Developed tools for image analyst training that identify and visualize critical threat indicating signatures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.868"
                                            },
                                            "Text": {
                                                "val": "Develop architectures for machine-intelligent biofidelic human threat models.  Develop human motion\/shape information system and online analytic tools for automatic detection and tracking of humans, discernment of gender, and detection of human shape anomalies.  Develop nano-bio technologies and sensor components to detect target molecules of interest in the operational environment.  Develop analysis tools to identify and track molecular-based threat signatures.  Characterize and exploit human signatures to perform ISR mission tagging, tracking, and locating of threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.330"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.330"
                                            },
                                            "Text": {
                                                "val": "Develop tools for the ISR analyst and special operations forces to detect and characterize human signatures in multiple sensing modalities from multiple platforms for human threat situational awareness.  Develop tools for ISR applications to detect and characterize molecular signatures for increased threat detection in an operational environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625329"
                    },
                    "ProjectTitle": {
                        "val": "Sensory Evaluation and Decision Science"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.118"
                        },
                        "CurrentYear": {
                            "val": "32.037"
                        },
                        "BudgetYearOne": {
                            "val": "28.861"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.861"
                        },
                        "BudgetYearTwo": {
                            "val": "30.192"
                        },
                        "BudgetYearThree": {
                            "val": "30.038"
                        },
                        "BudgetYearFour": {
                            "val": "30.339"
                        },
                        "BudgetYearFive": {
                            "val": "30.964"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to revolutionize the manner in which the human optimizes the capabilities of Air Force systems, including RPA and adaptive teams of humans and machines.  Research optimizes human situational awareness and cognitive performance, improves the human-machine interface, and seamlessly integrates warfighters with their weapon systems across air, space, and cyber domains.  Research is conducted in four focus areas:  applied neuroscience; human role in semiautonomous systems; battlespace visualization; and battlespace acoustics.  The applied neuroscience area develops technologies to enhance human-human and human-machine collaborations and system interactions in distributed decision-making environments.  The human role in semiautonomous systems area develops new control\/display concepts and technologies to optimize Air Force platform capabilities.  The battlespace visualization area advances the science and technology associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making.  The battlespace acoustics area researches human-human and human-machine communications to exploit the use of voice and acoustic data in collaborative, net-centric environments while accounting for the effects of acoustic propagation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Develops technologies to enhance human performance, human-human and human-machine collaboration, and system interaction in distributed decision-making environments.  Predicts physiological impacts of high-stress\/extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.805"
                                            },
                                            "Text": {
                                                "val": "Developed team functional state assessment criteria and characterized context dependent methodologies for assessing the cognitive functional state of teams.  Explored algorithm utility for assessing real-time team functional state in distributed operations.  Evaluated ability to capture team functional state assessments to enhance collaboration and team decision-making.  Developed adaptive interface algorithms for operator decision aiding.  Defined stressor-influenced mechanisms for developing strategies to optimize cognitive readiness and to influence performance in theater.  Targeted specific biological, behavioral, and physical metrics and markers for defining mechanisms that improve cognitive performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.887"
                                            },
                                            "Text": {
                                                "val": "Explore the development of trust metrics that can be used to design and enable trust automation for operators.  Develop the framework for modeling physiological and behavioral workload on the human operator.  Develop adaptive algorithms for workload management and mitigation.  Evaluate utility of workload assessment tool for teams.  Investigate potential tools for enhancing warfighter cognitive resiliency and performance through the manipulation of intrinsic biological and physiological mechanisms and processes.  Define metrics and biomarkers of resiliency and performance that can be integrated into these tools for sensing and assessing cognitive state.  Develop physiology modeling and sensing capability to measure stress parameters and predict physiological impacts of high-stress\/extreme environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.133"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.133"
                                            },
                                            "Text": {
                                                "val": "Begin examining new sense, assess, and augmentation technologies to provide adaptive aiding based on warfighter performance.  Validate team workload and trust measures to enhance effective human-human and human-machine system performance.  Define team synchronicity and cognitive functional state metrics that aid team performance.  Research stress-driven processes and their effects on human performance.  Explore psychological and neurophysiological mechanisms and processes for developing unique operational strategies that enhance cognitive resiliency and performance.  Continue to develop physiology models to predict the effects of high-stress\/extreme environments on the human.  Begin investigating interface technologies and exposure design criteria to protect operators and mitigate injury and performance risks.  Begin development of on-board oxygen generating technologies to mitigate hypoxia vulnerability risks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Research new control\/display concepts and technologies (e.g., information portrayal, control devices, decision-aiding algorithms).  Identify best design to direct operator attention."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.422"
                                            },
                                            "Text": {
                                                "val": "Explored flexible automation techniques and transitions to enable a human operator to intervene at various levels with autonomous systems.  Developed methods to quickly and easily ascertain the status\/intent of complex automation.  Designed and evaluated methods and interfaces to support distributed, ubiquitous unmanned system control of many heterogeneous systems.  Investigated combined spatial and temporal displays for proactive management of multiple semiautonomous assets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.921"
                                            },
                                            "Text": {
                                                "val": "Identify human operator-RPA automation interaction technologies and techniques that will provide increased situational awareness while exercising supervisory control of multiple RPAs.  Investigate and develop course-of-action tools, displays, and system software architectures that will support an operator's choice between several courses of action.  Explore the use of adaptive automation for teams of RPAs\/RPA operators to enable real-time situational awareness of human and vehicle states.  Develop an agent information architecture that responds to RPA pilot information queries by gathering, fusing and presenting information from on- and off-board sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.269"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.269"
                                            },
                                            "Text": {
                                                "val": "Investigate various automation technologies for the command and control of multiple RPAs.  Examine the interplay between automation technologies and various tools to enable choices between courses of action.  Evaluate advanced visualizations concepts and interaction methods for managing information from on-board and off-board sources to support RPA operator decision-making.  Begin developing adjustable, adaptive levels of automation to support flexible control of unmanned systems depending on mission and environmental context."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Visualization"
                                    },
                                    "Description": {
                                        "val": "Advances science and technology associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.281"
                                            },
                                            "Text": {
                                                "val": "Explored vision enhancement techniques for fusing multisource data to facilitate decision-making.  Developed interactive visualizations for displaying and analyzing multisource information to improve situational awareness.  Investigated visual analytics to optimally represent relevant information from large and disparate data sets.  Developed initial visualizations to represent and analyze large amounts of data to increase human performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.306"
                                            },
                                            "Text": {
                                                "val": "Assess human perception and performance of fused, multisource information.  Develop visualizations using visual analytics for representing information from large, disparate data sets.  Extend visualization techniques to three-dimensional (3-D) displays.  Assess the effectiveness of interactive visualizations to augment human operator situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.156"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.156"
                                            },
                                            "Text": {
                                                "val": "Develop a suite of image enhancement and fusion tools based on human perception and performance.  Begin the design and evaluation of visualizations based on visual analytics to represent and visualize relevant information from large, disparate data sets.  Assess application of visual analytics to various warfighting domains.  Evaluate the effectiveness of using 3-D displays to augment human decision-making and situational awareness.  Evaluate the use of various interaction devices, when interacting with visualizations, to determine their effectiveness in aiding human performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Conducts research on advanced auditory and communication technologies that mitigate effects of noise and enhance performance in operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.610"
                                            },
                                            "Text": {
                                                "val": "Explored the application of multi-modal digital communication technologies to enhance speech intelligibility, communication effectiveness, and situational awareness in communication-intense military environments.  Explored the use of accelerated speech to enhance situational awareness and communication effectiveness.  Assessed integration of graphical images with speech and text communication to enhance operator situational awareness and understanding.  Evaluated and monitored operator stress and workload using verbal communication signals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.923"
                                            },
                                            "Text": {
                                                "val": "Explore how best to use multi-modal and networked communications to fight through cyber attacks in defensive cyber operations with a focus on the human interface.  Investigate human interface concepts that disrupt communication effectiveness across networked command and control teams for offensive cyber operations.  Explore the use of advanced multi-modal interfaces to aid combat search and rescue teams in simulated scenarios.  Assess the effectiveness of spatial audio display concepts combined with vibro-tactile displays and enhanced visual displays to augment individual and team performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.303"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.303"
                                            },
                                            "Text": {
                                                "val": "Develop auditory interfaces to enable the human operator to respond to cyber attacks. Develop interface concepts for using multi-modal displays and visualizations to support combat search and rescue teams.  Examine the effectiveness of audio displays combined with multi-modal interaction techniques to support human operator decisionmaking."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627184"
                    },
                    "ProjectTitle": {
                        "val": "Performance Evaluation in Extreme Environments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.413"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research focused on biotechnology for the detection, identification, monitoring, and neutralization of biological threat agents."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Counterproliferation"
                                    },
                                    "Description": {
                                        "val": "Conduct surveillance and counterproliferation research to support detection, identification, and assessment of threat agents in support of Air Force operational missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.413"
                                            },
                                            "Text": {
                                                "val": "Developed and incorporated bioinspired nanoparticle taggants for enhanced warfighter counterproliferation capability during operational missions. Identified biological markers that indicate that individuals have handled, transported, or manipulated weapons of mass destruction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2013, the effort in this Project moves into Project 625328 to better align efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627757"
                    },
                    "ProjectTitle": {
                        "val": "Bioeffects"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.758"
                        },
                        "CurrentYear": {
                            "val": "21.298"
                        },
                        "BudgetYearOne": {
                            "val": "22.838"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.838"
                        },
                        "BudgetYearTwo": {
                            "val": "23.135"
                        },
                        "BudgetYearThree": {
                            "val": "24.262"
                        },
                        "BudgetYearFour": {
                            "val": "24.766"
                        },
                        "BudgetYearFive": {
                            "val": "25.261"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on the effects of human exposure to nanomaterials, electromagnetic (EM) energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons.  This research addresses fundamental physical principles, as well as the psychophysical interaction between directed energy and the individual or groups of individuals.  Research is divided into three core focus areas:  optical radiation bioeffects; radio frequency radiation (RFR) bioeffects; and molecular bioeffects.  Optical radiation bioeffects research enhances combat survivability and systems effectiveness through technologies that enable deployed forces to counter optical threats and exploit optical systems for offensive applications.  The RFR bioeffects research investigates basic biological mechanisms of RFR, conducts theoretical and empirical dosimetry, conducts research of bioeffects from short- and long-term exposures, develops methods to counter RFR threats, and performs research for exploitation of directed energy systems for offensive capabilities.  Molecular bioeffects research is conducted to protect airmen from the effects of toxic chemicals and materials and to monitor and enhance cognitive and physiological performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research on laser bioeffects, enabling military exploitation of laser technology while providing countermeasures for optical hazards\/threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.054"
                                            },
                                            "Text": {
                                                "val": "Initiated development of tools to assess collateral high energy laser hazards using probabilistic techniques.  Develop new models and techniques for assessing vision effects from laser eye protection.  Assessed human factors integration of laser eye protection with visor, helmet, and advanced cockpit designs.  Researched advanced designs of personal protection in high energy, directed energy weapons hazard zones."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.128"
                                            },
                                            "Text": {
                                                "val": "Develop high power probabilistic range safety tools for predicting eye and skin hazard zones from high energy laser weapon systems.  Develop models and methods for unique approaches using optical radiation for future weapon systems with scalable, disruptive, and ultra-precise effects.  Develop parameters for optimizing laser vision effect models for advanced laser eye protection models and non-lethal weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.417"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.417"
                                            },
                                            "Text": {
                                                "val": "Integrate operational tasks into laser vision effects models to identify impacts to human operators.  Explore daytime dazzling effects via multiple wavelength stimulation in human subjects.  Enhance dose-response models to support risk-based hazard analysis for low power probabilistic laser safety tools.  Expand models and methods for application to unique approaches for using optical radiation for future weapon systems with scalable, disruptive, and ultra-precise effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research to enable safe exploitation of directed energy technologies for communication, target identification, and weapons development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.388"
                                            },
                                            "Text": {
                                                "val": "Conducted EM radiation bioeffects research in support of national and international safety standards.  Conducted biological studies of advanced directed energy weapon concepts.  Conducted physiological and behavioral research to support scalable directed energy weapon capabilities.  Developed scalable RFR effects models based on theoretical and experimental physics.  Assessed bioeffects of combined directed energy sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.111"
                                            },
                                            "Text": {
                                                "val": "Integrate basic mechanisms of interactions between biology and RFR for validation of bioeffects models from ultra-short, high-peak power, RF systems.  Investigate terahertz (THz) radiation effects on cells and tissues and improve bioeffects models for exposure.  Initiate proposals for refined exposure standards for THz radiation.  Assess combined biological effects from multiple, combined directed energy sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.302"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.302"
                                            },
                                            "Text": {
                                                "val": "Conduct empirical laboratory tests on the human behavioral response to combined effects of directed energy sources.  Initiate validation of high-peak power exposure models.  Incorporate THz exposure test results into THz exposure standards and whole-body exposure models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Molecular Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct studies to assess human responses to non-lethal weapons and effects\/risks of these weapons.  Conduct bio\/nanotechnology research to advance warfighter performance.  Leverage toxicological\/biological data to improve human performance and decision-making abilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.316"
                                            },
                                            "Text": {
                                                "val": "Developed a quantitative framework for relating directed energy and scalable novel-effects technologies (including non-lethal and escalation of force weapons) to operationally-relevant outcomes via research on physiological and psychological human effects.  Established a database containing behavioral effectiveness and risk of injury information under operational conditions to facilitate coordination among operators, researchers, and weapon acquisition professionals.  Developed methodology to quantify behavioral effectiveness (e.g., sensory, cognitive, motor) across the range of directed energy and scalable novel-effects technologies.  Developed methodology to quantify the risk of injury (e.g., reversible, irreversible) across the range of non-lethal and escalation of force weapons.  Pursued advanced analysis of new and emerging nanomaterials and biofuels of Air Force interest.  Validated molecular markers in specific cognitive and physiological pathways that impact human performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.059"
                                            },
                                            "Text": {
                                                "val": "Expand the quantitative framework for relating directed energy and scalable novel-effects technologies to operationally relevant mission outcomes.  Expand the knowledge base of behavioral effectiveness and risk of injury under operational conditions to facilitate non-lethal weapons wargaming and acquisition.  Advance toxicity and nanotoxicity research; investigate\/establish toxicity impacts to the body of advanced fuels, materials, and chemicals used to support existing and future weapon systems.  Define and pursue modulation of major cell pathways affecting cognition using in vitro and in vivo models and modeling."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.119"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.119"
                                            },
                                            "Text": {
                                                "val": "Evaluate the quantitative framework for relating novel-effects technologies to operationally relevant mission outcomes.  Conduct research to define toxicity issues in current and future aircraft environments.  Begin development of models incorporating toxicity data and mechanisms of action to inform sensor development and development of hazard protection.  Conduct research to elucidate novel mechanisms of fundamental interaction of nanomaterials in a biological system.  Begin development of a new prototype of non-traditional effects of nanomaterials under the influence of incidental EM fields."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}