{
    "id": "f4e197c951ce08ed2fb5eaa6d266e7fdd2f62d30",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA3_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603004A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Advanced Technology"
        },
        "R1LineItemNumber": {
            "val": "32"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "75.607"
            },
            "CurrentYear": {
                "val": "67.613"
            },
            "BudgetYearOne": {
                "val": "63.919"
            },
            "BudgetYearOneBase": {
                "val": "63.919"
            },
            "BudgetYearTwo": {
                "val": "64.767"
            },
            "BudgetYearThree": {
                "val": "49.470"
            },
            "BudgetYearFour": {
                "val": "64.569"
            },
            "BudgetYearFive": {
                "val": "65.795"
            }
        },
        "ProgramElementNote": {
            "val": "FY14 reduced for higher priority efforts"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures weapons and munitions components\/subsystems and demonstrates lethal and non-lethal weapons and munitions with potential to increase force application and force protection capabilities across the spectrum of operations.  The weapons and munitions include artillery, mortars, medium caliber, tank fired, and shoulder fired. Project 232 focuses on affordable delivery of scalable (lethal to non-lethal) effects.  Project L96 matures and integrates critical high energy laser subsystems into a mobile demonstrator to explore and validate system performance in relevant environments.   Project L97demonstrates performance of advanced obscurants and delivery of mechanisms and conducts forensic analysis of explosives and hazardous materials to enable detection by Soldier and Small Units.  \n\nWork in this PE is related to, and fully coordinated with, PE 0602120A (Sensors and Electronic Survivability), PE 0602307A (Advanced Weapons Technology),  PE 0602618A (Ballistics Technology), PE 0602622A (Chemical, Smoke, and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602772A (Advanced Tactical Computer Science and Sensor Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology), and PE 0603313A (Missile and Rocket Advanced Technology).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n  \n\nWork in this PE is performed by the Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ; Edgewood Chemical Biological Center (ECBC), Edgewood, MD; and the U.S. Army Space and Missile Defense Center (SMDC), Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "76.955"
                },
                "CurrentYear": {
                    "val": "67.613"
                },
                "BudgetYearOne": {
                    "val": "76.236"
                },
                "BudgetYearOneBase": {
                    "val": "76.236"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "75.607"
                },
                "CurrentYear": {
                    "val": "67.613"
                },
                "BudgetYearOne": {
                    "val": "63.919"
                },
                "BudgetYearOneBase": {
                    "val": "63.919"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.348"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-12.317"
                },
                "BudgetYearOneBase": {
                    "val": "-12.317"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.635"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.983"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-12.317"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.317"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "232"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Lethality & Survivability Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "53.446"
                        },
                        "CurrentYear": {
                            "val": "50.578"
                        },
                        "BudgetYearOne": {
                            "val": "46.668"
                        },
                        "BudgetYearOneBase": {
                            "val": "46.668"
                        },
                        "BudgetYearTwo": {
                            "val": "46.396"
                        },
                        "BudgetYearThree": {
                            "val": "33.387"
                        },
                        "BudgetYearFour": {
                            "val": "42.674"
                        },
                        "BudgetYearFive": {
                            "val": "43.914"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates enabling technologies for affordable precision lethal and non-lethal weapons and munitions.  Technologies include advanced energetic materials, insensitive munitions, novel fuze designs, penetrators, scalable effects and pulsed laser and millimeter wave sources for  high power microwave (HPM) systems.\n\nWork in this PE is related to, and fully coordinated with, PE 0602120A (Sensors and Electronic Survivability), PE 0602307A (Advanced Weapons Technology), PE 0602618A (Ballistics Technology), PE 0602622A (Chemical, Smoke, and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602772A (Advanced Tactical Computer Science and Sensor Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology), and PE 0603313A (Missile and Rocket Advanced Technology).\n   \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nEfforts in this project support the Ground domain portfolio.\n\nWork in this project is performed by the Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Based Networked Munitions Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort provides follow-on technology advancement to ground based munitions systems currently being developed with improved capabilities.  This includes an autonomous non-lethal response system. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection Basing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.951"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated imagery and image processor, in a translucent protective container with Spider Munition Control Unit (MCU), for TRL 6 demonstration; incorporated the low collateral SD technology into a representative Scorpion System and concluded it with a final TRL 6 test\/demonstration;  demonstrated the disposable radio repeater technology to maintain and regain signal from the Spider to the hand held device during the TRL 6 testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.388"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.388"
                                            },
                                            "Text": {
                                                "val": "Will mature autonomous Non-Lethal Alert technology for personnel detection\/discrimination that was previously developed with improved communications and decreased size and weight to better support the base protection mission; will optimize non-lethal effects package for Autonomous Non-Lethal Alert to provide enhanced force protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operationally Adaptable Effects"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY13, this effort utilizes the technologies demonstrated in Scalable Effect Weapons and Munitions System, which ended in FY11, to enable the defeat of a wide range of threats and provide scalable capabilities to engage ground targets and aerial threats, prevent fratricide and minimize collateral damage."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.904"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and fabricate variable yield unitary warhead that uses reactive materials, preformed fragmenting composite casing and dual purpose energetics to demonstrate improved scalable lethal and non-lethal effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tunable Pyrotechnics"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates smoke and flare countermeasure for passive protection for ground and air combat platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.897"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated performance of advanced countermeasure flares through captive seeker flight testing and demonstrated performance of the pyrotechnic portion of the pocket hand-held signal with respect to the color given off and its illumination intensity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.993"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and validate performance of ultraviolet, laser beam rider, and imaging seeker counter measures;  subsequently validate performance using flares through flight testing; compare results to modeling and simulation studies and use derived information to advance computer modeling and simulation capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Area Protection and Survivability (EAPS)"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the use of command-guided medium caliber projectiles for the interception and destruction of incoming rockets, artillery, and mortar rounds (RAM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.701"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated developed gun system with optimized ammunition to provide salvo firing capability; validate fire control software and integration into gun system; verified optimized warhead performance; assessed software and firmware improvements to track, divert and initiate the warhead of multiple targets simultaneously."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.493"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate the ability to track, command maneuver, and command detonate multiple in-flight projectiles against RAM targets and improve software based on flight results."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.019"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.019"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate integrated system of radar, command guided interceptors, and auto cannon by a defeat of a statically placed threat munitions; will also demonstrate performance requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Operations in Urban Terrain (MOUT)\/Urban Lethal Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the next generation of explosive wall breaching and shoulder launched weapon warhead technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.694"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated optimized flight projectile, fire from enclosure (from cover) propulsion and light weight composite launcher; optimized system against requirements; demonstrated integrated system capability; and validated system capability against target set."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Lethality Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates novel penetrator designs (without using depleted uranium (DU)), as well as alternative lethal mechanisms to maintain or exceed tank main gun performance against multiple target types into the future."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.653"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimized and validated tactical size KE penetrator against actual range targets;  provided lethality maps for modeling and simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate several full-up KE rounds with selected novel penetrator and demonstrate lethality performance meets modeling and simulation predictions and range objectives in an instrumented range; design based on results, refine design and prepare additional testing on range and simulated operational environment, i.e., fired from a tank."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.175"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.175"
                                            },
                                            "Text": {
                                                "val": "Will build\/procure hardware components, assemble cartridges, and conduct functional and armor tests leading to techonology demo.  Will conduct technology demonstration (120 mm ballistic testing through all temperatures); will analyze test data: will provide test results to PM-MAS to determine if the Army needs to continue DU production."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dual-Use Improved Conventional Munitions (DPICM) Replacement Acceleration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates ultra high reliability fuzing, advanced kill mechanisms, and alternative dispensing technologies to provide increased battlefield lethality with reduced unexploded ordnance (UXO) compliant with current DoD cluster munitions policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.005"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated fuze reliability through static and ballistic testing;  optimized warhead design based on feedback and  used input to validate systems effectiveness modeling."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.977"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete warhead insensitive munition tests, producibility studies and final static arena tests validating system lethality; conduct instrumented ballistic firings and dispersion verification tests of finalized dispense\/stabilizer designs;  build optimized fuze technology demonstrator and conduct evaluation testing;  finalize submunition baseline, build demonstrator and conduct final 155mm integrated ballistic demonstration validating demonstrator."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.035"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.035"
                                            },
                                            "Text": {
                                                "val": "Will perform TRL6 demonstration on complete system which will consist of two major tests - a static arena test on the warhead and a ballistic demonstration test;  the static arena test will provide data on the effectiveness of the round which will then be used to validate that the system meets the lethality requirements;  the ballistic demonstration test will show the performance of the system in a representative environment and show the improvement in reliability over traditional DPICM."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced medium caliber rounds, weapon and ammunition handling systems optimized for remote operation.  This effort addresses multiple warfighter capability gaps including super high elevation engagement, high performance stabilization, remote ammunition loading, weapon safety and reliability, improved lethality, accuracy, and the ability to fire a suite of ammunition from non-lethal to highly lethal, to provide escalation of force capability in one system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.719"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Built advanced prototypes using mature system dynamic models to optimize system precision, accuracy, reliability and lethality against new and existing target sets, with new munitions and weapon enhancements; matured remaining system dynamics models; utilized systems engineering to optimize components maturation efforts for maximum return on investments and performance; demonstrated scalable lethality effects leveraging non-lethal  munition technologies; conducted live fire demonstrations in Mann barrels (test barrels designed to isolate munitions characteristics) and advanced medium and remote small caliber rounds, weapons, as well as ammunitions system prototypes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.408"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate air burst munition and armament to validate accuracy; conduct analysis to model accuracy performance and optimize air burst munition; mature air burst munition; optimize performance of onboard fuze and fuze setter for programmable airburst munition;  provide interface control documents for weapon, ammunition handling system and air burst munition; optimize fire control software for scenario based touch screen user interface; mature fire control system with downrange wind sensor, dynamic meteorological, environmental, temperature (MET ) sensor and improved laser ranging;  continue with the maturation phase of remote weapon station to reach a higher level of ruggedness and reliability; optimize the control system; improve the operator control interface;  conduct extended system level cycling tests; mature weapon and ammo handling\/turret cycling tests to determine system reliability and effectiveness; demonstrate remote weapon station capabilities using both lethal and non lethal ammunition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.051"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.051"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate and mature the turret control system in preparation for the integration of the weapon, ammunition handling system and fire control sensor enhancements within a Bradley fighting vehicle; demonstrate system level optimized performance capabilities of a 30mm weapon platform; optimize and down select the appropriate air bursting fuze technologies for the integration within the 50mm air bursting cartridge; continue to mature and improve the fire control target based user interface software as well as continue to develop and optimize the design of the 50mm Bushmaster III gun."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Remote\/Robotic Armament System (ARAS)"
                                    },
                                    "Description": {
                                        "val": "This effort provides advanced remote armaments with scalable effects from non-lethal to lethal engagements. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection – Basing.\nNote: Prior to FY14, this effort was combined with Medium Caliber Weapon Systems above."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.006"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.006"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate ARAS software\/electronics controls and validate\/improve mechanical subsystems to ensure they meet all design specifications which will mitigate risks associated with obtaining an Army Test and Evaluation Command (ATEC) limited safety release which is essential for the capstone demonstration; also, in preparation of ATEC testing, generation of a Safety Assessment Report (SAR) and other pre-ATEC activities will be performed"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Power and Energy Management for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the technology options available to provide the next generation of gun fired smart munitions, with advanced fuzing and power components for improved performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.747"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated technologies for reserve batteries that use methods to integrate energy storage with new architectures that have superior characteristics for energy management; matured electrochemical architectures which were miniaturized for integration into semiconductor devices capable to scale up into standard reserve cell to power munitions systems; demonstrated novel methods and techniques designed to reduce the power consumption of advanced gun fired smart munitions, as well as advanced technology to develop future generation of energy harvesters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.119"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate fabricate technologies for gravity sensor, and perform small scale environmental testing; for proximity sensor,  design necessary components and integrate into preliminary sensor, and  conduct performance tests in lab environment; for multi-point initiation,  create breadboard multi-point system based on artillery application, testing control circuitry and simultaneity;  fabricate demonstration millimeters thin lithium- ion batteries and demonstrate environmental robustness; mature supercapacitor for munition application and fabricate for bench and environmental evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.247"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.247"
                                            },
                                            "Text": {
                                                "val": "For multi-point initiation, will demonstrate a distributed four point initiation system in a future warhead application that is capable of achieving simultaneity between points and selectable control; for proximity sensor, will demonstrate improved range extraction and enhanced countermeasure protections through ballistic testing; for impact switch, will mature and demonstrate a microelectricalmechanical system (MEMS) based impact switch that has multi-level sensing capability against varying targets; for thin film thermal batteries, will mature and demonstrate a thin film heat source integrated into existing thin film battery; for super capacitor, will demonstrate robustness of design through environmental and ballistic testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scale-up of Energetic Materials"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the performance and insensitivity of energetic materials in medium caliber (direct fire) and large cal (indirect fire) weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed propulsion system as well as explosive warhead performance improvements against most critical current and projected threat targets;  fabricated and bench tested improved energetic materials in tactical quantities and configurations to evaluate performance improvements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.948"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate insensitive materials of interest for augmenting lethality; scale up and formulate nano energetics for increased performance; scale up organic compounds based explosives to augment energy and lethality outcomes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.819"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.819"
                                            },
                                            "Text": {
                                                "val": "Will scale-up and formulate newly synthesized ingredients for lethality and insensitive munition (IM) benefits; will optimize propellant formulations for various applications of interest for extended range; will prototype novel propulsion system concepts; will perform live fire and performance testing for nano pressed explosives; will conduct IM insult testing on XM1128 projectile; will perform IM testing on compatible IM detonation trains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Countermeasure (CCM) Technology Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the continued effectiveness of US weapon systems and ammunition against current and projected enemy countermeasures, including conventional and classified threats and unexploded ordnance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.345"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted performance assessment of counter countermeasure technologies for application to prioritize weapon systems with the most critical need; conduct system trade studies; fabricated surrogates to evaluate improvements; and assessed technologies for application to Army unique needs for mitigation of unexploded ordnance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.737"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate CCM technologies that optimize performance against threats, e.g. novel anti-armor weapon systems to defeat Active Protection Systems protected platforms; mature technology to reduce mounted soldier vulnerability by decreasing time on target."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lethality Efforts"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates several advanced lethality efforts, including weaponization of a robotic armed vehicle, air burst fuzing technology to enhance lethality against personnel in defilade, next generation kinetic energy penetrators, improved interception of Kinetic Energy Active Protection System projectiles, and increased lethality for medium caliber technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.934"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated enabling technologies, tactically relevant to the Kinetic Energy Active Protection System, and its subsystems to increase the battlefield lethality\/survivability; demonstrated technologies for longer range artillery systems by optimizing alternative launch mechanisms for indirect fire extended range; demonstrated technologies for sensor-fused munitions for anti-armor and area defense capability; demonstrated technologies for improving precision that extended beyond existing ranges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.439"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature existing weapon platform and fire control software for integration and demonstration on a robotic platform; mature and demonstrate enabling integrated technologies tactically relevant to increasing battlefield lethality\/survivability; continue to demonstrate technologies for improving precision that extends beyond existing ranges."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Protection and Tactical Overmatch Armament Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved ability to deliver decisive effects by providing hemispherical protection to semi-fixed and mobile sites against personnel, vehicle, and materiel targets to enable tactical overmatch to the Tactical Small Unit."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.534"
                                            },
                                            "Text": {
                                                "val": "Will integrate mature component technologies that have demonstrated effects against threat UAS, direct and indirect fired munitions providing hemispherical protection system of systems approach to accurately sense, warn, and respond to threats by delivering decisive effects timely and accurately."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Remote Armament System Integration"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates weapon systems on a semi-autonomous and autonomous unmanned platforms while maintaining positive control of weapon system."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.912"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.912"
                                            },
                                            "Text": {
                                                "val": "Will integrate mature component technologies of a medium caliber weapon mounted on a 1+ ton unmanned vehicle controlled via secure distributed communications operating up to 5 km from command and control entity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Effects Decision Suite"
                                    },
                                    "Description": {
                                        "val": "This effort provides sensor-to-shooter capabilities to deliver desired effects on target, specifically addressing accurate target location and target hand-off, improving accuracy and lethality at the small combat level."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improve weapon target pairing (WTP) enhancement for non-lethal effects; improve fire support of unmanned aerial vehicle\/unmanned ground vehicle tactical behavior along with the remote weapon station collaborative effort; validate de-conflction of target data received; demonstrate improvements to validate the enhanced sensor-to-shooter WTP capabilities for lethal and non-lethal effects; validate the networked fire control perfomance utilizing existing hardware and software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.511"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.511"
                                            },
                                            "Text": {
                                                "val": "Will implement fire support execution matrix; will improve target prioritization; will improve 3D de-conflictions of fires application; will demonstrate target data\/track management and effects planning; will demonstrate weapon placement coordination; will demonstrate effects planning component."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Non-Line-of-Sight (NLOS) Munition for Light Forces"
                                    },
                                    "Description": {
                                        "val": "This effort will provide a precision technology capability for an 81mm mortar cartridge for light forces for base defense. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection  Basing."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.006"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.006"
                                            },
                                            "Text": {
                                                "val": "Will improve and optimize down selected 81mm mortar GPS precision design candidate; will mature design and integrate into 81mm mortar round system taking into account warhead and propulsion system; will validate the 81mm precision mortar design integration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Solid State Active Denial Technology (SS-ADT)"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates non-lethal counter-personnel directed energy (DE) technology for crowd control up to 100 meters. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection Basing."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.914"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.914"
                                            },
                                            "Text": {
                                                "val": "Will improve the azimuth and elevation steering capability and develop a Fire Control Suite for Target Tracking; will perform demonstration of human target effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Base Defense Hostile Protection System"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates technology to locate unmanned aircraft systems (UAS) in bearing via acoustic sensor arrays as well as the source of mortars and mortars and rocket propelled grenades (RPGs).\nIn FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection – Basing."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.510"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.510"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate and optimize acoustic detection and tracking in bearing of UAS; will mature multi node system level fusion to improve performance, repackage components to reduce logistic burden and optimize power usage, for extended mission life and maintenance cycles; will support and participate in TECD 1a to demonstrate integrated capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range\/Guided 40mm Munition"
                                    },
                                    "Description": {
                                        "val": "This effort develops a 40mm guided, low cost, extended range projectile for use in the M320 launcher.  Warfighter\/Command & Control will be able to see beyond line-of-sight targets while in flight. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection Basing."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.013"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.013"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate optimized components for a guidance navigation and control system for extended range 40mm low velocity grenades; will perform improvements of extended range technologies to include airframe and Guidance, Navigation and Control and will conduct a demonstration; will optimize and demonstrate a mature warhead integrated into the projectile."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automated Direct\/Indirect Fire Mortar (ADIM)"
                                    },
                                    "Description": {
                                        "val": "This effort develops a line-of-sight\/non-line-of-sight remotely operatable mortar system for use in base protection and mobile fire support. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection Basing."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.019"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.019"
                                            },
                                            "Text": {
                                                "val": "Will improve and optimize the baseline, ground-up designed system; will demonstrate its capabilities in a controlled environment in order to validate expected increases in performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Hazard Predetonation System"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a system to neutralize improvised explosive devices (IEDs) leveraging emerging detection, geo-location, and classification technologies on a ground vehicle. It provides an integrated system approach to enhanced neutralization \/ predetonation that leverages data from sensor networks providing IED detection, geolocation and classification data. It transitions from the IED Neutralization Technology effort in PE 0602642A\/Proj H19 in FY2014\/15."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.006"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.006"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate an improved IED neutralization capability that interoperates with standard communications networks and databases that provide historical and real time IED emplacement data; Will mature the neutralization system to utilize beam steering algorithms for convoy operations as well as integrate emerging waveforms to defeat a wider class of IEDs; will demonstrate reduce Size, Weight and Power (SWaP) requirements for legacy neutralization systems utilizing emplacement data and RF generation enhancements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Sniper Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort will investigate advanced projectile designs such as long rod technologies that will provide snipers with the capability for increased range effectiveness (up to 1500m, possibly greater), hit probability, and armor penetration for man-portable sniper systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.503"
                                            },
                                            "Text": {
                                                "val": "Will optimize the performance of the long rod sabot, notably the slip obturator and discard; will demonstrate accuracy improvements associated with design modifications to existing projectiles; will investigate the technological advances and viability of guided munitions in small caliber applications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L96"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Technology Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.845"
                        },
                        "CurrentYear": {
                            "val": "13.965"
                        },
                        "BudgetYearOne": {
                            "val": "13.971"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.971"
                        },
                        "BudgetYearTwo": {
                            "val": "14.677"
                        },
                        "BudgetYearThree": {
                            "val": "12.000"
                        },
                        "BudgetYearFour": {
                            "val": "17.250"
                        },
                        "BudgetYearFive": {
                            "val": "17.152"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates advanced technologies for future High Energy Laser (HEL) weapons technology.  The major effort under this project is the phased approach for mobile high power solid state laser (SSL) technology demonstrations that are traceable to the form, fit, and function requirements for a HEL weapon.  At entry level weapon power of around 10 kW, SSL technology has the potential to engage and defeat small caliber mortars, unmanned aerial vehicles (UAVs), surface mines, sensors, and optics.  At full weapon system power levels of around 100 kW, SSL technology has the potential to engage and defeat rockets, artillery and mortars (RAM), UAVs, and anti-tank guided missiles (ATGMs), as well as surface mines, sensors, and optics at tactically relevant ranges.  HELs are expected to complement conventional offensive and defensive weapons at a lower cost-per-shot than current systems and without the need to strategically, operationally, or tactically stockpile ordnance.  This effort utilizes a modular building block approach with open systems architecture to ensure growth, interoperability, and opportunity for technology insertions for maturation of laser, beam control, sensor\/radar, integration of power and thermal management subsystems, as well as Battle Management Command, Control, and Computers (BMC3). \n\nThis project supports Army science and technology efforts in the Ground portfolio. \n \nWork in this project is related to, and fully coordinated with, efforts in PE 0602307A (Advanced Weapons Technology), PE 0602890F (High Energy Laser Research), PE 0603924F (HEL Advanced Technology Program), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603924D8Z (High Energy Laser Advanced Technology Program), PE 0602120A (Sensors and Electronic Survivability), and PE 0605605A (DOD High Energy Laser Systems Test Facility). \n \nThe cited work is consistent with the Department of Defense Research and Engineering Strategic Plan and the Army Modernization Strategy. \n \nWork is performed by the US Army Space and Missile Defense Command Technical Center, Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technology Demonstrator (HEL TD) Beam Control System (BCS)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and integrates a Beam Control System (BCS) into a mobile platform (Heavy Expanded Mobility Tactical Truck) and demonstrates BCS performance using low power SSLs. After the completion of the HEL TD BCS low power demonstrations in FY12, follow-on activities using the rugged, mobile BCS will be conducted under the High Energy Laser Mobile Demonstrations (HEL MD) planned program. HEL MD is the follow-on set of activities that utilize the mobile platform with rugged BCS to continue integration and demonstration of other subsystems required for a HEL weapon, such as power, thermal management, and a rugged laser."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.845"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted high power HEL demonstrations of target acquisition, tracking, aim point selection and lethality against rockets, mortar, and other selected targets. Pre-demonstration activities included BCS and 100 kW SSL hardware integration with check out activities. Planned for High Energy Laser Joint Technology Office (HEL JTO) provided Adaptive Optics (AO) technologies for integration into the BCS and prepared for AO demonstrations at HELSTF."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser System Ruggedization"
                                    },
                                    "Description": {
                                        "val": "This effort ruggedizes laser systems for integration on tactical platforms.  Ruggedization includes modifications of the laser system to withstand vibration, temperature, and contamination environments expected on the HEL MD platform, and other selected tactical platforms, while ensuring platform volume, weight, and interface specifications are met. The laser system consists of laser devices, such as the laboratory laser devices developed under PE 0602307A, Project 042, and the prime power and thermal management subsystems required for the laser device operation."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.499"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Use the HEL technology selected under PE 0602307A, Project 042 to begin ruggedization of a 25-50kW class laser device for integration on the HEL MD platform; validate vibration, temperature, and contamination environment specifications for the laser device and supporting equipment, as well as volume, weight, and interface specifications to ensure compatibility with the platform; begin ruggedization efforts for available programmable pulsed power technology to provide prime power for the 25-50 kW laser device; and ruggedize available thermal management technology that can cool the 25-50 kW laser device."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.571"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.571"
                                            },
                                            "Text": {
                                                "val": "Will complete ruggedization efforts for available programmable pulsed power technology to provide prime power for the 50 kW laser device; begin ruggedization of available thermal management technology that can cool the 50 kW laser device; provide additional ruggedization of the 50 kW laser device to enable integration into the HEL MD platform; correct beam control system deficiencies discovered during the 10 kW demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Mobile Demonstrations (HEL MD)"
                                    },
                                    "Description": {
                                        "val": "This effort initially integrates a commercial-off-the-shelf (COTS) laser subsystem (then later a ruggedized higher power laser subsystem) into the existing mobile laser demonstrator platform that includes the ruggedized BCS built under the HEL TD effort and other required subsystems to demonstrate weapon system performance. The goal is to demonstrate and evaluate performance of a complete mobile high power laser weapon in a relevant environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.466"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Capitalize on the availability of COTS 10 kW class lasers and reduce risk for integration of higher power lasers on a mobile platform by integrating a COTS 10kW laser system on the HEL MD platform to conduct demonstrations, including assessment of mobile SSL performance against mortars and other selected targets; demonstrate the HEL JTO provided AO technologies with the 10kW device to assess increases to effective range; and begin the integration of ruggedized components on the HEL MD platform to support the next phase (25-50kW) of HEL mobile demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Text": {
                                                "val": "Will complete the 10 kW laser demonstration integrated with the HEL MD platform; finish assessment of 10 kW integrated subsystem performance against selected targets; demonstrate and assess the performance of the HEL JTO provided AO technologies with the 10kW laser device to determine increases to effective range of the laser; begin integration of power subsystem for future 50kW demonstration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L97"
                    },
                    "ProjectTitle": {
                        "val": "Smoke And Obscurants Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.316"
                        },
                        "CurrentYear": {
                            "val": "3.070"
                        },
                        "BudgetYearOne": {
                            "val": "3.280"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.280"
                        },
                        "BudgetYearTwo": {
                            "val": "3.694"
                        },
                        "BudgetYearThree": {
                            "val": "4.083"
                        },
                        "BudgetYearFour": {
                            "val": "4.645"
                        },
                        "BudgetYearFive": {
                            "val": "4.729"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The project matures and demonstrates obscurant technologies with potential to enhance personnel\/platform survivability by degrading threat force surveillance sensors and defeating the enemy's target acquisition devices, missile guidance, and directed energy weapons. Dissemination systems for new and improved obscurants are developed with the goal of providing efficient and safe screening of deployed forces.  This project also matures and demonstrates improved detection of explosives and hazardous materials by Soldiers and Small Units.\n\nThis project sustains Army science and technology efforts supporting the Ground portfolio.\n   \nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan, the Army Modernization Strategy, and the Army Science and Technology Master Plan.   \n  \nWork in this project is performed and managed by the Army Research, Development, and Engineering Command (RDECOM), Edgewood Chemical Biological Center (ECBC), Edgewood, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Obscurant Enabling Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the dissemination of new and advanced obscurants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimized and demonstrated bispectral obscurant grenade; mature, fabricate and test grenade concepts for new low hazard visual obscurant\/smoke."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimize new low hazard visual obscurant grenade."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.659"
                                            },
                                            "Text": {
                                                "val": "Will conduct toxicology studies of optimized grenades; further characterize performance of low hazard visual obscurant grenade."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Forensic Analysis of Explosives"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and stand-off detection of explosives and home made explosive (HME) precursors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.399"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and evaluated colorimetric homemade explosives kit and integrate improved signature information for explosives and precursor materials into chemical point and stand-off detection systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.906"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimize, mature and demonstrate a HME detection kit for the dismounted soldier."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.053"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.053"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate unambiguous biometric identification detection of explosives in latent fingerprints; develop a prototype forensic imager that will generate digital fingerprints compatible with law enforcement databases and simultaneously determine the chemical composition of trace residue using Raman chemical imaging and fluorescence imaging."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Detection Mechanisms for Contaminants"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and standoff detection of a wide range of hazardous materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.936"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured innovative technologies based on multiple spectroscopic sensing techniques for the detection and identification of hazardous material; integrated algorithms for improved probability of detection (Pd) and low false alarm rate (FAR) and based on the use of complementary spectroscopic techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.514"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimize and demonstrate recommended spectroscopic approaches for standoff, proximity and point detection of explosives, homemade explosives, and\/or homemade explosive precursors; and demonstrate integrated sensing of chemical agents and explosives in a common Ion Mobility Spectroscopy system (IMS) Joint Chemical Detector (JCD)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.568"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.568"
                                            },
                                            "Text": {
                                                "val": "Will optimize and mature unified ion mobility based sensing of explosives and chemical agents in the Joint Chemical Detector (JCD) system; demonstrate standoff detection of trace homemade explosives with laser based systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    }
                }
            ]
        }
    }
}