{
    "id": "f62f8146d9b3c236d649153e91e5187fba1d7d2f",
    "meta": {
        "filename": "dod-2014_RDTE_2014_ARMY_BA5A_RDTE_JustificationBook_Army_PB_2014.zzz_unzipped_RDTE_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604710A"
        },
        "ProgramElementTitle": {
            "val": "Night Vision Systems - Eng Dev"
        },
        "R1LineItemNumber": {
            "val": "93"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "55.412"
            },
            "CurrentYear": {
                "val": "32.621"
            },
            "BudgetYearOne": {
                "val": "43.405"
            },
            "BudgetYearOneBase": {
                "val": "43.405"
            },
            "BudgetYearTwo": {
                "val": "37.581"
            },
            "BudgetYearThree": {
                "val": "24.084"
            },
            "BudgetYearFour": {
                "val": "15.581"
            },
            "BudgetYearFive": {
                "val": "22.585"
            }
        },
        "ProgramElementNote": {
            "val": "Program Change Summary Explanation:\n\nFiscal Year 2012:  Program decreases of $2.389 million to Project L70, $.081 million to Project L75, $0.678 million to Project L67 and $0.635 million to Project L79 which were realigned to higher priority Army efforts.\n\nFiscal Year 2014:  Program increases of $6.669 million to Project L70 for Next Generation FLIR B Kit and sensor development, program increase of $2.759 million to Project L75 for Profiler development activities and program increase of $1.100 million to Project L76 for Dismounted Fire Support Targeting System development efforts.  Program decreases of -$3.504 million to Project L67 and $6.584 million to Project L79 realigned to higher priority Army efforts."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides night vision\/reconnaissance, surveillance and target acquisition technologies required for U. S. defense forces to engage enemy forces twenty-four hours a day under conditions of degraded visibility due to darkness, adverse weather, battlefield obscurants, foliage and man-made structures.  These developments and improvements to high performance night vision electro-optics, radar, laser, and thermal systems and integration of related multi-sensor suites will enable near to long range target acquisition, identification and engagement to include significant fratricide reduction, which will improve battlefield command and control in \"around-the-clock\" combat operations.  \n\nProject L67 develops, improves and miniaturizes high performance night vision electro-optics, thermal and laser systems.  It also provides for systems integration of related multi-sensor suites to enable near to long-range target acquisition and engagement as well as improved battlefield command and control in around-the-clock combat operations.  It focuses on adapting demonstrated technologies that bring improvements to the dismounted Soldiers' equipment.  This project develops or enhances equipment that provides the individual Soldier's day\/night situational awareness and individual targeting capability, sniper fire detection and location capability, and integrates improved target location and self-location capability to eliminate friendly fire incidents.\n\nProject L70 focuses on night vision, reconnaissance, surveillance and target acquisition (RSTA) sensor and suites of sensors to provide well-defined surveillance and targeting capabilities for a variety of Current, Modular, and Future Force platforms.  This project includes: System Development and Demonstration of the Thermal Imaging Engine (transitioned from an Advanced Technology Objective); night vision sensor acquisition support of Unattended Ground Sensors and ASTAMIDS; development of a Standard Ground Station for Persistent Surveillance Sensors (RAID and PTDS), development for the Next Generation FLIR (NGF) B-kit  and improvements and enhancements to Persistent Surveillance System (PSS)and Pre Planned Product Improvements (P3I) software related to meeting network interoperability requirements and improving the soldier - machine interface of the POR.\n\nProject L75 focuses on development of Profiler Block enhanced capabilities for meteorological measurement sensors and data.  Improvements have reduced the footprint (less soldiers\/vehicles) and complexity of the system, improved performance (accuracy), improved survivability, connectivity, no balloon sensor, multiple initialization data, and terrain visualization. The improved MET message data will increase lethality by enabling artillery a greater probability of first round hit with indirect fire systems.  Profiler Block III will provide a networked laptop configuration while further reducing the system's logistics footprint with the elimination of the High Mobility Multi-purpose Wheeled Vehicle (HMMWV) mounted shelter and trailer.  The Block III configuration consist of one computer with a common operating system co-located within the Tactical Operation Center (TOC) with a direct interface to the TOC Local Area Network (LAN).  The system will be able to provide Gridded MET along with autonomously generate MET messages upon request from AFATDS eliminating the need for a dedicated MET section crew.  The Army will realize a significant cost avoidance with the improved configuration.\n\nProject L76 focuses on the engineering development of technologies for insertion into Laser Target Locators and Laser Designators to improve overall performance of those systems and reduce weight.  Technologies developed under this project will benefit the Lightweight Laser Designator Rangefinder (LLDR, AN\/PED-1), various Laser Target Locators, and future precision targeting programs based on emerging Army requirements.  In addition, this line will support improved accuracy (reduced target location error) in support of coordinate seeking weapons, such as Joint Direct Attack Munition (JDAM) and Excalibur.\n\nProject L79 focuses on development of the Joint Effects Targeting System (JETS).  The goal is to develop a lightweight set of mission equipment for the dismounted forward observers and controller (including Joint Tactical Air Controllers - JTAC) that will provide means to call for fire and control delivery of air, ground and naval surface fire support using precision\/near-precision\/non-precision munitions and effects (lethal and non-lethal).  JETS consist of two subsystems, the Target Location Designation System (TLDS) and the Target Effects Coordination System (TECS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "59.195"
                },
                "CurrentYear": {
                    "val": "32.621"
                },
                "BudgetYearOne": {
                    "val": "42.965"
                },
                "BudgetYearOneBase": {
                    "val": "42.965"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "55.412"
                },
                "CurrentYear": {
                    "val": "32.621"
                },
                "BudgetYearOne": {
                    "val": "43.405"
                },
                "BudgetYearOneBase": {
                    "val": "43.405"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.783"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.440"
                },
                "BudgetYearOneBase": {
                    "val": "0.440"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-3.783"
                                },
                                "BudgetYearOne": {
                                    "val": "0.440"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.440"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "L67"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Night Vision Devices"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.268"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "11.271"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.271"
                        },
                        "BudgetYearTwo": {
                            "val": "16.987"
                        },
                        "BudgetYearThree": {
                            "val": "13.880"
                        },
                        "BudgetYearFour": {
                            "val": "12.773"
                        },
                        "BudgetYearFive": {
                            "val": "19.729"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project develops, improves and miniaturizes high performance night vision electro-optics, thermal and laser systems.  It also provides for systems integration of related multi-sensor suites to enable near to long-range target acquisition and engagement as well as improved battlefield command and control in around-the-clock combat operations. Further, this funding supports the development, test, and evaluation of Preemptive Threat Detection (PTD) through EMD.  It focuses on adapting demonstrated technologies that bring improvements to the dismounted Soldiers' equipment.  This project develops or enhances equipment that provides the individual Soldier's day\/night situational awareness and individual targeting capability, sniper fire detection and location capability, and integrates improved target location and self-location capability to eliminate friendly fire incidents."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhanced Night Vision Goggle (ENVG)"
                                    },
                                    "Description": {
                                        "val": "The AN\/PSQ-20 ENVG is a helmet-mounted passive device for the individual Soldier that fuses image intensification and long wave infrared imagery into a single, integrated image."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.901"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed Production Qualification Testing (PQT) for multiple sources of AN\/PSQ-20 (Enhanced Night Vision Goggle)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.735"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.735"
                                            },
                                            "Text": {
                                                "val": "Initiate production qualification testing for multiple (AN\/PSQ-20) new contracts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sense Through The Wall (STTW)"
                                    },
                                    "Description": {
                                        "val": "The STTW is a handheld sensor that provides dismounted Soldiers with the capability to detect and locate personnel targets through walls from a standoff distance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.747"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed software modifications to enhance sensors performance and completed operational test activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Family of Weapons Sights (FWS)"
                                    },
                                    "Description": {
                                        "val": "FWS is a family of weapon sights that utilize advances in thermal and image intensified technologies to produce Individual (I) , Crew-Served (CS), and Sniper (S) weapon sights operable in-line with a day optic or in a stand-alone mode.  FWS includes fused multi-band imagery and rapid target acquisition with ballistic equations, providing the Soldier with improved capabilities during day and night operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.418"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In FY 2012, accelerated delivery of FWS I prototypes, developed technical requirements for wireless Rapid Target Acquisition (RTA) and used modeling and simulation efforts to identify capability increases provided by the FWS-I.  Additionally, continued development of High Definition (HD) thermal sensor and Electron Bombarded Active Pixel Sensor (EBAPS) for use in the FWS-CS prototypes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.536"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.536"
                                            },
                                            "Text": {
                                                "val": "Will initiate and perform Engineering and Manufacturing Development (EMD) for the FWS Individual (FWS-I) variant.  EMD tasks include refining the FWS-I design and producing production representative hardware that will enable an FY 2015 Limited User Test (LUT) and Milestone C."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Tactical Optical Rifle Mounted"
                                    },
                                    "Description": {
                                        "val": "The AN\/PSQ-23 Small Tactical Optical Rifle Mounted (STORM) Micro-Laser Range Finder (MLRF) is a weapon-mounted multi-function laser system.  It provides an eye safe laser range finder, digital compass, Infrared (IR) and visible aiming lights, and an IR illuminator for far target location with continuous range, accuracy, weight and power performance enhanced capabilities.  It also has an embedded training system, Multiple Integrated Laser Engagement System (MILES)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.202"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed production qualification testing for second source."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "603774A VT7"
                                    },
                                    "Title": {
                                        "val": "603774A - Night Vision Systems Advanced Development (VT7)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "10.715"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.066"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.066"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.208"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.260"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.193"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Helmet Mounted Enhanced Vision Devi"
                                    },
                                    "Title": {
                                        "val": "Helmet Mounted Enhanced Vision Devices (HMEVD) (SSN K36400)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "119.078"
                                        },
                                        "CurrentYear": {
                                            "val": "125.917"
                                        },
                                        "BudgetYearOne": {
                                            "val": "167.379"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "167.379"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "174.861"
                                        },
                                        "BudgetYearThree": {
                                            "val": "183.695"
                                        },
                                        "BudgetYearFour": {
                                            "val": "121.581"
                                        },
                                        "BudgetYearFive": {
                                            "val": "64.238"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Thermal Weapon Sight (TWS)"
                                    },
                                    "Title": {
                                        "val": "Thermal Weapon Sight (TWS) (SSN K22900)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "176.972"
                                        },
                                        "CurrentYear": {
                                            "val": "82.162"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.074"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.074"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "95.920"
                                        },
                                        "BudgetYearThree": {
                                            "val": "141.121"
                                        },
                                        "BudgetYearFour": {
                                            "val": "143.565"
                                        },
                                        "BudgetYearFive": {
                                            "val": "154.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Sniper Night Sight (SNS)"
                                    },
                                    "Title": {
                                        "val": "Sniper Night Sight (SNS) (SSN K41500)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.661"
                                        },
                                        "CurrentYear": {
                                            "val": "11.660"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.240"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.838"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Sense Through The Wall (STTW)"
                                    },
                                    "Title": {
                                        "val": "Sense Through The Wall (STTW) (SSN KA2300)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.000"
                                        },
                                        "CurrentYear": {
                                            "val": "6.212"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.142"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.142"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "16.354"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Small Tactical Optical Rifle Mounte"
                                    },
                                    "Title": {
                                        "val": "Small Tactical Optical Rifle Mounted (STORM) (SSN K35110)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.227"
                                        },
                                        "CurrentYear": {
                                            "val": "20.717"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.300"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.300"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.319"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.305"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.025"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.611"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The various developmental programs in this project continue to exercise competitively awarded contracts using best value source selection procedures."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PROGRAM MGMT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.946"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Sense Through The Wall (STTW)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.963"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.542"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.505"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Family of Weapon Sights (FWS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.939"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.965"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.304"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.304"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Advanced Weapon Sight Technologies (AWST)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.714"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.714"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Matrix Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NVESD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.363"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.323"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.232"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.232"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Matrix Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TACOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.789"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.789"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Test Support Activity"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test and Evaluation Command"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "39.782"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.778"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.735"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.735"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "ENVG Production Qualification Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FWS-I MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FWS-I Engineering and Manufacturing Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FWS-I MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FWS-I Development\/Operational Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FWS-CREW SERVED (CS) MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FWS-CS Engineering and Manufacturing Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FWS- SNIPER (S)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FWS- S Engineering and Manufacturing Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PTD MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PTD Engineering and Manufacturing Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PTD MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L70"
                    },
                    "ProjectTitle": {
                        "val": "Night Vision Dev Ed"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.900"
                        },
                        "CurrentYear": {
                            "val": "11.116"
                        },
                        "BudgetYearOne": {
                            "val": "6.669"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.669"
                        },
                        "BudgetYearTwo": {
                            "val": "5.819"
                        },
                        "BudgetYearThree": {
                            "val": "0.812"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project performs Engineering and Manufacturing Development (EMD) on high performance night vision, Reconnaissance, Surveillance, and Target Acquisition (RSTA) systems and other related systems that allow forces to locate and track enemy units in day, night, and all battlefield conditions, and through natural and man-made structures and obscurants.  It also develops and integrates suites of these sensors to provide well-defined surveillance and targeting capabilities, as well as architectures for these sensors to communicate automatically.  The focus is on meeting the requisite night vision and RSTA capabilities required for evolving Current Force, Modular Force, and Future Force systems.\n\nThe project will leverage critical technologies from the Advanced Thermal Imaging EMD effort and Combat Vehicle Advanced Sensor Technology (CVAST) to develop a common Improved-Forward Looking Infrared (I-FLIR) B-Kit for integration into US Army FLIR sensor systems including emerging requirements of I-FLIR Army Combat and reconnaissance sensor systems to the Ground Combat Vehicle Infantry Fighting Vehicle (GCV IFV), Abrams, and Bradley.  The I-FLIR B-Kit provides Mid Wave Infrared and Long Wave Infrared digital video and the electronic interfaces required to integrate the Next Generation FLIR (NGF) technology with the host platform sensor. This technology enhances the war-fighters' survivability and lethality through increased identification range performance when integrated in current sensor packages, while enabling the detection of difficult or obscured targets and faster threat detection through automated processes.  The I-FLIR B-Kit will also be used to enhance mobility by maintaining current range performance in significantly smaller and lighter sensor packages.\n\nThis project also supports the Army Sensor Computing Environment effort in support of the Common Operating Environment (COE) vision.  It focuses on the improving the network interoperability requirement and improving the soldier - machine interface.  Resultant improvements would be implemented through upgrades to fielded systems, or informing future programs.\n\nThe funds allocated to Gunshot Detection supported a System Characterization study and Technology Readiness Level (TRL) determination for potential technical capabilities.  The system characterization study will ascertain the performance of industry systems and will enhance Government knowledge of the benefits of various technology types and modalities in determining incoming gunshots.  The study will aid the Government in writing the Performance Work Statement (PWS), Performance Specification and the Interface Control Document (ICD) and will enable schedule acceleration.\n\nThis project also supports development efforts for the I-FLIR B-Kit, to include specification development, integration analysis, milestone and solicitation preparation activities, and continues development and implementation of Block II Electro Optic Counter-Counter Measures (EOCCM).  In addition, this project also supports the development of meeting the Army's network interoperability requirements and improving the soldier - machine interface.\n\nFY 2014 Base Funding in the amount of $6.669 Million supports I-FLIR B-Kit component and sensor integration assessments, milestone and solicitation preparation activities, and also supports the continued activities associated with meeting network interoperability requirements and improving the soldier - machine interface in support of the Army's vision of the Common Operating Environment (COE)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Thermal Imaging Engine"
                                    },
                                    "Description": {
                                        "val": "Engineering and Manufacturing Development (EMD) of Thermal Imaging Engine.  MS B approval in FY08 initiated EMD effort.  EMD program develops the Thermal Imaging Engine for the Next Gen FLIR Army Combat and reconnaissance systems to include fabrication and qualification of 15 prototypes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.379"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2012 Base Funding supported completion of qualification testing, System Verification Review, and contract closeout activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved-Forward Looking Infrared (I-FLIR) B-Kit"
                                    },
                                    "Description": {
                                        "val": "Development of the I-FLIR B-Kit.  The I-FLIR B-Kit will represent the B-Kit materiel solution in accordance with the I-FLIR CDD, resulting in a common sensor component for both Ground and Airborne host platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.790"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2012 Base Funding supported I-FLIR B-Kit performance spec & interface control document development, platform requirements decomposition, and maturation of critical technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.909"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Following FY12 approval of the I-FLIR CDD and Platform ECP\/Sensor Upgrade programs, funding supports I-FLIR B-Kit specification development and I-FLIR B-Kit MS B preparation activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.069"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.069"
                                            },
                                            "Text": {
                                                "val": "FY 2014 Base Funding will support I-FLIR B-Kit component and platform sensor integration assessments.  Funding will also support milestone and solicitation preparation activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pre Planned Product Improvements (P3I) software for the Persistent Surveillance System (PSS) Program of \nRecord (POR)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.731"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2012 Base Funding supports Developed Systems Engineering plan and path forward to meet the network interoperability requirement and improving the soldier - machine interfaces for COE execution plan."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.207"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development of the Pre Planned Product Improvements (P3I) software for the Persistent Surveillance System (PSS) Program of Record (POR), to include meeting the network interoperability requirement and improving the soldier - machine interface of the POR.  Resultant improvements would be implemented through maintenance upgrades to fielded systems.  This effort establishes the Army Sensor Computing Environment (CE) effort in support of the Common Operating Environment (COE) vision."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "FY 2014 Base Funding supports continued development of meeting the network interoperability requirement and improving the soldier - machine interface.  Resultant improvements would be implemented through upgrades to fielded systems, or informing future programs.  This effort continues the Army Sensor Computing Environment (CE) effort in support of the Common Operating Environment (COE) vision."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "GCV (PE 0605625A FC8)"
                                    },
                                    "Title": {
                                        "val": "Ground Combat Vehicle (PE 0605625A FC8)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "434.977"
                                        },
                                        "CurrentYear": {
                                            "val": "639.874"
                                        },
                                        "BudgetYearOne": {
                                            "val": "592.201"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "592.201"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "953.081"
                                        },
                                        "BudgetYearThree": {
                                            "val": "948.718"
                                        },
                                        "BudgetYearFour": {
                                            "val": "718.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "550.037"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "ABRAMS Tank Improvement Program"
                                    },
                                    "Title": {
                                        "val": "Abrams Tank Improvement Program (PE 0203735A)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.347"
                                        },
                                        "CurrentYear": {
                                            "val": "97.278"
                                        },
                                        "BudgetYearOne": {
                                            "val": "101.319"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "101.319"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "135.228"
                                        },
                                        "BudgetYearThree": {
                                            "val": "110.917"
                                        },
                                        "BudgetYearFour": {
                                            "val": "90.042"
                                        },
                                        "BudgetYearFive": {
                                            "val": "34.115"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BRADLEY Improvement Program"
                                    },
                                    "Title": {
                                        "val": "Bradley Improvement Program (PE 0203735A)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.858"
                                        },
                                        "CurrentYear": {
                                            "val": "82.586"
                                        },
                                        "BudgetYearOne": {
                                            "val": "76.213"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "76.213"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "84.709"
                                        },
                                        "BudgetYearThree": {
                                            "val": "59.010"
                                        },
                                        "BudgetYearFour": {
                                            "val": "40.539"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "354.915"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "LRAS3 (K38300)"
                                    },
                                    "Title": {
                                        "val": "Long Range Advanced Scout Surveillance System (LRAS3) (K38300) OPA2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "102.334"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.183"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.183"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "107.517"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Comment: Above figures reflect PB14 budget."
                        },
                        "AcquisitionStrategy": {
                            "val": "The development programs in this project are currently based on competitive awards and under cost reimbursement type contracts.  Following approval of the I-FLIR CDD planned activities include I-FLIR B-Kit component and sensor integration assessments, as well as milestone and solicitation preparation activities.  Additional activities include continued development of meeting the network interoperability requirement and improving the soldier - machine interface in support of the Army's vision of the Common Operating Environment (COE)."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM, NV\/RSTA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.239"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.216"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.616"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.229"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.229"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.300"
                                                    },
                                                    "TargetValue": {
                                                        "val": "9.454"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SGS\/RAID"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sarnoff"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Princeton, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.913"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.913"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.913"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2009 - FY 2011:   Thermal Imaging - Design and Demonstration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.478"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.478"
                                                    },
                                                    "TargetValue": {
                                                        "val": "13.478"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2010-FY 2011:  Thermal Imaging - Source Risk Reduction"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.361"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.361"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.361"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2012-FY 2013: Develop, Fab, and Qual of a common Ground Platform Engine with Block II EOCCM"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.049"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.918"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.967"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.535"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Improved-Forward Looking Infrared (I-FLIR) B-Kit"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.461"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.249"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.249"
                                                        },
                                                        "AwardDate": {
                                                            "val": "0014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.710"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Gunshot Detection Systems"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Grounds (APG)"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.211"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.211"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.211"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PSS P3I"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.244"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.591"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.835"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.904"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Standoff Suicide Bomber Detection System (SSBDS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lorton, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FOB S2S (Forward Operating Base Sensor to Shooter)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lorton, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Remotely Operated HMDS (Husky Mounted Detection System)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EOIR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fredricksburg VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.700"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.700"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "I-FLIR Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.244"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.658"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.991"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.820"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.820"
                                                        },
                                                        "AwardDate": {
                                                            "val": "0014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "31.713"
                                                    },
                                                    "TargetValue": {
                                                        "val": "27.995"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "COE Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.272"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.371"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.371"
                                                        },
                                                        "AwardDate": {
                                                            "val": "0014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "*  Includes PSDS2, UGS, STTW, 3GF, PSDS2, FCS UGS and other sensor test and evaluation activities."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Other Test Support*"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.850"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.850"
                                                    },
                                                    "TargetValue": {
                                                        "val": "15.850"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Thermal Imaging - Develop, Fab and Qual of Ground Platform Engine with BII EOCCM"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PSS P3I effort; Common Operating Environment Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L75"
                    },
                    "ProjectTitle": {
                        "val": "Profiler"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.512"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.759"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.759"
                        },
                        "BudgetYearTwo": {
                            "val": "3.605"
                        },
                        "BudgetYearThree": {
                            "val": "0.936"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Profiler provides meteorological(MET) information such as wind speed, wind direction, temperature, pressure, humidity, rate of precipitation, visibility, cloud height and cloud ceiling.  All of these are required for precise targeting and terminal guidance.  Profiler uses this information to build a four-dimensional MET model (height, width, depth and time) that includes terrain effects. By providing more accurate MET messages, Profiler will enable the artillery to have a greater probability of a first round hit with indirect fire systems.  The new capabilities will increase the lethality of field artillery systems such as Multiple Launch Rocket Systems (MLRS), Paladin, and self-propelled or towed howitzers.  When analysis determined that Block I Profiler already satisfied the requirements of Block II, the decision was made to proceed directly to Block III as the next evolution of the Profiler capability. The Block I, AN\/TMQ-52 Meteorological Measuring Set-Profiler (MMS-P),uses a ground tactical meteorological (TACMET) sensor and Meteorological (MET) data from communication satellites along with an advanced weather model to provide highly accurate MET data covering an operational area of 500 kilometers with a tested range of 60 kilometers. Block III CMD-P, AN\/GMK-2 will provide a networked laptop configuration that will enhance system efficiencies while further reducing the system's operational and logistical footprint with the elimination of the High Mobility Multi-purpose Wheeled Vehicle (HMMWV) mounted shelter and trailer.  The Block III configuration consists of one computer with a common operating system co-located within the Tactical Operation Center (TOC) with a direct interface to the TOC Local Area Network (LAN).  The system will be able to autonomously generate MET messages upon request from Advanced Field Artillery Tactical Data Systems (AFATDS) eliminating the need for a dedicated MET section crew.  The Army will realize a significant Operations and Support cost avoidance with the improved configuration.The Profiler Virtual Module (PVM) using the IT Box Construct concept will address emerging requirements and system long-term sustainment challenges. The PVM concept includes the following updates to the Profiler; the software architecture will be redone to create a modular framework, the weather model will be updated from Mesoscale Model version5(MM5) to Weather Research Forecast model(WRF), the weather data format for initiation data and data exchange will be updated to Gridded Binary version2 (GRIB 2), and the Graphical User Interface(GUI) made into a Common Operating Environment(COE)compliant thin client.  Along with these changes, a primary goal is to recode the multiple language reuse code pieces into a common development environment. This will also be developed in conjunction with the AFATDS program.  This concept is a flexible approach that will be able to support both stand alone application (on a PC), or integrated into the COE (i.e. a Slice in the TOC server). \n \nFY2014 Base funds in the amount of $2.759M are provided for the Profiler Virtual Module to develop the new MET process and the replacement of the weather model from MM5 to WRF."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Profiler Virtual Module (PVM) development"
                                    },
                                    "Description": {
                                        "val": "VM provides software architecture to create a modular framework."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.759"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.759"
                                            },
                                            "Text": {
                                                "val": "Profiler Virtual Module (PVM) development"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Block III Limited User Testing and Austere Testing."
                                    },
                                    "Description": {
                                        "val": "Conduct Block III Limited User Testing and Austere Testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.512"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct Block III Limited User Testing and Austere Testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Profiler OPA SSN K27900"
                                    },
                                    "Title": {
                                        "val": "Profiler"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.312"
                                        },
                                        "CurrentYear": {
                                            "val": "12.482"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.027"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.027"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.684"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.359"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "28.864"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Profiler Block III acquisition strategy decision brief to the Milestone Decision Authority (MDA) was presented in January 2010.  The Acquisition Decision Memorandum (ADM) authorizing initiation of Profiler Block III was signed by the MDA on 23 February 2010.  A limited competitive Firm-Fixed Price (FFP)\/Cost Plus Fixed Fee (CPFF) contract was awarded via the Strategic Services Sourcing (S3) contract to build, test and deliver the Block III software to support eight (8) Profiler Block III Production Representative Prototype Systems (PRPS). The Block III program is on schedule and entered production and fielding in the first quarter of FY13.\nThe revised Profiler Acquisition Strategy was approved by the MDA on 28 March 2012 for a product improvement to the Profiler Block III for a Virtual Module supporting the Command Post Computing Environment of the Common Operating Environment (COE)."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Nav Sys"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.150"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.473"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.270"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.270"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Award efforts for s\/w porting to laptop"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mantech"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Red Bank, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.495"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Initiate backup sensor effort"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Research Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.191"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Profiler VM SW development and data gathering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SEC, FSED"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Sill, Oklahoma"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.999"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.999"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.999"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Matrix Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.516"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.499"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sys Engr\/Technical Assistance"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.246"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.671"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Conversion from MM5 to WRF for PVM"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARL, Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "WSMR, NM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.089"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.178"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.490"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.490"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Planning and Preparation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC, Various, CECOM, PRD,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dir, APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.557"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Limited User Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.200"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.352"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Conduct Block III Austere Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARL, ATEC,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen  Proving Ground, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.339"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Austere Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PVM SW development and data gathering"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Profiler Virtual Module Development Testing\/Formal Qual Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Profiler Virtual Module Limited User Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Profiler Virtual Module FQT Delta Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L76"
                    },
                    "ProjectTitle": {
                        "val": "Dismounted Fire Support Laser Targeting Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.100"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.100"
                        },
                        "BudgetYearTwo": {
                            "val": "1.119"
                        },
                        "BudgetYearThree": {
                            "val": "1.138"
                        },
                        "BudgetYearFour": {
                            "val": "1.157"
                        },
                        "BudgetYearFive": {
                            "val": "1.177"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures technologies and capabilities which benefit, and may be inserted into, the Lightweight Laser Designator Rangefinder (LLDR, AN\/PED-1) and other precisioning targeting systems.  These precision targeting systems are used by dismounted Soldiers to locate, identify, and target enemy assets. This project focuses on reducing weight, improving imaging performance, and increasing targeting accuracy. Development also focuses on affordable, non-magnetic, high accuracy, Azimuth and Vertical Angle Measurement (AVAM) devices with reduced size, weight and power characteristics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Azimuth and Vertical Angle Measurement (AVAM) devices"
                                    },
                                    "Description": {
                                        "val": "AVAM is a non-magnetic based inertial navigation materiel solution for targeting devices.  This AVAM effort improves azimuth accuracy leading to reduced collateral damage and improved engagement efficiency."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Will fund the integration and testing of emerging smaller, lightweight, low cost AVAMs that can be inserted into the legacy Lightweight Laser Designator Rangefinder."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser development"
                                    },
                                    "Description": {
                                        "val": "Development of lightweight, low cost, multi-spectral, and more efficient lasers."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Will investigate the integration of emerging high accuracy capabilities into the current portfolio of laser targeting systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "LLDR (SSN K31100)"
                                    },
                                    "Title": {
                                        "val": "Lightweight Laser Designator Rangefinder (LLDR) (SSN K31100)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "67.929"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "67.929"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "LLDR Mod-of-In-Service (SSN KA3100)"
                                    },
                                    "Title": {
                                        "val": "Lightweight Laser Designator Rangefinder (LLDR) MOD-of-In-Service (SSN KA3100)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "22.403"
                                        },
                                        "BudgetYearOne": {
                                            "val": "26.037"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "26.037"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "48.163"
                                        },
                                        "BudgetYearThree": {
                                            "val": "49.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "54.600"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "200.203"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "JETS (SSN K32101)"
                                    },
                                    "Title": {
                                        "val": "Joint Effects Targeting System (JETS) (SSN K32101)"
                                    },
                                    "Funding": {
                                        "BudgetYearTwo": {
                                            "val": "95.894"
                                        },
                                        "BudgetYearThree": {
                                            "val": "91.695"
                                        },
                                        "BudgetYearFour": {
                                            "val": "77.443"
                                        },
                                        "BudgetYearFive": {
                                            "val": "79.452"
                                        },
                                        "CostToComplete": {
                                            "val": "905.332"
                                        },
                                        "TotalCost": {
                                            "val": "1249.816"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 654710\/DL79"
                                    },
                                    "Title": {
                                        "val": "Joint Effects Targeting System (JETS) (PE 654710 Project DL79)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.367"
                                        },
                                        "CurrentYear": {
                                            "val": "21.505"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.606"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.606"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.051"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.318"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.651"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.679"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "84.177"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AVAM Development and Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.900"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.900"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.900"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Laser Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.200"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Laser Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Azimuth and Vertical Angle Measurement (AVAM) Development and Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L79"
                    },
                    "ProjectTitle": {
                        "val": "Joint Effects Targeting Systems (JETS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.732"
                        },
                        "CurrentYear": {
                            "val": "21.505"
                        },
                        "BudgetYearOne": {
                            "val": "21.606"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.606"
                        },
                        "BudgetYearTwo": {
                            "val": "10.051"
                        },
                        "BudgetYearThree": {
                            "val": "7.318"
                        },
                        "BudgetYearFour": {
                            "val": "1.651"
                        },
                        "BudgetYearFive": {
                            "val": "1.679"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Effects Targeting System (JETS) is an Army program with joint interest (Air Force and Marine Corps). JETS provides individual dismounted forward observers and Joint Terminal Attack Controllers (JTAC) the means to call for fire and control delivery of air, ground and naval surface fire support using precision munitions and effects (both lethal and non-lethal). The JETS provides the observers and controllers the ability to conduct surveillance, acquire and accurately locate targets, designate targets for attack by laser seeking munitions, mark targets for aviation and ground-based targeting systems, and transmit targeting data to existing Forward Entry Systems for each Service."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Effects Targeting System (JETS)"
                                    },
                                    "Description": {
                                        "val": "JETS is a lightweight mission equipment set for the dismounted forward observers and Joint Terminal Attack Controllers (JTAC).  JETS provides observers and controllers the means to call for fire and control delivery of air, ground and naval surface fire support, including using precision munitions and effects (both lethal and non-lethal)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.732"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Tested Prototype Systems and Azimuth and Vertical Angle Measurement (AVAM) devices, conducted developmental and early user testing, initiated source selection preparation \/ process for the Engineering and Manufacturing Development (EMD) phase."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.505"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Full and Open EMD source selection, award two prime contracts, and begin EMD development of JETS prototype systems from the vendors. The prototypes will include integration with precision AVAM solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.606"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.606"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD phase development. Will complete initial build of up to 30 prototypes and begin early user assessment (EUA) and development testing (DT) of prototypes at White Sands Missle Range (WSMR) and Aberdeen Proving Ground (APG).  Will develop supportability products and initiate production planning."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Fire Support Laser Targeting Sys"
                                    },
                                    "Title": {
                                        "val": "Dismounted Fire Support Laser Targeting Systems (PE 654710 \/ DL76)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "1.100"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.100"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.119"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.138"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.157"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.177"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Joint Effects Targeting System"
                                    },
                                    "Title": {
                                        "val": "Joint Effects Targeting System (SSN K32101)"
                                    },
                                    "Funding": {
                                        "BudgetYearTwo": {
                                            "val": "95.894"
                                        },
                                        "BudgetYearThree": {
                                            "val": "91.695"
                                        },
                                        "BudgetYearFour": {
                                            "val": "77.443"
                                        },
                                        "BudgetYearFive": {
                                            "val": "79.452"
                                        },
                                        "CostToComplete": {
                                            "val": "905.332"
                                        },
                                        "TotalCost": {
                                            "val": "1249.816"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "DL76 supports technology development and integration efforts applicable to multiple programs (e.g. JETS, Lightweight Laser Designator Rangefinder (LLDR)."
                        },
                        "AcquisitionStrategy": {
                            "val": "This project continues to exercise competitively awarded contracts using best value source selection procedures."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics used in the preparation of this justification material may be found in the FY 2010 Army Performance Budget Justification Book, dated May 2010."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Completed JETS TLDS Tech Development (TD) prototype development, integration, and test"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.844"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.844"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AVAM Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.810"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2011-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.410"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JETS TLDS EMD prototype development, integration, and test - Contractor 1 year 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.122"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.734"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.734"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.856"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JETS TLDS EMD prototype development, integration, and test - Contractor 2 year 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.122"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.734"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.734"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.856"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "JETS TLDS prototype technical maturation"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Night Vision Electronics Sensors Directorate"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Functional Support Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Night Vision Electronics Sensors Directorate"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.206"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.837"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.819"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.819"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Science and Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.829"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.652"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.675"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.675"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.925"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.985"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.044"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.044"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "All RDTE Testing and Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.618"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.787"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "JETS TLDS prototype development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Engineering Characterization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Early user assessments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Technology Readiness Assessments"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JETS TLDS MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Engineering & Manufacturing Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JETS TLDS MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LRIP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FMR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}