{
    "id": "f7b2eb199542786893fe849deb40ef6e5da16d42",
    "meta": {
        "filename": "dod-2014_RDTE_2014_MDA_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603175C"
        },
        "ProgramElementTitle": {
            "val": "Ballistic Missile Defense Technology"
        },
        "R1LineItemNumber": {
            "val": "32"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "67.921"
            },
            "CurrentYear": {
                "val": "79.975"
            },
            "BudgetYearOne": {
                "val": "309.203"
            },
            "BudgetYearOneBase": {
                "val": "309.203"
            },
            "BudgetYearTwo": {
                "val": "212.715"
            },
            "BudgetYearThree": {
                "val": "220.185"
            },
            "BudgetYearFour": {
                "val": "220.732"
            },
            "BudgetYearFive": {
                "val": "220.373"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning in FY 2014, Ballistic Missile Defense Technology will realign to the following six focus areas: Advanced Concepts and Performance Assessments, Discrimination Sensor Technology, Weapons Technology, Advanced C4ISR (Command, Control, Communication, Computers, Intelligence, Surveillance, and Reconnaissance), Advanced Research, and Common Kill Vehicle.\n\nIn FY 2014, funding from the Advanced Remote Sensor Technology Program Element (0604886C) and the Directed Energy Research Program Element (0603901C) transfer into the Ballistic Missile Defense (BMD) Technology Program Element (0603175C). Additionally a portion of the funding for Enhanced Command, Control, Battle Management, and Communication moves to the Ballistic Missile Defense Command and Control, Battle Management and Communications Program Element (0603896C). Lastly, the Missile Defense Agency is developing Common Kill Vehicle Technology to address emerging threats and increase the protection of the homeland.  This is a continuation of the plan started in FY 2013 per Public Law 112-239, the National Defense Authorization Act for Fiscal Year 2013. This act directed the development of a long-term plan for the Exo-Atmospheric Kill Vehicle (EKV) that addresses both modifications and enhancements to the current EKV and options for the competitive development of a next generation EKV for the Ground Based Interceptor (GBI) and any other interceptor that might be developed for the defense of the United States against long-range ballistic missiles. Starting in FY 2014, kill vehicle technology development work begins in the BMD Technology Program Element (0603175C)."
        },
        "ProgramElementMissionDescription": {
            "val": "The Ballistic Missile Defense (BMD) Technology Program Element develops future Ballistic Missile Defense System (BMDS) capabilities to out-pace emerging and evolving threats. Advanced Technology is the program execution arm of MDA's Architecture and Engineering thrusts. Advanced Technology identifies, develops, and readies for transition in association with the Chief Architect and the Director of Engineering the technical solutions that meet BMDS shortfalls identified by the Combatant Commanders.  Advanced technology maintains a robust modeling and simulation environment to ensure emerging technology cost-effectively increases performance when inserted into the BMDS architecture.\n\nMDA uses the Prioritized Capabilities List (PCL) and the Agency's Achievable Capabilities List (ACL) to prioritize Advanced Technology investments within six focus areas:   1) Advanced Concepts and Performance Assessment, 2) Discrimination Sensor Technology, 3) Weapons Technology, 4) Advanced C4ISR, 5) Advanced Research, and 6) Common Kill Vehicle. MDA's investments balance the pursuit of promising next generation technology with near-term solutions to enhance existing BMDS capability.\n\n1. The Advanced Concepts & Performance Assessment focus area centralizes efforts for the development of models, simulations, algorithms, and software.   This area leverages industry standard model-based development techniques to give engineers the data to decompose system requirements allocated from MDA's System Engineer, perform trade studies, and complete performance assessments.   Subject matter experts integrate physics-based models into simulations to evaluate performance of components and system-level assemblies.  This focus area combines models of promising technical solutions into BMDS system-level simulations.   This model-based approach reduces risks and costs associated with successful development, demonstration, and implementation of BMDS technology initiatives.  Ultimately, BMD Technology's model-based program supplies the warfighter with confidence that future architectures will meet their needs.   \n\n2. The Discrimination Sensor Technology focus area matures technologies with proven tactical applications and applies those technologies plus emerging technologies to the missile defense mission area. Discrimination Sensor Technology develops solutions to improve identifying, acquiring, tracking and discriminating incoming threats, specifically addressing shortfalls in the Prioritized Capabilities List.  Areas of concentration include advanced detectors, infrared sensors, focal planes and algorithms for passive and active ground, sea, air and space systems. Sensor technology enhances the BMDS capability to discriminate increasing numbers of objects by an order of magnitude and precisely identify the threat.  \nThis technology has the potential to significantly enhance\/enable the following capabilities while decreasing the cost of the BMDS:\n- Discriminating BMDS sensors with global persistence\n- Discriminating weapon sensors\n- End-to-end correlation of sensor track and discrimination data\n- Timely and accurate kill assessment\n- Enhanced probability of kill\n\n3. Weapons Technology develops technology solutions to destroy an increasing number of threat objects.  Areas of concentration include next-generation kinetic interceptor technology, and directed energy intercept. Weapons Technology focuses on reducing the cost of intercepting a threat object by developing smaller, faster, less-complex interceptors, developing light-weight\/high power lasers and the novel beam propagation technology required for strategic-class directed energy weapons. Weapons technology works closely with Sensor Technology to correlate threat identification and engagement hand over requirements and capability. This area will also enable more agile, higher velocity interceptors that leverage our discrimination technology advances to defeat greater raid sizes and increasingly complex threats. This focus area is developing the enabling technology necessary to make game-changing breakthroughs with future interceptors. \n\n4. Advanced Command, Control, Communication, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) develops and matures technology which enables rapid and exponential capability increases in our command, control, battle management and communications (C2BMC) and existing sensor networks. We will develop and mature technology, software and algorithms which facilitate integration of the Service's command and control networks into the BMDS. This focus area will invest in advanced C2BMC technology that has the potential to increase battlespace for all BMDS interceptors including the Terminal High Altitude Area Defense and Ground-based Interceptors.\n\n5. Advanced Research conducts leading edge research and development to create and enable future missile defense capability. MDA executes this mission by capitalizing on the creativity and innovation of the brightest minds in our Nation's universities and small businesses, collaborative research partnerships between allied country academic institutions, and innovative ideas from industry.  Advanced Research identifies priorities and balances the research portfolio in collaboration with the Agency's Chief Architect, Chief Engineer, and an Agency-wide executive level Research Council.\n\n6. Common Kill Vehicle develops technology that supports both the Ground Based Interceptor (GBI) and Standard Missile-3 (SM-3) variants, focusing in particular on the ability to address future threat technology advancements, where component technology and architecture can contribute both to homeland and regional defense.  The component technology and architecture also has the potential to increase the capability of all missile defense interceptors.  By progressing with the common kill vehicle, development of the next generation of deployable and upgradeable kill vehicles, can begin for both the GBI and Standard Missile-3 variants, as soon as the technology is tested.\n\nMD40 Program-Wide Support (PWS) consists of essential non-headquarters management costs in support of the MDA functions and activities across the entire Ballistic Missile Defense System (BMDS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "74.920"
                },
                "CurrentYear": {
                    "val": "79.975"
                },
                "BudgetYearOne": {
                    "val": "81.388"
                },
                "BudgetYearOneBase": {
                    "val": "81.388"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "67.921"
                },
                "CurrentYear": {
                    "val": "79.975"
                },
                "BudgetYearOne": {
                    "val": "309.203"
                },
                "BudgetYearOneBase": {
                    "val": "309.203"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.999"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "227.815"
                },
                "BudgetYearOneBase": {
                    "val": "227.815"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.999"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "227.815"
                                },
                                "BudgetYearOneBase": {
                                    "val": "227.815"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2014 increase in this Program Element is the net result of the addition of both the Advanced Remote Sensor Technology Program Element (0604886C) and the Directed Energy Research Program Element (0603901C) as well as the transfer of a portion of the funding for Enhanced Command, Control, Battle Management and Communication, to the Ballistic Missile Defense Command and Control, Battle Management and Communications to Program Element 0603896C (Budget Project MD01). The increase also represents the move of funds for increased discrimination sensor technology development, and Advanced Command, Control, Communication, Computers, Intelligence, Surveillance, and Reconnaissance.  Additionally, the Missile Defense Agency is developing Common Kill Vehicle Technology (Budget Project MD85)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD25"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "67.484"
                        },
                        "CurrentYear": {
                            "val": "76.005"
                        },
                        "BudgetYearOne": {
                            "val": "229.882"
                        },
                        "BudgetYearOneBase": {
                            "val": "229.882"
                        },
                        "BudgetYearTwo": {
                            "val": "134.166"
                        },
                        "BudgetYearThree": {
                            "val": "140.968"
                        },
                        "BudgetYearFour": {
                            "val": "140.276"
                        },
                        "BudgetYearFive": {
                            "val": "138.372"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Ballistic Missile Defense (BMD) Technology portfolio develops technology to maximize effectiveness and minimize costs; explores and develops technology to counter future threats; leverages technology investments of other Department of Defense (DoD) organizations, industry, other government agencies and international partners. \n\nThe Advanced Concepts & Performance Assessment focus area delivers an integrated test bed simulation and analysis capability to define technology focus areas, validate contractor technology solutions and models, and evaluate future BMDS architecture solutions. This capability enables identification and assessment of innovative technology contributions to Ballistic Missile Defense System (BMDS) performance and facilitates the rapid exploration of potential solutions, presenting options and alternatives not otherwise achievable.  The Advanced Concepts & Performance Assessment laboratory identifies algorithms, models, and mathematical relationships that, when combined in integrated simulations, characterize component\/system key parameters and define performance expectations for all Advanced Technology programs.  Products produced by the model-based engineering process directly inform BMDS architect and systems engineering activities enabling evaluation of a large range of candidate technology and development of well-defined system\/component-level requirements. \n\nDiscrimination Sensor Technology enhances discrimination through the development and demonstration of a wide range of sensor technology and techniques. The goals for enhanced discrimination are to improve the probability of engagement success for stressing threats, expand the Ballistic Missile Defense (BMD) battle space, and increase the ability to negate larger raid sizes. System modeling indicates geographically and spectrally-diverse advanced sensors will improve global persistent tracking and the ability to discriminate by up to an order of magnitude. These improvements increase all weapon systems performance for regional and homeland defense. Discrimination Sensor Technology components are tested in the laboratory and then integrated into systems for test on the ground and in the air. Promising individual sensor technologies will be integrated into a discrimination sensor test bed and participate in stressing BMDS test environments to ensure only high benefit\/cost effective technologies are developed. Discrimination Sensor Technology is applicable to all layers of the battle space, to include ground, maritime, high and very-high-altitude airborne and space basing.\n\nThe Weapons Technology focus area contains advanced technology initiatives that support the design of the next-generation high energy laser, next-generation interceptor technology, and next-generation kill vehicle technology.  This effort includes the directed energy collaboration with the Office of the Assistant Secretary of Defense for Research and Engineering, the Defense Advanced Research Projects Agency and the High Energy Laser Joint Technology Office in a systems engineering based strategy for the research, development, test and evaluation of high energy laser technology.  To transition to the next generation high power directed energy platform in a cost effective manner, MDA is pursuing two promising laser technologies in a competitive environment.  These candidate laser systems offer a path to low cost, high efficiency, electrically-driven, compact, light-weight high energy lasers for multiple missile defense applications including discrimination and boost phase defense. MDA is pursuing the Diode Pumped Alkali Laser System and fiber combining laser technology based on their efficiency and scaling potential. A 200 kilowatt (kW) class flight qualifiable laser prototype will be built and tested based on the selected technology for Ballistic Missile Defense System (BMDS) enhancement.  A surrogate high altitude,  low mach, long endurance platform will be instrumented to measure platform vibration and characterize high altitude atmospheric environment for laser propagation to inform the design and flight compatible packaging of the high powered laser payloads.  The results will be used to validate key model assumptions concerning the environment for laser propagation to be used for airborne high powered directed energy concept definition, conceptual design and system development.  The Weapons Technology focus area will also develop technology that enables more agile, higher velocity interceptors that leverage our discrimination technology advances to defeat greater raid sizes and increasingly complex threats. We will focus on developing the enabling technology necessary to make game-changing breakthroughs with our future interceptors. \n\nAdvanced Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) enables rapid and exponential capability increases in our command, control, battle management and communications (C2BMC) and existing sensor networks. We will develop and mature technology, software and algorithms which facilitate integration of the Services command and sensor network approaches into the BMDS.\n\nThe Advanced Research focus area develops new BMDS capability by leveraging industry and university research. This focus area also manages the selection process and administers the Missile Defense Small Business Innovation Research (SBIR) Program Element, 0605502C.  In FY 2014, the Advanced Research focus area will conduct Advanced Technology Innovation Broad Agency Announcement (ATI BAA) solicitation for identifying potentially breakthrough research on missile defense related technology with private industry, qualified accredited educational institutions, and non profit organizations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhanced Command, Control, Battle Management and Communication"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.351"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Established a 24\/7 data link and exercised a scripted reverse-cue utilizing a space sensor: 3QFY12 \n-Successfully demonstrated the capability to provide real-time three-dimensional (3D) data used to cue Space Tracking and Surveillance System (STSS) and Pacific Tracker and text cues to Sea-based X-band radar (SBX) during a real-world event: 3QFY12 \n-Successfully supported simulated Aegis Launch-On-Remote engagements utilizing 3D track formation, track reporter, acquisition cue, and reverse cue prototypes processing live STSS and space sensor data during FTM-16E2a and FTM-18: 3QFY12\n-Performed analytical trade studies, and algorithm performance assessments using live data collects from current sensors and simulations of future and current sensors to examine improvements for ballistic cueing and three-dimensional track formation by increasing predicted burn out state vector performance, decreasing burn-out state vector report times, leveraging infrared sensor data contribution to bulk filtering and discrimination, and improving tasking and battle management functions: 1QFY12-4QFY12\n-Developed a Precision Tracking Space System (PTSS) - Command, Control, Battle Management and Communications (C2BMC) Interface Control Document Part II utilizing cooperative study efforts throughout the year with PTSS: 1QFY12-4QFY12\n-Established discrimination functionality within an advanced C2BMC prototype to explore raid performance gains: 1QFY12- 4QFY12\n-Defined and assessed technical approaches for advanced C2BMC capability against ballistic missile threats, including infrared\/radio frequency sensor fusion techniques, battle management decision logic, and measurement and state vector data processing: 1QFY12 - 4QFY12\n-Investigated advanced sensor research management, remote optical characterization, and real-time missile classification algorithms through Small Business Innovative Research Phase 2 and Rapid Integration Fund awards: 1QFY12 - 4QFY12 \n-Advanced University research on agent-based architecture constructs and incorporated independent assessments of prototype framework: 1QFY12-4QFY12"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "51.860"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Complete maturation and testing of new BMDS Overhead Persistent Infrared (BOA) baseline release to support Spiral 8.2 integration and testing \n-Complete requirements allocation and specification for advanced C2BMC technologies to support European Phased Adaptive Approach (EPAA) Phase 3\/4 requirements \n-Complete remote sensor technologies and STSS integration prototype development and evaluation \n-Identify, refine, and develop representative models for use in simulation exercises, associated operations in flight tests, experiments, and performance assessments of advanced algorithms and battle management techniques using infrared and radio frequency sensors \n-Develop advanced algorithms for infrared and radio frequency data fusion, sensor cueing and tasking, discrimination, and hit assessment \n-Enterprise Sensors Laboratory: Complete new OPIR sensor integration to expand the RF sensor cueing capability of BOA. This capability will improve the raid capacity of the RF sensors \n-Enterprise Sensors Laboratory: Initiate development for the first application of infrared sensor cueing \n-Enterprise Sensors Laboratory: Initiate algorithm development for hit assessment and continue mid-course tracking algorithm improvements and boost phase tracking algorithm enhancements\n-Award a Spiral 8.4 contract to support EPAA Phase 3 requirements and initiate engineering design and development"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2014 plans transferred to Program Element 0603896C, Budget Project MD01"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Concepts & Performance Assessment"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FY 2012 effort for Advanced Technology Modeling and Simulation was contained in Advanced Research and Enhanced Command, Control, Battle Management and Communications within budget project MD25."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.920"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Beginning in FY 2013, Advanced Technology Modeling and Simulation is centralized in this accomplishment area for efficiencies and budget clarity.\n-Develop common modeling and simulation infrastructure, tools, and analysis capabilities that integrate with Ballistic Missile Defense System (BMDS) modeling and simulation architectures for the Standard Missile-3 Block IIB and future variant government reference concepts. \n-Create and integrate BMDS Phase III\/IV system modeling and simulation products into BMDS modeling and simulation architectures for SM-3 IIB, Directed Energy, and University Research. \n-Conduct internal benchmarking simulation exercises and yearly internal modeling and simulation reviews to drive analysis and model requirements for future concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Beginning in FY 2014, Advanced Technology Modeling and Simulation is re-titled to Advanced Concepts & Performance Assessment to more accurately represent the planned and past accomplishments \n- Work with the BMDS Architect and Systems Engineer to provide realistic assumptions, design concepts, models and assessments for technology items included within the future BMDS, elements, and component concepts\n- Provide technology concepts and assessments for next generation interceptors and kill vehicles, advanced discriminating sensors, and directed energy systems\n- Provide rapid assessments of innovative technology to expand the trade space evaluated and increase early identification of promising technology investment opportunities \n- Focus research and engineering activities from university and small business partners to identify suitable technology and concepts that improve BMDS performance by providing a rapid innovation model based engineering test bed \n- Reduce time to translate innovative technology into BMDS capability by providing integrated models of emerging concepts that characterize key parameters and expected performance to shape future technology investments and inform the BMDS architect"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Discrimination Sensor Technology"
                                    },
                                    "Description": {
                                        "val": "Starting in FY 2014, Discrimination Sensor Technology is a new focus area in the BMD Technology Program Element and includes, but is not limited to, content previously included in the Advanced Remote Sensor Technology Program Element, 0604886C, Budget Project, MD95. The development of advanced algorithms for discrimination that began under the Enhanced, Command, Control, Battle Management and Communication focus area will continue in FY 2014 under the Discrimination Sensor Technology focus area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "77.305"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "77.305"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Evaluate and research discrimination requirements and identify technologies that significantly increase the ability of the current BMDS to identify lethal and non-lethal threat objects \n- Evaluate and research emerging technology that enable game changing discrimination improvements for incorporation into next generation interceptors, kill vehicles, and directed energy systems\n- Assess and characterize sensor components and sensor systems capable of precision tracking and advanced discrimination through laboratory, ground, and flight tests\n- Incorporate discrimination sensor field test measurements into models and simulations to anchor capability improvements\n- Conduct Near Field Infrared Experiment (NFIRE) On-Orbit Operations and perform cooperative tests with other overhead assets to collect baseline sensor capability data\n- Conduct analysis of sensor data from Space Tracking and Surveillance System (STSS), NFIRE, and Overhead Persistent Infrared (OPIR) observations, both individually and combined to identify advanced phenomenology and techniques to aid future architectures\n- Mature through analysis, demonstration, and test the critical radiation hard technologies necessary to enable future very high altitude and space based-sensing options\n- Develop and test real time advanced algorithms for dim target detection and tracking, discrimination support, hit assessment, and wideband infrared sensor data and exploitation\n- Initiate and conduct performance assessments and concept evaluations for advanced discriminating sensor options to include alternative sensor payload configurations\n- Begin the design of a discriminating sensor test platform to provide a technology test bed for discrimination sensors, detectors and advanced discrimination algorithms, and compatibility with directed energy systems"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapons Technology"
                                    },
                                    "Description": {
                                        "val": "Starting in FY 2014, Weapons Technology is a new focus area in the BMD Technology Program Element and includes, but is not limited to, content previously included in the Directed Energy Research Program Element, 0603901C, Budget Project, MD69."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "83.470"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "83.470"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate the efficiency, producibility, and scaling potential of candidate laser technology\n- Demonstrate a 10 kilowatt (kW) subscale Diode Pumped Alkali Laser System (DPALS) with high efficiency and excellent beam quality\n- Improve operability and performance of the DPALS to increase average laser power, increase laser system efficiency, measure beam quality and reduce risks to system performance from chemical interactions\n- In conjunction with the Defense Advanced Research Projects Agency (DARPA), demonstrate a 30 kW fiber combining laser scalable to high power with high efficiency and near-ideal beam quality (to efficiently deliver photons to targets at long range).\n- Conduct experiments using a high altitude, low mach platform to validate high altitude, low mach directed energy lethality models\n- Measure optical turbulence to validate model predictions that a high altitude, low mach platform can meet the low jitter requirements for the next generation high altitude directed energy system\n- Initiate design to address size, weight, and power platform constraints to integrate a 200 kilowatt (kW) class directed energy laser on a high altitude, low mach platform\n- Identify and assess technology and interceptor architectures that balance requirements between the Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) and the weapon system(s)\n- Identify component technology requirements, develop, demonstrate and assess technology designs for directed energy systems; high-speed interceptor propulsion; miniaturized light-weight structures, thermal protection systems and avionics; optimal guidance and control technologies; survivable and secure electronics;  long-range, high-data rate communications systems and novel launcher systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance"
                                    },
                                    "Description": {
                                        "val": "Advanced C4ISR is a new accomplishment area in FY 2014, but is a derivation of work accomplished in FY 2013 in the Sensors (0603907C) and C2BMC (0603896C) Program Elements"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "43.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "43.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Develop and mature technology for integrated track processing and battlefield decision aids to facilitate integration of the Services command and sensor networks into the Ballistic Missile Defense System (BMDS)\n- Develop advanced X-band radar target acquisition and discrimination capabilities against threats launched over extended geographical regions on wide range of flight trajectories \n- Demonstrate C2BMC capabilities to task X-band radar and pass target data to all BMDS weapon systems"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.816"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Awarded Advanced Research contracts to domestic universities for innovative early intercept investigations\n\n-Managed and oversaw ongoing domestic university research projects in:\n--Johns Hopkins University: Parameterized Fragmentation Models for Intercept optical Signatures --Investigated fragmentation of debris during intercept event to determine metrics for kill assessment.\n--Alabama A&M University: Innovative Methods for Computational Algorithms Utilizing Reconfigurable Devices -- Significant progress implementing algorithm solutions on Field Programmable Gate Arrays (FPGA)\n--University of Alabama Huntsville: Rapid Response Architectures -- Optimized and automated the  integration, use, and performance metrics of multiple weapon systems into integrated flexible architectures to optimize battlefield management  \n--University of Alabama Huntsville: Computational Aero-Optics Simulation Development -- Investigated algorithms to assess and predict aero-optic effects on sensor and laser systems \n--United States Air Force Academy: Active Coherent Beam Combining of High Power Fiber Lasers -- Investigated scalable, robust and reliable active coherent beam combining technology for high-power laser arrays using a hologram to interrogate output wave front and correct optical path length \n--United States Air Force Academy: Scaling DPAL to kilowatts - Developed state-of-the-art technique for scaling of laser systems to KW output power levels while maintaining optical efficiency greater than 50%\n--Auburn University: Radar Signal Processing for Multi-Sensor Tracking of Multiple Targets -- Investigated and evaluated algorithms for multi-scan joint probabilistic data association for multiple maneuvering targets in a densely cluttered environment using multiple sensors \n--Clemson University: Power Scaling of High Power Fiber Lasers -- Investigated methods to successfully control the index of refraction of the active core glass\n--University of Illinois: Intelligent and Robust Control for Optimal Engagement Planning -- Developed evolutionary algorithms to determine discrete parameters and continuous control time histories for launch time, launch site, and thrust direction programming for maneuvers of each vehicle\n--University of Southern California: Adaptive Spatiotemporal Image Processing-Based Clutter Suppression -- Developed a spatial-temporal filter that rejects clutter and simultaneously compensates for jitter\n--Texas A&M University: Solid Propellant Additives for DACS Applications -- Analyzed new additives for self extinguishing propellant \n\nManaged and oversaw ongoing international University-to-University research (UUR) projects:\n--University of Nebraska Lincoln \/ University of Bordeaux, France : Fast Deposition of Diamond Films in Open Air for Thermal Management, Wear Resistance, and Corrosion Resistance -- Achieved diamond film deposition areas at a rate ten times commercialized methods with close to 100% purity\n--University of Nebraska Lincoln \/ University of Rouen, France: Polymer Parts with Tailored Microstructure Distributions Optimized for an Application -- Demonstrated ability to control parameters both in laboratory and in rapid prototyping systems to a level allowing direct transfer of laboratory settings of specific polymer mixtures providing best uniform results into rapid prototyping \n--North Carolina State University \/ Czech Technical University: Algorithm Development for Multi-Modality Image Reconstruction -- Investigated algorithm framework for modeling integrated target recognition and tracking\n\n-Conducted Advanced Technology Innovation Broad Agency Announcement (ATI BAA) solicitation for identifying potentially breakthrough research on missile defense related technology with private industry, qualified accredited educational institutions, and nonprofit organizations. The following tops were awarded:\n--Target handoff and resource management for multi-sensor multi-target tracking systems\n--Combustion characterization of fine hypergolic sprays\n--Infrared analysis in counterfeit parts detection and supply chain validation\n--High altitude low mach platform vibration characterization experiments\n--High altitude turbulence, boundary later disturbance and beam propagation jitter characterization experiments\n--Light weight beam control technology concepts\n\n-Developed common modeling and simulation infrastructure, tools, and analysis capabilities that integrate with Ballistic Missile Defense System (BMDS) modeling and simulation architectures for advanced technology development\n\n-Conducted System Engineering to identify initiatives to defend against current and future threats\n\n-Managed the selection process of the Small Business Innovation Research (SBIR) and Technology Applications programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.225"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Award Advanced Research contracts to domestic universities for innovative early intercept investigations \n-Invest in second and third year of ongoing university contracts \n-Sponsor breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement (BAA) \n-Manage the Small Business Innovation Research (SBIR) and Technology Applications programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications \n-Conduct System Engineering to identify initiatives and technology to defend against current and future threats"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.188"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.188"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Award Advanced Research contracts to domestic universities for innovative investigations to enlarge the battle space and enhance discrimination and raid handling \n\n-Invest in ongoing University research:\n--Clemson University: Power scaling capability of High Power Fiber Laser Research \n--Texas A&M University: Solid Propellant Additives for Divert Attitude Control System (DACS) Applications \n--Tuskegee University: Mechanical properties, fracture behavior and failure mechanisms of selective composites for re-entry vehicles \n--University of Illinois: Decision Theory for Optimal Engagement Planning \n--University of Tennessee: Target Handoff and Resource Management for Multi-Sensor Multi-Target Tracking System \n--North Carolina State University\/Czech Republic Institute of Physics: Multi-sensor algorithm development to track space objects and debris \n--U.S. Air Force Academy: Scaling Diode Pumped Alkali Lasers for higher power output. \n--Alabama A&M University: Computational algorithms using reconfigurable logic devices. \n--University of Alabama Huntsville: Computational studies of aero-optic effects of higher Reynolds numbers gas flows over sensor structures. \n--University of Southern California: Algorithms for detection, track, and classification of objects in a high debris environment. \n--Texas A&M University: Hybrid Waveguide\/Micro Electro Mechanical System Optical Signal Processor \n\n-Sponsor breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement (BAA), to include research in: \n  --  Lightweight optics \n  --  Passive jitter control using mechanical isolation \n  --  Lightweight rigid optics mounts \n  --  Beam control optimization \n  --  Interceptor Technology\n  --  Sensor Technology\n\n-Partner with industry, the High Energy Laser Joint Technology Office, Universities and National Laboratories through advanced technology initiatives to improve sensor technology, high energy laser acquisition, tracking, and pointing technology, and lightweight fiber laser amplifiers\n\n-Conduct research and material solution analysis to identify initiatives and technology to include missiles, sensors, and command and control components in the defense against current and future threats\n \n-Leverage University-to-University (UUR) International Research opportunities with allied nations to enhance BMDS Advanced Technology initiatives and build stronger relationships with Missile Defense Agency (MDA) North Atlantic Treaty Organization (NATO) partner countries and our ally nations\n \n- Manage the selection process of the Small Business Innovation Research (SBIR) and Technology Applications programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications\n\n-Conduct System Engineering to identify initiatives and technology to defend against current and future threats"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Business Innovation Research (SBIR) Program Support"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.317"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Executed the FY 2012 Small Business Innovation Research\/Small Business Technology Transfer (SBIR\/STTR) MDA requirements-driven investment strategy including eight research areas, forty-three SBIR\/STTR topics and associated budgets \n-Awarded 123 Phase I SBIR and 14 Phase I STTR contracts leading to 90 follow-on prototype development efforts \n-Awarded 91 Phase II SBIR and 8 Phase II STTR contracts intended to transition to C2BMC, interceptor and space systems \n-Augmented promising Phase II programs to advance Technology Readiness Levels (TRLs) and aid transition\/commercialization \n-Conducted Phase II Transition invitation and assessments with additional augmentations pending \n-Generated and received approval for FY 2013 SBIR\/STTR investment strategy including eight Research Areas, SBIR topics, STTR topics, and associated budgets \n-Conducted outreach activities to mentor small business and foster best practices to increase the likelihood of successful technologies being transitioned into the BMDS \n-Conducted Technology Applications Reviews and Business Focus Workshops to assist MDA-funded technology developers find and enter technology transfer opportunities beyond MDA applications"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Small Business Innovation Research Program Support effort transfers to the Advanced Research accomplishment within this budget project MD25 beginning in FY 2013 to achieve efficiencies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603881C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Terminal Defense Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "381.041"
                                        },
                                        "CurrentYear": {
                                            "val": "316.929"
                                        },
                                        "BudgetYearOne": {
                                            "val": "268.990"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "268.990"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "309.901"
                                        },
                                        "BudgetYearThree": {
                                            "val": "227.476"
                                        },
                                        "BudgetYearFour": {
                                            "val": "262.488"
                                        },
                                        "BudgetYearFive": {
                                            "val": "254.913"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603884C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Sensors"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "222.696"
                                        },
                                        "CurrentYear": {
                                            "val": "347.012"
                                        },
                                        "BudgetYearOne": {
                                            "val": "315.183"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "315.183"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "340.899"
                                        },
                                        "BudgetYearThree": {
                                            "val": "334.705"
                                        },
                                        "BudgetYearFour": {
                                            "val": "341.811"
                                        },
                                        "BudgetYearFive": {
                                            "val": "278.313"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603893C"
                                    },
                                    "Title": {
                                        "val": "Space Tracking and Surveillance System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "86.278"
                                        },
                                        "CurrentYear": {
                                            "val": "51.313"
                                        },
                                        "BudgetYearOne": {
                                            "val": "44.947"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "44.947"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "32.007"
                                        },
                                        "BudgetYearThree": {
                                            "val": "33.778"
                                        },
                                        "BudgetYearFour": {
                                            "val": "34.555"
                                        },
                                        "BudgetYearFive": {
                                            "val": "34.974"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603896C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Command and Control, Battle Management & Communication"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "356.900"
                                        },
                                        "CurrentYear": {
                                            "val": "366.552"
                                        },
                                        "BudgetYearOne": {
                                            "val": "418.355"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "418.355"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "433.470"
                                        },
                                        "BudgetYearThree": {
                                            "val": "454.452"
                                        },
                                        "BudgetYearFour": {
                                            "val": "461.991"
                                        },
                                        "BudgetYearFive": {
                                            "val": "451.947"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603901C"
                                    },
                                    "Title": {
                                        "val": "Directed Energy Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "49.563"
                                        },
                                        "CurrentYear": {
                                            "val": "46.944"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "96.5070"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603902C"
                                    },
                                    "Title": {
                                        "val": "Next Generation Aegis Missile (Standard Missile-3 Block IIB (SM-3 IIB))"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.456"
                                        },
                                        "CurrentYear": {
                                            "val": "224.077"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603907C"
                                    },
                                    "Title": {
                                        "val": "Sea Based X-Band Radar (SBX)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "183.506"
                                        },
                                        "CurrentYear": {
                                            "val": "9.730"
                                        },
                                        "BudgetYearOne": {
                                            "val": "44.478"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "44.478"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "54.514"
                                        },
                                        "BudgetYearThree": {
                                            "val": "46.232"
                                        },
                                        "BudgetYearFour": {
                                            "val": "47.466"
                                        },
                                        "BudgetYearFive": {
                                            "val": "51.287"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0604886C"
                                    },
                                    "Title": {
                                        "val": "Advanced Remote Sensor Technology (ARST)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "58.742"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "58.7420"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy to conduct this technology development effort consists of partnering with Federally Funded Research and Development Centers and University Affiliated Research Centers.  The Missile Defense Agency will also award contracts to industry and universities via the Advanced Technology Innovation Broad Agency Announcement and competitive procurements.  This Program Element also shapes future BMDS acquisition decisions by advancing and documenting the technology readiness levels of emerging and developing technology, while simultaneously assessing the performance and contributions of the technology to the BMDS architecture."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD85"
                    },
                    "ProjectTitle": {
                        "val": "Common Kill Vehicle"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "70.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "70.000"
                        },
                        "BudgetYearTwo": {
                            "val": "70.300"
                        },
                        "BudgetYearThree": {
                            "val": "70.200"
                        },
                        "BudgetYearFour": {
                            "val": "70.100"
                        },
                        "BudgetYearFive": {
                            "val": "69.900"
                        },
                        "CostToComplete": {
                            "val": "0"
                        },
                        "TotalCost": {
                            "val": "350.50"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "Development of common kill vehicle architecture and interfaces could lower cost and raise reliability of ballistic missile defense interceptors.  Common architecture and interfaces would provide development and fielding of a common kill vehicle for Ground Based Interceptors (GBI) and Standard Missile-3 (SM-3) variants, while reducing development risk and decreasing costs.  A common kill vehicle could also facilitate rapid upgrades and replacement of key components, and also establish a scalable foundation for the production and performance for a common kill vehicle approach for both single threat negation and evolution to a volume kill concept to destroy several lethal objects from a single missile, which would provide the warfighter the ability to reevaluate shot doctrine and inventory for GBIs and SM-3 variants.  If determined to be feasible, these combined efforts will improve probability of negating large raid sizes.\n\nThe common kill vehicle development program will focus on developing and testing key technologies and concepts to include:\n\t- High performance, lightweight maneuvering propulsion\n\t- Long range acquisition seekers\n\t- Improve seeker discrimination capability\n\t- Engagement management algorithms\n\t- Shipboard compliant propulsion and leak mitigation systems\n\t- Non-proprietary software, algorithms, models and simulation\n\nThe Missile Defense Agency is executing Public Law 112-239, the National Defense Authorization Act for Fiscal Year 2013, which directed the development of a long-term plan for the Exo-Atmospheric Kill Vehicle (EKV) that addresses both modifications and enhancements to the current EKV and options for the competitive development of a next generation EKV for the GBI and any other interceptor that might be developed for the defense of the United States against long-range ballistic missiles.  We will define the technical parameters and performance capabilities for the next generation EKV which will inform the development of a common kill vehicle, its architecture and common interfaces.\n  \nThe Missile Defense Agency plans to:\n- Investigate processes and procedures to streamline manufacturing focusing on high tolerances to production processes and supply chain variability and inherent reliability\n- Optimize integration and exploit BMDS architecture and sensors of today and tomorrow, to include increased discrimination\n- Leverage relevant kill vehicle development activities and technology across the Department of Defense\n- Maximize commonality of sub-systems and components for the next generation EKV and future kill vehicle development\n- Meet Department of Defense criteria, as established in the February 2010 Ballistic Missile Defense Review, for affordability, reliability, suitability and operational effectiveness to defend against evolving and future threats from long-range missiles\n- Evaluate potential benefits and drawbacks of options for both unitary and multiple kill vehicles \n\nDevelopment of the common kill vehicle architectures and interfaces provides the Missile Defense Agency (MDA) the opportunity to balance Ballistic Missile Defense System (BMDS) architecture in light of the evolving threat and to do so at a lower cost while potentially improving performance.  By consolidating future kill vehicle technology development efforts, MDA will work with industry primes and suppliers to define the best technical approach for a modular, open architecture that yields all the aforementioned improvements for reliability and performance at a lower cost.  This modular open system approach could also increase opportunities for competition and international cooperation for all components with the common kill vehicle architecture.  This technology leads to a new high performance, high reliability, highly producible common kill vehicle that could be ready before the end of the decade."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Common Kill Vehicle"
                                    },
                                    "Description": {
                                        "val": "The Missile Defense Agency is developing common kill vehicle technology to address emerging threats and ensure the viability of the missile defense of our homeland.  This is a continuation of the work started in FY 2013, as directed by Public Law 112-239, the National Defense Authorization Act for Fiscal Year 2013."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2013 accomplishments will be reported to Congress in the response to the request for a common kill vehicle technology development plan as established by Public Law 112-239, the National Defense Authorization Act for Fiscal Year 2013. This act directed the development of a long-term plan for the Exo-Atmospheric Kill Vehicle (EKV) that addresses both modifications and enhancements to the current EKV and options for the competitive development of a next generation EKV for the Ground Based Interceptor (GBI) and any other interceptor that might be developed for the defense of the United States against long-range ballistic missiles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "70.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "70.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "We are executing key tasks focused on developing common kill vehicle technology for both the GBI and Standard Missile-3 (SM-3) missiles to address the evolving and future threat.  These investments in a common kill vehicle approach will help ensure the viability of our homeland ballistic missile defenses. \n\nOur overall strategy is to define a modular, open system kill vehicle architecture that improves performance, common interfaces and for standardized upgrades and replacement of key components.  \n\nSpecifically, we plan to:\n- Make near term investments in interceptor technology that accelerate our ability to use a common kill vehicle in a way that balances lethal object discrimination, limited inventory and cost per kill\n- Define a kill vehicle architecture, common component interfaces, and standards that streamline modifications to kill vehicles, improves performance, and broaden the vendor base for future upgrades\n- In parallel, investment in key technology development areas will be made to increase probability of kill and reliability of interceptors, including propulsion, inertial and alternative navigation, batteries and sensor components\n- Focus technology investments on kill vehicle component and sub-systems that support long range acquisition and discrimination, long operation times, multiple discreet events, precision attitude control, safe operation and minimal kill vehicle mass\n- Other investment areas include:  engagement management techniques and non-proprietary algorithms, volume kill techniques and enhanced lethality"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603882C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Midcourse Defense Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1143.313"
                                        },
                                        "CurrentYear": {
                                            "val": "903.172"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1033.903"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1033.903"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1045.500"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1002.568"
                                        },
                                        "BudgetYearFour": {
                                            "val": "815.198"
                                        },
                                        "BudgetYearFive": {
                                            "val": "781.824"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603890C"
                                    },
                                    "Title": {
                                        "val": "BMD Enabling Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "404.311"
                                        },
                                        "CurrentYear": {
                                            "val": "362.711"
                                        },
                                        "BudgetYearOne": {
                                            "val": "377.605"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "377.605"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "406.983"
                                        },
                                        "BudgetYearThree": {
                                            "val": "434.661"
                                        },
                                        "BudgetYearFour": {
                                            "val": "476.444"
                                        },
                                        "BudgetYearFive": {
                                            "val": "601.286"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603892C"
                                    },
                                    "Title": {
                                        "val": "AEGIS BMD"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1139.019"
                                        },
                                        "CurrentYear": {
                                            "val": "992.407"
                                        },
                                        "BudgetYearOne": {
                                            "val": "937.056"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "937.056"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "987.729"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1074.941"
                                        },
                                        "BudgetYearFour": {
                                            "val": "880.468"
                                        },
                                        "BudgetYearFive": {
                                            "val": "876.685"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Missile Defense Agency`s FY 2014 budget reflects an emphasis on the viability of our homeland ballistic missile defenses against future threat technology advancements.  The acquisition strategy to conduct this technology development effort consists of three focus areas. First, leverage the technical expertise of Federally Funded Research and Development Centers, University Applied Research Centers, and Universities and government laboratories.  Second, conduct risk reduction activities to identify and mature the technology necessary to increase the reliability and performance of our kill vehicles using our Advanced Technology Innovation Broad Agency Announcement and competitive procurements.  Third, through competition with missile integration contractors, development of a common kill vehicle architecture and interfaces with follow on competitive design of volume kill concepts incorporating lightweight kill vehicles and discrimination capability."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program Wide Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.437"
                        },
                        "CurrentYear": {
                            "val": "3.970"
                        },
                        "BudgetYearOne": {
                            "val": "9.321"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.321"
                        },
                        "BudgetYearTwo": {
                            "val": "8.249"
                        },
                        "BudgetYearThree": {
                            "val": "9.017"
                        },
                        "BudgetYearFour": {
                            "val": "10.356"
                        },
                        "BudgetYearFive": {
                            "val": "12.101"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "Program-Wide Support (PWS) contains non-headquarters management costs in support of Missile Defense Agency (MDA) functions and activities across the entire Ballistic Missile Defense System (BMDS). It Includes Government Civilians, Contract Support Service, and Federally Funded Research and Development Center (FFRDC) providing integrity and oversight of the BMDS as well as, supporting MDA in enabling the development and evaluation of technologies that will respond to the changing threat. In addition, includes Global Deployment personnel and support performing deployment site preparation and activation. Other costs included provide facility capabilities for MDA Executing Agent locations, such as physical and technical security, legal services, travel and agency training, office and equipment leases, utilities, data and unified communications support, supplies and maintenance, materiel and readiness and central property management of equipment, and similar operating expenses. Also includes legal settlements. In keeping with congressional intent, Program Wide Support is allocated on a pro-rata basis and therefore, fluctuates by year based on the total MDA budget."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Wide Support"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.437"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See paragraph A: Mission Description and Budget Item Justification"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.970"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See paragraph A: Mission Description and Budget Item Justification"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.321"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.321"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See paragraph A: Mission Description and Budget Item Justification"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}