{
    "id": "f941a5ab9d4e000f5a7cadacc8581791c056916a",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604051D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Acquisition Challenge Program (DACP)"
        },
        "R1LineItemNumber": {
            "val": "117"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "24.833"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Authorized by Title 10, U.S. Code, Section 2359b, the Defense Acquisition Challenge Program (DACP) increases opportunities to insert innovative and cost saving technologies into Department of Defense (DoD) acquisition programs.  DACP funds the test and evaluation of technologies and products with potential to improve performance, affordability, manufacturability, or operational capability of current acquisition programs at the subcomponent, component, or system level."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "24.836"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.833"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.003"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.003"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "The Defense Acquisition Challenge Program (DACP) concluded its efforts at the end of FY 2012."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P051"
                    },
                    "ProjectTitle": {
                        "val": "Defense Acquisition Challenge Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.833"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Authorized by Title 10, U.S. Code, Section 2359b, the Defense Acquisition Challenge Program (DACP) increases opportunities to insert innovative and cost-saving technologies into Department of Defense (DoD) acquisition programs.  DACP funds the test and evaluation of technologies and products with potential to improve performance, affordability, manufacturability, or operational capability of current acquisition programs at the subcomponent, component, or system level.\n \nSince the program inception in FY 2003, Office of Secretary of Defense (OSD) has initiated 176 projects; 117 projects have been completed to date; 83 met Service or Agency testing requirements, and 61 led to procurements with technology currently in use by our warfighters in Iraq, Afghanistan, or at U.S. training facilities.  Given the program tests developed equipment, Service and United States Special Operations Command (USSOCOM) program managers report that the average Research, Development, Test and Evaluation (RDT&E) and Operations and Support (O&S) non-recurring cost avoidance is at least 5-to-1.\n\nThe DACP provides the DoD an efficiency that is not generally recognized.  With centralized DACP funding in OSD, funding can be readily moved among the Services and USSOCOM to take advantage of emerging opportunities and fund joint projects.\n\nDACP increases opportunities for domestic vendors to enter the DoD acquisition process.  Although business size is not an evaluation criterion, approximately 60 percent of the projects awarded are with technology providers at the small or mid-sized enterprise level.  DACP has the additional DoD\/National Security benefit of expanding the industrial base for Defense acquisition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expendable Automated Data Ex-filtration Module for Expeditionary Unmanned Underwater Vehicle (UUVs) (Navy)"
                                    },
                                    "Description": {
                                        "val": "Test deployable radio relay buoys for the Navy’s MK 18 UUV.  The Wireless Aquatic Telemetry Exfiltration Radio Bottles (WATER Bottles) are released from a submerged UUV, float to the surface, and transmit critical sensor data via satellite communications to operator stations and surface ships.  This project combines two Small Business Innovation Research Phase III concepts (launching system and relay device), integrates them onto a MK 18 UUV, and tests the system in an operationally representative environment. Successfully implementing this capability will reduce the Navy’s Mine Warfare tactical timeline, expedite the delivery of mine detection data, allow the UUV to remain on task, and enable operators to locate disabled UUVs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning in 1Q FY 2012.  Coordinated with test facilities and integrated key product team members throughout 2Q FY 2012.  Conducted UUV integration and initial testing during 1Q FY 2013.  Execute field user evaluation during 2Q FY 2013.  Antipiciated final closeout and procurement decision during 3Q FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Cloud Market Place (Navy)"
                                    },
                                    "Description": {
                                        "val": "Evaluate government open source software that has been tested and deployed in the Intelligence Community.  The project challenges the Navy’s traditional deployment of software applications by adopting a widely accepted commercial application marketplace.  This marketplace will initially be hosted on aircraft carriers and will allow users on board any ship within a carrier strike group to discover and access the latest tactical widgets, applications, and services in a disconnected, intermittent or limited bandwidth communications environment. Successfully implementing the Tactical Cloud Market Place will provide the Navy a framework for rapid capability deployment at a significantly reduced cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.350"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning in 1Q FY 2012.  Coordinated with test facilities and integrated key product team members throughout 2Q FY 2012.  Conducted initial developmental testing during 1Q FY 2013.  Conduct shore based performance testing during 2Q FY 2013.  Conduct operational assessment during 3Q FY 2013.  Procurement decision and closeout in 4Q FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamic Modems (Navy)"
                                    },
                                    "Description": {
                                        "val": "Tests commercial-off-the-shelf Dynamic Modems as replacements for the existing Frequency Division Multiple Access modems.  New modems offer the potential to double shipboard network throughput from two to four megabits per second for DDG destroyers and from 12 to 24 megabits per second for CVN aircraft carriers.  These new modems are widely used in the commercial Information Technology sector and will provide the Navy with quicker dissemination and retrieval of time critical information such as targeting data.  Additionally, new modems will provide forward deployed units or first responders a quick entry into shipboard networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.325"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning in 1Q FY 2012.  Coordinated with test facilities and integrated key product team members throughout 2Q FY 2012.  Conducted system baseline testing during 1Q FY 2013.  Integration and initial developmental testing during 2Q FY13.  Conduct operational performance testing 3Q FY 2013. Procurement decision 4Q FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Man Portable Power Generation System (Air Force)"
                                    },
                                    "Description": {
                                        "val": "Test a field-ready ruggedized direct methanol fuel cell system.  This system will provide significant weight savings and increased safety compared to the current methods of providing and carrying energy for the dismounted operators in the field."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.045"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning in 1Q FY 2012.  Coordinated with test facilities and integrated key product team members throughout 2Q FY 2012.  Received test articles in 1Q FY 2013.  Conduct initial qualification and safety testing during 2Q FY 2013.  Conduct operational evaluations in 3Q FY 2013.  Procurement decision anticipated in 4Q FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Electronic Warfare Capability (United States Special Operations Command (USSOCOM))"
                                    },
                                    "Description": {
                                        "val": "Test a revolutionary capability that networks multiple types of Electronic Warfare (EW) equipment between different rotary wing aircraft.  This project will provide multi-platform threat geo-location, real time threat management, threat tracking and playback, multi-platform sensor fusion, and coordinated threat engagement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.261"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning in 1Q FY 2012.  Coordinated with test facilities and integrated key product team members throughout 2Q FY 2012.  Conduct system integration and initial testing during 2Q FY 2013.  Conduct flight testing during 3Q FY 2013.  Procurement decision anticipated in 4Q FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Polymer Family of Lightweight Ammunition (United States Special Operations Command (USSOCOM))"
                                    },
                                    "Description": {
                                        "val": "Evaluates injection molded polymer cartridge cases than can improve system accuracy, reduce the rapid price fluctuations due to brass costs, and reduce the overall weight of the cartridge by 25 percent - 30 percent (e.g., approximately 2.5 pounds on 200 rounds of 7.62mm)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning in 1Q FY 2012.  Coordinated with test facilities and integrated key product team members throughout 2Q FY 2012.  Received Phase I test articles in 1Q FY 2013.  Conduct comparative assessment and down select during 2Q FY 2013. Receive Phase II test articles and conduct limited user evaluation during 3Q FY 2013.  Procurement decision anticipated in 3Q FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Micro Defense Automated GPS Receiver (MicroDAGR) Selective Availability Anti-Spoofing Module (SAASM) 3.7 and Targeting Application (United States Special Operations Command (USSOCOM))"
                                    },
                                    "Description": {
                                        "val": "Tests a smaller, lighter, simplified Global Positioning System (GPS) receiver that is easy to use and expands the targeting capabilities for the war-fighter.  The development of the MicroDAGR targeting application will provide the capability to interface with a laser range finder for fire support missions requiring a SAASM GPS for targeting."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.570"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning in 1Q FY 2012.  Coordinated with test facilities and integrated key product team members throughout 2Q FY 2012.  Received test articles in 1Q FY 2013.  Conduct initial developm ental testing and operational assessment during 2Q FY 2013.  Procurement decision and fielding anticipated during 3Q FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "70mm Rocket Penetrator Guidance System & Digital Rocket Launcher (United States Special Operations Command (USSOCOM))"
                                    },
                                    "Description": {
                                        "val": "Tests a low cost, light weight, precision guided, and low collateral damage 70mm rocket and launcher that incorporates laser designated Lock on Before Launch and Lock on After Launch capability.  The rocket uses a joint direct attack munitions semi-active laser seeker and a 70mm enhanced electronic delay warhead. The precision rocket will have range from 1.5Km to 8Km."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.050"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning in 1Q FY 2012.  Coordinated with test facilities and integrated key product team members throughout 2Q FY 2012.  Received test articles in 2Q FY 2013.  Conduct initial developmental testing and safety assessment during 3Q FY 2013. Conduct operational assessment during 4Q FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Domestic Aluminum Alloys for Protection of Armored & Tactical Vehicles (Army)"
                                    },
                                    "Description": {
                                        "val": "Qualifies both C79 and AA2060 alloys as weld-able under MIL SPECs for acquisition. These alloys offer improved ballistics, improved forging for production of complex components, and inherent stress corrosion cracking resistance, which makes these materials possible candidates for use in the Ground Combat Vehicle, the Joint Light Tactical Vehicle, USMC Amphibious Combat Vehicle, and new production M2 Bradleys and Armored Multipurpose Vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.050"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning in 1Q FY 2012.  Coordinated with test facilities and integrated key product team members throughout 2Q FY 2012.  Received test articles in 1Q FY 2013.  Conduct ballistics and weld qualification during 1Q FY 2013. Conduct safety and blast testing during 2Q FY 2013. Perform user evaluations during 3Q FY 2013.  Procurement decision anticipated in 4Q FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Korean Advanced Text Translator (Army)"
                                    },
                                    "Description": {
                                        "val": "Evaluates software that will improve the war-fighter’s ability to collaborate and communicate with Republic of Korea coalition forces.  The resulting Korean Advanced Text Translator will provide document translation (Microsoft PowerPoint, Word, Outlook) for use on the Combined Enterprise Regional Information Exchange-Korea network."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.669"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning in 1Q FY 2012.  Coordinated with test facilities and integrated key product team members throughout 2Q FY 2012.  Obtained Certification & Accreditation during in 1Q FY 2013.  Perform operational assessment during 2Q FY 2013.  Procurement decision anticipated in 3Q FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Mortar Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Evaluates a manufacturing capability for new nickel alloy mortar tubes to provide improved weapons at lower cost.  This will be achieved by applying state of the art Inconel electrochemical manufacturing technology.  This technology is currently being employed in full rate production of various General Electric aircraft engines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.140"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning in 1Q FY 2012.  Coordinated with test facilities and integrated key product team members throughout 2Q FY 2012.  Received test samples in 1Q FY 2013.  Conduct subcomponent testing during 2Q FY 2013.  Receive newly coated test article and initiate live fire evaluations during 3Q FY 2013."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minor Resource Projects (Less than one million dollars)"
                                    },
                                    "Description": {
                                        "val": "Defense Acquisition Challenge Program initiated the following projects in FY 2012:  Embedded Training for Navy Rotary Wing School (Navy), Field Repair Solution for Rotor Blade Erosion Damage (Navy), Catapult Water Break Corrosion Inhibitor (Navy), Non-Magnetic, Non-Sparkling Commercial-off-the-Shelf Underwater Explosive Ordnance Disposal Tools (Navy), Carrier Full Motion Video \/ Intelligence, Surveillance, and Reconnaissance Data Exploitation from Manned and Unmanned Aircraft (Navy), Landing Craft Air Cushion Scavenge Fan (Navy), M2 Small Dome Antenna for on-the-move gunfire detection systems (United States Special Operations Command), Automatic Off-Road Routing for Mission Planning\/Execution (United States Special Operations Command), Deployable Shelter\/Detention System (Army), Enhanced Combat Vehicle Crewman Coverall (Army), Lightweight Combat Vehicle Crewman Helmet (Army), Tactical Communication and Hearing Protective System (Army), and Universal Battery Charger (Army)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.123"
                                            },
                                            "Text": {
                                                "val": "In FY 2012, Defense Acquisition Challenge Program initiated test planning, coordinated test facilities, and integrated key product team members for the above projects.  In FY 2013, the projects will complete testing, receive test articles, and finalize reporting and transition plans."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Acquisition Strategy for Defense Acquisition Challenge Program (DACP) is as outlined in Title 10 DACP provides opportunities for the increased introduction of innovative and cost-saving technology in acquisition programs of the DoD.  DACP funding is used to fund testing of commercial and non-developmental items that could result in improvements in performance, affordability, manufacturability, or operational capability of an existing acquisition program. It is expected that, should testing be successful, cognizant acquisition program of record will procure."
                        },
                        "PerformanceMetrics": {
                            "val": "Generic performance metrics applicable to these RDT&E initiatives includes attainment of DoD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology program\" and the metrics for this objective is to transition 40 percent of completing demonstration programs per year.  From program inception in 2003 until 2012, the Office of Secretary of Defense has initiated 176 projects; 117 projects have been completed to date; 74 met Service or Agency testing requirements and 61 led to procurements with technology currently in use by our war-fighters in Iraq, Afghanistan, or at U.S. training facilities.  The FY 2012 DACP projects have a transition rate of approximately 83 percent for completed projects, exceeding the objective of 40 percent.  In FY 2013, we anticipate the majority of our FY 2012 projects to complete successfully and transition to the war-fighter."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "DACP provides opportunities for the increased introduction of innovative and cost-saving technology in acquisition programs of the DoD.  Through a competitive process, DACP funding is used to fund testing of commercial and non-developmental items that could result in improvements in performance, affordability, manufacturability, or operational capability of an existing acquisition program.  It is expected that, should testing be successful, the cognizant acquisition program of record will procure."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Defense Acquisition Challenge Project"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "BA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various DoD activities"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various DoD activities"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "24.833"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}