{
    "id": "fee8cf4a81e7c4bd90e4f2108225290a0d3dfef5",
    "meta": {
        "filename": "dod-2014_RDTE_2014_OSD_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.zzz_unzipped_RDTE_MasterJustificationBook_Office_of_Secretary_Of_Defense_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603699D8Z"
        },
        "ProgramElementTitle": {
            "val": "Emerging Capabilities Technology Development"
        },
        "R1LineItemNumber": {
            "val": "48"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "43.377"
            },
            "CurrentYear": {
                "val": "24.662"
            },
            "BudgetYearOne": {
                "val": "61.971"
            },
            "BudgetYearOneBase": {
                "val": "61.971"
            },
            "BudgetYearTwo": {
                "val": "45.706"
            },
            "BudgetYearThree": {
                "val": "44.058"
            },
            "BudgetYearFour": {
                "val": "44.438"
            },
            "BudgetYearFive": {
                "val": "45.893"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The FY 2014 funding increase is directly related to the funding insertion of the new \"Disruptive Technology Demonstrations\" project.  Resulting from the guidelines provided by the Secretary of Defense in the Defense Strategic Guide (Sustaining Global Leadership: Priorities for 21st Century Defense), the reallocation of funds will support the identification and demonstration of disruptive solutions.  These resources will support specific time-sensitive capability needs that address Secretary\/Department Strategic Vectors and Chairman’s Gap Assessment of capability shortfalls.  The funding increase to P795:  Emerging Capabilities Technology Development for FY 2014 supports Department-wide S&T priorities and advanced developmental prototyping."
        },
        "ProgramElementMissionDescription": {
            "val": "This funding develops emerging capabilities and advanced developmental prototypes in support of near and mid-term irregular warfare and stability operations.  The framework is guided by the Office of the Assistant Secretary of Defense, Research and Engineering (ASD(R&E)), the Deputy Assistant Secretary of Defense of Rapid Fielding (DASD RF), and the Rapid Reaction Technology Office (RRTO) science and technology objectives and focus areas.  With an emphasis on interagency and Service partnerships, initiatives are developed to pursue risk-reducing prototypes and demonstrations in order to produce capability options that anticipate and inform formal joint and interagency requirements and acquisition processes.  Individual projects generally span a two to three year period and are demonstrated and fielded in spirals within the project timeline.  During FY 2012 and FY 2013, RRTO continued to expand its maritime and irregular warfare portfolio as a complement to the existing maritime technology demonstrator and ground, and Intelligence, Surveillance, and Reconnaissance (ISR) portfolios and in FY 2014 RRTO will continue these efforts and enhance its focus on developmental rapid prototyping.  This program element has evolved from exclusive support of force transformation activities to the activities described above, which is more closely aligned with departmental goals."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "26.160"
                },
                "CurrentYear": {
                    "val": "24.662"
                },
                "BudgetYearOne": {
                    "val": "24.675"
                },
                "BudgetYearOneBase": {
                    "val": "24.675"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "43.377"
                },
                "CurrentYear": {
                    "val": "24.662"
                },
                "BudgetYearOne": {
                    "val": "61.971"
                },
                "BudgetYearOneBase": {
                    "val": "61.971"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "17.217"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "37.296"
                },
                "BudgetYearOneBase": {
                    "val": "37.296"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "17.225"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "37.296"
                                },
                                "BudgetYearOneBase": {
                                    "val": "37.296"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.008"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2012: Increase of $17.217 million is due to congressional reprogramming of $16.700 million for the Enhanced Mortar Target Acquisition System (EMTAS)\/ Advanced Mortar Protection system (AMPS), and net adjustments of $0.517 million from SBIR\/STTR, reprogrammings and other adjustments to support OSD efforts.\n\nFY 2014: Net increase is due to a baseline adjustment that reflects DoD priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P795"
                    },
                    "ProjectTitle": {
                        "val": "Emerging Capabilities Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "43.377"
                        },
                        "CurrentYear": {
                            "val": "24.662"
                        },
                        "BudgetYearOne": {
                            "val": "34.971"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.971"
                        },
                        "BudgetYearTwo": {
                            "val": "17.706"
                        },
                        "BudgetYearThree": {
                            "val": "16.058"
                        },
                        "BudgetYearFour": {
                            "val": "15.438"
                        },
                        "BudgetYearFive": {
                            "val": "15.893"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element was a new start in FY 2012 and reflects a transition from 0605799D8Z to 0603699D8Z in FY 2012.\n\nThis funding develops emerging capabilities and advanced developmental prototypes in support of near and mid-term irregular warfare and stability operations. The framework is guided by the Office of the Assistant Secretary of Defense, Research and Engineering (ASD(R&E)), the Deputy Assistant Secretary of Defense of Rapid Fielding (DASD RF), and the Rapid Reaction Technology Office (RRTO) science and technology objectives and focus areas.  With an emphasis on interagency and Service partnerships, initiatives are developed to pursue risk-reducing prototypes and demonstrations in order to produce capability options that anticipate and inform formal joint and interagency requirements and acquisition processes.  Individual projects generally span a two to three year period and are demonstrated and fielded in spirals within the project timeline.  During FY 2012 and FY 2013, RRTO continued to expand its maritime and irregular warfare portfolio as a complement to its existing maritime technology demonstrator and ground, and Intelligence, Surveillance, and Reconnaissance (ISR) portfolios and in FY 2014 RRTO will continue these efforts and enhance its focus on developmental rapid prototyping.  This program element has evolved from exclusive support of force transformation activities to the activities described above, which is more closely aligned with departmental goals."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Overwatch"
                                    },
                                    "Description": {
                                        "val": "Overwatch is an overarching ground capability development effort which is leveraging technology and new concepts to fill ground combat and interagency capability gaps.  It contains multiple initiatives seeking to cultivate and leverage emerging technologies and concepts to counter the current and future challenges characteristic of the irregular warfare environment.  Projects are oriented toward increasing warfighter effectiveness on the battlefield and\/or the development\/enhancement of “whole of government” irregular warfare capabilities.\n  \nThe capability development effort furthers interagency capabilities by pursuing concept experimentation\/validation, interoperability enhancements, and command and control development.  Ground capabilities focus on command and control, force protection, situational awareness, and networked, cooperative engagement.  These solutions include completed operational assessments, equipment prototypes, or validated concepts which can be used to inform and drive formal procurement processes and\/or policy decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.447"
                                            },
                                            "Text": {
                                                "val": "Project Overwatch executed 14 active subordinate projects in FY 2012: the Enhanced Mortar Target Acquisition System (EMTAS)\/Advanced Mortar Protection System (AMPS); Intelligent Small Unit Power (ISUP), Campaign Planning and Assessment Requirements\/Identifying Human and Technological Resource Requirements; High Speed-Hostile Fire Detection System (HFDS); Forward Operating Base Defense Integrated Protection Initiative; Off-the-shelf Guided Munitions; Walking Papers: Building Geospatial Understanding; QuickNETS—Humanitarian Assistance\/Disaster Relief effort; Spectral Management effort for uniforms and equipment; Building Effective Institutions; NeXTech; Advanced Countermeasure Prototype; Buoyant Body Armor, and Humanitarian Assistance\/Disaster Relief (HA\/DR) Test Center.  \n\nNew start projects in FY 2012 were: the NexTech project to identify potentially game-changing, disruptive technologies for DoD, and provide a model for analyzing the potential implications of emerging technologies from technical, social, political, legal and ethical perspectives; the Advanced Countermeasure Prototype effort to develop a low-cost prototype counter-rocket-propelled grenade (RPG)\/surface to air missile protective capability for rotary wing aircraft; the Spectral Management project to reduce equipment and uniform signatures across the infrared spectrum by producing prototype materials to mitigate this vulnerability; the Buoyant Body Armor project to develop lightweight, more flexible, buoyant body armor while providing a similar level of protection as the armor currently used; and the HA\/DR-Test Center to stand up a technology experimentation center in the Philippines in support of U.S. Pacific Command (USPACOM)\/U.S. Marine Corps Forces Pacific Command (MARFORPAC) in conjunction with the Armed Forces of the Philippines.\n\nThe EMTAS\/AMPS systems completed a one year deployment to Afghanistan and received a $16.7M congressional reprogramming to support a USCENTCOM Joint Urgent Operational Needs Statement (JUONS) request for an additional twenty systems. The HFDS was demonstrated in various configurations, which resulted in its consideration for transition to the US Army, US Marine Corps and US Navy.  The Forward Operating Base Defense Integrated Protection Initiative deployed a suite of capabilities to two Forward Operating Bases in Afghanistan; the Army is analyzing the results.  QuickNETS deployed multiple times in support of exercises in U.S. Pacific Command (USPACOM) and U.S. Southern Command (USSOUTHCOM) areas of operation with great success and is working towards a transition into the Unclassified Information Sharing Enterprise Service (UIS) with the Department of Defense, Chief Information Officer (DoD CIO). In addition, an FY 2011 program — Gunslinger Package for Advanced Convoy Security (GunPACS) — transitioned to the US Marine Corps, which allocated funding to maintain the GunPACS capability deployed in theater.  The Marine Corps Requirements Oversight Council will determine whether to support the procurement of additional GunPACS systems in support of an Urgent Needs Statement from USMC users."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.271"
                                            },
                                            "Text": {
                                                "val": "Walking Papers and QuickNETS will be assessed for continuing requirements and\/or closed\/transitioned, while NexTech, Advanced Countermeasure Prototype, Buoyant Body Armor, Spectral Management, ISUP, and HA\/DR-Test Center will continue in their project developments. New projects for FY 2013 will include:  Electromagnetic Environmental Understanding which will explore how social media and emerging network technologies can be identified and exploited by a tactical unit, and the Net-Zero Engagement project which will identify more cost effective ways of engaging in unstable and transitioning states.  Additional projects will be developed and informed by ASD (R&E), DASD (RF) and RRTO objectives and focus areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.936"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.936"
                                            },
                                            "Text": {
                                                "val": "Four projects will continue in FY 2014:  Advanced Countermeasure Prototype will culminate in a controlled intercept demonstration; Buoyant Body Armor will test and demonstrate; Electromagnetic Environmental Understanding will test and deploy with an operational unit; and HA\/DR-Test Center will become self-sufficient and operate under USPACOM control.  Potential new starts for FY 2014 include Light Detection and Ranging (LIDAR) based hostile fire detection and geo-location; and a new helmet liner designed to identify and classify potential over-pressure situations leading to traumatic brain injuries.  Additional projects will be developed and informed by ASD (R&E) DASD, (RF) and RRTO objectives and focus areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Irregular Warfare\/Stiletto"
                                    },
                                    "Description": {
                                        "val": "The Maritime Irregular Warfare portfolio investigates and develops irregular warfare capability gaps in the maritime domain.  Projects explore the development of counter evolved non-state capabilities such as semi- and fully- submersible vehicles and swarms, countering unmanned swarms, maritime non-lethal weapons systems, and low cost littoral fire support, among other capabilities.  This expanded effort to address maritime capability gaps builds on and leverages the Stiletto dedicated maritime demonstration vessel.  Stiletto is a maritime demonstration platform designed to assist in the rapid transition of emerging technologies across the range of military operations to higher Technology Readiness Levels.  The 88-foot long boat is an experimental, all carbon fiber craft that was purposefully designed to rapidly acquire, integrate, and employ new capabilities to explore the military utility of emerging technologies and concepts of operation for special and expeditionary forces. The Stiletto program, managed in partnership with the Naval Surface Warfare Center’s Combatant Craft Division and the Naval Air Warfare Center Aircraft Division’s Warfare Innovation Cell, streamlines the experimentation process and helps facilitate the rapid demonstration, exploration, and risk reduction of emerging technologies and capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.605"
                                            },
                                            "Text": {
                                                "val": "The Maritime Irregular Warfare portfolio initiated several new projects in FY 2012.  The Naval Underwater Threat Interrogation and Covert Assessment Systems (NAUTICAS) is a project to non-invasively identify contraband materials such as explosives or illegal drugs being transported by maritime vessels underway.  In FY 2012, NAUTICAS was selected as the centerpiece of a joint Navy\/Joint Improvised Explosive Device Defeat Organization (JIEDDO) effort to detect Home Made Explosives (HME) in maritime domains.  The Inflatable Catamaran (I-Cat) Structural Loads Testing and I-Cat Hull Construction and Design Improvement received the endorsement of the Commander for Naval Special Warfare (NSW), as well as significant contributions from U.S. Special Operations Command (USSOCOM) and the Office of Naval Research.  The Inflatable Catamaran projects are intended to demonstrate and test improvements to the Combat Rubber Raiding Craft (CRRC).  Concurrently with execution of this project, NSW designated the inflatable catamaran as one of a family of future craft known as Combatant Craft Light (CCL Mk 1), a program of record with an Initial Operating Capability in FY 2016.  The Common Maritime Technology Working Group (CMTWG) was formed in FY 2012 to unify the combatant\/small craft community and developed a crosswalk of science and technology (S&T) needs and requirements based on input from the US Navy, US Marine Corps, US Army, US Coast Guard, and Special Warfare community.   Priorities identified through the CMTWG were used to inform future Capability Demonstrations aboard Stiletto.  Stiletto doubled the number of demonstrations it performed in FY 2012 over the previous year by working more closely with operational commands through exercises like Trident Warrior and Trident Spectre.  Twenty-five separate technologies were demonstrated during Trident Spectre 2012 which was sponsored by the Naval Special Warfare Support Activity-2.  During Trident Warrior 2012 at Fort Eustis, VA, Stiletto served as a “control ship” for multiple unmanned autonomous vessels.  During FY 2012, Stiletto also demonstrated multiple radar systems, remote stabilized weapon systems, Command, Control, Communications, Computers, and Intelligence (C4I) capabilities, full motion video, and unmanned system launch and recovery.  In FY 2012, Stiletto revised its business model to create three Capability Demonstrations per year.  Each capability demonstration is guided by an individual lead organization or command and is focused on that organization’s articulated capability needs.  In order to preserve Stiletto’s outreach to non-traditional businesses by providing a low-cost, accessible demonstration venue, Stiletto continued to offer open technology demonstration periods throughout the year."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.270"
                                            },
                                            "Text": {
                                                "val": "Projects will focus on partnerships with the US Navy, US Coast Guard, US Army Watercraft Systems, US Special Operations Command (USSOCOM), US Southern Command (USSOUTHCOM), and other operational users.  In FY 2013, NAUTICAS will continue development with the Navy and JIEDDO, moving from the lab environment to real world, controlled environment, and testing within the Continental United States (CONUS).  The goal is to have a successful prototype system that leads to the development of an operationally deployable prototype.  Continuing in FY 2013, the Inflatable Catamaran project will improve the existing design and construction processes for the inflatable hull component of the CCL Mk 1 inflatable catamaran with an initial operating capability in FY 2016. The improved hull form will increase durability, reliability and maintainability.  The new design will provide significantly increased speed, range, payload, and improved riding, supporting missions such as Maritime Area Denial. The CMTWG will identify the lead organizations for Stiletto Capability Demonstrations and continue to analyze common small craft technology needs in FY 2013.  Potential new Maritime Irregular Warfare projects for FY 2013 include demonstration of the Spike Non-Line of Site (NLOS) system in cooperation with US Navy Director of Expeditionary Warfare and US Naval Air Systems Command; development of the Spar buoy deployable ocean sensor system with the US Navy Director of Expeditionary Warfare and other partners; and an effort to focus on emerging advanced undersea weapons and sensors.  The Maritime Irregular Warfare focus area will continue to support Stiletto’s maritime technology demonstrations.  Emerging capabilities will be demonstrated on Stiletto during three Capability Demonstrations in FY 2013, including participation in Trident Warrior and Trident Spectre, as well as three Technology Demonstration periods throughout the year.  Priority will be given to demonstrations that directly assist an acquisition program, with specific focus on technology transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.942"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.942"
                                            },
                                            "Text": {
                                                "val": "The Maritime Irregular Warfare portfolio will continue to develop and demonstrate state-of-the-art capabilities in anticipation of future needs, such as the Spar buoy deployable ocean sensor system and advanced unmanned surface and undersea systems focused on ASD(R&E), DASD RF, and RRTO objectives and focus areas.  Emerging capabilities will continue to be demonstrated on Stiletto during three Capability Demonstrations with operational commands and interagency partners, as well as joint operational demonstrations and exercises.  Technology Demonstration opportunities will continue to be offered to non-traditional businesses to help mature their systems and increase engagement with the warfighter in the development process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hybrid Airship"
                                    },
                                    "Description": {
                                        "val": "In conjunction with the National Aeronautics and Space Administration (NASA) - Ames Research Center, the United States Air Force (USAF) Research Laboratory, and U.S. Transportation Command (USTRANSCOM), the Department of Defense has developed a hybrid airship demonstration vehicle known as Pelican, which is a non-deployable technology demonstrator that integrates four independent technologies into a single, rigid aeroshell variable buoyancy (RAVB) air vehicle.  The project will demonstrate the technical maturity of a scalable vertical takeoff and landing airship.  Key technologies include a buoyancy management system to enable ballast-independent operations, composite lightweight rigid internal structure to reduce environmental restrictions, a responsive low-speed\/hover control system with associated control algorithms, and a ground handling subsystem to enable operations on unimproved landing surfaces.  The program objectives are to mitigate long-term technical risks by integrating and demonstrating a suite of technologies with the potential to reduce operational constraints on future heavy-lift hybrid, buoyant-aircraft development programs.  \n\nIn FY 2011, the project was reduced to a four-year program by accelerating the funding needed to complete vehicle design, analysis, subsystem prototyping\/testing, systems integration, construction and ground testing.  The project is scheduled to end in early Fiscal Year 2013, with a hangar demonstration of the four main project objectives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Text": {
                                                "val": "The funding increase in FY 2012 was used for acceleration and technical risk reduction to the hybrid airship initiative and completion of the Pelican vehicle.  By the end of FY 2012, Pelican completed subsystems and integration onto the vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Pelican will demonstrate the ability to operate without ballast, operate on the ground without additional ground crew, maintain its shape without using gas pressure and demonstrate low speed control.  These activities will be performed using FY 2012 funding.  Following that demonstration, the objective of this effort is to leverage the work done to date and advance the data collection, measurement of performance objectives and technical risk mitigation of future airship design.  FY 2013 is the final year supporting this effort, and Assistant Secretary of Defense Research and Engineering (ASD(R&E))\/Deputy Assistant Secretary of Defense (DASD) Rapid Fielding (RF)\/Rapid Reaction Technology Office (RRTO) sponsorship will end.  This effort will inform the Department and help guide the decision process to explore future airship designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, and Reconnaissance (ISR)\/Thunderstorm\/Space"
                                    },
                                    "Description": {
                                        "val": "This portfolio examines and explores emerging technologies to complement the US Air Force (USAF), the National Reconnaissance Office (NRO), DoD’s ISR Task Force and other interagency initiatives in Intelligence, Surveillance, and Reconnaissance (ISR).   In addition, the portfolio addresses the National Space Strategy objectives to preserve and protect the space environment with a focus on developing applications for employment by the tactical user.  The flagship project for this portfolio is Thunderstorm, an enduring multi-Intelligence technology demonstration for the Office of Secretary of Defense (OSD), interagency partners, Combatant Commands (COCOMs), Services, academia, government laboratories and commercial vendors.  Thunderstorm demonstrations provide an opportunity to evaluate and assess the capabilities of new, emerging and transformational ISR technologies, and related information collection, processing, exploitation, and dissemination (PED) capabilities in mission-related, geographically, and operationally relevant environments prior to full-scale employment.  Thunderstorm demonstration objectives, performance measures, lessons learned, post-demonstration assessments and data evaluation serve to inform future DoD ISR concepts of operations and remote PED capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.223"
                                            },
                                            "Text": {
                                                "val": "Funding supported the planning and execution of the Thunderstorm Spiral 5.0 technology demonstration.  Execution of this summer 2012 spiral in Customs and Border Protection’s Rio Grande Valley (RGV) Sector leveraged partnerships with the Department of Homeland Security (DHS), Customs and Border Protection (CBP), U.S. Coast Guard (USCG), National Geospatial-Intelligence Agency (NGA), U.S. Northern Command (NORTHCOM), Joint Task Force-North (JTF-N), U.S. Southern Command (USSOUTHCOM) and the Joint Inter-Agency Task Force–South (JIATF-S).  The RGV Sector offered multi-intelligence demonstration opportunities against land, air, sea and littoral scenarios and the possibility to examine cross-domain tip\/cue architectures.  These scenarios served to challenge ISR assets in multiple domains and highlighted the strengths and weaknesses in each.  The scenarios also demonstrated how technology, when used in conjunction with existing threat procedures, can mitigate an adversary’s ability to achieve tactical surprise and advantage. \n\nA classified project was started in partnership with the National Reconnaissance Office (NRO) to develop the capability to transfer large data files from theater to the U.S. using a commercial-off-the-shelf Satellite Communications (SATCOM) High Data Rate Modem.  The project is reducing the time (from weeks to hours) to transfer large data files from theater to Contiguous United States (CONUS)-based analysts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.141"
                                            },
                                            "Text": {
                                                "val": "Thunderstorm Spirals 13-1 and 13-2 planning began in early FY 2013.  Both spirals will build on Spiral 5.0 lessons learned in the RGV Sector.  Spiral 13-1’s primary focus will be to further characterize and counter asymmetrical maritime threats and inform tactics, techniques, and procedures to detect and discriminate suspicious open water, littoral and maritime-to-land transition activity.  Execution of the spring 2013 spiral will leverage partnerships with CBP, JIATF-S, JTF-N, the USCG, NGA, NRO, USSOUTHCOM and USNORTHCOM. Spiral 13-2 will be executed in summer 2013.  This spiral builds upon Spiral 13-1 and places emphasis on the maritime-to-land transition activity and the ability for suspicious actors to quickly dissolve themselves into an urban or rural population.  This spiral incorporates National Technical Capabilities into the strategic framework.  Also in FY 2013, Thunderstorm Spiral 14-1 planning will begin.  This spiral will take place in the CBP Detroit Sector and will once again leverage DHS, USCG, CBP, NGA, USNORTHCOM and JTF-N support.  The winter 2014 spiral will focus on the transition of actors into a large urban\/suburban populace.  \n\nIn the space arena, projects will be pursued that focus on increasing satellite utility, developing transformational satellite capabilities for the tactical user and efforts to improve space situational awareness.  With the high value and long lead time to replace space assets, the goal is to preserve and protect these capabilities.\n\nThe classified project initiated in partnership with the NRO to develop the capability to transfer large data files from theater to the U.S. via a commercial-off-the-shelf SATCOM High Data Rate Modem will conclude and transition to the NRO as the primary customer.  The project reduces the time (from weeks to hours) to transfer large data files from theater to CONUS-based analysts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.967"
                                            },
                                            "Text": {
                                                "val": "Planning will continue for subsequent Thunderstorm spirals building on the experience garnered from previous spirals.  In 2014, Spiral 14-1 will be executed in the Detroit Sector of CBP.  The winter 2014 spiral will focus on the transition of actors into a large urban\/suburban populace.  \n\nPlanning will also begin for Spiral 14-2, which will examine new, emerging and transformational ISR capabilities against asymmetric maritime, riverine, airborne and land challenges.\n\nSpace projects focused on new and emerging space technology with the goal of recognizing and mitigating technological surprise and improving multi-Intelligence sensing, processing, exploitation and dissemination capabilities will be emphasized."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Science and Technology Support to Information Operations (IO)"
                                    },
                                    "Description": {
                                        "val": "This portfolio will apply the Rapid Reaction Technology Office (RRTO) business model of relatively low cost, short duration, high-impact, gap filling investments to complement DoD,  the Department of State (DoS), and DHS initiatives in the areas of Information Operations, Strategic Communication, and Public Diplomacy.  Projects of particular interest include efforts to fill gaps in tools and capabilities that support the National Counterterrorism Strategy and the Countering Violent Extremism (CVE) Abroad Framework by developing influence assessment capabilities, measures of effectiveness, social media analysis, and counter-narrative capabilities.  Specific support to United States Combatant Commands (COCOM) needs will be coordinated through the Director for Information Operations in the Office of the Under Secretary of Defense for Policy, Special Operations and Low Intensity Conflict (SO\/LIC) and the Joint Staff."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.602"
                                            },
                                            "Text": {
                                                "val": "RRTO completed an update to its previous survey and gap analysis (published in FY 2009) of the US Government’s S&T efforts for communication and persuasion abroad, broadening the field to include information operations. The May 2012 update by the Center for Naval Analyses (CNA) focused on assessing existing and needed technical capabilities to respond in a systemic, rapid, sustained, and measurable way to adversarial narratives being used to undermine US military and security efforts.  It also identified technologies to rapidly analyze and respond to those narratives in the information environment.  The final report identified gaps in seven areas to guide future project development: analytical tools, production, content delivery, research, planning, training, and evaluation tools.  The new analysis was distributed to stakeholders through DoD, COCOMs, DoS, academia, and private industry.  Four new projects were started in FY 2012 to support Information Operations and CVE needs in partnership with SO\/LIC, the COCOMs, and the DoS’s Center for Strategic Counterterrorism Communications (CSCC).  NORTHCOM Influence Assessment Capability (NIAC) Education and Training (NET) Research Project One (NETp-1) applied a social science research based approach to develop assessors’ capabilities to tailor socio-political data collection, evaluation, and analysis to a given Theater Campaign Plan objective or effect under study.  CVE Messaging is an effort for the CSCC’s Digital Outreach Team, coordinated in support of SO\/LIC and US Central Command (USCENTCOM) interests, to develop the capability to track and assess the spread and impact of al-Qa’ida (AQ) propaganda in mainstream online environments.  Further, it assessed the concurrent spread and impact of counter-messaging campaigns.  This project built on Sandia National Laboratory’s existing capabilities to track and assess the spread and impact of AQ propaganda in mainstream online environments, attributed counter-messaging by the CSCC Digital Outreach Team and assisted in guiding Geographic Combatant Command (GCC) influence and influence assessment efforts.  In FY 2012, some of the technical capabilities from the CVE Messaging project were transitioned to US Pacific Command, which will continue to fund the tools as part of its Information Operations efforts.  In addition, the Information Operations Assessment Foundation project was started with the Joint Information Operations Warfare Center to identify and adapt best practices in influence assessment for the DoD’s IO Assessment Framework.  A new project was also initiated with USCENTCOM and SO\/LIC to develop mobile applications in support of CVE activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.980"
                                            },
                                            "Text": {
                                                "val": "Projects funded in FY 2013 will support Information Operations and CVE needs in partnership with SO\/LIC, DoS’s CSCC, U.S. Agency for International Development (USAID), and DHS’s Science and Technology (S&T) Human Factors programs.  NORTHCOM’s NETp-1 project will advance to its next spiral, incorporating Commander Joint Task Force (CTJF) – Horn of Africa (HOA), U.S. Southern Command (USSOUTHCOM), and the Joint Information Operations Warfare Center as transition partners.  DoS’s CVE Messaging Impact project will continue, with participation from USCENTCOM and contributions from the Countering Terrorism Technical Support Office (CTTSO).  The Information Operations Assessment Foundation will continue in support of SO\/LIC and the Joint Staff to identify and adapt best practices from DoD as well as commercial marketing experience in influence assessment and will be used to form the DoD framework for Information Operations Assessment. Development of mobile applications in support of USCENTCOM will continue. A potential new project will focus on developing tools to improve understanding of the information environment in the littorals in support of the Marine Corps Information Operations Command."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.326"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.326"
                                            },
                                            "Text": {
                                                "val": "Projects will focus on developing technologies and capabilities in the areas of influence assessment, measurement of effectiveness, social network analysis, advanced communications technologies, and other areas identified through partnerships with other DoD, COCOM, and interagency stakeholders."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Developmental Prototyping"
                                    },
                                    "Description": {
                                        "val": "The Department will drive innovation in aviation, space, maritime and ground combat systems in a fiscally constrained environment through advanced prototyping.  This portfolio will focus on cost-effective, limited duration projects to design, develop and deliver full-scale operational prototypes of cutting-edge land, sea, air and space systems.  These prototypes will be delivered to joint and Service users to evaluate operational capability under realistic conditions and often against current capabilities or anticipated threats.  Potential venues for prototype assessment include assets such as the Stiletto Maritime Demonstration Program and Thunderstorm ISR integration exercises.  Knowledge and experience gained through those demonstrations will help develop new warfighting concepts and inform requirements and technical feasibility of future acquisition programs.  These initial prototype efforts will help reduce the cost of future acquisition programs and stimulate efforts beyond traditional defense industrial base activities.  Development of advanced prototypes will involve partnerships with industry and academia and permit operational users to gain insight into future technology-enabled strategies and tactics.  Advanced developmental prototyping provides a mechanism to guard against technological surprise, preserve industrial base capabilities, impose asymmetric strategic costs on potential adversaries, and explore innovative, technology-enabled military capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.800"
                                            },
                                            "Text": {
                                                "val": "Developmental prototyping will be a new focus area in FY 2014.  Plans for FY 2014 include pursuing development of concepts and designs that will result in fieldable prototype systems in one to two years.  Candidate efforts will address the Department’s S&T priorities, including unmanned air, ground, and underwater systems; low-cost space access; advanced rotorcraft capabilities; directed energy; energy efficient engine technology; electronic warfare; global access Intelligence, Surveillance, Reconnaissance (ISR) systems; dismounted soldier systems; vehicle active protection; and installation\/base efficiency, sustainment & protection.  Two to three advanced prototype efforts will start in FY 2014 leveraging joint or Service partnerships and involving operational commands in the evaluation of field-ready prototypes in realistic military environments.  Additional new efforts will examine and find possible leverage points to improve the state of the art for rapid prototyping.  Potential efforts may include improved materials, reduced prototyping costs and\/or improved cycle times for prototyping activities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2014, generic performance metrics applicable to Emerging Capabilities includes attainment of DoD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology (S&T) program\" and the metrics for this objective is to transition 40% of completing demonstrations program per year.  In addition, project completions and success are monitored against schedules and deliverables stated in the proposals and statements of work.  The metrics include items such as target dates, production measures, fielding dates, and demonstration goals and dates.   In FY2012, Emerging Capabilities Technology Development had 100 percent of its completing projects successfully transition."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P369"
                    },
                    "ProjectTitle": {
                        "val": "Disruptive Technology Demonstrations"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "27.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.000"
                        },
                        "BudgetYearTwo": {
                            "val": "28.000"
                        },
                        "BudgetYearThree": {
                            "val": "28.000"
                        },
                        "BudgetYearFour": {
                            "val": "29.000"
                        },
                        "BudgetYearFive": {
                            "val": "30.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Resulting from the guidelines provided by the Secretary of Defense in the Defense Strategic Guide (Sustaining Global Leadership: Priorities for 21st Century Defense), the FY 2014 funding increase will address specific time-sensitive capability needs and anticipatory concerns while maintaining low cost and small footprint operations. These resources will support specific time-sensitive capability needs that address Secretary\/Department Strategic Vectors and Chairman’s Gap Assessment of capability shortfalls."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Disruptive Technology Demonstrations project is a technology initiative to address time-sensitive capability needs and anticipatory concerns while maintaining low cost, small footprint operations. These resources are a result of capability shortfalls identified in the Defense Strategic Guide (Sustaining Global Leadership: Priorities for 21st Century Defense). The program objectives are to identify, rapidly integrate, and demonstrate disruptive, anticipatory products suited to quick deployment that fall outside of individual Service developments.  Disruptive technology demonstrations will leverage low cost, commercial, and often low technology options that don’t conform to the typical DoD acquisition business model but have the potential to disrupt and change warfighting capabilities by avoiding or creating technological surprise. Disruptive technology demonstrations can be either stand-alone technology or concept demonstrations, or utilize one of the existing Architecture and Integration venues for rapid technology architecture and assessment such as the Joint Experimentation Range Complexes (JERCs)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Disruptive Technology Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Technology Initiative to address time-sensitive, capability needs, anticipatory concerns and low-cost, small footprint operations.  These resources are a result of Secretary\/Department Strategic Vectors resulting from the capability shortfall identification in the Chairman's Gap Assessment. The program objectives are to identify, rapidly integrate, and demonstrate disruptive, anticipatory products suited to quick deployment that fall outside of individual Service developments.  Disruptive demonstrations will leverage low cost, commercial, and often low technology options that don’t conform to the typical DoD acquisition business model but have the potential to disrupt and change warfighting capabilities by avoiding or creating technological surprise.  Disruptive demonstrations can be either stand-alone technology or concept demonstrations or utilize one of the existing Architecture and Integration venues for rapid technology architecture and assessment such as the Joint Experimentation Range Complexes (JERCs)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.000"
                                            },
                                            "Text": {
                                                "val": "Disruptive Technology Demonstrations will focus on addressing anticipatory concerns, and small footprint, low-cost operations, among others. Utilizing low cost, commercial, or low technology options outside the typical DoD acquisition business model, this initiative will demonstrate capabilities with the potential to disrupt and change warfighting that are suitable for rapid fielding and acquisition. Disruptive demonstrations can be either stand-alone technology or concept demonstrations or utilize one of the existing Architecture and Integration venues for rapid technology architecture and assessment.  Projects will be selected in the execution year based on the Secretary\/Department Strategic Vectors."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The primary acquisition strategy for funding Disruptive Technology Demonstrations will be through the use of Military Inter-Departmental Purchase Requests (MIPRS).  The specifics of each MIPR will be dependent upon the development center, laboratory, contractor or agency requirements and needs.  If an Inter-Agency agreement is required, compliance and coordination of the agreement will be completed in coordination with the receiving activity and Federal Acquisition Regulation 17.5."
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2014, generic performance metrics applicable to these RDT&E initiatives includes attainment of DoD Strategic Objective 3.5.2D. The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology (S&T) program\" and the metrics for this objective is to transition 40 percent of completing demonstration programs per year.  Performance metrics are specific to each Disruptive Technology Demonstration effort and include measures identified in the management approach, Statement of Work (SOW) and Period of Performance (POP).  In addition, completions and successes are monitored against schedules and deliverables stated in the initiative's management approach."
                        }
                    }
                }
            ]
        }
    }
}