{
    "id": "47956f7100d8c2dc98d65121fe69b585dca277ce",
    "meta": {
        "filename": "dod-2014_PROCUREMENT_2014_NAVY_OTHER_BA1_PROCUREMENT_MasterJustificationBook_Navy_PB_2014.zzz_unzipped_PROCUREMENT_MasterJustificationBook_Navy_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "5449"
        },
        "LineItemTitle": {
            "val": "Surface ASW Support Equipment"
        },
        "P1LineNumber": {
            "val": "124"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Ordnance Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Asw Support Equipment"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "122.261"
                },
                "PriorYear": {
                    "val": "5.801"
                },
                "CurrentYear": {
                    "val": "6.465"
                },
                "BudgetYearOneBase": {
                    "val": "3.909"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.909"
                },
                "BudgetYearTwo": {
                    "val": "4.142"
                },
                "BudgetYearThree": {
                    "val": "4.214"
                },
                "BudgetYearFour": {
                    "val": "4.32"
                },
                "BudgetYearFive": {
                    "val": "4.382"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "122.261"
                },
                "PriorYear": {
                    "val": "5.801"
                },
                "CurrentYear": {
                    "val": "6.465"
                },
                "BudgetYearOneBase": {
                    "val": "3.909"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.909"
                },
                "BudgetYearTwo": {
                    "val": "4.142"
                },
                "BudgetYearThree": {
                    "val": "4.214"
                },
                "BudgetYearFour": {
                    "val": "4.32"
                },
                "BudgetYearFive": {
                    "val": "4.382"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "122.261"
                },
                "PriorYear": {
                    "val": "5.801"
                },
                "CurrentYear": {
                    "val": "6.465"
                },
                "BudgetYearOneBase": {
                    "val": "3.909"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.909"
                },
                "BudgetYearTwo": {
                    "val": "4.142"
                },
                "BudgetYearThree": {
                    "val": "4.214"
                },
                "BudgetYearFour": {
                    "val": "4.32"
                },
                "BudgetYearFive": {
                    "val": "4.382"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.07"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "0.07"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This line item provides funding to procure Reliability, Maintainability and Availability (RM&A) and safety modifications through the Ordnance Alteration (ORDALT) process to Anti-Submarine Warfare (ASW) Fire Control, Surface Vessel Torpedo Tubes (SVTT), and related ASW Fire Control\/SVTT support and test equipment to maintain the current envelope.  Modification requirements arise as a result of evaluation, testing, and Fleet use of existing, new, or modified ASW weapons and\/or related systems and subsystems.  Included in this line item are all related procurements for training and simulation equipment required for the continued operation of this equipment.  ORDALT procurements are highly variable and dependent on shipboard configurations and equipment age.\n\nThis line item also provides funding for Surface Ship Undersea Warfare (USW) Fire Control System (FCS) modification efforts to continue the required operation\/performance of ASW helicopter (helo operations), Vertical Launch (VLA) Anti-Submarine Rocket (ASROC), and Over-The-Side (OTS) capabilities due to the implementation of the MK54 Lightweight Torpedo (LHT) and Digital Fire Control Interface (DFCI).\n\n[P40A \/ 6B001 - ASWCS FIRE CONTROL ORDALTS, MK54 SURFACE SHIP USW FCS MODS]: 6B001 Cost Elements\/Descriptions as Follows:\n\nASWCS - UFCS\/Control Panel ORDALTs:  Provides funding for ORDALT kits for the ASW Underwater Fire Control System (UFCS) and Control Panel (MK309), ASW Control System (ASWCS) MK116 Mod 7, Torpedo Setting Panel (MK331), and the Torpedo Pre-Setter Test Set (MK432).  ORDALT procurements include a MK432 Mod 6 test set which provides for the addition of wide angle display, cable terminations and tech refresh of obsolete motherboard parts.  Also provide material support at multiple land-based laboratories as well as material support for upgrades and calibrations.  Procurements will ensure laboratories are at Fleet baseline configurations.\n\nASWCS - Production Engineering Support:  Provides the necessary production engineering support funds to cover the associated Integrated Logistics Support (ILS) elements, Engineering Change Proposal (ECP) reviews, Engineering Changes (EC), Ship Change Documents (SCDs), and engineering audits for ASW Fire Control.  Review and approve internal and external system interfaces (hardware and integration related) and identify interface issues.\n\nASWCS - Acceptance Test & Evaluation:  Provides the in-house acceptance test and evaluation funding associated with the safety and quality assurance testing of all ASW Fire Control, Alteration Equivalent to Repairs (AERs), ECPs, ECs, and SCDs.\n\nMK54 - Surface Ship USW Fire Control System Mods:  Funds Surface Ship Undersea Warfare (USW) Fire Control System (FCS) modification efforts to continue the required operation\/performance of ASW helicopter (helo ops), Vertical Launch (VLA) Anti-Submarine Rocket (ASROC), and Over-The-Side (OTS) capabilities due to the implementation of the MK54 Lightweight Torpedo (LHT) and Digital Fire Control Interface (DFCI).  Effort includes associated Non Recurring Engineering (NRE), procurement, and installation of the following:  1) MK54 magazine Stowage & Handling (S&H) modifications to CG47 and DDG51 class ships, thereby enabling them to stow\/carry the MK54 and fully support ASW helo operations; 2) Modification of AEGIS Weapons System (AWS) Commercial-Off-The-Shelf Refresh 3 (CR3) Command & Decision (C&D) software for CG47 and DDG51 class ships so it can identify, preset, and launch the MK54 torpedo in its VLA configuration; 3) Modification of AN\/SQQ-89A(V)15 USW Combat System software for CG47 and DDG51 class ships so it can identify, preset, and launch the MK54 torpedo in its VLA configuration; 4) Upgrade of MK116 MOD 7 Build 12B FCS software for CG47 class ships so it can identify, preset, and launch the MK54 torpedo in its OTS and VLA configuration; 5) Upgrade of the SVTT MK32 hardware for CG47 class ships so it can launch the MK54 torpedo in its OTS configuration.  Additionally, effort is required to produce the associated Ship Control Document (SCD) and conduct the necessary system and integration tests and safety analyses to ensure the item meets MIL-STD-882 safety requirements.\n\n[P40A \/ 6B004 - TORPEDO TUBE ORDALTS]: 6B004 Cost Elements\/Descriptions as Follows:\n\nSVTT - MK32 ORDALTS: The SVTT MK32 is an over-the-side torpedo defense surface ship launched system that conducts close-in ASW operations.  This line provides funding for SVTT MK32 launchers, Torpedo Loading Trays (TLTs), and ancillary equipment for testing, training, and maintainability.  ORDALT procurements include: Emergency Fire Circuit and Mount to Magazine Door Interoperability Circuit Improvements (SVTT MK32 Mod 19 only - ORDALT 76463); Overheat Sensor Test Set (SVTT MK32 Mod 15 Only - ORDALT 412-01-019); Locking Handle Securing Device (SVTT MK32 All Mods - ORDALT 412-01-031); Pressure Switch Assembly Replacement (SVTT MK32 All Mods - ORDALT 73191);  Torpedo MK54 SVTT Upgrades for CGs 52-71 (SVTT MK32 Mods 14 Only - ORDALT 76008); Safe\/Ready Lever Modification (SVTT MK32 Mod 15 Only - ORDALT 73440); Breech Mechanism Control Valve Redesign (SVTT MK32 All Mods - ORDALT TBD); Securing Mechanism Shoulder Bolt Retention (SVTT MK32 All Mods - ORDALT 412-04-025); Over-Heat Sensor Assembly Modification (SVTT MK32 Mod 15 Only - ORDALT 412-05-015) and Training Gear Handcrank Support Improvements (SVTT MK32 Mods 15 Only - ORDALT TBD).  Procure SVTT shoresite laboratory equipment for Launcher System Facilities (LSF).  LSFs are used to simulate shipboard conditions for over-the-side torpedo launchers, as well as for the creation of the required ORDALTs.\n\nSVTT - Production Engineering:  Provides the necessary production engineering support funds to cover the associated Integrated Logistics Support (ILS) elements, Engineering Change Proposal (ECP) reviews, Engineering Changes (EC), SCDs, and engineering audits for SVTT ORDALTs.\n\nSVTT - Acceptance Test & Evaluation: Provides the in-house acceptance test and evaluation funding required for the safety and quality assurance testing of all SVTT ORDALTs, Alteration Equivalent to Repairs (AERs), ECPs, ECs, and SCDs.\n\n[P40A \/ 6B900 - CONSULTING SERVICES]: 6B900 Cost Element\/Description as Follows:\n\nProvide the necessary funding for consulting services required to support scheduling of ASW Fire Control and SVTT ORDALT production, test, and installation efforts in conjunction with operation, safety, and environmental requirements.\n\n[P40A \/ 6B6IN - INSTALLATION OF EQUIPMENT - N96]: 6B6IN Cost Element\/Description as Follows:\n\nFunds the installation of all ASW Fire Control (under Cost Code 6B001) and SVTT (under Cost Code 6B004) ORDALTs\/SCDs.  ORDALT\/SCD Alteration Installation Team (AIT) pier-side installations are variable and contingent on Type Commander (TYCOM), Ships' Scheduling Conference (SSC), and ships' availability.  Cost Code 6B6IN also funds the installation of MK54 Surface Ship USW FCS modifications (under Cost Code 6B001) to continue the required operation\/performance of ASW helicopter (helo operations), VLA, and OTS capabilities due to the implementation of the MK54."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Surface ASW Support Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) 6B001 - ASWCS FIRE CONTROL ORDALTS, MK54 SURFACE SHIP USW FCS MODS"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) ASWCS - UCFS\/CONTROL PANEL ORDALTS"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "42.355"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.772"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.696"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.155"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.155"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.2) ASWCS - PRODUCTION ENGINEERING SUPPORT"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.361"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.124"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.128"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.131"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.131"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.3) ASWCS - ACCEPTANCE TEST & EVALUATION"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.405"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.101"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.101"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.101"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.101"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.4) MK54 - S&H UPGRADES (NRE)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.312"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.5) MK54 - AEGIS CR3 UPGRADE (NRE)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.8"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.6) MK54 - SQQ-89A(V)15 UPGRADE (NRE)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.82"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.56"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.54"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.52"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.52"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.7) MK54 - MK116 MOD 7 UPGRADE (NRE)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.2"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.8) MK54 - MK116 MOD 7 UPGRADE"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.7"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.526"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.192"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.9) MK54 - SVTT UPGRADE"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.854"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.326"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.362"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.524"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.524"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) 6B004 - TORPEDO TUBE ORDALTS"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) SVTT - MK32 ORDALTS"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "43.65"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.323"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.309"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.823"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.823"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.2) SVTT - PRODUCTION ENGINEERING SUPPORT"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.301"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.123"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.127"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.131"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.131"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.3) SVTT - ACCEPTANCE TEST & EVALUATION"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.375"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.101"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.101"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.101"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.101"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) 6B900 - CONSULTING SERVICES"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) CONSULTING SERVICES"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "6.318"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.153"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.103"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.098"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.098"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) 6B6IN - INSTALLATION OF EQUIPMENT - N96"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) ASWCS - FIRE CONTROL ORDALTS"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.009"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.11"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.112"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.105"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.105"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.2) MK54 - SURFACE SHIP USW FCS UPGRADES"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.808"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.488"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.601"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.124"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.124"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.3) SVTT - TORPEDO TUBE ORDALTS"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.993"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.094"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.093"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.096"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.096"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            },
            "suppressP40As": {
                "val": "false"
            }
        }
    }
}