{
    "id": "a00967411ba93624e5a5d89477605293ca1b059b",
    "meta": {
        "filename": "dod-2014_PROCUREMENT_2014_ARMY_OTHER_2_PROCUREMENT_JustificationBook_Army_PB_2014.zzz_unzipped_PROCUREMENT_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "BD3955"
        },
        "LineItemTitle": {
            "val": "Life Cycle Software Support (LCSS)"
        },
        "P1LineNumber": {
            "val": "107"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "89"
        },
        "BudgetSubActivityTitle": {
            "val": "Elect Equip - Tactical C2 Systems"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "87.452"
                },
                "PriorYear": {
                    "val": "1.807"
                },
                "CurrentYear": {
                    "val": "1.853"
                },
                "BudgetYearOneBase": {
                    "val": "1.795"
                },
                "BudgetYearOne": {
                    "val": "1.795"
                },
                "BudgetYearTwo": {
                    "val": "1.795"
                },
                "BudgetYearThree": {
                    "val": "1.913"
                },
                "BudgetYearFour": {
                    "val": "1.619"
                },
                "BudgetYearFive": {
                    "val": "1.619"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "87.452"
                },
                "PriorYear": {
                    "val": "1.807"
                },
                "CurrentYear": {
                    "val": "1.853"
                },
                "BudgetYearOneBase": {
                    "val": "1.795"
                },
                "BudgetYearOne": {
                    "val": "1.795"
                },
                "BudgetYearTwo": {
                    "val": "1.795"
                },
                "BudgetYearThree": {
                    "val": "1.913"
                },
                "BudgetYearFour": {
                    "val": "1.619"
                },
                "BudgetYearFive": {
                    "val": "1.619"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "87.452"
                },
                "PriorYear": {
                    "val": "1.807"
                },
                "CurrentYear": {
                    "val": "1.853"
                },
                "BudgetYearOneBase": {
                    "val": "1.795"
                },
                "BudgetYearOne": {
                    "val": "1.795"
                },
                "BudgetYearTwo": {
                    "val": "1.795"
                },
                "BudgetYearThree": {
                    "val": "1.913"
                },
                "BudgetYearFour": {
                    "val": "1.619"
                },
                "BudgetYearFive": {
                    "val": "1.619"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "ComponentSplit": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "PriorYear": {
                                "TotalCost": {
                                    "val": "1.807"
                                }
                            },
                            "CurrentYear": {
                                "TotalCost": {
                                    "val": "1.853"
                                }
                            },
                            "BudgetYearOneBase": {
                                "TotalCost": {
                                    "val": "1.795"
                                }
                            },
                            "BudgetYearOne": {
                                "TotalCost": {
                                    "val": "1.795"
                                }
                            },
                            "BudgetYearTwo": {
                                "TotalCost": {
                                    "val": "1.795"
                                }
                            },
                            "BudgetYearThree": {
                                "TotalCost": {
                                    "val": "1.913"
                                }
                            },
                            "BudgetYearFour": {
                                "TotalCost": {
                                    "val": "1.619"
                                }
                            },
                            "BudgetYearFive": {
                                "TotalCost": {
                                    "val": "1.619"
                                }
                            }
                        }
                    }
                ]
            }
        },
        "Description": {
            "val": "Life Cycle Software Engineering (LCSE) support, by the Software Engineering Center (SEC), provides the essential equipment needed to maintain Communications-Electronics Life Cycle Management Command (C-E LCMC) managed fielded Battlefield Automated Systems (BAS) in a state of operational readiness.  Approximately 100 BASs in Post Production Software Support (PPSS) directly depend on LCSE support to maintain a posture of mission critical readiness.  LCSE system support and services are essential to maintain BASs in the state of operational readiness.  Policy for Post Production Software Support (PPSS) requires that system managers provide initial host capabilities for new systems and that the Life Cycle Software Engineering Centers (LCSEC) provide upgrades and replacement of obsolete equipment.  Significant portions of host and network equipment are no longer economically repairable and\/or are reaching obsolescence.  There is a requirement to respond to emergency requests from the field for Software Engineering support, in order to maintain operational readiness of deployed BASs.  With host computers and peripherals having a life span of approximately five years and SEC performing its mission over a continuous period of time beyond five years, equipment must be replaced and\/or upgraded regularly to deal with obsolescence and take advantage of the continual improvements in technology that are indigenous to high-technology based weapon systems and their software support environments.  SEC must purchase these items to meet systems mission requirements."
        },
        "Justification": {
            "val": "FY 2014  Base procurement dollars in the amount of $1.795 million procures the following for C4ISR lab equipment:\n\nIn order for SEC to support Battle Command Support and Sustainment System (BCS3)  it needs to procure a training Master Tracking System (MTS) base station, MTS transponder and recycled Radio Frequency (RF) tags, , 1 TB  USB  hard drive and sound dampening wall dividers. The procurement will support the requirement to establish BCS3 PPSS lab at APG. The equipments are used to transmit and process sustainment\/logistic data to populate BCS3 servers. The MTS Transponder is mounted on vehicles to transmit vehicle locations, which enable BCS3 users to locate vehicles on the Common Operational Picture (COP). MTS Base Station is an interface that a user (BCS3 users) may use to communicate with vehicle MTS devices. The equipment will enable SEC to provide system integration software support.\n                       \nIn order for SEC to continue to support Warfighter Information Network-Tactical , Increment 1 (WIN-T Inc 1) requires obtaining computer servers, laptops, routers, switches, modems, anti-virus gateways in lab equipments. The equipment will be used to maintain the system configuration to ensure it is up to date which is critical in order to provide timely support to the warfighers from theater to battalion level and below. The WIN-T Inc 1 labs continue to expand the network bandwidth and networking capability to effectively support deploying warfighters force as they flow into a theater of operation.\n\nThe Combat Electromagnetic Environment Simulator (CEESIM)requires two E-J band radio frequency channel modules. The CEESIM Radio Frequency (RF) simulator provides for simulation of multiple, simultaneous emitters and static\/dynamic platform attributes required to faithfully simulate true-to-war conditions. The modules are needed to increase of RF simulation requirements due to the complexity of threats in support of Counter Radio controlled Electronic Warfare (CREW)and Aircraft Survivability Equipment(ASE) systems.\n\n                                                                                          \nAll funding is for the Active component."
        },
        "DocumentAssemblyOptions": []
    }
}