{
    "id": "c841ea9c1005d28bda536b2ba61bfbd470bc9d78",
    "meta": {
        "filename": "dod-2014_PROCUREMENT_2014_NAVY_MARINECORPS_PROCUREMENT_MasterJustificationBook_Navy_PB_2014.zzz_unzipped_PROCUREMENT_MasterJustificationBook_Navy_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "6438"
        },
        "LineItemTitle": {
            "val": "Physical Security Equipment"
        },
        "P1LineNumber": {
            "val": "48"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Materials Handling Equipment"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "AllPriorYears": {
                    "val": "182.238"
                },
                "PriorYear": {
                    "val": "65.247"
                },
                "CurrentYear": {
                    "val": "59.01"
                },
                "BudgetYearOneBase": {
                    "val": "16.809"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "16.809"
                },
                "BudgetYearTwo": {
                    "val": "21.189"
                },
                "BudgetYearThree": {
                    "val": "20.37"
                },
                "BudgetYearFour": {
                    "val": "25.869"
                },
                "BudgetYearFive": {
                    "val": "25.417"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "416.149"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "182.238"
                },
                "PriorYear": {
                    "val": "65.247"
                },
                "CurrentYear": {
                    "val": "59.01"
                },
                "BudgetYearOneBase": {
                    "val": "16.809"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "16.809"
                },
                "BudgetYearTwo": {
                    "val": "21.189"
                },
                "BudgetYearThree": {
                    "val": "20.37"
                },
                "BudgetYearFour": {
                    "val": "25.869"
                },
                "BudgetYearFive": {
                    "val": "25.417"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "416.149"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "182.238"
                },
                "PriorYear": {
                    "val": "65.247"
                },
                "CurrentYear": {
                    "val": "59.01"
                },
                "BudgetYearOneBase": {
                    "val": "16.809"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "16.809"
                },
                "BudgetYearTwo": {
                    "val": "21.189"
                },
                "BudgetYearThree": {
                    "val": "20.37"
                },
                "BudgetYearFour": {
                    "val": "25.869"
                },
                "BudgetYearFive": {
                    "val": "25.417"
                },
                "ToComplete": {
                    "val": "0.000"
                },
                "Total": {
                    "val": "416.149"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Code": {
            "val": "B"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206313M"
                }
            ]
        },
        "Description": {
            "val": "Physical Security Systems provide systematic, uniform technological solutions to manpower intensive security requirements.  Systems are used at bases and stations and expeditionary environments protecting our most important assets vital to operations - people, flight lines, classified information, arms, ammunition and explosives (AA&E), shore lines, critical assets and infrastructure and providing constant, vigilant capabilities that control and restrict access. Mass Notification System (MNS) provides immediate notice and warning to people living and working aboard our bases and stations in the event of security breaches via interior and exterior speaker systems, telephones and computers in the event of natural disasters, terrorist situations, weather emergencies or other events requiring immediate guidance to ensure the safety and security of personnel. Physical Security supports capital plant equipment specifically designed for physical security\/electronic security systems (ESS) in military construction (MILCON) projects.  Funding procures investment items, devices and systems necessary for the United States Marine Corps installation and facility structure to comply with Congressional, White House Military Office, Department of Defense, Department of Navy, and Marine Corps Physical Security and antiterrorism directives pertaining to security equipment and ESS as technological solutions to manpower intensive security requirements and to provide a systematic, uniform capability throughout Marine Corps installations to deter, delay, and defeat espionage, sabotage, damage, theft, and terrorist attacks against Marine Corps personnel, resources, installations, and facilities.   \n\nThese systems upgrade and replace antiquated systems that are costly to maintain and upgrade.  The Marine Corps Electronic Security System (MCESS) Program provides a comprehensive electronic security system suite that supports collateral equipment that includes intrusion detection, surveillance, perimeter and facility automated access control and tracking capabilities.  These systems increase efficiency\/effectiveness of available security manpower and improve security and safety at installation perimeter, flight line, restricted area, and facility entry points.  The systems further reduce vulnerabilities and maintain mission readiness and enhance aviation mission capabilities in support of flight line security.  Support to the war fighter with technology and equipment, increases assessment capability outside the established perimeter at Forward Operating Bases\/enduring bases.  Ground based radars support Expeditionary Missions (improved assessment at long distances) allowing for greater defensive posture and response capabilities.  \n\nGround-Based Operational Surveillance System (G-BOSS) The Ground-Based Operational Surveillance System (G-BOSS) is an incremental development program currently providing persistent, multispectral surveillance sensor packages in Afghanistan. Three variants of G-BOSS exist; 80' tower mounted system (heavy), 20' trailer mounted system (medium\/GBL), and man-portable, tripod mounted system (lite\/CBL).   Each tower employs multiple, self-contained detection and assessment technologies on a single trailer-mounted elevation platform with a multi-spectral sensor suite consisting of: daylight color & infrared imagery (StarSafire III and T-3000), Unattended Ground Sensors (UGS), Manportable Surveillance and Target Acquisition Radar (MSTAR), Communication suite for wireless point to point link, and unmanned aerial vehicle interface (VideoScout). The medium and lite systems provide a subset of the G-BOSS heavy capabilities.  G-BOSS is a material solution in response to an Urgent Universal Needs Statement in support of OIF and OEF.  In FY12 - 13 the program will transition to the G-BOSS enduring requirement and be intergrated as a core capability for the Marine Expeditionary Force (MEF).  In FY13 G-BOSS 3.1 will update the existing G-BOSS systems with a common operating system and equipment interface to increase operational availability while reducing sustainment cost. \n\nIdentity Dominance System-MC (IDS-MC) is a multi-modal (fingerprint, iris and face) biometric collection system that provides the USMC a reliable and effective capability to collect, share, match, access, verify and store identity information. IDS-MC will enable the Marine to collect appropriate biometric, biographical and reference information on an individual and match this locally developed information with pre-existing information available to the expeditionary force. The system will display match results with linkage to the respective individual's biographical and reference information as well as help analyze the response, update records as appropriate, create reports and disseminate updated information in accordance with current MAGTF policy. The primary mission of IDS-MC is to provide the MAGTF with the means to identify persons encountered in the battlespace. While IDS-MC is not an intelligence analysis system, it does provide identification information in support of military intelligence and law enforcement operations by providing positive identification of persons of interest. IDS-MC is an enabler in the areas of detainee management and questioning, base access, counterintelligence screening, border control, law enforcement, displaced persons' management and aiding in humanitarian assistance missions. IDS-MC supports the tactical application of identity dominance and fully supports a forward presence, crisis response and contingency response capability. IDS will subsume the Biometrics Automated Toolset (BAT).  The total AAO of 821 fielded systems to training facilities and eleven battalion-sized elements. IDS will incrementally phase out the Biometric Automated Toolset (BAT)."
        },
        "Justification": {
            "val": "FY12 Base Appropriation Request:\nPhysical Security $10.212M:  Funding procured Electronic Security systems, Intrusion Detection Systems, closed circuit television systems, and access controls throughout the Marine Corps.  FY12 increase in funding provides support for the Joint Strike Fighter program at MCAS Yuma in the following areas:  Access Control at the Marine Air Wing Training Squadron, Intrusion Detection System, Flight Line Mass Notification capability to comply with SecDef mandate with the follow-on of Ft. Hood, Flight Line\/hangar Access Control and Flight Line Closed Circuit Television Systems.\n\nG-BOSS $0.271M:  Funding will be used for Interim Contract Support.  $6.51M was realigned to IDS in support of a new requirement.\n\nIDS $5.353M: Funds support a new requirement based upon a universal statement of need (USON) dated 21 Oct 2011 to procure a biometric enrollment screening device (BESD).  The program was established as increment zero of the Identity Dominance System (IDS) Program.  An additional $6.51M was provided as a realignment from the G-BOSS program - as noted above.  This provided a total of $11.864M to procure a total of 821 systems. \n\nFY12 Overseas Contingency Operations (OCO) Request:\nG-BOSS $42.9M: FY12 procurements provided the information assurance upgrades for all fielded systems and to enhance the systems to a common hardware\/software baseline.\n\nFY13 Base Appropriation Request:\nPhysical Security $3.510M:  Funding procures Electronic Security Systems, Intrusion Detection Systems, closed circuit television systems, and access controls throughout the Marine Corps.\n\nFY13 Overseas Contingency Operations (OCO)Request:\nG-BOSS $55.5M:  FY13 funding completes procurement of capability upgrades to support a common hardware\/software baseline.  This request also consists of the procurement of GBOSS material and support elements such as documentation\/operators, maintenance, training\/curriculum manuals, installation procedures, post installation procedures, and the integration of material into kits.\n\n\nFY14 Base Appropriation Request:\nPhysical Security System $15.001M:  Physical Security Systems provide systematic, uniform technological solutions to manpower intensive security requirements throughout the Marine Corps. The FY14 increase in funds for collateral equipment is procuring flight line security systems, ground based radar detection tracking systems, Mass Notification Systems and perimeter and facility automated access control and tracking capabilities control systems.\n\nIDS $1.808M:  The IDS-MC FY14 supports the technical refresh of the BESD IDS systems."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Physical Security Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Physical Security Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1) Collateral Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "99.043"
                                                    },
                                                    "PriorYear": {
                                                        "val": "7.175"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.327"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "7.98"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "7.98"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2) Installation Security Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "83.195"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.037"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.183"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "7.021"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "7.021"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "1) Ground-Based Operational Surveillance System (G-BOSS)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) G-BOSS 3.1 Production Representative Articles"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "PriorYear": {
                                                        "val": "1.169"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.2) G-BOSS 3.1 Upgrade Kits"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "PriorYear": {
                                                        "val": "32.192"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "23.07"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.3) G-BOSS Integration Support"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "PriorYear": {
                                                        "val": "9.811"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "32.43"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) IDENTITY DOMINANCE SYSTEM (IDS)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) Biometrics IDS Client"
                                            },
                                            "IdCode": {
                                                "val": "B"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.2) Biometrics IDS Server"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.3) Biometrics Hand-Held Device"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.4) Logistics\/Fielding Support"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.5) Biometric Enrollment Screening Device (BESD)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "PriorYear": {
                                                        "val": "11.863"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.6) BESD Technical Refresh"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.808"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.808"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            },
            "suppressP40As": {
                "val": "false"
            }
        }
    }
}