{
    "id": "cd3047970dca9f2230138fa4e82a0c0c330980b5",
    "meta": {
        "filename": "dod-2014_PROCUREMENT_2014_DEFENSE_VOL1_PROCUREMENT_MasterJustificationBook_Defense-Wide_PB_2014.zzz_unzipped_PROCUREMENT_MasterJustificationBook_Defense-Wide_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "0203ORDN"
        },
        "LineItemTitle": {
            "val": "ORDNANCE ITEMS <$5M"
        },
        "P1LineNumber": {
            "val": "61"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Special Operations Command"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Ammunition Programs"
        },
        "ResourceSummary": {
            "GrossWeaponSystemCost": {
                "BudgetYearOneBase": {
                    "val": "159.029"
                },
                "BudgetYearOne": {
                    "val": "159.029"
                },
                "BudgetYearTwo": {
                    "val": "155.753"
                },
                "BudgetYearThree": {
                    "val": "172.437"
                },
                "BudgetYearFour": {
                    "val": "162.131"
                },
                "BudgetYearFive": {
                    "val": "170.378"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "BudgetYearOneBase": {
                    "val": "159.029"
                },
                "BudgetYearOne": {
                    "val": "159.029"
                },
                "BudgetYearTwo": {
                    "val": "155.753"
                },
                "BudgetYearThree": {
                    "val": "172.437"
                },
                "BudgetYearFour": {
                    "val": "162.131"
                },
                "BudgetYearFive": {
                    "val": "170.378"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "BudgetYearOneBase": {
                    "val": "159.029"
                },
                "BudgetYearOne": {
                    "val": "159.029"
                },
                "BudgetYearTwo": {
                    "val": "155.753"
                },
                "BudgetYearThree": {
                    "val": "172.437"
                },
                "BudgetYearFour": {
                    "val": "162.131"
                },
                "BudgetYearFive": {
                    "val": "170.378"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "1160431BB"
                },
                {
                    "val": "1160481BB"
                }
            ]
        },
        "Description": {
            "val": "NOTE:  Beginning in FY 2014, the following P-1 Line Items were consolidated within the new Ordnance Items <$5M P-1 Line Item:  Ordnance Replenishment and Ordnance Acquisition.\n\nThe ORDNANCE ITEMS <$5M  line provides ordnance items, munitions, small caliber, medium caliber, and large caliber ammunition, demolitions, pyrotechnics, explosive initiation devices, underwater munitions, grenades, foreign weapons and ammunition, air delivered munitions, precision guided munitions, shoulder fired munitions and rockets for Special Operations Forces (SOF). The required funding will allow SOF components to accomplish the required annual training, support required combat missions, and build toward the required war reserve quantities.\n\nThe associated RDT&E funds are in Program Element 1160431BB."
        },
        "Justification": {
            "val": "1. Air Delivered Munitions - Procures AC-130 gunship munitions including the associated safety certification, Insensitive Munitions qualification, production engineering and transportation.  Funding includes several tactical and training configurations of the 105mm, 40mm 30mm, 25mm and fuzes.  The required funding will allow SOF components to accomplish the required annual training, support required combat missions, and build toward the required war reserve quantities.\n\nFY 2014 PROGRAM JUSTIFICATION:  Procures and qualifies air delivered ammunition to meet mission requirements required to maintain AC-130 Gunship crew mission-related readiness skills and provides combat mission support. Procures several tactical and training configurations of 105mm, 40mm, 30mm, and 25mm ammunition and fuzes. Replenishes munitions expended in training, Operation Enduring Freedom (OEF) and Operation New Dawn (OND). Actual quantities vary depending on training requirements. \n\n\n2.  Bullets - Procures barrel launched munitions including the associated safety certification, Insensitive Munitions qualification, production engineering and transportation.  Funding includes several tactical and training configurations US and non standard foreign munitions, weapons and related equipment of 4.6mm, 5.45mm, 5.56mm, 7.62mm, .300 WinMag, .338 Lapua, 9mm, .357, .380, .40, .44, .45, .50, 12.7mm, 14.7mm, 12 gauge, 25mm, 40mm, 60mm, 64mm, 66mm, 81mm, 84mm, 105mm, 4.2”, 107mm, 120mm, 155mm, rocket propelled grenades (RPG) and other calibers as required.  The required funding will allow SOF components to accomplish the required annual training, support required combat missions, and build toward the required war reserve quantities.  Program was increased by FY 2012 Title IX funds.  \n\nFY 2014 PROGRAM JUSTIFICATION:   Funding procures the following munitions: 40mm Cartridges (all types); Shotgun Cartridges; Handgun Cartridges; Rifle\/Machine Gun Cartridges (all types of 5.56mm, 7.62mm, .300 WM and .50 Caliber); Replenishes munitions expended in training, Operation Enduring Freedom (OEF) and Operation New Dawn (OND).  Procures 4,000,000 rounds of various types of Non-Standard foreign ammunition.  Actual quantities vary depending on training requirements.\n\n\n3.  Demolition, Breaching and Pyrotechnics - Procures Demolition, Breaching and Pyrotechnics munitions including the associated safety certification, Insensitive Munitions qualification, production engineering and transportation.  Funding includes several tactical and training configurations of munitions and related equipment of explosively formed penetrators, conical shape charges, linear shaped charges, diversionary devices, demolition hand grenades, breaching devices, explosives, firing devices, underwater munitions, flares, signaling devices, along with tools, equipment, and attaching devices for constructing and emplacing a variety of demolition charges and other munitions as required.  The required funding will allow SOF components to accomplish the required annual training, support required combat missions, and build toward the required war reserve quantities.\n\nFY 2014 PROGRAM JUSTIFICATION:  Grenades (offensive and smoke); Flash-Bang Grenades a variety of demolition materiel consisting of explosives, firing devices, accessories, and production engineering. Replenishes munitions expended in training, Operation Enduring Freedom (OEF) and Operation New Dawn (OND).  Actual quantities vary depending on training requirements.\n\n\n4.  Shoulder Fired Munitions and Rockets - Procures Shoulder Fired Munitions, launchers, and rockets including the associated safety certification, Insensitive Munitions qualification, production engineering and transportation.  Funding includes several tactical and training configurations of munitions and related equipment providing armored vehicle destruction, bunker and hardened facility destruction, soft target destruction, fire from enclosure, anti-personnel, smoke obscuration, visible and IR illumination, as well as sub-caliber training devices with back blast simulation.  These systems gives SOF extended range fires to operate where no artillery, mortar, or armor support is available.  The required funding will allow SOF components to accomplish the required annual training, support required combat missions, and build toward the required war reserve quantities.\n\nFY 2014 PROGRAM JUSTIFICATION: Procures shoulder fired munitions, launchers, 2.75” rockets and associated production engineering support. Replenishes munitions expended in training, Operation Enduring Freedom (OEF) and Operation New Dawn (OND).  Actual quantities vary depending on training requirements.\n\n\n5. Precision Guided Munitions (PGM) - Procures Precision Guided Munitions including the associated safety certification, Insensitive Munitions qualification, production engineering, transportation, and provides for the integration of service-common and SOF-unique PGM munitions onto SOF platforms to support armed over-watch capability on the battlefield. The required funding will allow SOF components to accomplish the required annual training, support required combat missions, and build toward the required war reserve quantities.\n \nFY 2014 PROGRAM JUSTIFICATION:  Procures 247 PGMs and provides for production support to provide an armed over-watch capability on the battlefield, required annual training, and build toward the required war reserve quantities.  Program was increased by OCO in FY 2012."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "ORDNANCE ITEMS <$5M"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Air Delivered Munitions"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Air Delivered Munitions"
                                            },
                                            "ItemNumber": {
                                                "val": "1"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "56.504"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "56.504"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "54.886"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "62.566"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "57.619"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "62.407"
                                                    },
                                                    "Continuing": {
                                                        "val": "true"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "Small Caliber Bullets"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Small Caliber Bullets"
                                            },
                                            "ItemNumber": {
                                                "val": "2"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "49.506"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "49.506"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "51.869"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "55.333"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "50.586"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "50.762"
                                                    },
                                                    "Continuing": {
                                                        "val": "true"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "Demolition, Breaching and Pyrotechnics"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Demolition, Breaching and Pyrotechnics"
                                            },
                                            "ItemNumber": {
                                                "val": "3"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "8.401"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.401"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "11.852"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "10.166"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "7.71"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "9.544"
                                                    },
                                                    "Continuing": {
                                                        "val": "true"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "Shoulder Fired Munitions and Rockets"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Shoulder Fired Munitions and Rockets"
                                            },
                                            "ItemNumber": {
                                                "val": "4"
                                            },
                                            "ResourceSummary": {
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "13.93"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "13.93"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "8.138"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "13.487"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "10.639"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "11.346"
                                                    },
                                                    "Continuing": {
                                                        "val": "true"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            {
                                "Name": {
                                    "val": "Precision Guided Munitions"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Stand-Off Precision Guided Munitions"
                                            },
                                            "ItemNumber": {
                                                "val": "5"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "247"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "247"
                                                    },
                                                    "Continuing": {
                                                        "val": "true"
                                                    }
                                                },
                                                "GrossWeaponSystemCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "30.688"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "30.688"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "29.008"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "30.885"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "35.577"
                                                    },
                                                    "BudgetYearFive": {
                                                        "val": "36.319"
                                                    },
                                                    "Continuing": {
                                                        "val": "true"
                                                    }
                                                },
                                                "GrossWeaponSystemUnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "124242.91"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "124242.91"
                                                    },
                                                    "Continuing": {
                                                        "val": "true"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "Raytheon"
                                                        },
                                                        "Location": {
                                                            "val": "Tucson, AZ"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2014"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "Eglin AFB, FL"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2014-01"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2015-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "247"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "124243.000"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "IDIQ"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        }
                                    ]
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            },
            "suppressP40As": {
                "val": "false"
            }
        }
    }
}