{
    "id": "f8abb799eb1725741e808eb9556f4b0f355b02c8",
    "meta": {
        "filename": "dod-2014_PROCUREMENT_2014_ARMY_OTHER_3-4_PROCUREMENT_JustificationBook_Army_PB_2014.zzz_unzipped_PROCUREMENT_JustificationBook_Army_PB_2014.xml",
        "budget_year": "2014",
        "budget_cycle": "PB",
        "submission_date": "2013-04",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "R07001"
        },
        "LineItemTitle": {
            "val": "Enhanced Rapid Airfield Construction Capap"
        },
        "P1LineNumber": {
            "val": "168"
        },
        "BudgetYear": {
            "val": "2014"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2013-04"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "50"
        },
        "BudgetSubActivityTitle": {
            "val": "Construction Equipment"
        },
        "ResourceSummary": {
            "Quantity": {
                "CurrentYear": {
                    "val": "182"
                },
                "BudgetYearOneBase": {
                    "val": "109"
                },
                "BudgetYearOne": {
                    "val": "109"
                },
                "BudgetYearTwo": {
                    "val": "102"
                },
                "BudgetYearThree": {
                    "val": "50"
                },
                "BudgetYearFour": {
                    "val": "41"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "GrossWeaponSystemCost": {
                "CurrentYear": {
                    "val": "13.725"
                },
                "BudgetYearOneBase": {
                    "val": "13.59"
                },
                "BudgetYearOne": {
                    "val": "13.59"
                },
                "BudgetYearTwo": {
                    "val": "13.597"
                },
                "BudgetYearThree": {
                    "val": "13.907"
                },
                "BudgetYearFour": {
                    "val": "14.547"
                },
                "BudgetYearFive": {
                    "val": "1.99"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "GrossWeaponSystemUnitCost": {
                "CurrentYear": {
                    "val": "75.412"
                },
                "BudgetYearOneBase": {
                    "val": "124.679"
                },
                "BudgetYearOne": {
                    "val": "124.679"
                },
                "BudgetYearTwo": {
                    "val": "133.304"
                },
                "BudgetYearThree": {
                    "val": "278.14"
                },
                "BudgetYearFour": {
                    "val": "354.805"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "CurrentYear": {
                    "val": "13.725"
                },
                "BudgetYearOneBase": {
                    "val": "13.59"
                },
                "BudgetYearOne": {
                    "val": "13.59"
                },
                "BudgetYearTwo": {
                    "val": "13.597"
                },
                "BudgetYearThree": {
                    "val": "13.907"
                },
                "BudgetYearFour": {
                    "val": "14.547"
                },
                "BudgetYearFive": {
                    "val": "1.99"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "CurrentYear": {
                    "val": "13.725"
                },
                "BudgetYearOneBase": {
                    "val": "13.59"
                },
                "BudgetYearOne": {
                    "val": "13.59"
                },
                "BudgetYearTwo": {
                    "val": "13.597"
                },
                "BudgetYearThree": {
                    "val": "13.907"
                },
                "BudgetYearFour": {
                    "val": "14.547"
                },
                "BudgetYearFive": {
                    "val": "1.99"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CostType": {
            "val": "AB"
        },
        "Description": {
            "val": "The Enhanced Rapid Airfield Construction Capabilities (ERACC) consists of four (4) independent products that enhance the joint commander's capability for Enable Theater Access (ETA) operations.  ERACC provides the joint commander the capability enhancement to rapidly construct new airfields, runways and to upgrade existing facilities to meet joint task force needs.  This expands operating capacities of Aerial ports Embarkation\/Debarkation (APOE\/APOD).  ERACC provides the joint commander a capability enhancement to rapidly open new airfields and runways, and\/or to upgrade existing facilities to meet joint task force needs.\n\nERACC Type I, Site Selection and Assessment. This capability package is a software centric capability used to rapidly assess potential sites for airfield operations.  This capability provides geospatial information, site analysis, terrain visualization, airfield performance predictions, constructability estimations, on-site material characterization, and site design capabilities. \nThe fielding of the ERACC Type I software will be to users of the ENFIRE engineer reconnaissance system as part of the ENFIRE 7.0 software baseline, and will be included in all subsequent baselines. The users include construction engineer platoon leaders, engineer liaison teams, facilities managers, and contracting personnel within Engineer organizations for construction project management, reconnaissance, facilities and inventory management, Tele-engineering, site layout, rudimentary surveying, mapping, and associated reporting.  The ERACC Type I system is a software application on the ENFIRE system.  The AAO for the Type I is 86 and will be procured by Product Director Combat Terrain Information Systems (PD CTIS). \n\nERACC Type II, Enhanced Earthmoving.  This system is a global positioning system (GPS) and laser blade leveling kit that is installed on a dozer, grader, scraper and Deployable Universal Combat Earthmover (DEUCE).  The blade leveling significantly increases operating productivity and training efficiencies by reducing construction times and fuel consumption.  A project design can be loaded into the blade leveling display box allowing the operator to have 3-D view of where he is in relation to the project end state.  This allows the operator to instantly know where to fill and cut and thus eliminates the requirement for the survey team to repetitively verify the project.  The AAO for the Type II 252 and will be procured by PM Combat Engineer\/Material Handling Equipment (CE\/MHE). \n\nThe fielding of the Enhanced Earthmoving within Engineer organizations will be to Rapidly Deployable Earthmoving-Light (RDE-L) Platoons, an integral asset of the Engineer Support Companies.  \n\nERACC Type III, is the Mobil Technical Engineer Lab (MTEL)and is an integration of commercially available non-developmental items.  MTEL effort is a C130 airplane Low Velocity Air Droppable (LVAD)\/CH-47 helicopter sling transportable package enhancing a modularly designed capability to rapidly open new airfields and runways, and\/or upgrade existing facilities to meet joint task force needs.  The MTEL provides a soil test and survey capability utilizing a utility vehicle.  This allows the ERACC Team to quickly understand the composition of the soil to determine feasibility for construction of an airfield. The MTEL can also be used for recon and scouting once the lab package is removed. The fielding of the MTEL will be within Engineer Support Company and Engineer Support Teams.  The ERACC Type III AAO is 81 and will be procured by PM CE\/MHE.\n\nERACC Type IV, is the Soil Reclaimer Stabilizer.  This system is essential to mix soil stabilization products with soil to produce desired stabilized base layers suitable for aircraft traffic operations.  This system supports rapid construction and or expansion of airfield operation capacities.  It will also be employed during the construction\/upgrading of helipads as a means to prevent brownout conditions from occurring during helicopter landing and takeoff operations. The machine is equipped with an onboard automated liquid distribution system that matches the desired liquid polymer application rate to the machines ground speed.  It has the capability to continuously operate for a period of 10 hours.\nThe ERACC will be fielded to the Rapidly Deployable Earthmoving-Light (RDE-L) Platoon within the Engineer Support Company (ESC), Engineer Survey and Design Sections, Engineer Geospatial Cells, Forward Engineer Support Teams, and Technical Engineer Sections.  The long term objective is to field the ERACC as a stand alone module within the ESC. The ERACC Type IV AAO is 34 and will be procured by PM CE\/MHE. Joint U.S. Forces will employ ERACC types (I-IV) individually or as a combined mission based on engineer requirements.\n\nThe ERACC program procures Type I, Type II, and Type IV packages for FY 2014. ERACC Type I, Type II and Type IV are commercial off the shelf (COTS) programs and operate independently of each other."
        },
        "Justification": {
            "val": "FY 2014 Base funding in the amount of $13.590 million procures 18 ERACC Type I, 81 ERACC Type II, and 10 ERACC Type IV for a total of 109 each ERACC packages.  This will support rapid construction and\/or expansion of airfield operating capacities in support of mission requirements.  FY 2014 procurement supports a balanced investment strategy for the Army's approved force structure and Army Force Generation (ARFORGEN) requirements.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active components and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "ERACC Type IV- Soil Stabilization"
                    },
                    "ItemNumber": {
                        "val": "R03001"
                    },
                    "ComponentSplit": {
                        "ComponentList": {
                            "Component": [
                                {
                                    "Name": {
                                        "val": "Army Active"
                                    },
                                    "Cost": {
                                        "CurrentYear": {
                                            "Quantity": {
                                                "val": "182"
                                            },
                                            "TotalCost": {
                                                "val": "13.725"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Quantity": {
                                                "val": "37"
                                            },
                                            "TotalCost": {
                                                "val": "4.809"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Quantity": {
                                                "val": "37"
                                            },
                                            "TotalCost": {
                                                "val": "4.809"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Army National Guard"
                                    },
                                    "Cost": {
                                        "BudgetYearOneBase": {
                                            "Quantity": {
                                                "val": "53"
                                            },
                                            "TotalCost": {
                                                "val": "6.642"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Quantity": {
                                                "val": "53"
                                            },
                                            "TotalCost": {
                                                "val": "6.642"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Army Reserve"
                                    },
                                    "Cost": {
                                        "BudgetYearOneBase": {
                                            "Quantity": {
                                                "val": "19"
                                            },
                                            "TotalCost": {
                                                "val": "2.139"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Quantity": {
                                                "val": "19"
                                            },
                                            "TotalCost": {
                                                "val": "2.139"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "ResourceSummary": {
                        "Quantity": {
                            "CurrentYear": {
                                "val": "182"
                            },
                            "BudgetYearOneBase": {
                                "val": "109"
                            },
                            "BudgetYearOne": {
                                "val": "109"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        },
                        "GrossWeaponSystemCost": {
                            "CurrentYear": {
                                "val": "13.725"
                            },
                            "BudgetYearOneBase": {
                                "val": "13.59"
                            },
                            "BudgetYearOne": {
                                "val": "13.59"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        },
                        "GrossWeaponSystemUnitCost": {
                            "CurrentYear": {
                                "val": "75.412"
                            },
                            "BudgetYearOneBase": {
                                "val": "124.679"
                            },
                            "BudgetYearOne": {
                                "val": "124.679"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        },
                        "NetProcurementP1": {
                            "CurrentYear": {
                                "val": "13.725"
                            },
                            "BudgetYearOneBase": {
                                "val": "13.59"
                            },
                            "BudgetYearOne": {
                                "val": "13.59"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        },
                        "TotalObligationAuthority": {
                            "CurrentYear": {
                                "val": "13.725"
                            },
                            "BudgetYearOneBase": {
                                "val": "13.59"
                            },
                            "BudgetYearOne": {
                                "val": "13.59"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Hardware - Package Type I"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "UnitCost": {
                                                            "val": "44"
                                                        },
                                                        "Quantity": {
                                                            "val": "42"
                                                        },
                                                        "TotalCost": {
                                                            "val": "1.856"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "UnitCost": {
                                                            "val": "92"
                                                        },
                                                        "Quantity": {
                                                            "val": "18"
                                                        },
                                                        "TotalCost": {
                                                            "val": "1.66"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "UnitCost": {
                                                            "val": "92"
                                                        },
                                                        "Quantity": {
                                                            "val": "18"
                                                        },
                                                        "TotalCost": {
                                                            "val": "1.66"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hardware - Package Type II"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "UnitCost": {
                                                            "val": "48"
                                                        },
                                                        "Quantity": {
                                                            "val": "130"
                                                        },
                                                        "TotalCost": {
                                                            "val": "6.2"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "UnitCost": {
                                                            "val": "74"
                                                        },
                                                        "Quantity": {
                                                            "val": "81"
                                                        },
                                                        "TotalCost": {
                                                            "val": "5.994"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "UnitCost": {
                                                            "val": "74"
                                                        },
                                                        "Quantity": {
                                                            "val": "81"
                                                        },
                                                        "TotalCost": {
                                                            "val": "5.994"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hardware - Package Type IV"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "UnitCost": {
                                                            "val": "205"
                                                        },
                                                        "Quantity": {
                                                            "val": "10"
                                                        },
                                                        "TotalCost": {
                                                            "val": "2.052"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "UnitCost": {
                                                            "val": "157"
                                                        },
                                                        "Quantity": {
                                                            "val": "10"
                                                        },
                                                        "TotalCost": {
                                                            "val": "1.57"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "UnitCost": {
                                                            "val": "157"
                                                        },
                                                        "Quantity": {
                                                            "val": "10"
                                                        },
                                                        "TotalCost": {
                                                            "val": "1.57"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Changes"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "0.3"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "0.3"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "0.3"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Engineering\/Program Management"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "0.313"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "0.313"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "0.313"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Test & Evaluation, Production"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "1.626"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "1.626"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "1.626"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "1.378"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "1.378"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "1.378"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Fielding"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "TotalCost": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "TotalCost": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "TotalCost": {
                                                            "val": "0.749"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "TotalCost": {
                                                            "val": "0.749"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": []
    }
}