{
    "id": "000fd56b3ca67dc171cad330cbdfcddbeea8c267",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602601F"
        },
        "ProgramElementTitle": {
            "val": "Space Technology"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "88.363"
            },
            "CurrentYear": {
                "val": "103.955"
            },
            "BudgetYearOne": {
                "val": "98.229"
            },
            "BudgetYearOneBase": {
                "val": "98.229"
            },
            "BudgetYearTwo": {
                "val": "108.821"
            },
            "BudgetYearThree": {
                "val": "111.632"
            },
            "BudgetYearFour": {
                "val": "114.874"
            },
            "BudgetYearFive": {
                "val": "117.705"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element focuses on four major areas.  First, space survivability and surveillance develops technologies to understand space weather and the geophysics environment for mitigation and exploitation of these effects to Air Force systems.  Second, spacecraft payload technologies improve satellite payload operations by developing advanced component and subsystem capabilities.  Third, spacecraft protection develops technologies for protecting U.S. space assets in potential hostile settings.  The last major area, spacecraft vehicles, focuses on spacecraft platform and control technologies, and their interactions.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary space technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "98.375"
                },
                "CurrentYear": {
                    "val": "104.063"
                },
                "BudgetYearOne": {
                    "val": "109.561"
                },
                "BudgetYearOneBase": {
                    "val": "109.561"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "88.363"
                },
                "CurrentYear": {
                    "val": "103.955"
                },
                "BudgetYearOne": {
                    "val": "98.229"
                },
                "BudgetYearOneBase": {
                    "val": "98.229"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-10.012"
                },
                "CurrentYear": {
                    "val": "-0.108"
                },
                "BudgetYearOne": {
                    "val": "-11.332"
                },
                "BudgetYearOneBase": {
                    "val": "-11.332"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.204"
                    },
                    "CurrentYear": {
                        "val": "-0.108"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.594"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-8.214"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-11.332"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.332"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY13 Other Adjustments was due to Sequestration.\nDecrease in FY15 is due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621010"
                    },
                    "ProjectTitle": {
                        "val": "Space Survivability & Surveillance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.601"
                        },
                        "CurrentYear": {
                            "val": "35.955"
                        },
                        "BudgetYearOne": {
                            "val": "35.159"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.159"
                        },
                        "BudgetYearTwo": {
                            "val": "40.742"
                        },
                        "BudgetYearThree": {
                            "val": "44.325"
                        },
                        "BudgetYearFour": {
                            "val": "45.927"
                        },
                        "BudgetYearFive": {
                            "val": "47.001"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technologies to understand and control the space environment for warfighter's future capabilities.  The focus is on characterizing and forecasting the battlespace environment for more realistic space system design, modeling, and simulation, as well as the battlespace environment's effect on space systems' performance.  This includes technologies to specify and forecast the space environment for planning operations, ensure uninterrupted system performance, optimize space-based surveillance operations, and provide capability to mitigate or exploit the space environment for both offensive and defensive operations.  Finally, this project includes the seismic research program that supports national requirements for monitoring nuclear explosions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Environment Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for specifying, monitoring, predicting, and controlling space environmental conditions hazardous to DoD operational space systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.788"
                                            },
                                            "Text": {
                                                "val": "Refined the concept-of-operations for solar optical flare specification and prediction unit, and completed the setup of the associated solar optics laboratory.  Explored properties of spacecraft materials and novel coatings to understand effects of temperature and aging on spacecraft charging and developed new techniques for charge mitigation.  Developed space environment models and tools to support improved spacecraft design and space mission planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.403"
                                            },
                                            "Text": {
                                                "val": "Continue energetic space particle dynamics research to improve quality of spacecraft environmental hazard predictions.  Continue spacecraft material temperature, dose, and aging effects research.  Develop spacecraft charge mitigation techniques related to on-orbit material aging.  Develop next-generation miniaturized space environment sensor concepts.  Exploit developing solar ultraviolet emissions and solar wind models to enable a time-dependent solar wind model capable of handling transients.  Investigate potential alternatives to traditional solar flare specification and prediction to achieve more accurate predictions.  Develop improved solar radio frequency monitoring concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.309"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.309"
                                            },
                                            "Text": {
                                                "val": "Exploit new on-orbit data sources to enhance energetic space environment models supporting spacecraft design and mission planning.  Exploit spacecraft material aging research to investigate methods for remote measurement of aging susceptibilities.  Continue development of solar flare specification and prediction techniques using both ground- and space-based data and modern artificial intelligence techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Surveillance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced target detection techniques, spectral signature libraries, and decision aids for space-based sensors and surveillance systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.086"
                                            },
                                            "Text": {
                                                "val": "Evaluated space-based hypertemporal (HT) sensor performance.  Completed HT data processing methodology and investigated HT detection methods for concealed activity monitoring.  Conducted trade-space studies of components used in space-based thermal infrared (IR) hyperspectral imaging payloads.  Initiated development of case scenarios and sensitivity analyses of atmospheric compensation and temperature-emissivity separation codes required for space-based thermal IR hyperspectral imaging."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.538"
                                            },
                                            "Text": {
                                                "val": "Continue space-based HT sensor performance trade studies.  Continue evaluation of HT detection methods for concealed activity monitoring.  Discontinued hyperspectral imaging work due to increased emphasis in HT sensor technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.534"
                                            },
                                            "Text": {
                                                "val": "Evaluate HT data processing methods and target detection algorithms.  Complete space-based HT sensor performance trade studies.  Continue evaluation of HT detection methods for concealed activity monitoring."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ionospheric Research"
                                    },
                                    "Description": {
                                        "val": "Develop techniques, forecasting tools, and sensors for ionospheric specification and forecasting, space-based geolocation demonstrations, and determination of potential radar degradation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.407"
                                            },
                                            "Text": {
                                                "val": "Incorporated methods to exploit grid-free calculations of plasma processes in the magnetosphere and ionosphere to improve solar weather forecasts.  Initiated modeling of energy flow between solar and terrestrial environments.  Studied plasma instabilities and processes in the equatorial ionosphere to predict global positioning system (GPS) and communication impacts.  Developed plan for increased measurement capabilities in severely under-sampled region for more accurate predictions of communication\/navigation effects.  Initiated development of physics-based low earth orbit (LEO) satellite drag prediction tool."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.999"
                                            },
                                            "Text": {
                                                "val": "Continue investigations for physics-based improvements of space weather specification and forecast models related to impacts on DoD systems.  Develop improved modeling capability for scintillation impacts on communication, GPS and remote sensing, and for environmentally-induced satellite anomalies, by assimilating space, ground and unexploited data sources.  Begin implementing plan for increasing measurements in under-sampled regions for more accurate prediction of radio link degradation.  Validate preliminary LEO satellite drag prediction tool and improve by assimilating satellite observations.  Define requirements and implement a baseline ionospheric simulation and radio frequency illumination capability for high frequency (HF) geolocation and radar systems; initiate model and data utility trade studies; begin development of advanced simulation techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.689"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.689"
                                            },
                                            "Text": {
                                                "val": "Continue investigations for physics-based space weather specification and forecast models related to impacts on DoD systems.  Validate improved modeling capabilities for scintillation impacts on communications, GPS and remote sensing, and for environmentally-induced satellite anomalies.  Begin development of next model increments.  Integrate and quantitatively assess environmental models and system impact data across the solar, magnetosphere, and ionosphere domains to expand capabilities for actionable attribution and forecast of environmentally-caused anomalies on DoD satellites and environmental interference with electromagnetic wave propagation.  Incorporate advanced ionospheric sounding techniques and traveling ionospheric disturbance effects into simulation model for next generation radar systems.   Conduct application-specific trade studies for model components and data types.  Demonstrate HF geolocation coordinate registration capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radiation Remediation Research"
                                    },
                                    "Description": {
                                        "val": "Conduct Radiation Belt Remediation (RBR) research through developing and validating analytical and performance models for remediation of Earth radiation belts following high altitude nuclear detonation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.882"
                                            },
                                            "Text": {
                                                "val": "Conducted research to characterize the interactions of radio waves and charged particles in the earth's radiation belts using satellite experiments.  Applied understanding of very low frequency (VLF) propagation from space sources and the resulting wave particle interactions.  Developed a validated end-to-end model to assess the feasibility of a fielded RBR system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.158"
                                            },
                                            "Text": {
                                                "val": "Continue ground-based VLF propagation experiments using national and international assets.   Validate revised VLF ionospheric propagation models for RBR modeling to include natural and man-made VLF sources.  Incorporate results from planned VLF and particle mapping flight experiment to support ground-based and space-based VLF transmitter experiments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.529"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.529"
                                            },
                                            "Text": {
                                                "val": "Validate RBR end-to-end model version 2.0 using ground and space-based measurements with the very low frequency particle mapper and satellite experiments.  Conduct fielded RBR capability assessments to determine rough order fielded system requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seismic Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop seismic technologies to support national requirements for monitoring nuclear explosions with special focus on regional distances less than 2,000 kilometers from the sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.438"
                                            },
                                            "Text": {
                                                "val": "Migrated unified models of seismic calibration and wave propagation in Eurasia to three-dimensional physics-based models.  Began extending coverage of unified model to all of Eurasia.  Tested new processing approaches to image local seismic structure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.777"
                                            },
                                            "Text": {
                                                "val": "Improve resolution of three-dimensional physics-based seismic wave propagation models through scientific and computational advances.  Investigate use of these three-dimensional models to match all details of seismic signals.  Continue extending coverage of unified model."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.292"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.292"
                                            },
                                            "Text": {
                                                "val": "Assess relative utility of different scientific and computational advances for improving the accuracy of three-dimensional seismic wave propagation models.  Explore use of details of seismic signals in three-dimensional models for discrimination of explosions from earthquakes.  Extend coverage and increase resolution of unified model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Navigation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies based on cold atom physics that provide autonomous jam-proof precision inertial navigation to augment Global Positioning System (GPS) in case of GPS-denial.  Develop atomic clocks based on new technologies to replace legacy GPS atomic clocks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.080"
                                            },
                                            "Text": {
                                                "val": "Design a compact atomic clock that would provide both the accuracy and robustness necessary to replace legacy atomic clocks for GPS with modern sustainable technology.  Begin construction of a free space cold atom gyroscope\/accelerometer that would enable GPS-free precision navigation.  Evaluate design of a confined cold atom gyroscope to reduce size and weight requirements to expand GPS-free navigation to a larger number of Air Force platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.806"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.806"
                                            },
                                            "Text": {
                                                "val": "Continue to advance the development of compact atomic clocks with improved accuracy and stability to replace legacy atomic clocks.  Continue construction of a free space, cold atom 3-axis gyroscope\/accelerometer that would enable GPS-free precision navigation.  Test a completed free space, cold atom single-axis gyroscope\/accelerometer to learn about its strengths and limitations.  Continue development of a confined cold atom gyroscope with reduced size and weight over free space cold atom gyroscopes to expand GPS-free navigation to a larger number of Air Force platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624846"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Payload Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.052"
                        },
                        "CurrentYear": {
                            "val": "19.098"
                        },
                        "BudgetYearOne": {
                            "val": "15.203"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.203"
                        },
                        "BudgetYearTwo": {
                            "val": "16.779"
                        },
                        "BudgetYearThree": {
                            "val": "15.692"
                        },
                        "BudgetYearFour": {
                            "val": "16.142"
                        },
                        "BudgetYearFive": {
                            "val": "16.575"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops advanced technologies that enhance spacecraft payload operations by improving component and subsystem capabilities.  The project focuses on development of advanced, space-qualified, survivable electronics, and electronics packaging technologies; development of advanced space data generation and exploitation technologies, including infrared sensors; and development of high-fidelity space simulation models that support space-based surveillance and space asset protection research and development for the warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space-Based Detector Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced infrared device technologies that enable hardened space detector arrays with improved detection to perform acquisition, tracking, and discrimination of space objects and missile warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.638"
                                            },
                                            "Text": {
                                                "val": "Researched predictive capability for next generation large format detector array and readout array technology challenges toward Wide Area, Global Access Detection and Tracking.  Developed alternative, lower-cost detector materials that operate at higher temperatures for the persistent surveillance mission.  Explored theoretical and experimental electronic transport and tenability studies in semiconductors to improve detector sensitivity and operation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.471"
                                            },
                                            "Text": {
                                                "val": "Continue to develop innovative alternative materials\/components and technologies to enable new capabilities or enhance existing performance of space sensors.  Pursue revolutionary breakthroughs to improve target detection and identification, enable mission configurability, and provide all-weather, all-terrain, dim\/distant target detection and identification while reducing the volume, weight and cost."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.982"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.982"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and mature an alternative sensor material system to include: increased operating temperature, reduced non-uniformity, and reduced cost.  Explore novel detector enhancement methodologies (radiation hardening techniques, detector architectures, etc.) to mainstream visible-long wavelength infrared focal plane array developments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Situational Awareness Sensing (SSA) Research"
                                    },
                                    "Description": {
                                        "val": "Develop innovative means for measuring, modeling, and predicting phenomena for SSA and protection applications.  Develop new methods to evaluate how well specific data contributes to identifying particular physical and functional information about a space-based object, and ultimately enable decision-makers to pursue courses of action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.095"
                                            },
                                            "Text": {
                                                "val": "Initiated predictive modeling capabilities for select sensing methods and phenomena.  Developed theory required and applied to a variety of space awareness mission threads and potential threat scenarios.  Verified and validated decision-critical information mapping exercise results.  Completed the multi-sensor exploitation for space object characterization effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.031"
                                            },
                                            "Text": {
                                                "val": "Verify and validate predictive modeling capabilities against laboratory and field measurements.  Initiate next-generation analysis of sensing methods and phenomena to exploit for space protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.102"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.102"
                                            },
                                            "Text": {
                                                "val": "Begin execution of experiment campaign to measure satellite components to verify and validate predictive modeling capabilities against these laboratory and field measurements.  Begin systems analysis to establish performance requirements under validated threat scenarios.  Initiate next-generation analysis of sensing methods and phenomena to exploit for space protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Electronics Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for space-based payload components such as radiation-hardened electronic devices, micro-electro-mechanical system devices, and advanced electronics packaging."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.245"
                                            },
                                            "Text": {
                                                "val": "Investigated hardening techniques to protect satellites from high power microwaves.  Researched advanced system-on-chip integration for improved performance of space sensor systems.  Developed integrated modules using three-dimensional techniques to reduce size, weight, and power and increase performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.918"
                                            },
                                            "Text": {
                                                "val": "Complete investigation of hardening techniques to protect satellites from high power microwaves.  Complete integration model of basic technologies for proof-of-concept system-on-chip integration.  Continue research and development of advanced system-on-chip integration for improved performance of space sensor systems.  Complete three-dimensional evaluation test devices to prove feasibility of the process within the foundry.  Continue development of integrated modules using three-dimensional techniques to reduce size, weight, and power and increase performance.  Begin investigating multicore processor architectures for integration with three-dimensional and system-on-chip techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.684"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.684"
                                            },
                                            "Text": {
                                                "val": "Complete development of integrated modules using three-dimensional techniques to increase throughput while reducing size, weight, and, especially, power.  Explore new transistor designs that are compatible with current manufacturing techniques but more efficient and radiation tolerant at ultra-small feature sizes (e.g., 7nm).  Expand on-going electronic device reliability research into other failure modes (e.g., hot carrier injection) to understand defects responsible for reduced lifetimes in small feature-size electronic devices.  Continue exploration of successful integration techniques for system-on-chip integrated circuits."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation Tools for Space Applications"
                                    },
                                    "Description": {
                                        "val": "Develop modeling and simulation tools for space-based ground surveillance systems, rendezvous and proximity operations, imaging of space systems, distributed satellite architecture, and space control payloads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.074"
                                            },
                                            "Text": {
                                                "val": "Refined and tested spacecraft simulations that model system performance, mission planning, and experiments for future flight experiments.  Developed a data center to be able to archive telemetry from flight experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.678"
                                            },
                                            "Text": {
                                                "val": "Continue to develop spacecraft and mission simulations in close conjunction with customers across DoD.  Integrate state-of-the-art system performance and mission planning algorithms into modeling and simulation software tools.  Transition validated tools to the data center in preparation for upcoming flight programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.451"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.451"
                                            },
                                            "Text": {
                                                "val": "Continue to develop spacecraft and mission simulations in close conjunction with customers across the DoD.  Continue to integrate state-of-the-art system performance and mission planning algorithms into modeling and simulation software tools.  Revise flight tools based on recent flight program experience.  Support technology development and maturation through capability and mission utility studies and size, weight, and power-cost trade studies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Positioning, Navigation, and Timing Technology"
                                    },
                                    "Description": {
                                        "val": "Identify and develop technologies that enable new, or enhance existing, U.S. positioning, navigation, and timing (PNT) satellite capabilities by increasing resiliency and availability of accuracy, and\/or increasing the affordability of providing current capabilities.  Develop technologies to meet identified Air Force Space Command\/Space and Missile Systems Center PNT space payload technology needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.984"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.984"
                                            },
                                            "Text": {
                                                "val": "Conduct experiments to establish the sensitivity of PNT payload units\/sub-units to off-nominal operating conditions and to establish laboratory readiness for incorporation of experimental hardware from other, on-going PNT technology developments.  Conduct studies to identify alternative and innovative technology options for PNT payloads."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625018"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Protection Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.383"
                        },
                        "CurrentYear": {
                            "val": "5.407"
                        },
                        "BudgetYearOne": {
                            "val": "8.498"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.498"
                        },
                        "BudgetYearTwo": {
                            "val": "7.525"
                        },
                        "BudgetYearThree": {
                            "val": "8.629"
                        },
                        "BudgetYearFour": {
                            "val": "9.201"
                        },
                        "BudgetYearFive": {
                            "val": "9.411"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the technologies for protecting U.S. space assets in potentially hostile environments to assure continued space system operation without performance loss in support of warfighter requirements.  The project focuses on identifying and assessing spacecraft system vulnerabilities, developing threat warning technologies, and developing technologies to mitigate the effects of both intentional and unintentional threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Threat Warning Research"
                                    },
                                    "Description": {
                                        "val": "Develop satellite threat warning technologies and tools for space defense.  Exploit on-board inherent satellite resources, satellite-as-a-sensor, and self-aware satellite technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.383"
                                            },
                                            "Text": {
                                                "val": "Developed advanced on-orbit threat detection, assessment, and response technologies, including data processing and handling for course of action determination, space-based tasking, co-orbital threat detection, and autonomous response.  Demonstrated situational awareness system in operational environment.  Developed and obtained initial operating capability for situational awareness testbed.  Reduced size, weight, and power for next-generation proximity detection sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.407"
                                            },
                                            "Text": {
                                                "val": "Enhance satellite-as-a-sensor technology development.  Demonstrate improved ability to determine satellite orbital conjunctions and develop proof-of-concept for closed loop situational awareness system.  Develop integrated sensor and response system for threat detection, characterization, and warning.  Advance detection sensor technology to improve data-to-information-to-decision capabilities.  Develop improved sensor algorithms and data fusion techniques.  Continue to reduce size, weight, and power requirements for next generation proximity detection sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.498"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.498"
                                            },
                                            "Text": {
                                                "val": "Down select and mature next generation proximity detection sensor technologies and sensor suite integration.  Provide technology support for the Joint Space Operations Center (JSpOC) Mission Systems Service Pack 7.  Begin instantiation of JSpOC Mission Systems (JMS) space situational awareness testbed.  Develop SSA closed loop simulation showing automated threat detection and response actions.  Evaluate technologies to enable better monitoring of space objects in geosynchronous orbit."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "628809"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Vehicle Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.327"
                        },
                        "CurrentYear": {
                            "val": "43.495"
                        },
                        "BudgetYearOne": {
                            "val": "39.369"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.369"
                        },
                        "BudgetYearTwo": {
                            "val": "43.775"
                        },
                        "BudgetYearThree": {
                            "val": "42.986"
                        },
                        "BudgetYearFour": {
                            "val": "43.604"
                        },
                        "BudgetYearFive": {
                            "val": "44.718"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project focuses on spacecraft platforms (e.g., structures, power, and thermal management); satellite control (e.g., signal processing and control); and space experiments of maturing technologies for space qualification."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Power\/Thermal Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for advanced space platform subsystems such as cryocoolers, compact, high efficiency solar power cells and arrays, and innovative power generation concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.687"
                                            },
                                            "Text": {
                                                "val": "Increased cryocooler efficiency from 12% to 30% through modeling, energy analysis of single and multi-stage coolers, and cross gimbal\/distributed cooling.  Researched effective low and zero vibration cryocooler technologies, including solid state coolers.  Investigated approaches and concepts for development of greater than 40% efficient solar cells.  Developed novel flexible array technologies to enable greater launch volume stowage efficiency."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.439"
                                            },
                                            "Text": {
                                                "val": "Complete preliminary cryocooler modeling, energy analysis of single and multi-stage coolers, and cross gimbal\/distributed cooling to improve cryocooler efficiency and demonstrate some strategies.  Continue to research and advance effective low and zero vibration cryocooler technologies, including solid state coolers.  Begin moving forward with maturation of most promising technical approaches for greater than 40% efficient solar cells.  Continue development of novel flexible array technologies to enable greater launch volume stowage efficiency and higher specific power."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.491"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.491"
                                            },
                                            "Text": {
                                                "val": "Continue to examine new solid state, zero vibration cryocooler methods. Perform studies on how new solid state technologies may be integrated directly to a focal plane array to show representative thermal loading.  Continue development of greater than 40% efficient solar cell approaches.  Investigate advanced photon management approaches.  Continue optimizing flexible solar array for mass and volume efficiency."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Structures and Controls Research"
                                    },
                                    "Description": {
                                        "val": "Develop revolutionary and enabling technologies, including lighter weight, lower cost, high performance structures for space platforms; guidance, navigation, and controls hardware and software for next generation of space superiority systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.998"
                                            },
                                            "Text": {
                                                "val": "Produced experimental flight hardware for thermal management systems requiring high power input. Developed capabilities for characterizing novel, structural materials in a relevant environment.  Completed design tools for automated guidance, navigation, and control subsystem for spacecraft.  Demonstrated and transitioned advanced estimation-based algorithms for search, detect, and track of space objects.  Developed advanced dynamic analysis methods for spacecraft relative motion applications; validated improved spacecraft thruster models in relevant environment; initiated new techniques supporting debris mitigation, including passive (fuel free) techniques for de-tumbling debris to allow for easier removal; initiated new research in collaborating autonomous spacecraft guidance, navigation, and control techniques supporting distributed spacecraft missions.  Developed next-generation electronics to enable rapid spacecraft build and reduce spacecraft cost.  Demonstrated autonomous flight architecture enabling rapid threat detection and response."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.702"
                                            },
                                            "Text": {
                                                "val": "Perform multi-physics characterization of relevant and non-linear structural materials (mechanical, thermal, electromagnetic).  Produce flight hardware for experimental de-orbit mechanism for satellites and rocket stages.  Complete advanced dynamics analysis methods efforts and demonstrate in relevant environment(s); continue space debris mitigation efforts; continue collaborative autonomous spacecraft guidance, navigation, and control efforts supporting distributed spacecraft missions; initiate efforts to integrate guidance, navigation, and control methods with advanced spacecraft autonomy decision architectures.  Demonstrate on the ground space-to-space surveillance system with autonomous sensor control."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.884"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.884"
                                            },
                                            "Text": {
                                                "val": "Improve and refine collaborative autonomous spacecraft guidance, navigation, and control efforts supporting distributed spacecraft missions.  Continue efforts to integrate guidance, navigation, and control methods with advanced spacecraft autonomy decision architectures.  Integrate multi-spacecraft and autonomous spacecraft efforts to establish multiple autonomous spacecraft technology capability.  Develop improved constitutive models for composite materials.  Continue research to improve the fabrication and manufacture of precision and high tolerance composite structures.  Perform research in thermal management technologies for heat dissipation of high power and high energy density electronics.  Continue to develop analytic and numerical tools and demonstrate multi-physics optimization of satellite structures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Experiments"
                                    },
                                    "Description": {
                                        "val": "Develop flight experiments to improve the capabilities of existing operational space systems and to enable new transformational space capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.666"
                                            },
                                            "Text": {
                                                "val": "Initiated launch readiness preparations, electrical trailblazer, insertion of flight batteries and communications security equipment, and regression testing with satellite operations center in preparation for integration on the launch vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.228"
                                            },
                                            "Text": {
                                                "val": "Continue pre-launch preparations and pre-launch-vehicle integration for on-orbit radiation remediation proof-of-concept experiment.  Develop innovative technologies for planned on-orbit experiment using the Evolved Expendable Launch Vehicle Secondary Payload Adaptor to support both platform and payloads, as well as developing advanced interfaces to accommodate partner payloads and technologies.  Complete manufacturing and delivery of very low frequency particle mapper (VPM) payload suite, and begin satellite bus integration.  Begin VPM mission launch readiness actions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.947"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.947"
                                            },
                                            "Text": {
                                                "val": "Continue pre-launch preparations, launch the on-orbit radiation remediation proof-of-concept experiment.  Perform launch and early orbit activities and then on-orbit satellite experiments operations.  Continue science payload design and long lead procurement for maneuverable geosynchronous space vehicle experiment.  Verify system design for science data collections.  Verify payload subsystem hardware and software after component\/subsystem delivery.  Prepare for component\/subsystem tests, complete experiment planning for maneuverable geosynchronous experimental platform design payload configurations, and begin to prepare for final spacecraft integration and test.  Complete VPM space vehicle assembly integration and test."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Communication Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for next-generation space communications terminals and equipment and methods\/techniques to enable future space system operational command and control concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.976"
                                            },
                                            "Text": {
                                                "val": "Conducted research and developed various technologies (i.e., high power amplifiers, integrated optical transceivers, high-performance satellite antenna, and reconfigurable satellite radios) to support future space communication systems; particular emphasis was placed on optical (laser) communication, reconfigurable and cognitive communication, advanced radio frequency communication, high-bandwidth photonic satellite bus networks, and satellite communication security\/encryption."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.126"
                                            },
                                            "Text": {
                                                "val": "Continue applied research and development efforts (modeling, simulation, and laboratory testing) to reduce component technical risks (e.g., functionality and performance) and to meet technology and capability needs for optical (i.e., laser communication), millimeter-wave (i.e., Ka-band, V-band, W-band), and protected satellite communication technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.047"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.047"
                                            },
                                            "Text": {
                                                "val": "Continue applied research and development efforts (modeling, simulation, and laboratory testing) to reduce component technical risks and to meet technology needs.  Specifically, work to develop a propagation flight experiment to characterize the W and V frequency bands for future military satellite communications.  Begin evaluation of optical communication links with small spacecraft."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}