{
    "id": "0156d98599b6dcd371e86c3c42fcba3b00d676c1",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V3A_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0208006F"
        },
        "ProgramElementTitle": {
            "val": "Mission Planning Systems"
        },
        "R1LineNumber": {
            "val": "167"
        },
        "MdapCode": {
            "val": "N35"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "64.035"
            },
            "CurrentYear": {
                "val": "62.432"
            },
            "BudgetYearOne": {
                "val": "60.679"
            },
            "BudgetYearOneBase": {
                "val": "60.679"
            },
            "BudgetYearTwo": {
                "val": "65.701"
            },
            "BudgetYearThree": {
                "val": "83.246"
            },
            "BudgetYearFour": {
                "val": "82.894"
            },
            "BudgetYearFive": {
                "val": "84.798"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Mission planning involves the creation of a flight plan based on threats, targets, terrain, weather, aircraft performance capability, and configuration.  It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie.  The planner must have the ability to plan weapons, cargo, passenger, and\/or fuel delivery, calculate fuel requirements, and assess the route based on known enemy threat location and type.  Mission planners must be able to optimize and de-conflict flight routes with other aircraft; review, print, and brief the mission plan; and download pertinent flight information to on-board aircraft avionics.\n \nThe Mission Planning Systems (MPS) program is a collaborative program with the Army and Navy to leverage technical solutions and business practices for all Department of Defense (DoD) platforms.  It provides automated mission planning tools and support for fixed and rotary wing aircraft and guided munitions.  It replaced two closed architecture legacy mission planning systems (UNIX-based MPS (UNIX-MPS) and the PC-based Portable Flight Planning Software (PFPS)), with a single multi-service open architecture system more commonly referred to as the Joint Mission Planning System (JMPS).  MPS will compress the mission planning cycle by providing an improved integrated planning environment, reducing the time required to respond to changing situations and urgent needs such as striking time sensitive\/critical targets and conducting combat search and rescue.  MPS products have the potential to support all DoD fixed-wing and rotary-wing aircraft and will be shared with other AF programs as well as the Army and Navy.  MPS will deliver significant benefits to command and control performance by enhancing information superiority for the warfighter and by providing unique capabilities in support of both precision engagement and dominant maneuver.\n  \nTo meet the unique needs of Air Mobility Command (AMC), the Mobility Air Force Automated Flight Planning Service (MAFPS) component of MPS will provide a centralized, net-centric global mobility mission flight planning capability.  This capability will provide significant fuel savings through automated flight route optimization utilizing aircraft performance, air traffic management, weather, and other data. \n\nIn addition to the above, elements of Mission Planning Systems will be utilized to continue development of a Joint Precision Airdrop System (JPADS) in conjunction with the Army.  The JPADS System of Systems (SoS) capability provides a planning and execution capability for DoD airdrop requirements.  It is the primary airdrop mission planning and execution system for all ballistic airdrop mission as well as precision guided airdrops that are required when the mission profile or surface-to-air threat assessment warrants a high-altitude and\/or standoff precision delivery.  JPADS enables high-altitude, precise airdrop delivery to forward ground forces, mitigating surface-to-air threats, reducing risk of Improvised Explosive Device (IED) & insurgent attack on ground convoys.  JPADS allows the warfighter to consider weather, terrain, aircraft capabilities, threat, etc. to accurately deliver payloads to keep the warfighter supplied and in the fight.\n\nFY15 funding will continue the MPS software development program.  It will develop pre and in-flight mission planning capabilities for a variety of Air Force aircraft and weapons from legacy mission planning systems to the new MPS.  These weapon systems include, but are not limited to the: A-10, B-1B, C-5, C-17, C-130, E-3, E-8, F-15, F-16, F-22A, RC-135, HH-60, and their associated weapons (e.g. Small Diameter Bomb (SDB), Joint Direct Attack Munitions (JDAM), Joint Air-to-Surface Standoff Munitions (JASSM), etc.).  FY15 funding will also continue the development of MAFPS to realize fuel savings and other efficiencies.  Additionally, it will continue the development of JPADS airdrop software (and other system components) to provide a precision airdrop capability for the C-17, C-130, and other selected platforms as necessary.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "69.377"
                },
                "CurrentYear": {
                    "val": "62.605"
                },
                "BudgetYearOne": {
                    "val": "86.628"
                },
                "BudgetYearOneBase": {
                    "val": "86.628"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "64.035"
                },
                "CurrentYear": {
                    "val": "62.432"
                },
                "BudgetYearOne": {
                    "val": "60.679"
                },
                "BudgetYearOneBase": {
                    "val": "60.679"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.342"
                },
                "CurrentYear": {
                    "val": "-0.173"
                },
                "BudgetYearOne": {
                    "val": "-25.949"
                },
                "BudgetYearOneBase": {
                    "val": "-25.949"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.091"
                    },
                    "CurrentYear": {
                        "val": "-0.173"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.941"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-3.310"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-25.949"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-25.949"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2013 Other Adjustments decreased $3.310M due to Sequestration.\n\nFY2015 Other Adjustments decreased $25.949M for higher Air Force priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "673858"
                    },
                    "ProjectTitle": {
                        "val": "Mission Planning Systems (MPS) Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.161"
                        },
                        "CurrentYear": {
                            "val": "0.660"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.821"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission planning involves the creation of a flight plan based on threats, targets, terrain, weather, aircraft performance capability and configuration. It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie. The planner must have the ability to plan weapon, cargo, passenger, and\/or fuel delivery, calculate fuel requirement and assess the route based on known enemy threat location and type. Mission planners must be able to optimize and de-conflict flight routes with other aircraft; review, print and brief the plan; and download pertinent flight information to on-board aircraft avionics.\n\nThis project provides for the continuous improvement of mission planning software capabilities that cut across all platforms and systems.  It allows for the investigation of new technologies and products that have the potential for improving mission planning systems.  This includes the continuous upgrading of the MPS framework.  The framework is the underlying baseline capability for all mission planning systems.  It will require regular upgrades to: 1) reduce timelines for route planning; 2) transmit near real-time intelligence data to the platforms; 3) increase the accuracy of the mapping products; 4) provide a Windows-based, commercial off the shelf-based, user friendly product; and 5) retain compatibility with platform changes to avionics and operational flight programs.  Funding will support development and modernization activities for the following efforts within this project area:\n\na. MPS Increment IV:  Continues development activities to complete the initial migration of designated Increment IV platforms (from the Combat Air Forces (CAF) and Mobility Air Forces (MAF) to the new MPS planning capability.  This includes the F-22 Mission Planning Environment (MPE) which will support new capabilities for weapons integration, sensor updates, and avionics changes integrated on board the aircraft.  Planned updates include transitioning selected platform to the Windows 7 operating system.  Additionally, the development effort will also address new and emerging Operational Flight Program (OFP)-generated requirements as identified by the operational users.  Updates to common component (e.g. airdrop and weather) will also be completed as required.\n\nb. Test, Training and Certification:  Continues all MPS-related integration, test, and certification activities for CAF and MAF platforms. Funding for these support efforts will be programmed with their associated project\/program in FY14 and the outyears.\n\nc. Operational and Technical Support:  Continues all program office management operations and support activities to ensure the timely delivery of mission planning systems to the warfighter.\n \nNo Budget Year (FY15) funding is requested for this activity.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MPS Increment IV"
                                    },
                                    "Description": {
                                        "val": "Continues contractor-executed software development and test activities required to migrate selected CAF and MAF platforms to the new MPS Increment IV mission planning capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.161"
                                            },
                                            "Text": {
                                                "val": "Completed development and contractor testing of unique planning components of the Mission Planning Environments (MPEs) for F-22 and A-10."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.660"
                                            },
                                            "Text": {
                                                "val": "Complete operational testing of OFP-driven updates (e.g. Global Pilot Vehicle Interface, Windows 7 operating environment, Link 16, Combat ID) for the F-22 MPE."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "MPS development utilizes an evolutionary acquisition approach to develop and deliver an interoperable, network-centric, mission planning system tailored for numerous Air Force platforms using competition and multiple contract vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MPS Incr IV Software Development (MPEC II)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.203"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.563"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering and Integration (SEIC)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.031"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "A-10 Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Organic"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Responsible Test Organization (RTO)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "46TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.195"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.022"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Certification and Accreditation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Indian Head, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.007"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Type I Training"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Ogden Air Logistics Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.103"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.024"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Field Representative Hardware"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.062"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.004"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical and Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mitre Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.222"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.007"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.269"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.009"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_673858_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "F-22 Inc 3.2A v12.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "A-10 Suite 7B Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Program Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675302"
                    },
                    "ProjectTitle": {
                        "val": "Precision Aerial Delivery Systems (PADS)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.546"
                        },
                        "CurrentYear": {
                            "val": "3.299"
                        },
                        "BudgetYearOne": {
                            "val": "6.972"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.972"
                        },
                        "BudgetYearTwo": {
                            "val": "11.987"
                        },
                        "BudgetYearThree": {
                            "val": "12.777"
                        },
                        "BudgetYearFour": {
                            "val": "14.115"
                        },
                        "BudgetYearFive": {
                            "val": "14.384"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission planning involves the creation of a flight plan based on multiple inputs including threats, targets, terrain, weather, aircraft performance capability, and configuration. It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie.  The planner must have the ability to plan weapon, cargo, passenger, and\/or fuel delivery, calculate fuel requirement and assess the route based on known enemy threat location and type.  Mission planners must be able to optimize and de-conflict flight routes with other aircraft; review, print and brief the plan; download pertinent flight information to on-board aircraft avionics; and, conduct dynamic\/in-flight replanning as applicable.\n\nThis project continues the development of a Joint Precision Airdrop System-Mission Planner (JPADS-MP) Phase I capability in conjunction with the Army contract vehicle.  JPADS provides a planning and execution capability for DoD airdrop requirements.  It is the primary airdrop mission planning and execution system for all ballistic airdrop missions as well as precision guided airdrops that are required when the mission profile or surface-to-air threat assessment warrants a high-altitude and\/or standoff precision delivery.  It enables high-altitude, precise airdrop delivery to forward ground forces, mitigating surface-to-air threats, reducing risk of Improvised Explosive Devices (IEDs) and insurgent attack on ground convoys.  JPADS allows the warfighter to consider weather, terrain, aircraft capabilities, threat, etc., to accurately deliver payloads to combat and other friendly forces. \n \nThe Consolidated Airdrop Tool (CAT) is the key JPADS-MP software deliverable.  It will increase the accuracy of airdrop mission planning by improving aircraft, payload, and chute specific calculations along with weather analysis visualization tools specifically adapted for airdrop.  In addition, the AFRL-led Precision Airdrop (PAD) Flagship Capability Concept (FCC) effort will transition technology capabilities (including but not limited to Bundle Tracking, Forced Exit, Autonomous Weather Sensing, Humanitarian Airdrop, and Airdrop Performance) to the JPADS-MP PoR and into various CAT software release\/deliverables.  The PAD FCC is also charged with updating airdrop platforms and airdrop related systems to improve accuracy across all airdrop mission types.  The following capabilities are currently planned for development within the JPADS-MP program:\n\na. CAT 2.x includes, but is not limited to, the development and incorporation of Digital Terrain Data (DTED), Wireless Gate Release (WGRS), and aircraft specific Monte Carlo solutions into JPADS-MP.\n\nb. CAT v3.x includes, but is not limited to, updates to the operating systems and standard desktop configuration (SDC), refactor of the weather component known as WinPADS, replaces the Local Area Prediction System (LAPS), and Airdrop Damage Estimate (ADE) capabilities.  It also transitions and supports the AFRL PADS FCC capability of bundle tracking.\n\nc. CAT 4.x includes, but is not limited to, Operating System\/Standard Desktop Configuration (OS\/SDC) updates, migration to the new Mission Planning Systems (MPS) capability, combination airdrop, and new map projections including polar stereographic.\n\nd. CAT v5.x includes, but is not limited to, approach headings for guided systems, secondary cargo airdrop release, and transitions AFRL PADS FCC forced exit and humanitarian airdrop capabilities.\n\ne. CAT v6.x includes, but is not limited to, new chute configurations and aerial guidance units, updates ballistics data and dispersion models and transitions AFRL PADS FCC Light Detection and Ranging (LIDAR) and RADAR sensing capabilities for real-time weather.\n\nf. CAT v7.x includes, but is not limited to, OS\/SDC updates, force deployment, and transitions AFRL PADS FCC human effectiveness capabilities.\n\nFY15 funding continues development, testing, and fielding of CAT ver 3.2 software to provide a precision and conventional airdrop capability for AF and other services (e.g. the Army) aircraft platforms.\n\nThis program is in Budget Activity 7, Operational System Development, which includes development efforts to upgrade systems that have been fielded or have received approval for full rate production, and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JPADS-MP Phase I"
                                    },
                                    "Description": {
                                        "val": "Continues development of a JPADS capability for precise, high altitude delivery of material to forward ground forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.546"
                                            },
                                            "Text": {
                                                "val": "Fielded Cat 2.1.  Continued CAT v3.x devlopment activities.  These activities included: 1) Modified antiquated airdrop software for the integration of new weather solutions; 2) brought code-base up to modern standards and practices for modularity and ease of re-use; 3) developed aircraft\/chute system specific calculations for increased accuracy; 4) developed capability for airdrop software to ingest updates to payload ballistic data; 5) developed capability to display location of dropped bundles; and 6) made necessary updates in the software to accommodate new mission computers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.299"
                                            },
                                            "Text": {
                                                "val": "Phase I:  Complete fielding of CAT v2.2 and will field CAT v3.0 and v3.1. Continue CAT v3.x development.  Also continue development and integration of weather forecast and analysis tools (customized for precision airdrop) and integrate an Airdrop Damage Estimate (ADE) tool for improved planning. Efforts also include revising the work-flow of the software and maximizing automation in order to simplify mission execution for the aircrew. Continues development of CAT v4.x activities to expand precision airdrop capabilities for accurate calculation of leaflet dispersion and developing calculations and capabilities for combination airdrop for personnel and heavy equipment in a single pass.  Efforts also include the migration of airdrop software to a JMPS framework."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.972"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.972"
                                            },
                                            "Text": {
                                                "val": "Phase I: Field CAT v3.2. Will continue CAT 4.x development activities to expand precision airdrop capabilities for accurate calculating of leaflet dispersion and development of calculations\/capabilities for combination airdrop for personnel and heavy equipment in a single pass. Will also migrate airdrop software to a JMPS framework.  Will also initiate CAT 5.x development to continue evolution of CAT S\/W into an automated suite of airdrop mission tools to include key Flagship Capabilities Concept (FCC) directives (e.g. humantitatrian airdrop, improved accuracy through updated algorithms, data transfer to Navaids, dropsonde optimization, and ability to transfer wind information along the flight path to Autonomous Guidance Units (AGUs))."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA07: Line Item # 833170"
                                    },
                                    "Title": {
                                        "val": "Mission Planning Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.487"
                                        },
                                        "CurrentYear": {
                                            "val": "6.725"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.400"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.400"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.715"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.281"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.161"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.815"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "PADS utilizes an evolutionary acquisition approach to develop and deliver an interoperable, network-centric, mission planning system tailored for numerous Air Force platforms using competition and multiple contract vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TYBRIN"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Walton Beach, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.889"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.561"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.277"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.277"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.471"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.954"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.316"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.316"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SEI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pittsburgh, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.014"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.012"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.011"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.011"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cost Estimating"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tecolote Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.036"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.024"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.027"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.027"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Responsible Test Organization (RTO)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "46TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.287"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.075"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.075"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Certification and Accreditation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Indian Head, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.011"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.010"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Type I Training"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Ogden Air Logistics Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.151"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.133"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Field Representative Hardware"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.092"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.081"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.285"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.310"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.274"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.266"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.266"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_675302_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v2.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v2.2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v3.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v3.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v3.2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v4.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v5.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v6.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JPADS-MP CAT v7.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Program Office Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675380"
                    },
                    "ProjectTitle": {
                        "val": "Mission Planning Systems (MPS) Modernization"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "57.328"
                        },
                        "CurrentYear": {
                            "val": "58.473"
                        },
                        "BudgetYearOne": {
                            "val": "53.707"
                        },
                        "BudgetYearOneBase": {
                            "val": "53.707"
                        },
                        "BudgetYearTwo": {
                            "val": "53.714"
                        },
                        "BudgetYearThree": {
                            "val": "70.469"
                        },
                        "BudgetYearFour": {
                            "val": "68.779"
                        },
                        "BudgetYearFive": {
                            "val": "70.414"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission planning involves the creation of a flight plan(s) based on threats, targets, terrain, weather, aircraft performance capability and configuration.  It is an essential task that must be completed prior to any fixed or rotary wing aircraft sortie.  The planner must have the ability to plan weapons, cargo, passenger, and\/or fuel delivery, calculate fuel requirement, and assess the route based on known enemy threat location and type.  Mission planners must be able to optimize and de-conflict flight routes with other aircraft, review, print and brief the plan; and download pertinent flight information to on-board aircraft avionics.\n\nThis project focuses on modernizing MPS to support Combat Air Forces (CAF) and Mobility Air Forces (MAF), including the development, test and sustainment of Mission Planning Environments (MPEs) to support the A-10, B-1B, C-5, C-17, C- 27, C-130, E-3, E-8, F-15, F-16, F-22A, KC-10, KC-46, KC-135, RC-135, other platforms, and all common component (CCs)software tools  currently approved as necessary for mission requirements.  Activities also include studies and analysis to support both current program planning and execution and future program planning.  MPS Modernization efforts are as follows:\n\na. CAF MPE Modernization:  These development efforts modernize CAF MPEs that were previously developed and delivered under MPS Increments II and IV. The modernization effort will provide new and improved mission planning capability for individual Operational Flight Program (OFP) requirements, such as new weapons, avionics upgrades, communications systems, etc. The OFPs requiring MPE updates under the CAF modernization effort in Fiscal Years 2011 through 2017 include but are not limited to those for A-10 (Suites 8, 9, 10, 11, and 12), B-1B (Sustainment Blocks 15, 16, 16a, 17 and 18), F-15 (Suites 7, 8, 9, and 10), F-16 Block 30 (System Capability Upgrade [SCU] 8, 9, and 10), F-16 Block 40\/50 (M6.1, M6.5, M7.1, and M8.0) and F-22 (Increments 3.2B, 3.2C, and 4.0). CAF modernization also includes updates to mission planning capabilities supporting associated weapons, including small diameter bomb (SDB-II), joint direct attack munitions (JDAM) and the Joint air-to-surface standoff missile (JASSM). Finally, CAF modernization will address required improvements to CAF related MPE CCs, including Precision-Guided Munitions Planning System (PGMPS), Electronic Warfare CC (EWCC), etc. CAF MPE Modernization includes the following platform efforts:\n\n1) F-15 Modernization Phase II:  This modernization program consists of multiple software development efforts driven by OFP updates for F-15 Suites 7, 8, and 9.  Suite 7 MPE capabilities include, but are not limited to, Digital Transfer Device (DTD) improvements, updates for new features in weapons such as Joint Direct Attack Munition (JDAM), Small Diameter Bomb (SDB), AIM-9X, AIM-120D, and Network Enable Weapon support elements (e.g. key handling, weapon data link, and Link 16).  It will also include enhancements to the synthetic aperture radar planning tool (SAR-PT) and the global area reference tool as well as radar modernization updates (e.g. combat identification, radar planning tool enhancements).  Development efforts for F-15 Suite 8 include, but are not limited to, integration of B61 Life Extension Program (LEP), feature updates for several weapons, and the expansion of Link-16 messages sets.  F-15 Suite 9 MPE will include a variety of updates and enhancements for weapons and aircraft systems to include a new Advanced Dual Core Process II (ADCP-II) computer as well as Digital Transfer Device\/Modules (DTD\/DTM) modernization.\n\n2) F-16 Block 30 Modernization Phase I:  The F-16 Block 30 modernization effort will support new aircraft capabilities established in OFPs for the SCU8 and SCU9.  The effort will also migrate the F-16 Block 30 Mission Planning Environment (MPE) to the Windows 7 operating system and the current version of the MPS Framework.  SCU8 system capabilities include the addition of Helmet Mounted Integrated Targeting (HMIT), Small Diameter Bomb (SDB), the AIM-120D missile variant and Center Display Unit (CDU) Integration.  SCU9 capabilities include finishing HMIT and CDU integrations, support of Threat Symbology\/Correlation (TS\/C) file import (commonality with F-16 Block 40\/50) and the addition of the Laser JDAM.\n\n3) F-16 Block 40\/50 Modernization Phases I&II:  The F-16 Block 40\/50 modernization efforts will provide the capability within the MPE to plan\/utilize a number or OFP-driven capabilities in the platform.  These capabilities include, but are not limited to, integrating the universal armament interface (UAI) with the most recent version of precision guided munitions planning software (PGMPS) to give the platform the ability to plan missions for any type of network enabled weapon (NEW).  It will also provide for UAI compliance with the small diameter bomb (SDB; GBU-39) and the laser joint direct attack munition (LJDAM; GBU-54).  The modernization effort will also provide for the use of the advanced identification friend or foe (AIFF) Mode 5 capability in the F-16 Blk 40\/50.  AIFF will allow use of enhanced authentication and verification of friendly signals, through the incorporation of cryptographically secured signals.  It will also introduce Automatic Dependent Surveillance-Broadcast (ADS-B) technology and facilitate compliance with standards for the Next Generation Air Transportation System (NextGen).  The development effort will also migrate the F-16 Block 40\/50 MPE to the Windows 7 operating environment\n\n4) F-22 Modernization Phase I:  F-22 OFP-driven enhancements include, but are not limited to the addition of improved capabilities for the AIM-9X and AIM-120D, the incorporation of additional electronic protection tasks, the small diameter bomb target list manager, combat identification improvements, installation of the auto ground collision avoidance system, and incorporation of the synthetic aperture radar planning tool.  Additionally, other new and emerging OFP-generated requirements will be addressed as identified by the operational user(s).  Other common component updates will also be completed as required.\n\n5) B-1 Modernization Phase I:  The B-1 Modernization program includes OFP-driven software updates for Releases 7.0, 8.0, and 9.0.  It will incrementally update the platform MPE and provide for integration with the Reliability and Maintainability Improvement Program (RMIP)\/Inertial Navigation System Replacement (INSR), Laptop Computer Targeting Pod Phase 2 (LCTP), Integrated Battle Station elements (including Fully Integrated Data Link\/Visual Situation Display Upgrade (VSDU)), Central Integrated Test System Upgrade (CITS), and related follow on enhancements.  Additionally it will migrate the B-1 MPE to the Windows 7 operating system and convert the B-1 Unit Planning Component (UPC) Visual Basic (VB) code to C# .NET.\n\n6) A-10 Modernization Phase I:  The A-10 effort will continue to support aircraft OFP-driven capability enhancement for Suite 7B and Suite 8.  Suite 7B capabilities include, but are not limited to, JPEG 2000 Maps, Situational Awareness Data Link (SADL) Crypto Upgrade, Electronic Warfare Threat Table Correlation, pre-planning combat search and rescue parameters and helmet mounted cueing system updates.  Suite 8 capabilities include, but are not limited to, the addition of Mode 5 IFF, Combat Survivor Evader Locator (CSEL), Laser JDAM (Joint Direct Attack Munition), AGM-65L (Laser Code Entry), advanced targeting pod mission planning settings, and combat search and rescue post mission enhancements. The modernization effort will also migrate the A-10 Mission Planning Environment (MPE) to the Windows 7 operating system and the current version of the MPS framework.\n\nb. MAF MPE Modernization:  This effort modifies the common MAF MPE developed and deployed during previous mission planning increments.  The modernization activities will provide new and improved mission planning capabilities for the MAF fleet as required to meet evolving OFP, fuel efficiency, and global planning netcentric requirements such as avionics upgrades, communication systems, interfaces with command and control systems, new parachute types, etc. for various MAF platforms.  The MPE updates under the MAF Modernization effort include but are not limited to those for Air Mobility Command--C-5, C-17, C-130s (multiple variants), KC-10, KC-46, and KC-135 and Special Mission Air Combat Command--E-3, E-8, E-4, EC-130H, and RC-135.  MAF modernization will also address required improvements to and integration of MAF related MPE CCs, including the Communications, Navigation Surveillance\/Air Traffic Management (CNS\/ATM) CC, Aeronautical Advisory and Notices to Airmen Tool (AANT), and Air Refueling Tool (ART) CC, etc.  This effort also provides the capability to use the new Digital Aeronautical Information File (DAFIF) web services-based data structure being produced by NGA in this timeframe.\n\n1) Special Missions ACC (SMACC) Modernization Phase I and Phase II:  The SMACC Modernization Program includes development, testing, and fielding of MP software for the E-3\/E-8, RC-135 and EC-130. The E-3\/E-8 v3.0 development effort will provide a Windows 7 capability while maintaining SDC compliance.  It will also deliver software that is compatible with the E-3 DRAGON avionics upgrade including CNS ATM Certification. The RC-135 and EC-130H efforts will update their respective mission planning environments to include the latest Framework and SDC version.\n\n2) Special Missions ACC (SMACC) Combat Search and Rescue (CSAR): The SMACC CSAR program is a continuation of the SMACC Modernization program. SMACC CSAR will transition the PFPS-based HH-60 and HC-130 CSAR mission planning functionality, tools, and plugins to Joint Mission Planning Systems (JMPS) environment.\n\n3) MAF MPS Modernization (AMC Transition):  This effort modifies the common MAF MPE developed and deployed during previous mission planning increments. It will provide new and improved mission planning capabilities for the MAF fleet (e.g. C-5, C-130, KC-10, etc.) as required to meet OFP, fuel efficiency, and global planning net-centric requirements. It includes enhanced capabilities to accommodate avionics upgrades, improved communications systems, interfaces with command and control systems, new parachutes, etc. for various MAF platforms. Development efforts also include integrating improvements to MAF related Common Components (CCs).  Examples of these CCs include the Communication, Navigation, Surveillance\/Air Traffic Management (CNS\/ATM) CC, Consolidated Airdrop Tool (CAT), Aeronautical Advisory and Notices to Airmen Tool (AANT), and Air Refueling Tool (ART). This effort also provides the capability to use the new Digital Aeronautical Information File (DAFIF) services-based data structure being produced by NGA.\n\nc. Mobility Air Force Automated Flight Planning Service (MAFPS):  This effort includes development of a centralized\/net-centric global mobility flight planning capability, which will provide significant fuel savings through automated flight route, airspeed, and altitude optimization utilizing aircraft performance, air traffic management, weather, and other data.\n\nd. Test, Training and Certification:  Continues all MPS-related integration, test, and certification activities for all CAF and MAF platforms.\n\ne. Program Support:  Continues all program office management operations and support activities to ensure the timely development, testing, and delivery of mission planning systems to the warfighter.\n\nFY15 funding will continue the development and modernization of the Mission Planning Environments (MPEs) and related planning capabilities for a variety of Air Force aircraft and weapons platforms for the CAF, MAF, and other operational users.  The modernization programs will be closely aligned and compatible with the capabilities being developed for the platforms within their respective and regularly scheduled Operational Flight Programs (OFPs).\n \nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "F-15 Modernization Phase II"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded F-15 MPEs to enable efficient use of new and improved capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.484"
                                            },
                                            "Text": {
                                                "val": "Continued development of v3.2 and v4.0, which include B61-LEP and additional OFP requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.703"
                                            },
                                            "Text": {
                                                "val": "Complete development and testing (DT\/OT) of SDB II improvements. Continue development of radar and other weapon updates (e.g. B61 LEP, key data loading). Initiate development of OFP-driven updates for F-15 Suite 9."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.091"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.091"
                                            },
                                            "Text": {
                                                "val": "Will continue development of  v4.0 and v5.0, which include B61-LEP and additional Suite 9 OFP requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-16 Block 30 Modernization Phase I"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded F-16 Block 30 MPEs to enable efficient use of new and improved capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.547"
                                            },
                                            "Text": {
                                                "val": "Fielded SCU8. Continued software development and testing to migrate F-16 SCU8 to Windows 7 operating environment.  Initiated development of F-16 SCU9 updates to incorporate Laser JDAM, threat symbology\/correlation, and other capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.282"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of F-16 SCU9 updates (e.g. Laser JDAM, threat symbology\/correlation)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.613"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.613"
                                            },
                                            "Text": {
                                                "val": "Will complete development and testing of F-16 SCU9 updates (e.g. Laser JDAM, threat symbology\/correlation). Will initiate requirements definitization\/planning and initial design activities for F-16 SCU10 updates."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-16 Block 40\/50 Modernization Phases I&II"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded F-16 Block 40\/50 MPEs to enable efficient use of new and improved capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.940"
                                            },
                                            "Text": {
                                                "val": "Phase I: M6.1+ was re-fielded via a Component Replacement Evaluation (CRE), updates included new versions of EWCC and Miniature Air Launched Decoy (MALD), and the addition of OBMT and newer ACC H\/W support. Continued development of M6.5\/M6.5+, which implements UAI Mission Planning 1 (MP1) completion, Weapons Data Link, and Common Weapons Employment Zone (CWEZ) updates. Phase II: M7.1+ continued development throughout FY13 and will include Mission Plannable Declutter, Pattern Management for UAI, and CWEZ."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.868"
                                            },
                                            "Text": {
                                                "val": "Will continue development of Phase I M6.5\/M6.5+, the M6.5 (EPAF) version\nwill enter FQT in Q3 and enter DT in Q4. Phase II: M7.1+ will continue\ndevelopment throughout FY14. Capabilities include, but are not limited to,\nUAI MP2 completion, Weapons Data Link, and Common Weapons Employment Zone\nupdates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.698"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.698"
                                            },
                                            "Text": {
                                                "val": "Phase II: Initiate M7.1+ Functional Qualification Test (FQT) in Q4."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F-22 Modernization Phase I"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded F-22 MPEs to enable efficient use of new and improved capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.019"
                                            },
                                            "Text": {
                                                "val": "Initiated MPE integration and transitioned to Framework 1.5.2.x. Conducted Preliminary Design Reviews, Critical Design Reviews, and developer evaluations in support of v13.0 development and user enhancements to tools, Framework, and common component updates. Tested and delivered v12.0.  Implemented correction of v12.0 deficiencies identified during Government testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.104"
                                            },
                                            "Text": {
                                                "val": "Continue development of v13.0. Capabilities for v13.0 include, but are not limited to, addition of AIM-9X and AIM-120D, incorporation of additional Electronic Protection Tasks, Combat Identification improvements, and the Synthetic Aperture Radar Planning Tool."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.043"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.043"
                                            },
                                            "Text": {
                                                "val": "Will complete development of v13.0 for 2nd FQT in FY16. Capabilities for v13.0 include, but are not limited to, addition of AIM-9X and AIM-120D, incorporation of additional Electronic Protection Tasks, Combat Identification improvements, and the Synthetic Aperture Radar Planning Tool.  The Phase II v14.0 MPE will be built from the v13.1 baseline and will\nintegrate with requirements established through OFP Inc 3.2M(Mandates).\nThese new Inc 3.2M capabilities are planned to include the Mark XIIA System\nwith Joint Requirements Oversight Council (JROC) mandated Mode 5\/S\nIdentification Friend or Foe (IFF) as well as the Communication Navigation\nSurveillance (CNS) \/ Air Traffic Management (ATM) upgrade designated as\nTactical Mandates (TACMAN) and Link 16 transmit capabilities.  Efforts in\nFY15 will focus on requirements definition interfacing with the aircraft\nprogram and culminate in the MPE SRR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "A-10 Modernization Phase I"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded A-10 MPEs to enable efficient use of new and improved capabilities developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.774"
                                            },
                                            "Text": {
                                                "val": "Completed development and fielding of A-10 Suite 7B update (migrated MPE to Win7 operating environment). Continued A-10 Suite 8 development (capabilities include, but are not limited to, Mode 5 IFF, CSEL (Combat Survivor Evader Locator), Laser JDAM (Joint Direct Attack Munition), AGM-65L (Laser Code Entry), Advanced Targeting Pod Mission Planning Settings, and CSAR Post Mission Enhancements)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.794"
                                            },
                                            "Text": {
                                                "val": "Complete A-10 Suite 8 DT\/OT and field capability.  Initiate design reviews for A-10 suite 9."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No FY15 funds requested."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "B-1 Modernization Phase I"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded B-1 MPEs to enable efficient use of new and improved capabilities being developed in the OFPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.858"
                                            },
                                            "Text": {
                                                "val": "Conducted development and test activities of Framework 1.5.300 to support MAF MPS modernization requirements. Ensured legacy capabilities for various tools are supported in the JMPS program. Such tools include, but are not limited to, the Drop Zone\/Landing Zone (DZLZ) database manager and Enterprise Administration and Synchronization Environment Enterprise Administration and Synchronization Environment (EASE)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.349"
                                            },
                                            "Text": {
                                                "val": "Field Rel 7.0.8 for SB-15 and field Rel 7.0.10 for SB-16."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.575"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.575"
                                            },
                                            "Text": {
                                                "val": "Conduct Full Qualification Testing (FQT) for Rel 8.0 (which will update de-clutter configuration tool and defensive threat rings) and complete DT\/OT to support SB-16A requirements. Field Rel 8.0 in Q4."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MAF MPS Modernization (AMC Transition)"
                                    },
                                    "Description": {
                                        "val": "Efforts include the start and continuation of activities for the modernization of the MAF MPE to include C-5, C-17, C-130s, KC-10, KC-135, and KC-46 platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.562"
                                            },
                                            "Text": {
                                                "val": "Conducted development and test activities of Framework 1.5.300 to support MAF MPS modernization requirements.  Ensured legacy capabilities for various tools are supported in the JMPS program.  Such tools include, but are not limited to, the Drop Zone\/Landing Zone (DZLZ) database manager and Enterprise Administration and Synchronization Environment (EASE)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.183"
                                            },
                                            "Text": {
                                                "val": "Initiate development and integration of Global Mobility JMPS UPC\/MPE releases. Initiate development, integration, and test of the Air Refueling Tool CC. Continue development, integration, and test of the MAF Tools (DZ\/LZ database manager, EASE, etc). Continue development and test activities of Framework 1.5.300 to support MAF MPS modernization requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.485"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.485"
                                            },
                                            "Text": {
                                                "val": "Will deliver C5 and AOC interface JMPS UPC\/MPE. Will also continue development and integration of Global Mobility tankers and Airdrop JMPS UPC\/MPE releases.  Will continue development, integration, and test of the Air Refueling Tool CC.  Will continue development, integration, and test of the MAF Tools. Will continue development and test activities of Framework 1.5.300 to support MAF MPS modernization requirements. Initiate development and integration of Global Mobility JMPS UPC\/MPE Phase II releases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Special Missions ACC Modernization Phase I"
                                    },
                                    "Description": {
                                        "val": "Continues the modernization of previously fielded mission planning software environments for the E-3, E-8, E-4, EC-130, and RC-135."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.144"
                                            },
                                            "Text": {
                                                "val": "Continued development of software for E-3\/E-8, RC-135, and EC-130H to ensure SDC currency and upgrade capabilities based on aircraft platform OFP requirements.  These include the Communication, Navigation, Surveillance\/Air Traffic Management (CNS\/ATM) CC, cockpit upgrades, communication presets, mission\/navigation database format changes, and FPM\/TOLD updates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.405"
                                            },
                                            "Text": {
                                                "val": "Continue development of software for E-3\/E-8, RC-135, and EC-130H to ensure SDC currency and to upgrade capabilities based on aircraft platform OFP requirements.  These include the Communication, Navigation, Surveillance\/Air Traffic Management (CNS\/ATM) CC, cockpit upgrades, communication presets, mission\/navigation database format changes, and FPM\/TOLD updates. These software updates will include compatibility with potential aircraft avionics upgrades and maintain SDC and Windows compliance.  Initiate software development activities for SMACC CSAR Tools effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.215"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.215"
                                            },
                                            "Text": {
                                                "val": "Will continue development of mission planning software to incorporate new platform capabilities into a variety of MAF platforms (e.g. E-3\/E-8, RC-135, and EC-130H).  New capabilities include cockpit upgrades, communications, mission\/navigation database format changes, and FPM\/TOLD updates. Will also include initial development efforts to migrate the MPEs to the most current Windows operating system as well as maintaining SDC compliance.  Initiate software development activities for SMACC CSAR HH-60 and HC-130 efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MAF Automated Flight Planning Service (MAFPS)"
                                    },
                                    "Description": {
                                        "val": "Develops a centralized\/net-centric global mobility flight planning capability, which will provide significant fuel savings through automated flight route, airspeed, and altitude optimization utilizing aircraft performance, air traffic management, weather, and other data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.785"
                                            },
                                            "Text": {
                                                "val": "Release 1 software development.  Will conduct Preliminary Design Review and two (2) Interim Design Reviews.  Will complete two (2) of four (4) Engineering Releases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.987"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.987"
                                            },
                                            "Text": {
                                                "val": "Will complete Release 1 software development.  Contractor will deliver final two (2) Engineering Releases and complete Final Qualification Test.  Government will conduct Developmental Test.  Contractor will begin Release 2 software development.  Contractor will begin Release 2 software development, to include a System Requirements Review and Integrated Baseline Review."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA07: Line Item # 833170"
                                    },
                                    "Title": {
                                        "val": "Mission Planning Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.235"
                                        },
                                        "CurrentYear": {
                                            "val": "5.190"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.249"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.249"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.129"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.358"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.240"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.405"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Mission Planning Systems (MPS) Modernization utilizes an evolutionary acquisition approach to develop and deliver an interoperable, network-centric, mission planning system tailored for numerous Air Force platforms using competition and multiple contract vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Mission Planning Software Development (MPEC II)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "21.375"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "21.744"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "25.493"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "25.493"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "F-16 Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Organic"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.769"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.108"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.807"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.807"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "A-10 Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Organic"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.042"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.380"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "EC-130H Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Organic"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Robins AFB, GA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.290"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.470"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.465"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.465"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.593"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.784"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.862"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.862"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Framework"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Herndon, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.474"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.603"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Common Components"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.444"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.781"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.760"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.760"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SEI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pittsburgh, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.130"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.147"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.149"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.149"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Cost Estimating"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tecolote Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.264"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.314"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.314"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Responsible Test Organization (RTO)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "46TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.329"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.856"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.474"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.474"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.659"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Certification and Accreditation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Indian Head, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.088"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.109"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.110"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.110"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.307"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Type I Training"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Ogden Air Logistics Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill AFB, UT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.230"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.509"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.816"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.816"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.555"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Field Representative Hardware"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.747"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.916"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.167"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.167"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.830"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering and Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.662"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.017"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.089"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.089"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.891"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.749"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.201"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.201"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_675380_0.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0208006F_BPAC_675380_1.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "F-15 v3.2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15 v4.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-15 v5.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 30 SCU 8 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 30 SCU 9 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 40\/50 M6.5 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-16 Blk 40\/50 M7.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "F-22 v13.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "A-10 Suite 8 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 7 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 8 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 9 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B-1 Release 10 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMC Modernization C-5 AMP Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMC Modernization Tankers Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMC Modernization Airdrop Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMACC E-3 \/ E-8 Release 2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMACC EC-130H Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMACC E-3 \/ E-8 Release 3 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMACC RC-135 Release 3 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMACC E-3 \/ E-8 Release 3.1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMACC EC-130H Release 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMACC CSAR Tools CC Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMACC HH-60 Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMACC CSAR Tools CC Release 1 Fielding (1)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMACC E-8 Release 4.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMACC E-3 Release 4.0 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MAFPS Release 1 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MAFPS Release 2 Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Program Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}