{
    "id": "1f7a83ee9d35d0a42dafb0add196a0acfc9591aa",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V2_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604441F"
        },
        "ProgramElementTitle": {
            "val": "Space Based Infrared System (SBIRS) High EMD"
        },
        "R1LineNumber": {
            "val": "68"
        },
        "MdapCode": {
            "val": "210"
        },
        "PriorYearsDelta": {
            "val": "39.831"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "8968.993"
            },
            "PriorYear": {
                "val": "486.647"
            },
            "CurrentYear": {
                "val": "322.399"
            },
            "BudgetYearOne": {
                "val": "319.501"
            },
            "BudgetYearOneBase": {
                "val": "319.501"
            },
            "BudgetYearTwo": {
                "val": "274.826"
            },
            "BudgetYearThree": {
                "val": "200.357"
            },
            "BudgetYearFour": {
                "val": "483.856"
            },
            "BudgetYearFive": {
                "val": "613.999"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Prior Years: Total Program Element above includes $39.831M for BPAC 65A040 Commercially Hosted Payload funded in FY11 and FY12.\nMDAP PNO 210 includes only BPAC 653616 SBIRS High EMD."
        },
        "ProgramElementMissionDescription": {
            "val": "The SBIRS RDT&E FY15 budget justification exhibits describe three elements of the SBIRS program: 1) the SBIRS Engineering and Manufacturing Developement (EMD) program of record PNO 210 MDAP, 2) the Space Modernization Initiative (SMI) (non-MDAP) and the 3) Evolved SBIRS follow-on (non-MDAP).\n\n1. SBIRS EMD:  The Space-Based Infrared Systems (SBIRS) primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS will enhance detection and improve reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. SBIRS supports Missile Defense, Battlespace Awareness, and Technical Intelligence missions by providing reliable, accurate, and timely data to Unified Combatant Commanders, Joint Task Force (JTF) Commanders, the intelligence community, and other users. SBIRS provides increased detection and tracking performance in order to meet requirements in Air Force Space Command's Operational Requirements Document. The SBIRS system includes both space and ground elements. The space segment consists of Geosynchronous Earth Orbit (GEO) satellites, payloads hosted on satellites in Highly Elliptical Orbit (HEO), and Defense Support Program (DSP) satellites. The ground segment consists of both fixed and mobile data processing elements, communications infrastructure, and relay ground stations serving all SBIRS space elements. The HEO-1 and HEO-2 payloads are on-orbit and certified for Integrated Tactical Warning\/Attack Assessment (ITW\/AA) missile warning operations and technical intelligence operations. The GEO-1 and GEO-2 satellites have completed AFSPC and USSTRATCOM operational acceptance.  GEO-1 received ITW\/AA certification in August 2013  The GEO-2 satellite received ITW\/AA certification in December 2013. Ground segment development continues through FY18.  The baseline requirement document is the 1996 SBIRS ORD.\n\n2. SMI: Future SBIRS Overhead Persistent Infrared (OPIR) satellites will be procured using the Department of Defense (DOD) Efficient Space Procurement (ESP) concept. ESP is an approach which seeks stable production and efficient sub-contractor product management through the block buy of two space vehicles at one time (please see SBIRS P-40 Exhibit). A portion of the savings realized from ESP block buys are programmed for investment into OPIR Space Modernization Initiative (SMI); the current OPIR SMI project was established in this manner in the FY12 President's Budget. The primary objective of SMI is to enable and inform future decisions to maintain and evolve a capable, resilient, and affordable OPIR architecture, by maturing technologies and mitigating risk areas to facilitate OPIR modernization to be executed within the Department's constrained resources.  SMI supports the Program of Record by assessing future parts and material obsolescence and future affordability and capability design modifications.  SMI funds engineering activities to reduce future system and production costs through manufacturing and producibility enhancements and through technology insertion. SMI will also mature potential technology upgrades at the component and system level for future space and ground architecture affordability and capability enhancements. The SBIRS OPIR SMI plan includes studies and risk reduction activities to evolve the current Program of Record SBIRS GEO satellites, reduce production schedules, and reduce system costs. SMI funded data exploitation efforts include OPIR mission data processing, data fusion, data publication, algorithm development, network connectivity, and sensor performance assessments. The data exploitation efforts will identify affordable, responsive, and resilient measures to improve battlespace awareness data dissemination to the warfighter. SMI Architecture and Component Study efforts will assess future architecture alternatives for viability, affordability, capability and resilience. The SMI Hosted Payloads and Wide Field of View Testbeds efforts will explore technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture.\n\n3. Evolved SBIRS Follow-on: Knowledge gained from the SBIRS SMI projects will inform a future Defense Acquisition Board(DAB)decision for the Evolved SBIRS effort.  DAB alternatives are expected to include 1) continued production of SBIRS PoR design; 2) an evolved satellite and ground system derived from the SBIRS POR designs; 3) an evolved satellite and ground system that includes a combination of PoR derivatives and new systems; or 4)a disaggregated OPIR system.  The Evolved SBIRS effort will implement the DAB directed program alternative begining with FY18 funding.  The Evolved SBIRS efforts will also include the initial HEO 5-6 development anticipate to begin in FY19.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "448.594"
                },
                "CurrentYear": {
                    "val": "352.532"
                },
                "BudgetYearOne": {
                    "val": "279.888"
                },
                "BudgetYearOneBase": {
                    "val": "279.888"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "486.647"
                },
                "CurrentYear": {
                    "val": "322.399"
                },
                "BudgetYearOne": {
                    "val": "319.501"
                },
                "BudgetYearOneBase": {
                    "val": "319.501"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "38.053"
                },
                "CurrentYear": {
                    "val": "-30.133"
                },
                "BudgetYearOne": {
                    "val": "39.613"
                },
                "BudgetYearOneBase": {
                    "val": "39.613"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.702"
                    },
                    "CurrentYear": {
                        "val": "-29.700"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-15.000"
                    },
                    "CurrentYear": {
                        "val": "-0.433"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "98.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-44.245"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "39.613"
                                },
                                "BudgetYearOneBase": {
                                    "val": "39.613"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY13: \nCongressional Directed Reductions: -$5.0M SBIRS SMI architecture studies, -$10.0M SBIRS evolution\n\nOther Adjustments: -$44.245M sequestration reduction (base).\n\n(Note: The Congressional Adds total of $98.000M above is comprised of: +$40.000M SBIRS ground expansion for HEO C2, +$40.000M SBIRS ground starer\/scanner integration acceleration, +$18.000M program increase Space Modernization Initiative)\n\nFY14:\nCongressional Directed Reductions: -$29.7M modernization projects execution\ndelays excluding exploitation efforts\n\nFY15:\nOther Adjustments: +$43.6M funded EMD ground shortfall, less -$2.881M EMD and -$1.106M SMI inflation adjustments"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "653616"
                    },
                    "ProjectTitle": {
                        "val": "SBIRS High Element EMD"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8929.162"
                        },
                        "PriorYear": {
                            "val": "407.979"
                        },
                        "CurrentYear": {
                            "val": "266.975"
                        },
                        "BudgetYearOne": {
                            "val": "230.893"
                        },
                        "BudgetYearOneBase": {
                            "val": "230.893"
                        },
                        "BudgetYearTwo": {
                            "val": "185.541"
                        },
                        "BudgetYearThree": {
                            "val": "110.848"
                        },
                        "BudgetYearFour": {
                            "val": "97.177"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10228.575"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "4"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Quantity of RDT&E articles above reflect delivery of GEO-1 in FY11 and GEO-2 in FY12.  Both were developed under this project."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Space-Based Infrared Systems (SBIRS) primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS will enhance detection and improve reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. SBIRS supports Missile Defense, Battlespace Awareness, and Technical Intelligence missions by providing reliable, accurate, and timely data to Unified Combatant Commanders, Joint Task Force (JTF) Commanders, the intelligence community, and other users. SBIRS provides increased detection and tracking performance in order to meet requirements in Air Force Space Command's Operational Requirements Document. The SBIRS system includes both space and ground elements. The space segment consists of Geosynchronous Earth Orbit (GEO) satellites, payloads hosted on satellites in Highly Elliptical Orbit (HEO), and Defense Support Program (DSP) satellites. The ground segment consists of both fixed and mobile data processing elements, communications infrastructure, and relay ground stations serving all SBIRS space elements. The HEO-1 and HEO-2 payloads are on-orbit and certified for Integrated Tactical Warning\/Attack Assessment (ITW\/AA) missile warning operations and technical intelligence operations. The GEO-1 and GEO-2 satellites have completed AFSPC and USSTRATCOM operational acceptance.  GEO-1 received ITW\/AA certification in August 2013. The GEO-2 satellite received ITW\/AA certification in December 2013. Ground segment development continues through FY18. Enterprise systems engineering and integration (SE&I) provides intra- and inter-program requirements development, enterprise master planning, validation and verification, specialty engineering, and architecture developement."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Starer Acceleration ($40.000M add less $7.154 CGR\/Sequestration)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "32.846"
                                        },
                                        "Text": {
                                            "val": "Accelerates development of ground processing of the GEO starer sensor in the program of record ground system."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HEO Command and Control Ground Expansion"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "40.000"
                                        },
                                        "Text": {
                                            "val": "The $40 million for SBIRS Ground Expansion for HEO C2 will be used to increase the system capabilities to support HEO-4 Launch and Early On orbit Test (LEOT) and support HEO 3\/4 State of Health monitoring prior to transition to operations and the Ground tuning required to enable the transition into operations."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIRS EMD"
                                    },
                                    "Description": {
                                        "val": "Continued EMD contracts for Space and Ground segment development, concept studies\/activities for obsolescence issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "335.133"
                                            },
                                            "Text": {
                                                "val": "Continued GEO development. Completed GEO-1 operational user evaluation and certification. Accelerated starer tuning and infrastructure improvements to make starer data available to battlespace awareness and technical intelligence users. Launched GEO-2 in March 2013, completed early orbit testing, and began accelerated Developmental Test & Evaluation.  Continued Ground System Development (continued Block 10 and began Block 20), System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/Exploitation\/ground integration activities, Combined Task Force (CTF) support activities, systems integration and test studies. Continued Program Office and related support activities (to include SETA), technical analysis and independent verification and validation of Contractor. Continued enterprise SE&I."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "266.975"
                                            },
                                            "Text": {
                                                "val": "Complete the first three (of four) Block 10 system deliveries.  Complete development and delivery of the Block 10 Standard Space Trainer to support 460 OG training.  Complete development and delivery of the Block 10 Launch and Anomaly Resolution Center to support SBIRS GEO-3 system test.  Complete development of Ground mission processing risk reduction build, which includes starer processing for non-ITW\/AA users. Complete GEO-2 operational user evaluation and certification. Continue Ground System Development (Block 10  and Block 20), System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/ Exploitation\/ground integration activities, CTF support activities, systems integration and test studies. Continue Program Office and related support activities, technical analysis and independent verification and validation of Contractor. Continue enterprise SE&I."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "230.893"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "230.893"
                                            },
                                            "Text": {
                                                "val": "Continue Ground System Development (Block 10) and begin Block 10 Operational Utility Evaluation.  Continue Block 20 Ground System Development, System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/ Exploitation\/ground integration activities, CTF support activities, systems integration and test studies. Continue Program Office and related support activities, technical analysis and independent verification and validation of Contractor. Continue enterprise SE&I."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: Line Item # 836720"
                                    },
                                    "Title": {
                                        "val": "Space Based Ir Sensor Pgm Space"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "39.582"
                                        },
                                        "CurrentYear": {
                                            "val": "25.408"
                                        },
                                        "BudgetYearOne": {
                                            "val": "26.100"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "26.100"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.683"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.663"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.799"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.939"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MPAF: BA05: Line Item # MSSBIR"
                                    },
                                    "Title": {
                                        "val": "SBIR High (Space)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "392.271"
                                        },
                                        "CurrentYear": {
                                            "val": "524.587"
                                        },
                                        "BudgetYearOne": {
                                            "val": "450.884"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "450.884"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "434.162"
                                        },
                                        "BudgetYearThree": {
                                            "val": "384.134"
                                        },
                                        "BudgetYearFour": {
                                            "val": "984.178"
                                        },
                                        "BudgetYearFive": {
                                            "val": "100.074"
                                        },
                                        "CostToComplete": {
                                            "val": "220.174"
                                        },
                                        "TotalCost": {
                                            "val": "7433.600"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The pre-SDD SBIRS contracts were competed in full and open competition.  Two contracts were awarded to Lockheed\/Loral\/Aerojet and Hughes\/TRW in 1995 for the pre-SDD phase.  A single contract was awarded to Lockheed Martin in 1996 for the SDD phase.  This contract is still ongoing and will incrementally deliver the ground segment through FY18.  Production contracts are discussed in the procurement budget exhibits."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "SBIRS EMD includes SBIRS EMD prime contract with Lockheed Martin, Program\/Mission Support and Host SPO efforts. Award dates represent date of first award of the funds for that fiscal year."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Pre-EMD (LMMS & Hughes)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Hughes Aircraft Company"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "159.600"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "159.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "159.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIRS EMD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Prime: Lockheed Martin Sunnyvale, CA; Sub: Northrop Grumman, Azusa, CA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8040.774"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "317.415"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "231.130"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "200.203"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "200.203"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "316.958"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9106.480"
                                                    },
                                                    "TargetValue": {
                                                        "val": "9106.480"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise Systems Engineering and Integration (SE&I)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "The Analytical Sciences Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Andover, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "33.999"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.682"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.206"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.194"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.194"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "14.494"
                                                    },
                                                    "TotalCost": {
                                                        "val": "68.575"
                                                    },
                                                    "TargetValue": {
                                                        "val": "68.575"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIRS Pre-SDD Contract Adjustment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.780"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.780"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.780"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.600"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Phenomenology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.350"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.350"
                                                    },
                                                    "TargetValue": {
                                                        "val": "17.350"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sensor Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sandia National Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Albuquerque, NM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "10.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HEO Command & Control (C2) Ground Expansion"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "40.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "40.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "40.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Award dates represent date of first award of the fiscal year."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "WFOV Testbed Concept Study"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Millennium Space Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Torrance, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Various Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.538"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.538"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.538"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Support (FFRDC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "407.721"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "21.281"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.702"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.133"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.133"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "32.940"
                                                    },
                                                    "TotalCost": {
                                                        "val": "487.777"
                                                    },
                                                    "TargetValue": {
                                                        "val": "487.777"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMC Admin Support (PMA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Quantech Services, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.866"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.161"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.819"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.824"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.824"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.200"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.870"
                                                    },
                                                    "TargetValue": {
                                                        "val": "14.870"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMC Technical Support (PMA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Scitor Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "67.014"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.336"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.758"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.721"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.721"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "7.785"
                                                    },
                                                    "TotalCost": {
                                                        "val": "87.614"
                                                    },
                                                    "TargetValue": {
                                                        "val": "87.614"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMC Financial Support (PMA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tecolote, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Goleta, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.930"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.448"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.034"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.998"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.998"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.692"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.102"
                                                    },
                                                    "TargetValue": {
                                                        "val": "23.102"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Various Management Support Services (PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "131.990"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "12.656"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.326"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.820"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.820"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "16.497"
                                                    },
                                                    "TotalCost": {
                                                        "val": "177.289"
                                                    },
                                                    "TargetValue": {
                                                        "val": "177.289"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604441F_BPAC_653616_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Mission Control Station (MCS) Fit Up"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GEO-1 Message Certification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GEO-2 Early Orbit Testing (EOT)\/Tuning\/Certification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Back-up Mission Control Station (MCSB) Fit Up"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Integration & Test at MCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Integration & Test at MCSB"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MCS Launch and Anomaly Resolution Center (LARC) ready for GEO-3 launch and early on-orbit System Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B10.3 Completed and ITW\/AA Certified"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B20 Completed and ITW\/AA Certified"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "657009"
                    },
                    "ProjectTitle": {
                        "val": "Space Modernization Initiative"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "78.668"
                        },
                        "CurrentYear": {
                            "val": "55.424"
                        },
                        "BudgetYearOne": {
                            "val": "88.608"
                        },
                        "BudgetYearOneBase": {
                            "val": "88.608"
                        },
                        "BudgetYearTwo": {
                            "val": "89.285"
                        },
                        "BudgetYearThree": {
                            "val": "89.509"
                        },
                        "BudgetYearFour": {
                            "val": "89.197"
                        },
                        "BudgetYearFive": {
                            "val": "90.894"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Future SBIRS Overhead Persistent Infrared (OPIR) satellites will be procured using the Department of Defense (DOD) Efficient Space Procurement (ESP) concept. ESP is an approach which seeks stable production and efficient sub-contractor product management through the block buy of two space vehicles at one time (please see SBIRS P-40 Exhibit). A portion of the savings realized from ESP block buys are programmed for investment into OPIR Space Modernization Initiative (SMI); the current OPIR SMI project was established in this manner in the FY12 President's Budget. The primary objective of SMI is to enable and inform future decisions to maintain and evolve a capable, resilient, and affordable OPIR architecture, by maturing technologies and mitigating risk areas to facilitate OPIR modernization to be executed within the Department's constrained resources.  SMI supports the Program of Record by assessing future parts and material obsolescence and future affordability and capability design modifications.  SMI funds engineering activities to reduce future system and production costs through manufacturing and producibility enhancements and through technology insertion. SMI will also mature potential technology upgrades at the component and system level for future space and ground architecture affordability and capability enhancements. The SBIRS OPIR SMI plan includes studies and risk reduction activities to evolve the current Program of Record SBIRS GEO satellites, reduce production schedules, and reduce system costs. SMI funded data exploitation efforts include OPIR mission data processing, data fusion, data publication, algorithm development, network connectivity, and sensor performance assessments. The data exploitation efforts will identify affordable, responsive, and resilient measures to improve battlespace awareness data dissemination to the warfighter. SMI Architecture and Component Study efforts will assess future architecture alternatives for viability, affordability, capability and resilience. The SMI Hosted Payloads and Wide Field of View Testbeds efforts will explore technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "SMI Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "18.000"
                                        },
                                        "Text": {
                                            "val": "This Congressional Add was incorporated into Hosted Payloads.  Please refer to the Hosted Payloads FY13 Accomplishments above for content."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Evolved SBIRS"
                                    },
                                    "Description": {
                                        "val": "Assess obsolescence, affordability, capability design modifications, and SBIRS Follow-on Analysis of Alternatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.110"
                                            },
                                            "Text": {
                                                "val": "Initiate and complete design trade studies with the incumbent SBIRS contractor to 1) identify obsolescence issues and corresponding hardware\/software design modifications to mitigate future spacecraft\/payload production risks; 2) identify payload and spacecraft modifications to improve affordability of the current satellite; and 3) identify design modifications required to segregate the scanning and staring payload hardware, software, and functionality to enable evolution of the Program of Record SBIRS satellite.  Initiate SBIRS Follow-on Analysis of Alternatives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.597"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.597"
                                            },
                                            "Text": {
                                                "val": "Initiate detailed design studies and hardware\/software risk reduction efforts (e.g., brassboards\/breadboards\/engineering model testing) to implement approved recommendations from FY14 design trade studies.  Continue SBIRS Follow-on Analysis of Alternatives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Exploitation"
                                    },
                                    "Description": {
                                        "val": "Exploit existing OPIR data (Defense Support Program (DSP), SBIRS, Commercially Hosted InfraRed Payload (CHIRP), other classified sources) through data processing, data publication, algorithm development, network connectivity and sensor performance assessments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.867"
                                            },
                                            "Text": {
                                                "val": "Extended data collection and analysis from the on-orbit CHIRP payload throughout the entire FY 13.  Provided near real-time weather alerts over data-sparse Areas of Interest (AOI) in support of Air Force Weather Agency (AFWA) and CENTCOM.  Provided second wide band connection to Spacecraft Payloads Orbital Test Station (SPOTS) in support upgrades to Space Awareness and Global Exploitation (SAGE).  Continued development and testing of WVOF detection algorithms. Provided enhanced ground segment capabilities for command and control, data collection, mission processing, and data dissemination.  Provided post mission analysis of OPIR events using SAGE to process multiple OPIR sensors (DSP, SBIRS, CHIRP, other classified sources).  Provided Wide Field of View starer data and demonstrated ability to aid in the detection of forest fires."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.754"
                                            },
                                            "Text": {
                                                "val": "Continue to provide enhanced ground segment capabilities for command and control, data collection, mission processing, and data dissemination. Continue development, testing, and maturation of WFOV detection algorithms.  Initiate development of an open architecture ground processing capability for WFOV sensors to evolve the current SBIRS Program of Record ground system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.159"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.159"
                                            },
                                            "Text": {
                                                "val": "Continue to provide enhanced ground segment capability for command and control, data collection, mission processing, and data dissemination.  Continue development, testing, and maturation of WFOV detection algorithms.  Continue development of an open architecture ground processing capability for WFOV sensors to support future evolution of the current SBIRS Program of Record ground system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hosted Payloads"
                                    },
                                    "Description": {
                                        "val": "Explore Wide Field of View (WFOV) payload technology maturation, qualification of new components, and subsystem\/component prototyping to evolve SBIRS and the OPIR architecture."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.139"
                                            },
                                            "Text": {
                                                "val": "Awarded six contracts for Tactical WFOV Payload development to include Preliminary Design Review (PDR).   Initiated new 4Kx4K Sensor Chip space qualification.  Initiated WFOV payload test and calibration planning activities. Note: FY13 funding includes $7.139M plus the $18.000M Congressional Add below for a total of $25.139M."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.252"
                                            },
                                            "Text": {
                                                "val": "Continue development of Tactical WFOV Payload.  Award new contract for single payload vendor to complete payload development and build prototype sensor for operational flight demonstration (launch in Dec 2016). Complete payload Critical Design Review (CDR) and order long lead parts\/materials.  Complete Sensor Chip qualification tests and determine feasibility for use on the flight demo.  Initiate Strategic on-board processing demonstration to support Strategic WFOV payload on-board exceedance generation requirements. Continue WFOV payload test planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.612"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.612"
                                            },
                                            "Text": {
                                                "val": "Continue development of Tactical WFOV Payload.  Continue Strategic on-board processing demonstration and initiate Strategic WFOV payload development.  Continue WFOV payload test planning."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WFOV Testbeds"
                                    },
                                    "Description": {
                                        "val": "Explore spacecraft technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture.  Explore international, commercial, or other rideshare opportunities for an on-orbit WFOV payload demonstration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.400"
                                            },
                                            "Text": {
                                                "val": "Completed concept and design trade studies for a small GEO spacecraft.  Initiated design and build phase of the spacecraft to support the Tactical WFOV Payload on-orbit demonstration.  Completed spacecraft PDR."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Continue development of spacecraft for the Tactical WFOV Payload.  Complete CDR and order long lead parts\/materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.747"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.747"
                                            },
                                            "Text": {
                                                "val": "Continue development of spacecraft for the Tactical WFOV payload.  Integrate and test spacecraft subsystems and components.  Initiate launch vehicle integration planning for December 2016 launch.  Initiate Host-Payload Office studies to evaluate Government, international, and commercial rideshare opportunities for the Alternative WFOV Strategic Payload on-orbit demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Description": {
                                        "val": "Conduct System Engineering and Program Management to include Program Office support such as Federally Funded Research and Development Center (FFRDC) analyses and System Engineering Technical Assistance (SETA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.262"
                                            },
                                            "Text": {
                                                "val": "Funded Program Office support for SMI projects"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.808"
                                            },
                                            "Text": {
                                                "val": "Provide Program Office support for all SMI projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.493"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.493"
                                            },
                                            "Text": {
                                                "val": "Provide Program Office support for SMI projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA05: PE 0604441F"
                                    },
                                    "Title": {
                                        "val": "Evolved SBIRS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "297.482"
                                        },
                                        "BudgetYearFive": {
                                            "val": "523.105"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program office will use a variety acquisition approaches to execute various concept studies, technology maturation efforts, testbed\/prototype demonstrations, and data exploitation initiatives and projects.  The program office will collaborate with appropriate contracting agencies to support each individual effort. Activities such as SBIRS GEO obsolescence and affordability enhancements to the existing satellite design will leverage existing Program of Record contracts. Technology maturation and component prototyping and\/or qualification could leverage existing contracts, but where practical could be competed.  New technology, replacement components and system designs will be acquired with government data rights to a maximum extent to allow their incorporation into any future OPIR satellite production or system development. Contracting partnerships with other agencies will also be used to study, develop and demonstrate and prove emerging capabilities.  FFRDC and SETA contractors will also be used to conduct and support studies."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Each Cost Category Item with \"TBD\" or \"Various\" annotated contains several contract elements with some contracts still TBD.\nUnder Hosted Payload the BAA Contractors are Ball, L3, Northrop Grumman, Raytheon, SAIC, and Lockheed Martin."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Evolved SBIRS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.110"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.597"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.597"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Exploitation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Americom Government Services Mclean VA; Northrop Grumman Boulder, CO; Others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "20.867"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "19.754"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "23.159"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "23.159"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hosted Payloads"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "25.139"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "23.252"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "21.612"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "21.612"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "WFOV Testbeds"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Millenium Space Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Torrance, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "29.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "29.747"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "29.747"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Various Management Support Services (PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.262"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.808"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.493"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.493"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604441F_BPAC_657009_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "WFOV Testbeds"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Hosted Payloads"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OPIR Data Exploitation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "657106"
                    },
                    "ProjectTitle": {
                        "val": "EVOLVED SBIRS"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "297.482"
                        },
                        "BudgetYearFive": {
                            "val": "523.105"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Knowledge gained from the SBIRS SMI projects will inform a future Defense Acquisition Board (DAB) decision for the Evolved SBIRS effort.  DAB alternatives are expected to include 1) continued production of SBIRS PoR design; 2) an evolved satellite and ground system derived from the SBIRS POR designs; 3) an evolved satellite and ground system that includes a combination of PoR derivatives and new systems; or 4) a disaggregated OPIR system.  The Evolved SBIRS effort will implement the DAB directed program alternative begining with FY18 funding.  The Evolved SBIRS efforts will also include the initial HEO 5-6 development (anticipate to begin in FY19).\n\nThe \"cost to complete\" and \"total cost\" fields above will be populated after completion of the formal cost estimate in support of the DAB decision."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Evolved SBIRS"
                                    },
                                    "Description": {
                                        "val": "Development effort for the Evolved SBIRS space and ground systems. Initial development program is expected to be for a new or derivative follow-on system(s) for the SBIRS GEO and HEO systems. Evolved SBIRS will also include development of ground system modifications to accommodate evolved SBIRS satellite design changes for GEO and HEO."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A, Evolved SBIRS funding starts in FY18."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A, Evolved SBIRS funding starts in FY18."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A, Evolved SBIRS funding starts in FY18."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA05: PE 0604441F"
                                    },
                                    "Title": {
                                        "val": "Space Modernization Initiative"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "78.668"
                                        },
                                        "CurrentYear": {
                                            "val": "55.424"
                                        },
                                        "BudgetYearOne": {
                                            "val": "88.608"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "88.608"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "89.285"
                                        },
                                        "BudgetYearThree": {
                                            "val": "89.509"
                                        },
                                        "BudgetYearFour": {
                                            "val": "89.197"
                                        },
                                        "BudgetYearFive": {
                                            "val": "90.894"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "TBD until Milestone Decision in the FY16-17 timeframe."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Evolved SBIRS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": ","
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management and Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604441F_BPAC_657106_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Evolved SBIRS GEO Development\/Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SBIRS Ground Block 30 Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Evolved SBIRS HEO Development\/Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}