{
    "id": "27e8e54f27e2c7f73fd4086cda80fd91aa8c0c3a",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605790D8Z"
        },
        "ProgramElementTitle": {
            "val": "Small Business Innovation Research (SBIR)\/Small Business Technology Transfer (STTR)"
        },
        "R1LineNumber": {
            "val": "159"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "1.911"
            },
            "PriorYear": {
                "val": "1.344"
            },
            "CurrentYear": {
                "val": "1.857"
            },
            "BudgetYearOne": {
                "val": "1.634"
            },
            "BudgetYearOneBase": {
                "val": "1.634"
            },
            "BudgetYearTwo": {
                "val": "2.183"
            },
            "BudgetYearThree": {
                "val": "2.276"
            },
            "BudgetYearFour": {
                "val": "2.416"
            },
            "BudgetYearFive": {
                "val": "2.611"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "(U) This Program Element (PE) provides funding for the administration of the Department of Defense (DoD) Small Business Innovation Research (SBIR) Program and the Small Business Technology Transfer (STTR) Program.  The SBIR\/STTR Program funds over one billion dollars annually in mission oriented research and development projects via small technology companies. The purpose of the program is to stimulate technological innovation, increase private sector commercialization of Federal R&D, increase small business participation in Federally funded R&D, foster participation by minority and disadvantaged firms in technological innovation, and foster cooperative research & technology transfer between small business and research institutions. The SBIR\/STTR Program is codified in 15 USC 638. The SBIR\/STTR Program competitively funds scientific and technical innovation to specifically address the needs of participating DoD components.\n\n(U) DoD components participating in the SBIR Program include the: Army, Navy, Air Force, Defense Advanced Research Projects Agency (DARPA), Missile Defense Agency (MDA), Defense Threat Reduction Agency (DTRA), U.S. Special Operations Command (SOCOM), Joint Science & Technology Office for Chemical & Biological Defense (CBD), National Geospatial-Intelligence Agency (NGA), the Defense Logistics Agency (DLA), the Defense Microelectronics Activity (DMEA), the Defense Health Program (DHP) and the Office of Secretary of Defense (OSD) through the Assistant Secretary of Defense for Research & Engineering. DoD components participating in the STTR Program include the: Army, Navy, Air Force, DARPA, MDA, and OSD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.857"
                },
                "CurrentYear": {
                    "val": "1.868"
                },
                "BudgetYearOne": {
                    "val": "1.907"
                },
                "BudgetYearOneBase": {
                    "val": "1.907"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.344"
                },
                "CurrentYear": {
                    "val": "1.857"
                },
                "BudgetYearOne": {
                    "val": "1.634"
                },
                "BudgetYearOneBase": {
                    "val": "1.634"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.513"
                },
                "CurrentYear": {
                    "val": "-0.011"
                },
                "BudgetYearOne": {
                    "val": "-0.273"
                },
                "BudgetYearOneBase": {
                    "val": "-0.273"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.513"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.011"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Efficiency Reduction Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.273"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.273"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P518"
                    },
                    "ProjectTitle": {
                        "val": "SBIR\/Challenge Admin"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1.911"
                        },
                        "PriorYear": {
                            "val": "1.344"
                        },
                        "CurrentYear": {
                            "val": "1.857"
                        },
                        "BudgetYearOne": {
                            "val": "1.634"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.634"
                        },
                        "BudgetYearTwo": {
                            "val": "2.183"
                        },
                        "BudgetYearThree": {
                            "val": "2.276"
                        },
                        "BudgetYearFour": {
                            "val": "2.416"
                        },
                        "BudgetYearFive": {
                            "val": "2.611"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "(U) The SBIR\/STTR Program is executed in three phases. The purpose of Phase I is to determine, insofar as possible, the scientific technical and commercial merit, and feasibility of ideas submitted under the SBIR\/STTR Program. Phase II awards are made to firms that have been awarded a Phase I contract on the basis of the results of their Phase I effort and the scientific, technical, and commercial merit of the Phase II proposal. Phase II is the principal research or research and development effort and is expected to produce a well-defined deliverable prototype. Phase III SBIR\/STTR efforts derive from, extend or conclude Phase I or Phase II efforts, and are not funded with SBIR\/STTR funds. Under Phase III, companies participating in the SBIR\/STTR Program are expected to obtain funding from the private sector and\/or non-SBIR\/STTR government sources to develop the prototype into a viable product or non-R&D service for sale in military and\/or private sector markets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIR\/Challenge Admin"
                                    },
                                    "Description": {
                                        "val": "(U) Program element (PE) 0605790D8Z is the only source of funds for the coordination, administration and execution of the Department's SBIR\/STTR Programs. The DoD Office of Small Business Programs is tasked with providing Departmental SBIR\/STTR policy guidance, oversight and implementation and therefore requires program element (PE) 0605790D8Z to fund these administrative activities. In addition to funding costs for program administration, coordination and execution, PE 0605790D8Z funds essential elements of the SBIR\/STTR Program that are required by law including: \n(1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs including the development of technical topics, preparation of SBIR\/STTR R&D solicitations and receipt of proposal responses; \n(2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle including the development and maintenance of information systems and software required for the measurement, evaluation, and effective management of the Department's SBIR\/STTR Programs; \n(3) Implement an aggressive outreach program including the execution of two National conferences and outreach to small technology companies, potential investors in such companies, SDBs WOSBs, Institutions of Higher Learning and others, to facilitate participation in the SBIR\/STTR Programs; \n(4) Coordinate oversight, collect results, track execution and provide reporting of Phase II technology transition in the DoD SBIR Commercialization Pilot  and Commercialization Readiness Program (CPP\/CRP); and \n(5) Prepare all reports mandated by law and policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.344"
                                            },
                                            "Text": {
                                                "val": "(U) FY 2013 plan included program administration, coordination and execution of the DoD SBIR\/STTR Program.  Specifically, managed the execution of the FY 2013 DoD SBIR\/STTR budget between 13 DoD Components to include:\n(1) Coordinated and executed the administrative portions of the DoD SBIR\/STTR Programs including the development of technical topics, preparation of SBIR\/STTR R&D solicitations, and receipt of proposal responses; \n(2) Revised the SBIR\/STTR Topic Review process which enabled the Military Services to directly approve their respective topics;\n(3) Maintained and modified automated processes across the entire SBIR\/STTR lifecycle including the development and maintenance of information systems and software required for the measurement, evaluation, and effective management of the Departments’ SBIR\/STTR Programs;\n(4) Developed a comprehensive DoD SBIR\/STTR Programs Outreach Guide that identifies strategies and tactics to achieve outreach goals and the objectives set forth by the Department and the SBIR\/STTR Reauthorization Act of 2011;\n(5) Reduced outreach costs and expanded target audience by leveraging social media platforms and webinars to conduct outreach to small businesses;\n(6) Established the DoD SBIR Commercialization Working Group (CWG) to promote best practices for meeting legislative requirements and optimizing the standard processes for transitioning SBIR\/STTR developed technologies within the Federal government or commercial markets;\n(7) Coordinated oversight, collected results, tracked execution and provided reporting of Phase II technology transition in DoD Commercialization Readiness Program (CRP); and\n(8) Prepared all reports mandated by law and policy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.857"
                                            },
                                            "Text": {
                                                "val": "(U) FY 2014 plan includes program administration, coordination and execution of the DoD SBIR\/STTR Program.  Specifically, manage the execution of the FY 2014 DoD SBIR\/STTR budget between 13 DoD Components to include:\n(1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs including the development of technical topics, preparation of SBIR\/STTR R&D solicitations and receipt of proposal responses; \n(2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle including the development and maintenance of information systems and software required for the measurement, evaluation, and effective management of the Department's SBIR\/STTR Programs; \n(3) Improving and implementing an outreach program including the execution of two national level conferences and increased outreach to small technology companies, potential investors in such companies, SDBs, WOSBs, institutions of higher learning and others, to facilitate participation in the SBIR\/STTR Programs\n(4) Build on the success of the DoD SBIR Commercialization Working Group (CWG) to promote best practices for meeting legislative requirements and optimizing the standard processes for SBIR\/STTR outreach activities through the development of an DoD SBIR\/STTR Program Outreach Working Group (OWG) to increase the outreach efforts to small business, research organizations, acquisition personnel, and prime contractors;\n(5) Coordinate oversight, collect results, track execution and provide reporting of Phase II technology transition in DoD Commercialization Readiness Program (CRP); and\n(6) Prepare all reports mandated by law and policy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.634"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.634"
                                            },
                                            "Text": {
                                                "val": "(U) FY 2015 plan includes program administration, coordination, and execution of the SBIR\/STTR Program.  Specifically, provide policy guidance and oversight regarding execution of the FY 2015 DoD SBIR\/STTR budget between 13 Components to include:\n(1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs including the development of technical topics, preparation of SBIR\/STTR R&D solicitations, and receipt of proposal responses;\n(2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle including the development and maintenance of information systems and software required for the measurement, evaluation, and effective management of the Departments’ SBIR\/STTR Programs;\n(3) Improve and implement an outreach program to increase interest and facilitate participation of small technology companies, potential investors in such companies, research organizations, acquisition personnel, prime contractors and others in the SBIR\/STTR Programs\n(4) Leverage DoD SBIR\/STTR Commercialization and Outreach Working Groups to promote best practices for meeting legislative requirements and optimizing standard processes for improving SBIR\/STTR technology transition and outreach activities;\n(4) Coordinate oversight, collect results, track execution and provide reporting of Phase II technology transition in DoD Commercialization Readiness Program (CRP); and\n(5) Prepare all reports mandated by law and policy."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "(U) Performance is in support of the administration of the program and compliance with statutory requirements.  \n\n(U) For PE 0605790D8Z, management and administration of the DoD SBIR\/STTR Programs, the following measures have been established to meet requirements as mandated by law:  1) Coordinate and execute the administrative portions of the DoD SBIR\/STTR Programs, especically the creation of the five solicitions; 2) Maintain and modify automated processes across the entire SBIR\/STTR lifecycle; 3) Develop and conduct an aggressive outreach program, especially the planning and execution of one government training workshop and one small business conference; 4) Coordinate oversight, collect results, track execution and provide reporting of Phase III technology transition management and support of the DoD SBIR Commercialization Readiness Program; and 5) Prepare all reports required of the SBIR\/STTR Programs as mandated by law and policy."
                        }
                    }
                }
            ]
        }
    }
}