{
    "id": "3caf1909e4918e710f332230594cca570ee959e3",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA5_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605013M"
        },
        "ProgramElementTitle": {
            "val": "Marine Corps IT Dev\/Mod"
        },
        "R1LineNumber": {
            "val": "137"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "57.382"
            },
            "PriorYear": {
                "val": "11.540"
            },
            "CurrentYear": {
                "val": "5.564"
            },
            "BudgetYearOne": {
                "val": "2.887"
            },
            "BudgetYearOneBase": {
                "val": "2.887"
            },
            "BudgetYearTwo": {
                "val": "5.158"
            },
            "BudgetYearThree": {
                "val": "5.239"
            },
            "BudgetYearFour": {
                "val": "3.860"
            },
            "BudgetYearFive": {
                "val": "1.954"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program establishes, sustains, and continuously refines computing platforms and Information Technology (IT) services as tested, certified and reusable components of a Marine Corps IT framework that spans the range of military operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.143"
                },
                "CurrentYear": {
                    "val": "5.564"
                },
                "BudgetYearOne": {
                    "val": "5.663"
                },
                "BudgetYearOneBase": {
                    "val": "5.663"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.540"
                },
                "CurrentYear": {
                    "val": "5.564"
                },
                "BudgetYearOne": {
                    "val": "2.887"
                },
                "BudgetYearOneBase": {
                    "val": "2.887"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.603"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.776"
                },
                "BudgetYearOneBase": {
                    "val": "-2.776"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.320"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.430"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.430"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.346"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.346"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.283"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding decrease from FY14 to FY15 is due to program adjustments which realigned resources for more efficient execution."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2906"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps IT"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "57.382"
                        },
                        "PriorYear": {
                            "val": "11.540"
                        },
                        "CurrentYear": {
                            "val": "5.564"
                        },
                        "BudgetYearOne": {
                            "val": "2.887"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.887"
                        },
                        "BudgetYearTwo": {
                            "val": "5.158"
                        },
                        "BudgetYearThree": {
                            "val": "5.239"
                        },
                        "BudgetYearFour": {
                            "val": "3.860"
                        },
                        "BudgetYearFive": {
                            "val": "1.954"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Defense Message System (DMS) and follow-on\/replacement systems, as directed by the Joint Staff and HQMC Command, Control, Communications and Computers (C4), meet the organizational messaging requirement for all classification levels from General Services (GENSER) through Top Secret\/Sensitive Compartmented Information (TS\/SCI). Telos Automated Message Handling System (AMHS) is the current implementation that provides Web-interface for system administration and for user messaging (including readers). Organizational messages are used to direct and commit resources, provide user authentication, non-repudiation, confidentiality, and integrity. It also maintains an archive and retrospective search capability to the warfighter and requires security at the Class 4 level (currently implemented with Fortezza and Certificate Authority Workstations). The Defense Information Systems Agency (DISA) is the lead agency and Global System Manager (GSM) for DMS products. The Department of Defense Intelligence Information System (DODIIS) is the Operations Manager for the Intelligence Community (IC) to support TS\/SCI messaging. Within the Marine Corps, there are two distinct acquisition efforts to field DMS to strategic and tactical communication centers to all classification levels. Additionally ongoing efforts at the service and DISA level to transition from the DMS system to alternative mechanisms for the transfer of organizational information. FY13 R&D for DMS continued research and analysis to assist in the transition to the next generation DMS occurring between FY12-15 in order to test and certify possible organizational messaging solutions\/capabilities that are DISA compliant.  FY14 DMS will continue to conduct research and analysis to assist in the transition to the next generation DMS occurring between FY12-15 in order to test and certify possible organizational messaging solutions\/capabilities that are DISA compliant. Additionally, DMS will research the feasibility of the migrating all Marine Corps organizational messaging capabilities into MCEITS.\n\nMarine Corps Training Information Management System (MCTIMS) replaced the mainframe program By Name Assignment, which managed all Marine Corps school seats and interfaced with other service's school seat management programs. MCTIMS is the Marine Corps' official program of record for training and education management and is the single data source which the Training and Education Command (TECOM) relies on to manage training personnel, training seats, students, and other training resources. MCTIMS is the enterprise application upon which standards based instruction, education, and training is built, delivered, tracked, and evaluated. MCTIMS is establishing the unit training management module for all ground forces. This module will provide commanders an enterprise level application, which brings standardization in planning and scheduling training, recording of training against units and individual Marines, provides training assessments and reports combat readiness to Department of Defense (DOD) systems. FY13 funding continued the development of the Calendar Based Scheduling Module.  FY14 funding is planned for Development of Enhanced Registration capability of Marines\/Students and a Prerequisite and Registration Screening Tool.  FY15 funding is planned for Handheld\/Mobile Application Interface & Integration Training Data Warehouse (TrDW) Planning.\t\n\nManpower Operations Systems (MOS) is a portfolio of enterprise IT systems and modules that support manpower business operations for the Total Force (active and reserve). The investment in the portfolio improves dataflow and increases reliability, functionality, and accuracy of data while reducing the manpower required to operate and maintain these systems\/operations. Development is partially driven by regulatory and policy changes mandated by Congress, DOD, Department of the Navy (DON), and United States Marine Corps (USMC). These systems support all five tiers of Manpower: 1) Individual Marine, 2) Small Unit Leader; 3) Unit, 4) Installation Personnel Administration Center (IPAC)\/Disbursing Echelon, and 5) Headquarters Marine Corps (HQMC) Manpower and Reserve Affairs (M&RA)\/ Defense Finance and Accounting Service. The MOS portfolio provides support in functional areas such as permanent change of station assignments, retention, mobilization, manpower planning, line of duty determination, personnel accountability, individual augmentation, personnel records management and maintenance, management of case incidents, civilian professional development planning, pay entitlement determinations, promotion and performance evaluations and self service\/visibility of personnel data. MOS programs interface with other systems to provide manpower data and web services functionality for pay and personnel transactions between systems. Systems in the portfolio include the Web-enabled Manpower Assignment Support System (WebMASS), Performance Evaluation System (PES), Total Force Retention System (TFRS), Optical Digital Imaging - Records Management System (ODI-RMS), Manpower Mobilization Assignment System (MMAS), and the Requirements, Transition and Manpower Management System (RTAMMS) Total Force Administration System (TFAS) (composed of the Secure Personnel Accountability (SPA) Module, and the Drill Management Module (DMM)).\n\nMarine Corps Enterprise Information Technology Services (MCEITS) provides an overarching portfolio of capabilities to deliver \"Power to the Edge\" for the Marine Corps. Born from an effort to establish a Continuity of Operations Plan of HQMC Automated Information Systems, MCEITS enables realignment of the existing USMC environment of applications, databases, networks, and facilities into an integrated architecture of programs to deliver new information technology capabilities based on a common infrastructure and shared services. MCEITS is a unifying framework of both the Enterprise Services  to be delivered, and the infrastructure and systems which must be deployed to enable delivery of those services. Initially it will encompass the Operational, Technical, and Systems architectures of the enterprise environment. However, ultimately it will extend to transform information access both in garrison and in the deployed environment. Combined with policy, procedure and standards provided by HQMC (C4), MCEITS will allow for architectural standardization, consolidated management, and seamless interoperability of and access to the data residing in currently fielded applications (business and tactical). Testing efforts will be focused on MCEITS provided services operating within a Service Oriented Architecture environment. MCEITS will ensure the ability to host services and applications in a Web Services enabled environment. MCEITS enables services to be federated throughout the Marine Corps to include Content Discover and Delivery, Collaboration and Text Chat, between the service consumer and provider. Efforts for MCEITS will focus on technical refresh of the software and hardware infrastructure, modernizing and enhancing MCEITS high availability, automation and service management with continued Pre-Planned Product Improvements (P3I) efforts.  \n\nMarine Corps Recruiting Information Support System (MCRISS) is an enterprise level system to automate administrative procedures for the recruiting station operations. This customized automated System, centered on procedures in the Guidebook for Recruiters, Volume I, dramatically improves efficiency and effectiveness in Marine Corps recruiting. Furthermore, Military Entrance Processing Command requires Marine Corps recruiting to provide information in electronic format only. MCRISS is the Marine Corps Recruiting Command's program to manage applicant processing from commitment to accession\/commission into the Marine Corps and Marine Corps Reserve. This enterprise approach allows for efficient sharing of information about potential recruits and recruiter screening efforts, yielding a more cost effective process. In FY13, funds supported development of the Mission Planning Tool.  FY14 funding supports Design and development of Manning Level Structure Analysis Tool and Training Application Tool Development & Web Based Training (WBT).  FY15 funding is planned for Automated Waiver Processing Tool, Recruiter Client Development and MCEITS Migration.\n\nDefense Readiness Reporting System (DRRS-MC) is the next generation of Marine Corps authoritative system for force registration and readiness reporting. The DRRS-MC is a web-based and net-centric system providing readiness reporting via the Netcentric Unit Status Report (NetUSR)-Marine Corps (input) tool, enabling units to register and report their training, equipment (including Chemical, Biological, Radiological and Nuclear [CBRN]); personnel; missions and mission essential tasks (METs) readiness status. The Marine Readiness Management Output Tool (MRMOT) allows users to view current and historical readiness information using graphical user interface screens to efficiently display information. MRMOT is an executive information system in that it begins at a summary level and allows a \"drill-down\" capability to access detailed readiness information. FY13 - FY14 funding will also support the Global Force Management (GFM) - Data Initiative (DI) to consume Force Structure from Marine Corps Org Server (MCOS); conduct mapping, link and maintain Organizational Unique Identifier (OUID) and Unit Identification Code (UIC) relationships. No additional system development is anticipated in FY15.\n\nPaperless Office\/Acquisition (PA) funding supports development and enhancement of Purchase Request (PR) Builder which is the Marine Corps enterprise solution for the electronic generation of purchase requests, funding documents, miscellaneous payments, and serves as the front-end system for feeding the DOD enterprise contracting writing system Standard Procurement System (SPS). Development and enhancement of PR Builder is required to ensure financial and contracting functional requirements and Marine Corps business processes are developed, designed, tested and implemented within the system. PR Builder is also undergoing requirements definition and estimation for v4.3. Once these requirements are delivered to the Program Manager (PM) from the service integrators, modifications to the contract to support the requirements will be initiated. Future DOD, DON, and USMC initiatives that will need to be researched and developed include support or adherence to: Standard Financial Information Structure (SFIS), Standard Line of Accounting (SLOA), and Purchase Request Data Standards (PRDS)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DEFENSE READINESS REPORTING SYSTEM-MARINE CORPS (DRRS-MC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.377"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed testing with Joint Interoperability Test Command (JITC) and Human System Integrator (HSI) Support Dahlgren."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Will support the Global Force Management (GFM) - Data Initiative (DI) to consume Force Structure from Marine Corps Org Server (MCOS); conduct mapping, link and maintain Organizational Unique Identifier (OUID) and Unit Identification Code (UIC) relationships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DEFENSE MESSAGE SYSTEM (DMS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.630"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to conduct research and analysis to assist in the transition to the next generation DMS occurring between FY12-15 in order to test and certify possible organizational messaging solutions\/capabilities that are DISA compliant."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.489"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct research and analysis to assist in the transition to the next generation DMS occurring between FY12-15 in order to test and certify possible organizational messaging solutions\/capabilities that are DISA compliant. Additionally, DMS will research the feasbility of migrating all Marine Corps organizational messaging capabilities into MCEITS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MARINE CORPS TRAINING INFORMATION MANAGEMENT  SYSTEM (MCTIMS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.624"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development of Calendar Based Scheduling Module."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.527"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate development of Enhanced Registration capability for Marines\/Students as well as a Prerequisite and Registration Screening Tool."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.291"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.291"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate development of Handheld\/Mobile Application Interface and Integration Training Data Warehouse (TrDW) Planning."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANPOWER OPERATIONS SYSTEMS (MOS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.707"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed the design and development of the IDMS (Integrated Database Management System) module for the Reserve Transition and Manpower Management System (RTAMMRS)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MARINE CORPS ENTERPRISE INFORMATION TECHNOLOGY SERVICES (MCEITS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.578"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enhanced infrastructure to enable and provide an enterprise level Service Oriented Architecture capability, available for use by all systems, services and applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.373"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate integration, test and transition of technically refreshed software and hardware infrastructure of the first Enterprise IT Center in Kansas City.  Scale infrastructure capacity to host additional applications planned to migrate and to initiate the technical refresh."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.814"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.814"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue integration, test and transition of refreshed Enterprise IT Center in Kansas City.  Continue to scale infrastructure capacity to host additional applications planned to migrate."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PAPERLESS ACQUISITION (PA)"
                                    },
                                    "Description": {
                                        "val": "PAPERLESS ACQUISITION (PA)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.484"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued Research and development including support or adherence to: Standard Financial Information Structure, Financial Data in Procurement, Ucore, Business, Enterrise Archritecture, USMC Financial Improvement Initiative, Naval Facilities Engineering Command to USMC contract\/obligation interface, Seaport-e to USMC contract\/obligation interface."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "No FY14 Funding."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.144"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.144"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funding to support Engineering Change Proposals (ECPs)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MARINE CORPS RECRUITING INFORMATION SUPPORT SYSTEM (MCRISS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.140"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiated design, development and implementation of Mission Planning Tool."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate Design and development of Manning Level Structure Analysis Tool and Training Application Tool development and Web Based Training (WBT)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.638"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.638"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate design, development and implementation of Automated Waiver Processing Tool; Recruiter Client Development and MCEITS Migration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PMC\/4617 - DRRS"
                                    },
                                    "Title": {
                                        "val": "Defense Readiness Reporting System (DRRS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.053"
                                        },
                                        "CurrentYear": {
                                            "val": "0.153"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.206"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Defense Message System (DMS) is a Joint Acquisition Category (ACAT) IAM program. It is Assistant Secretary Defense Command, Control, Communication and Intelligence mandated. Each year the Joint Interoperability Test Command (JITC) runs Operational Test (OT) assessments on DMS software versions and maintenance releases. Marine Corps participation is vital to ensuring that the implementation of DMS is interoperable with all DOD CINCs, services, and agencies. Furthermore, as follow-on organizational messaging solutions for DMS are being identified, materiel solution analysis activities will be conducted. \n\nMarine Corps Training Information System (MCTIMS) will utilize an evolutionary strategy with incremental development methodology. MCTIMS is structured in a module format that allows for phasing of development without having to reengineer the entire system to add significant new capability. MCTIMS utilizes a firm-fixed price contracting strategy to reduce risk to the government. MCTIMS is a fully integrated system, emphasizing code re-use between modules to reduce cost and improve program stability. \t\t\t\t\t\t\t\t\n\nManpower Operations Systems (MOS) within this portfolio follow an Evolutionary Acquisition (EA) approach: 1. Define, develop, and deliver an initial or \"core\" capability based on mature technology. 2. \"Core\" capability will be incrementally improved over an extended period of time. Incremental Development Model: 1. Iterative cycles of requirements definition, design, build and evaluation. The contracting strategy across the portfolio is to utilize competitive firm-fixed price contracts. \t\t\t\t\t\t\t\t\n\nMarine Corps Enterprise Information Technology Services (MCEITS) will be implemented using an initial increment (with 2 releases for each EITC location) followed by P3Is providing an operationally effective and suitable capability in the shortest time possible. The program will deliver an initial capability and continue integration and production of the system in accordance with the USMC Information Enterprise Strategy. The objective is to balance needs with available commercial and government solutions and resources, and to rapidly provide capabilities to the Marines. This strategy is supported by an Indefinite Delivery Indefinite Quantity contracting vehicle which will allow the contractor to provide the full range of capabilities, services and solutions necessary to satisfy the requirements through incremental implementation of technology, processes and capabilities. Capabilities will be delivered through individual task orders to ensure technology and services are inserted according to the overall program goals, user requirements and program schedule. \n\nPaperless Acquisition (PA) will use an incremental development methodology utilizing short development periods. The contracting strategy is to use a firm-fixed price contract to reduce risk to government, with additional capabilities defined by a Marine Corps Configuration Control Board and delivered to the service integrator as a modification to the contract. The delivery of small functional capabilities allows for measurable enhancements to the base system while keeping Post Deployment System Support costs relatively low. \t\t\t\t\t\t\t\t\t\n\nMarine Corps Recruiting Information Support System (MCRISS) capitalizes on centrally located data with secure web and wireless web enabled entry. MCRISS utilizes a modular\/incremental development to maintain system operability while providing continued development. Contracting strategy includes competitive firm-fixed price contracts.\n\nDefense Readiness Reporting System-Marine Corps (DRRS-MC) will use an EA strategy. DRRS-MC will consist of three phases: 1. Provide basic readiness reporting capabilities for both the input tool and output tool 2. Provide for auto-population and enhanced trending capabilities. 3. Additional system interfaces and a cross-domain solution. The DRRS-MC software architecture is based on commercial products used throughout Government and Industry. The supporting products, underlying technologies and technical skills are not unique and are readily available. There are no limitations within industry to prevent any interested sources from submitting a proposal. Many of the corporations providing enterprise solutions to the USMC, DON and DoD are potential sources as the DRRS-MC Systems Integrator."
                        },
                        "PerformanceMetrics": {
                            "val": "Milestone Reviews"
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013M_2906_FILE8.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013M_2906_FILE10.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013M_2906_FILE12.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013M_2906_FILE13.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013M_2906_FILE14.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013M_2906_FILE15.JPG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}