{
    "id": "52ffe64541ba3b0e1589309bb7d4714ed4900d2d",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DLA_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603712S"
        },
        "ProgramElementTitle": {
            "val": "Logistics Research and Development Technology (Log R&D)"
        },
        "R1LineNumber": {
            "val": "54"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "43.145"
            },
            "PriorYear": {
                "val": "23.130"
            },
            "CurrentYear": {
                "val": "18.000"
            },
            "BudgetYearOne": {
                "val": "16.836"
            },
            "BudgetYearOneBase": {
                "val": "16.836"
            },
            "BudgetYearTwo": {
                "val": "17.207"
            },
            "BudgetYearThree": {
                "val": "17.991"
            },
            "BudgetYearFour": {
                "val": "18.056"
            },
            "BudgetYearFive": {
                "val": "18.416"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The central idea of the Focused Logistics Joint Functional Concept “is to build sufficient capacity into the sustainment pipeline, exercise sufficient control over the pipeline from end to end, and provide a high degree of certainty to the supported joint force commander that sustainment, and support will arrive where needed and on time.”  The Defense Logistics Agency (DLA) Research and Development (R&D) program helps achieve this vision by pioneering advanced logistics concepts and business processes that provides the leanest possible infrastructure, the use of the best commercial and government sources, and the application of business practices.  The Logistics R&D program develops and demonstrates high risk, high payoff technology that will provide a significantly higher level of support at lower costs, than would be otherwise attainable.  The program has a proven track record of implementation and benefits.  One example is the Department of Defense (DOD) Electronic MALL (EMALL).  DOD EMALL was the first web based, distributed architecture on-line ordering capability.  It has been adopted by the Army, Navy and the Department of Homeland Security.  DLA’s overall Log R&D program has demonstrated positive net present value and a positive return on investment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "24.605"
                },
                "CurrentYear": {
                    "val": "20.000"
                },
                "BudgetYearOne": {
                    "val": "20.312"
                },
                "BudgetYearOneBase": {
                    "val": "20.312"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.130"
                },
                "CurrentYear": {
                    "val": "18.000"
                },
                "BudgetYearOne": {
                    "val": "16.836"
                },
                "BudgetYearOneBase": {
                    "val": "16.836"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.475"
                },
                "CurrentYear": {
                    "val": "-2.000"
                },
                "BudgetYearOne": {
                    "val": "-3.476"
                },
                "BudgetYearOneBase": {
                    "val": "-3.476"
                }
            },
            "AdjustmentDetails": {
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.033"
                    },
                    "CurrentYear": {
                        "val": "-2.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.068"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.182"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.328"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.476"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.476"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2014 Congressional Rescissions: -$2.000 million\n\nFY2015 Other Program Reduction (Budget Control Act 2011): -$3.476 million\n\nThe lower funding will result in significant disruption and delay for critical DLA Logistics R&D efforts.  The Medical On-line Business Analytics capability will be delayed depriving DLA of the ability to properly plan and monitor orders to critical medical customers.  The Supply Chain management project reductions means additional anti-counterfeiting technology will not be fully developed and implemented, increasing the risk that counterfeit parts will enter the DOD supply system. In addition, emerging additive manufacturing technology will not be available for low volume parts.  The Strategic Distribution and Reutilization reductions mean that DLA support to the COCOM’s deployments will be more costly because they will not be able to access regional suppliers through the IBEX2 system.  Reductions to the Energy readiness program mean cost increases to the Services for fuel because fewer alternative fuel additives will be available.  Finally, the reductions to the Defense Logistics Information project means DLA will not be capable of taking advantage of major advancements in Computer Aided Design\/Computer Aided Manufacturing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Medical Logistics Network (MLN)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.201"
                        },
                        "PriorYear": {
                            "val": "2.649"
                        },
                        "CurrentYear": {
                            "val": "2.655"
                        },
                        "BudgetYearOne": {
                            "val": "2.266"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.266"
                        },
                        "BudgetYearTwo": {
                            "val": "2.306"
                        },
                        "BudgetYearThree": {
                            "val": "2.353"
                        },
                        "BudgetYearFour": {
                            "val": "2.392"
                        },
                        "BudgetYearFive": {
                            "val": "2.448"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Medical Directorate’s mission is to develop and implement the critical logistics and medical supply chain business practices that ensure the cost-effective and efficient distribution of medical materiel to the full range of Military Health System operations.\n\nThe Medical Logistics Network (MLN) anticipates future medical logistical requirements and develops strategies and tools to meet these requirements.  Operating in the unique DoD-Commercial medical logistics environment, the Medical Logistics Network supports innovative projects that improve this partnership and enhance the medical logistics enterprise support to the Warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical Logistics Network Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.649"
                                            },
                                            "Text": {
                                                "val": "In FY2013 two of the new projects are continuing to deliver capabilities to DLA business users. The Business Analytics project will enable users to extract data based on daily Electronic Data Interchange (EDI) business transactions instead of monthly vendor-reported data. The Cost & Pricing project is using historical prices and commercial data sources to help determine fair & reasonable prices. Advancing Cold Chain Management (ACCM), executed and funded as multiple sub-projects, continues this year with two small efforts to support pharmaceutical products."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.655"
                                            },
                                            "Text": {
                                                "val": "In FY2014 the projects underway will continue to deliver enhancements to extend the initial accomplishments, and the clinical standardization initiative will begin with its focus on medical\/surgical product knowledge. We will look to extend the processes and capabilities for fair and reasonable pricing to other supply classes such as Subsistence. In addition, a new readiness project defined in 2013 could be in its first year."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.266"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.266"
                                            },
                                            "Text": {
                                                "val": "In FY2015 the On-Demand Business Analytics (ODBA) project and possibly the Cost & pricing project will be transitioning to sustainment. We will look to broaden the scope of Clinical Standardization to classes of medical products such as medical equipment. Advancing Cold Chain Management (ACCM), executed and funded as multiple sub-projects, will continue into this year. A new project for assembly data management could be undertaken this year."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Business Analytics project was competitively bid as a task order on the Defense Logistics Standard Support Blanket Purchase Agreement (DMLSS-W BPA).  That contract is no longer available to the MLN program so all new work is being solicited through DLA’s Emerging Requirements Broad Agency Announcement.   The MLN program may develop a new BPA that will support IT and non-IT medical logistics projects."
                        },
                        "PerformanceMetrics": {
                            "val": "Defense Medical Logistics Transformation (DMLT):  1) The percentage of requirements supported by architecture products – Eighty-seven percent of the MedSurg Prime Vendor Program’s Gen IV Requirements are supported by architecture products.  2) Measurement of compliance with laws and regulations (e.g. Clinger-Cohen Act) that require complete enterprise architecture- 93.0% of required products passed first certification review (based on MS-B and CDR). 3) Percentage alignment between Balanced Scorecard Transformation Initiatives and Enterprise Architecture - data to be determined as initiatives are further refined."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2"
                    },
                    "ProjectTitle": {
                        "val": "Weapon System Sustainment (WSS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.470"
                        },
                        "PriorYear": {
                            "val": "5.262"
                        },
                        "CurrentYear": {
                            "val": "5.342"
                        },
                        "BudgetYearOne": {
                            "val": "6.074"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.074"
                        },
                        "BudgetYearTwo": {
                            "val": "6.177"
                        },
                        "BudgetYearThree": {
                            "val": "6.281"
                        },
                        "BudgetYearFour": {
                            "val": "6.397"
                        },
                        "BudgetYearFive": {
                            "val": "6.483"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Support Defense Logistics Agency (DLA) Strategic Plans Goals 1.)  Warfighter Support) and 2.)  Stewardship Excellence.  The program spans multiple weapon systems and supply chains to improve internal processes, provide new methods, reduce costs and lead times, and ultimately, improve readiness for DLA customers.  \n\nThe program is focused in three initiatives:\n1.)  Planning Process Improvement:  The program improves elements of current inventory policy models, assesses potential benefits of new technologies and seeks more efficient approaches to deliver customer requirements while reducing inventory   and order fulfillment costs.  \n\n2.)  Technical\/Quality Process Improvement:  The program improves internal efficiency and customer satisfaction through new tools and methods to proactively address supply issues resulting from current technical\/quality processes.  \n\n3.)  Procurement Process Improvement:  The program will demonstrate tailored data collection and business processes for well-defined subsets of suppliers and procurement types to improve supplier responsiveness, cycle time and cost."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Weapon System Sustainment Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.262"
                                            },
                                            "Text": {
                                                "val": "Planning Process Improvement.  Efforts to support the transition of Peak Policy and the Next Generation inventory model (PNG) were successfully complete, and PNG is now used to set inventory levels for approximately 500K items. Projects were initiated to develop enhancements to the PNG technology that when completed will allow coverage of approximately 200K additional items.  The Customer Collaboration project was successfully completed and the results transitioned to the Planning Process owner.  The Supplier Initiated orders project was continued and is on track for successful completion in 2014.  The Exchange\/Sale for Economic Retention Stock project (formerly titled Inventory Privatization) was initiated.  A project to develop enhancements to the FINISIM simulation model was initiated, and transition was initiated by submitting the capabilities to the J6 Front Door process.  The WSS team worked with the Planning Process team to identify requirements for FY2014 projects.\n           \nTechnical\/Quality Process Improvement.  Efforts to support transition of DNA Marking for FSC 6K microcircuits were successfully completed, and DLA now requires use of the technology in all procurements of 6K items.  The Product Verification Process project was successfully completed and transitioned to the Technical\/Quality Process team.  A project to identify key quality metrics and recommend improved metric s with greatest potential to impact operations and change behavior was successfully completed and transitioned to the Technical\/Quality Process team.  The WSS team worked with the T\/Q Process team to identify a requirement for a Quality Cost Tool intended as an FY2014 project.\n\nProcurement Process Improvement.  The Decision Support Project was completed and transitioned through the J6 High Risk Procurement project.  The Matching Acquisition Strategies to Industry Capabilities project was successfully completed and transition activities initiated with Land and Maritime and J7.  Efforts were made to work with J7 personnel to identify requirements for FY2014 projects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.342"
                                            },
                                            "Text": {
                                                "val": "Planning Process Improvement:  Transition of the Customer Collaboration, Matching Acquisition Strategies to Industry Capabilities, and Supplier Managed Inventory projects will be supported. New projects initiated in FY2013 will be continued or concludes as appropriate.  New projects for FY2014 will be initiated as a result of planning efforts joint with the Planning Process owner and his team.\n\nTechnical\/Quality Process Improvement: New projects initiated in 2013 will be continued or concludes as appropriate.  New projects for FY2014 will be initiated as a result of planning efforts joint with the Planning Process owner and his team.\n\nProcurement Process Improvement:  Efforts to support transition of the Decision Support project will be continued as necessary. Any projects initiated in FY2013 will be continued or concluded, and efforts will continue to work with J7 procurement policy personnel to identify additional projects for initiation in FY2014."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.074"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.074"
                                            },
                                            "Text": {
                                                "val": "Planning Process Improvement:  Transition of enhanced capabilities for Peak and Next Gen will be completed.  Support to transition of enhancements to the Financial and Inventory Simulation model will be continued, as will transition support to the Inventory Privatization model.  The Lead-time Demand project will be completed and transitioned initiated.  A project to use Indentured Bills of Materials for improved demand planning will be completed, and follow on activities defined jointly with the Planning Process Owner and his team.  New projects initiated in FY2014 will be continued or concluded as appropriate.  New projects for FY2015 will be initiated as a result of planning efforts joint with the Planning Process owner and his team.\n\nTechnical\/Quality Process Improvement:  The Product-based Anti-counterfeiting Technologies effort and the Quality Tool project initiated in FY2014 will be continued.  Successful results from the Quality Metrics project completed in FY2014 will be transitioned.  New projects initiated in 2014 will be continued or concluded as appropriate.  New projects for FY2015 will be initiated as a result of planning efforts joint with the Technical\/Quality Process owner and her team.\n\nProcurement Process Improvement:  The Low Item Demand Sourcing Solutions (LIDSS) project will be completed, and follow-on efforts to pursue transition of key results of the project will be defined jointly with J7 personnel.  Other New projects initiated in 2014 will be continued or concluded as appropriate.  New projects for FY2015 will be initiated as a result of planning efforts joint with the Technical\/Quality Process owner and her team.\n\nNew Initiative:  If intensive planning, structuring and approval efforts to be conducted during FY2014 are successful, a major new initiative will be initiated to develop a Deployable Additive Manufacturing capability for DLA."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "The metric is percent of completing demonstration projects transitioning per year. In FY2012, five of six completed projects transitioned.  In FY2013, 2 of 3 completing projects will transition."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3"
                    },
                    "ProjectTitle": {
                        "val": "Supply Chain Management (SCM)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.239"
                        },
                        "PriorYear": {
                            "val": "3.432"
                        },
                        "CurrentYear": {
                            "val": "3.024"
                        },
                        "BudgetYearOne": {
                            "val": "2.527"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.527"
                        },
                        "BudgetYearTwo": {
                            "val": "2.561"
                        },
                        "BudgetYearThree": {
                            "val": "2.607"
                        },
                        "BudgetYearFour": {
                            "val": "2.649"
                        },
                        "BudgetYearFive": {
                            "val": "2.711"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DLA operates in a very dynamic environment.  To meet customer expectations DLA must be able to address problems in a timely manner and be able to respond to emerging opportunities.  The Supply Chain Management Program within R&D provides the Agency with the resources needed to quickly take advantage of new ideas emerging from the Center Commanders, Process Owners, or Staff Directors."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Supply Chain Management Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.432"
                                            },
                                            "Text": {
                                                "val": "During FY2013 Supply Chain Management invested in technologies to implement advanced Supply Chain Management techniques into DLA’s Supply Chains.  DLA is expecting to reduce the Production Lead-time needed to produce critical DLA Land and Maritime items."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.024"
                                            },
                                            "Text": {
                                                "val": "During FY2014 Supply Chain Management will invest in the technologies to implement advanced Supply Chain Management techniques into DLA’s Supply Chains.  DLA is expecting to reduce the Production Lead-time needed to produce critical DLA Land and Maritime items."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.527"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.527"
                                            },
                                            "Text": {
                                                "val": "During FY2015 Supply Chain Management will invest in the technologies to implement advanced Supply Chain Management techniques into DLA’s Supply Chains.  DLA is expecting to reduce the Production Lead-time needed to produce critical DLA Land and Maritime items."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive Broad Area Announcement."
                        },
                        "PerformanceMetrics": {
                            "val": "Implementation of advanced technologies into DLA's supply chain operations."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "4"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Distribution & Reutilization (SDR)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "9.051"
                        },
                        "PriorYear": {
                            "val": "6.006"
                        },
                        "CurrentYear": {
                            "val": "2.785"
                        },
                        "BudgetYearOne": {
                            "val": "2.383"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.383"
                        },
                        "BudgetYearTwo": {
                            "val": "2.513"
                        },
                        "BudgetYearThree": {
                            "val": "3.025"
                        },
                        "BudgetYearFour": {
                            "val": "2.832"
                        },
                        "BudgetYearFive": {
                            "val": "2.899"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program, which through FY2013 is completing improvements and extensions to DLA distribution and disposition capabilities—especially for deployed warfighters—will shift focus in FY2014 to developing and implementing improvements to DLA Distribution and DLA Disposition Services in the Continental United States (CONUS). This will include technology enhancements to operations and processes in distribution centers and disposition offices. Transition organizations are DLA Distribution and DLA Disposition Services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Distribution & Reutilization (SDR) Accomplishments \/ Planned Program"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.006"
                                            },
                                            "Text": {
                                                "val": "Completed transition of SPX and humanitarian distribution capabilities. Began FDTPI implementation and the transition of successful practices into operations. Roadmap technology insertions in distribution and disposition operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.785"
                                            },
                                            "Text": {
                                                "val": "Complete transition of FDTPI and IBex2 capabilities. Support technology planning and insertions into disposition and distribution operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.383"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.383"
                                            },
                                            "Text": {
                                                "val": "Address inadequate legacy capabilities for worldwide distribution, disposition, reutilization, and retrograde operations via technology planning and insertion."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "5"
                    },
                    "ProjectTitle": {
                        "val": "Energy Readiness Program (ERP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.714"
                        },
                        "PriorYear": {
                            "val": "3.626"
                        },
                        "CurrentYear": {
                            "val": "2.038"
                        },
                        "BudgetYearOne": {
                            "val": "1.743"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.743"
                        },
                        "BudgetYearTwo": {
                            "val": "1.774"
                        },
                        "BudgetYearThree": {
                            "val": "1.810"
                        },
                        "BudgetYearFour": {
                            "val": "1.840"
                        },
                        "BudgetYearFive": {
                            "val": "1.883"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Program Management Office Support (PMO) for developing program strategies and goals, preparing documentation for the program, and performing quick reaction studies, including Congressionally Mandated Studies (CMS), and analysis.  Alternate Energy Development (AED) to include test and certification to support the addition of synthetic and alternative fuels to mobility fuel specifications and acquisition plan; renewable fuels studies and planning; continued study of directives related to the implementation of alternative fuels and renewable energy.  Improving Class IIIB supply chain through Current Product Improvement (CPI) (e.g. the study and development of fuel additives; studies to increase sources of supply), and Infrastructure & Process Improvement (IPI) (e.g. the development of analytical tools)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Energy Readiness Program (ERP) Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.626"
                                            },
                                            "Text": {
                                                "val": "Continued PMO support in program implementation and planning ($0.566M PMO\/CMS). Continued support of alternative\/renewable energy solution study, test, and demonstration ($1.0M AED).  Continued support Class IIIB supply chain through product improvement to increase sources, improve quality, and reduce cost. ($1.4M CPI).  Continue to support infrastructure & process improvements ($1.0M IPI)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.038"
                                            },
                                            "Text": {
                                                "val": "Continued PMO support in program implementation and planning ($0.318M PMO\/CMS). Continued support of alternative\/renewable energy solution study, test, and demonstration ($0.570M AED).  Continued support Class IIIB supply chain through product improvement to increase sources, improve quality, and reduce cost. ($0.800M CPI).  Continue to support infrastructure & process improvements ($0.570M IPI)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.743"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.743"
                                            },
                                            "Text": {
                                                "val": "Continued PMO support in program implementation and planning ($0.240M PMO\/CMS). Continued support of alternative\/renewable energy solution study, test, and demonstration ($0.440M AED).  Continued support Class IIIB supply chain through product improvement to increase sources, improve quality, and reduce cost. ($0.620M CPI).  Continue to support infrastructure & process improvements ($0.440M IPI)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "FY2012 – Transition of 30% of completed demonstration programs.\nFY2013 - Transition of 30% of completed demonstration programs."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "6"
                    },
                    "ProjectTitle": {
                        "val": "Defense Logistics Information Research (DLIR)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.470"
                        },
                        "PriorYear": {
                            "val": "2.155"
                        },
                        "CurrentYear": {
                            "val": "2.156"
                        },
                        "BudgetYearOne": {
                            "val": "1.843"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.843"
                        },
                        "BudgetYearTwo": {
                            "val": "1.876"
                        },
                        "BudgetYearThree": {
                            "val": "1.915"
                        },
                        "BudgetYearFour": {
                            "val": "1.946"
                        },
                        "BudgetYearFive": {
                            "val": "1.992"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Logistics Information Research (DLIR) program objective is to research, identify, and implement potential or existing technologies using high-risk, high-payoff tools, methods, techniques, and products.  The DLIR program partners with commercial industry to perform short-term projects (STPs) in various logistics business areas which align with the Defense Logistics Agency’s (DLA’s) strategic vision. DLIR improves functional and business processes using the latest technologies available, which support the nation’s warfighter. The technical areas of interest are:\n\n1.)  Development of Logistics Data Interoperability & Availability. Enhances the functionality and compatibility of data in a complex data environment using supply chain relationships and lifecycle management to allow flexible visibility.  2.)  Next Generation Automated Electronic Commerce and Sourcing.  The Next Generation Automated Electronic Commerce and Sourcing technical area of interest focuses on employing the best of breed processes, practices, and technology to enable and\/or streamline electronic commerce from the customer’s point-of-need to point-of-satisfaction.\n\nDLIR is working several short term projects in the first area of interest only. They are positioning DLA to move towards a model-based enterprise (MBE), using and acquiring 3-Dimensional model-based data instead of 2-Dimensional hardcopy for weapon system sustainment and support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Logistics Information Research (DLIR) Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.155"
                                            },
                                            "Text": {
                                                "val": "Completed the second phase of the project supporting the Air Force’s A10 wing replacement program and complete the study about how the government obtains and can improve how it acquires technical data. \n\nThe Parametric Search tool will be made “transition ready” to be inserted behind the DLA firewall"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.156"
                                            },
                                            "Text": {
                                                "val": "Continue to identify ways for DLA to utilize the recommendations for using automated tools and processes for obtaining and exchanging technical data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.843"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.843"
                                            },
                                            "Text": {
                                                "val": "Continue work on a concept of operations (CONOPS) for using Model based technical data in Procurement\n\nDevelop a sourcing function within the parametric search tool\n\nDevelop automated tools and methodologies to store and deliver 3 Dimensional model data to customers so they can use Additive Manufacturing to make the part. The goal is that DLA will store, stock, and ship the model, not the part."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Improved quality of logistics data."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "7"
                    },
                    "ProjectTitle": {
                        "val": "Tent Network for Technology Implementation (TENTNET)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The purpose of the TENTNET program is to significantly improve supply chain surge capabilities for military tent requirements.  The program is building a community of practice amongst DLA, academia, and industry to help identify supply chain bottlenecks and structure short term R&D projects to address these bottlenecks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "TENTNET Accomplishments\/Plans"
                                    },
                                    "Description": {
                                        "val": "E-Mall Access for TENTNET:  This project will make it possible for MilSpec Tent information to be available to all EMALL users.  It will expand the number of tent and shelter products that have rich technical and performance information available on DOD EMALL. The project is structured to benefit the entire tent manufacturing community by making their product more visible and, more importantly, it will improve the quality of product information available to the warfighter.  Plans include completing data collection and web design for three additional MILSPEC tents, complete modifications, and develop web-based training capability.  \n\nExtension of Supply Chain Simulation project:  This represents additional tasking for an existing project.  The project will simulate the capability of the tent supply chain to surge production under varying conditions and requirements.  We expect this project to produce an effective decision making tool for DLA’s Industrial Capabilities Programs allowing program management to evaluate the effect of placing buffer stocks at various levels within the supply chain.  Anticipate completion by Sept 2011."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No input."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The goal of the program is to transition positive project results to industry, assuming there is a credible business case to do so.  With this goal in mind, each STP team will develop a set of key performance parameters (KPPs) at the onset of the project – the KPPs will be used to measure the success of the technology or process improvement involved."
                        }
                    }
                }
            ]
        }
    }
}