{
    "id": "5d27570be323b7afd7d08015046b5663176749db",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V2_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604602F"
        },
        "ProgramElementTitle": {
            "val": "Armament\/Ordnance Development"
        },
        "R1LineNumber": {
            "val": "69"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.874"
            },
            "CurrentYear": {
                "val": "13.661"
            },
            "BudgetYearOne": {
                "val": "31.112"
            },
            "BudgetYearOneBase": {
                "val": "31.112"
            },
            "BudgetYearTwo": {
                "val": "37.460"
            },
            "BudgetYearThree": {
                "val": "16.788"
            },
            "BudgetYearFour": {
                "val": "6.012"
            },
            "BudgetYearFive": {
                "val": "6.126"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2015, Project 653133, Bombs & Fuzes, includes new start efforts, Improved Lethality (IL)."
        },
        "ProgramElementMissionDescription": {
            "val": "The Armament\/Ordnance Development program provides for initial and continuing development of weapons\/munitions (kinetic and non-kinetic) and munitions equipment for support and operational use.  This program develops and improves the following weapons and weapons subsystems:  bombs, bomb fuzes (to include the FMU-152 and FMU-139 general purpose, commodity fuzes), insensitive explosive fills (Insensitive Munitions - IM), aircraft ammunition, stores-aircraft interface upgrades to include the Universal Armament Interface (UAI), directed energy technology transition to weapons, munitions materiel handling equipment (MMHE), munitions containers, and other weapon subsystems.\n  \n- Bombs and Fuzes (Armament Subsystems):  This project develops and improves conventional weapons\/munitions (kinetic and non-kinetic) and fuzes.  The project also provides an opportunity to quickly insert emerging technologies into existing and developing aircraft munitions and fuzes.  Bombs and fuzes provides research, development and testing of conventional warhead and fuzing modifications to improve lethality against area targets, to include anti-personnel anti-material (APAM) targets.  This project provides for the development and testing necessary to provide a suitable manufacturing base of conventional warheads and fuzes.  The project provides for research, development, and testing of medium caliber ammunition and enterprise management of guns, ammunition, and Munitions Materiel Handling Equipment (MMHE) systems integration and testing to ensure tested and certified medium caliber ammunition is provided to users.  The project helps the AF meet Insensitive Munitions (IM) compliance requirements through strategic planning, development of insensitive explosive fills, and bomb case modifications to make weapons insensitive to unplanned stimuli.   Armament Standardization\/Control\/Munitions Materiel Handling Equipment (MMHE) is a continuing project to develop and improve the standardization and commonality of munitions handling and armament equipment to preclude duplication.  This project also funds the operation of the tri-service Container Design Retrieval System (CDRS), maintaining a container database to preclude proliferation and duplication of munitions containers and supporting organic container design.\n\n- BLU-109 and BLU-113 Upgrade [Advanced BLU-109 and BLU-113 (A2K\/A5K)]:  This project demonstrates advancements in capability of these two legacy penetrator warheads, enabling them to hold more targets at risk than currently achievable.\n\n- Stores-Aircraft Interface: This project conducts stores-aircraft interface upgrades and standards development to include the Universal Armament Interface (UAI).  UAI is an Air Force initiative to develop standardized software interfaces in aircraft, weapons and mission planning to support integration of weapons independent of aircraft Operational Flight Program (OFP) cycles. Significant savings of cost and time are achieved using UAI.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full rate production."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.951"
                },
                "CurrentYear": {
                    "val": "16.284"
                },
                "BudgetYearOne": {
                    "val": "23.596"
                },
                "BudgetYearOneBase": {
                    "val": "23.596"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.874"
                },
                "CurrentYear": {
                    "val": "13.661"
                },
                "BudgetYearOne": {
                    "val": "31.112"
                },
                "BudgetYearOneBase": {
                    "val": "31.112"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.077"
                },
                "CurrentYear": {
                    "val": "-2.623"
                },
                "BudgetYearOne": {
                    "val": "7.516"
                },
                "BudgetYearOneBase": {
                    "val": "7.516"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.013"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-2.623"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.230"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.834"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "7.516"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.516"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013, Other Adjustments: -$0.834M, Sequestration\n\nFY 2014, Congressional Directed Reductions: -$2.623M, Program decrease\n\nFY 2015, Other Adjustments: +$7.516M\n +9.900M, Improved Lethality\n -1.384M, Reduction of funds due to higher AF priorities"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "653133"
                    },
                    "ProjectTitle": {
                        "val": "Bombs & Fuzes"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.561"
                        },
                        "CurrentYear": {
                            "val": "0.720"
                        },
                        "BudgetYearOne": {
                            "val": "11.001"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.001"
                        },
                        "BudgetYearTwo": {
                            "val": "20.856"
                        },
                        "BudgetYearThree": {
                            "val": "11.162"
                        },
                        "BudgetYearFour": {
                            "val": "1.083"
                        },
                        "BudgetYearFive": {
                            "val": "1.104"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2015, Project 653133, Bombs & Fuzes, includes new start efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Bombs & Fuzes (Armament Subsystems) Project contains a variety of work:\n\n- Bombs\/munitions and fuzes.\n(a) Medium Caliber Ammunition project assesses, refines, and develops medium caliber ammunition, to include, but not limited to, conducting PGU-28A\/B (F-22) and 25mm (F-35) qualification testing.\n(b)  This project funds follow-on development activities for legacy fuzes, including reliability enhancements and producibility improvements.\n(c) Improved Lethality (IL): IL continues and expands development planning and legacy warhead efforts to improve lethality against area targets, to include anti-personnel anti-material (APAM) targets.  This effort studies, designs, develops and tests warhead and fuzing modifications which improve  lethality against APAM while meeting current DoD policy on cluster munitions and unintended harm to civilians.  These improvements may be synergistic with maintaining a suitable manufacturing base.  This effort is a new start effort in Project 653133, Bombs & Fuzes, in FY15.\n\n- Insensitive Munitions (IM). IM develops less sensitive explosive fills and bomb case modifications to improve the response of conventional weapons to unplanned stimuli. The project also supports AF IM strategic planning to achieve IM compliance IAW U.S. Code, Title 10, Subtitle A, Part N, Chapter 141, Section 2389, Ensuring safety regarding insensitive munitions.\n\n- Munitions Materiel Handling Equipment (MMHE) and Container Design Retrieval System (CDRS).  Armament Standardization\/Control\/Munitions Materiel Handling Equipment (MMHE) is a continuing project to develop and improve the standardization and commonality of munitions handling and armament equipment to preclude duplication.  Efforts are limited to the study, design, and development of MMHE and armament control systems.  Procurement will be performed and funded by the applicable weapons system project.  The tri-service  Container Design Retrieval System (CDRS) is a database intended to preclude proliferation and duplication of munitions containers.  It also supports organic container design, acquisition transportation, prototyping and testing capabilities, as well as the Joint Ordnance Commander's Working Group (JOCG) for Packaging, Handling, and Loading.\n\nBA5 - This program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Munitions Materiel Handling Equipment\/Container Design Retrieval System"
                                    },
                                    "Description": {
                                        "val": "Munitions Materiel Handling Equipment (MMHE) and Container Design Retrieval System (CDRS). Armament Standardization\/Control\/Munitions Materiel Handling Equipment (MMHE) is a continuing project to develop and improve the standardization and commonality of munitions handling and armament equipment to preclude duplication.  Efforts are limited to the study, design, and development of MMHE and armament control systems. Procurement will be performed and funded by the applicable weapons system project.  The tri-service Container Design Retrieval System (CDRS) is a database intended to preclude proliferation and duplication of munitions containers.  It also supports organic container design, acquisition transportation, prototyping, Packaging, Handling, Storage & Transportation (PHS&T) support and testing capabilities, as well as the Joint Ordnance Commander's Working Group (JOCG) for Packaging, Handling, and Loading."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.734"
                                            },
                                            "Text": {
                                                "val": "CDRS provided DoD wide customer support with container design and technical support for munitions\/weapons containers developers.   Completed 54 customer requests to provide container or technical information and design resulting in $550K in container cost savings.  Provided repair and test procedures for the Conventional Air Launched Cruise Missile (CALCM) Container.  Provided System Program Office (SPO) Integrated Product Team (IPT) Team with technical guidance for the B61-12 Tail Fin Container acquisition. Provided specification and budgetary cost estimate for the HARM Control Section Container.  MMHE completed 16 MMHE support equipment projects to include engineering, drafting, proof load, technical data, and safety authorizations.  Fabricated 17 prototypes and first article equipment fabrications for drafting verification and delivery to Air Force units for additional test and evaluation.  Engineered and developed a Pylon Lift Adapter and Missile Pylon Load Adapter to support F-35 Program Office.  Engineered and developed F-22 Single Pylon Storage Stand for ready pylon storage.  Engineered and developed GAU-8 Drum Helix Handler for the A-10 30MM gun system.   Engineered and developed BRU-57 Load Adapter to ease bomb rack handling.  Engineered and developed Bomb Rack Load Adapter for B-1B maintenance personnel.  Provided support to all SPOs with new weapons and container development.  Continued support and sustainment of all previously existing items developed by the MMHE program office."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.466"
                                            },
                                            "Text": {
                                                "val": "Provide container design expertise and technical support to AF munitions\/weapons containers developers.  Maintain the tri-service Container Design Retrieval System (CDRS) database search ability to preclude proliferation and duplication of munitions containers.  Complete six Munitions Materiel Handling Equipment (MMHE) support equipment projects to include engineering, drafting, proof load, technical data, and safety authorizations. Fabricate six prototypes for test and evaluation purposes. Complete four first article equipment fabrications for drafting verification and delivery to Air Force units for additional test and evaluation. Provide support to all SPO with new weapons and container development. Continue support to the multi service F-35\/JSF programs with equipment to test and evaluate various Alternate Mission Equipment to include pylons, racks and adapters. Continue support and sustainment of all previously existing items developed by the MMHE program office.  Continue to provide direct customer support through limited customer support visits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.738"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.738"
                                            },
                                            "Text": {
                                                "val": "Provide expert DoD wide customer support with container design and technical support for munitions\/weapons containers developers.  Complete 10 Munitions Materiel Handling Equipment (MMHE) support equipment projects to include engineering, drafting, proof load, technical data, and safety authorizations. Fabricate 7 prototypes for test and evaluation purposes. Complete 7 first article equipment fabrications for drafting verification and delivery to Air Force units for additional test and evaluation. Provide support to all Specialized Program Office (SPO) with new weapons and container development. Continue support to the F-35 program with equipment to aid safe munitions loading and handling of various pylons and adapters. Continue support and sustainment of all previously existing items developed by the MMHE program office."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Ammunition"
                                    },
                                    "Description": {
                                        "val": "Assess, refine, and develop medium caliber ammunition. The project provides enterprise management of guns, ammunition, and Munitions Materiel Handling Equipment (MMHE) systems integration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.460"
                                            },
                                            "Text": {
                                                "val": "Completed 20mm PGU-28A\/B F-22 ground qualification and operational suitability and flight testing.\n\nProcured 25mm FAP rounds to support updates to LFT&E lethality predictions in FATEPEN modeling and simulation software.  Initiated procurement of 25mm FAP rounds to support DT\/OT of gun system during F-35 EMD.  [FAP = Frangible Armor Piercing (now PGU-48\/B); FATEPEN = Fast Air Target Encounter Penetration]"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Complete procurement of 25mm FAP rounds to support DT\/OT of gun system during F-35 EMD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Insensitive Munitions (IM)"
                                    },
                                    "Description": {
                                        "val": "Strategic IM planning for the AF; support Joint Service IM efforts; provide technical guidance and test expertise to AF IM programs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.367"
                                            },
                                            "Text": {
                                                "val": "Initiated the FY15\/16 AF IM Strategic Plan; supported DoD and Joint Service IM planning; provided IM planning expertise to individual AF programs, including AMRAAM, SDB II, BLU-109\/113, BLU-117, BLU-129, and the Hard Target Void Sensing Fuze (HTVSF)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.254"
                                            },
                                            "Text": {
                                                "val": "Deliver the FY 15\/16 AF IM Strategic Plan; support DoD and Joint Service IM planning; provide IM planning expertise to individual AF programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Initiate the FY17\/18 AF IM Strategic Plan; support DoD and Joint Service IM planning; provide IM planning expertise to individual AF programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Lethality (IL) - New Start"
                                    },
                                    "Description": {
                                        "val": "Improve lethality against area targets, to include anti-personnel anti-material (APAM) targets.  Improvements must meet current DoD policy on cluster munitions and unintended harm to civilians and may be synergistic with maintaining a suitable manufacturing base."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.763"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.763"
                                            },
                                            "Text": {
                                                "val": "Expand previous development planning efforts to study options and demonstrate technologies for improved lethality in future scenarios which meet DoD policy on cluster munitions and unintended harm to civilians.  Complete development and begin test of a direct attack employed, interim, 500lb warhead for improved APAM target lethality which meets DoD policy."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA04: PE 0604337F"
                                    },
                                    "Title": {
                                        "val": "Requirements Analysis and Maturation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.760"
                                        },
                                        "CurrentYear": {
                                            "val": "11.884"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The Improved Lethality (IL) effort continues and expands upon developmental planning work accomplished in the Requirements Analysis and Maturation PE."
                        },
                        "AcquisitionStrategy": {
                            "val": "- Fuzes (including the FMU-152) is a continuing effort with most activities performed in-house or through contracted services (small contracts).\n  \n- MMHE\/CDRS project activities are performed in-house with limited technical and analysis contract support.\n\n- Medium Caliber project activities are performed in-house with technical and analysis contract support, organic government test support, and possible contracted services (small contracts)."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604602F_BPAC_653133_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "653134"
                    },
                    "ProjectTitle": {
                        "val": "BLU-109 and BLU-113 Upgrade"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "8.877"
                        },
                        "BudgetYearOne": {
                            "val": "14.325"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.325"
                        },
                        "BudgetYearTwo": {
                            "val": "11.069"
                        },
                        "BudgetYearThree": {
                            "val": "0.791"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "BLU-109 and BLU-113 Upgrade [Advanced BLU-109 and BLU-113 (A2K\/A5K)]: This project develops, tests and implements upgrades to penetrator bomb designs (BLU-109, BLU-113) to improve their reliability and survivability during penetration into hardened targets.  The enhancements will enable these two weapons to hold more targets at risk than currently achievable with legacy weapons.  The initial effort will focus on demonstrating an advanced 2000 lb (A2K) warhead and an advanced 5000 lb (A5K) warhead, which improve the survivability and reliability of the legacy warheads.  The project leverages work previously accomplished by the Legacy Warhead Improvement Program (LWIP).\n \n\nBA5 - This program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced 2000 lb Penetrator (A2K) and Advanced 5000 lb Penetrator (A5K) Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Conduct A2K & A5K design analysis, warhead modifications, and testing to improve BLU-109\/113 performance against increasingly hardened targets. Designs will maintain the current BLU-109\/113 mold lines and will attempt to maintain current BLU-109\/113 mass properties and Insensitive Munitions (IM) characteristics."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.877"
                                            },
                                            "Text": {
                                                "val": "Complete risk reduction and begin demonstration\/qualification testing of A2K design to include modified FMU-152 fuzing units (FZUs) and cables, modified JDAM hardbacks, and modified warhead cases employed on the threshold platform (B-2A). The demonstration\/qualification effort will complete in FY16.  Design new A5K warhead in FY14 in preparation for test asset production in FY15."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.325"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.325"
                                            },
                                            "Text": {
                                                "val": "Complete risk reduction and begin demonstration\/qualification testing of A2K design to include modified FMU-152 FZUs and cables, modified JDAM hardbacks, and modified warhead cases employed on the threshold platform (B-2A). The demonstration\/qualification effort will complete in FY16.  Build A5K test assets in preparation for test and produceability study in FY16, and limited qualification in FY17."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE:BA04:PE 0604618F"
                                    },
                                    "Title": {
                                        "val": "Joint Direct Attack Munition"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "2.500"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.469"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.469"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PAAF:BA01:Line Item # 353020"
                                    },
                                    "Title": {
                                        "val": "Legacy Weapon Improvement Program"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.000"
                                        },
                                        "CurrentYear": {
                                            "val": "3.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "The A2K\/A5K Demonstration and Partial Qualification program will provide a BLU-109\/BLU-113 modification package that would precede efforts to achieve a full qualification and low rate initial production (LRIP) phase in FY18."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604602F_BPAC_653134_0.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604602F_BPAC_653134_1.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "655361"
                    },
                    "ProjectTitle": {
                        "val": "Stores-Aircraft Interface"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.313"
                        },
                        "CurrentYear": {
                            "val": "4.064"
                        },
                        "BudgetYearOne": {
                            "val": "5.786"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.786"
                        },
                        "BudgetYearTwo": {
                            "val": "5.535"
                        },
                        "BudgetYearThree": {
                            "val": "4.835"
                        },
                        "BudgetYearFour": {
                            "val": "4.929"
                        },
                        "BudgetYearFive": {
                            "val": "5.022"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Universal Armament Interface (UAI) is an Air Force program to develop, enhance, and implement standardized interfaces in current and future aircraft (manned or unmanned), weapons and mission planning to support integration of weapons independent of aircraft Operational Flight Program (OFP) cycles. UAI is currently being implemented on the F-15E, F-16 Block 40\/50, and EPAF(European Participating Air Forces) F-16 aircraft, Small Diameter Bomb (SDB) I and II, Joint Direct Attack Munition (JDAM), Laser JDAM, Joint Air-to-Surface Stand-off Missile (JASSM) and Precision Guided Munitions Planning Software (PGMPS). Additional aircraft and weapons, including but not limited to, Joint Strike Fighter (JSF\/F-35), MQ-9, as well as Army and Navy systems, have program plans to implement UAI. The UAI program office is responsible for development and enhancement of the standard (U.S. and allied),  support to coalition\/allied\/joint interoperability efforts for weapons-platform interface efforts, provision of certification tools and implementation support to aircraft and weapons.\n\nBA5 - This program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "UAI Development"
                                    },
                                    "Description": {
                                        "val": "Conduct stores-aircraft interface upgrades and standards development to the Universal Armament Interface (UAI), development of and maintenance to the UAI, and facilitation of aircraft and stores program users in the UAI process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.313"
                                            },
                                            "Text": {
                                                "val": "Continued development and configuration management of UAI standards in response to user needs, working group management, technical meetings and workshops, risk reduction studies, common mission planning, and integration support and updates to test. Accomplishments: Completed Moving Target Launch Acceptability Region Study Interface Control Notice;  Released version 4 of began\/completed 14 Platform-Store and 2 Mission Planning (MP) interface changes Interface Control Documents in response to aircraft program needs. With support from UAI SPO, B-2 MP SPO signed the UAI Interface Control Program, precision Guided Munitions Planning System designated UAI as its single future MP interface (even to non-UAI a\/c), and Army\/Navy\/AF Unmanned Systems Interoperability Profile (USIP) Weapons IP 5.0 mandated UAI as its primary interface on Unmanned Aerial Vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.064"
                                            },
                                            "Text": {
                                                "val": "Continue development and configuration management of UAI standards in response to user needs, working group management, technical meetings and workshops, risk reduction studies, common mission planning, and integration support.  Also, continue integration and updates to test tools, including maintenance and procurement of certification tools. These tools are shared among aircraft and weapons programs to reduce time and cost for UAI integration efforts. Start negotiation for multinational Memorandum of Understanding to broaden the use of coalition partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.786"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.786"
                                            },
                                            "Text": {
                                                "val": "Continue development and configuration management of UAI standards in response to user needs, working group management, technical meetings and workshops, risk reduction studies, common mission planning, integration support and updates to test tools.  Procure certification tools with miniature and micro munitions interface capability to meet F-35, SDB II and other future user system integration lab test certification needs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "None"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "In December 2004, under the authority of a class Justification and Approval (J&A), the UAI program office awarded individual Cost Plus Fixed Fee (CPFF) contracts to Boeing, Lockheed Martin, Northrop Grumman and Raytheon.  Each Original Equipment Manufacturer is responsible for a different piece of the total UAI requirement based on its product-specific (platform\/weapon) expertise.  During FY10 these contracts expired.  Under the authority of a new class J&A, Cost Plus Incentive Fee (CPIF) contracts were awarded to the four UAI vendors in August 2010.  Follow-on period of performance was awarded in February 2013 for 12 months to better align future contract awards with funding through the Five Year Defense Plan."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604602F_BPAC_655361_0.jpg"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}