{
    "id": "70a337686de2d42e2dd2b1969a96652c0f4af86d",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V2_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604283F"
        },
        "ProgramElementTitle": {
            "val": "Battle Mgmt Com & Ctrl Sensor Development"
        },
        "R1LineNumber": {
            "val": "41"
        },
        "MdapCode": {
            "val": "393"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "28.740"
            },
            "PriorYear": {
                "val": "100.507"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "129.247"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2013, PE 0604283F includes Congressional funding added for the Joint Surveillance Target Attack Radar System (JSTARS) Recapitilization (Recap).  This program is in Budget Activity 04, Advanced Component Development and Prototypes (ACD&P).  Efforts are necessary to evaluate integrated technologies, representative modes, or prototype systems in a high fidelity and realistic operating environment.  \n\nIn FY 2014, Project 646002, Three-Dimensional Expeditionary Long-Range Radar (3DELRR), efforts were transferred to PE 0207455F, Three-Dimensional Expeditionary Long-Range Radar, Project 646002, in order to provide this program its own Program Element.\n\nIn FY 2015, Project 645363, MP-RTIP efforts were transferred to PE 0307581F, NextGen JSTARS, Project 650003, JSTARS Recapitalization, in order to consolidate efforts and continue development of the JSTARs Recap."
        },
        "ProgramElementMissionDescription": {
            "val": "JSTARS Recap will provide a unique blend of Battle Management Command and Control (BMC2) and Intelligence, Surveillance, and Reconnaissance (ISR) that enables the central tenant of Air Forces doctrine \"Centralized Control and Decentralized Execution\". Air Battle Managers onboard the JSTARS use its wide area ground surveillance radar to build situational awareness and identify targets which are passed to strike assets or crossed cued with ISR platforms. The capability to perform this dual mission at the tactical edge both reduces the time to execute the kill chain and improves ISR collections across the range of military options.\n\nThis program element enhances the warfighter's ability to achieve the joint vision of combat operations. It develops advanced battle management aids and information fusion technologies to enable rapid decisions by automating tracking and addressing time-critical targets. Concept exploration, program definition\/risk reduction efforts, and studies support continuous improvements in development of BMC2 capabilities, network centric operational capabilities, and interoperability with joint service, allied, and coalition systems.\n\nThe JSTARS Recap Program efforts in this program element include: BMC2 System and Sensor Systems. It may also include the furtherance of other related activities to include, but not be limited to, Open System Architecture (OSA) development and\/or refinement for sensor systems and BMC2. Future JSTARS Recap efforts not in this program element include Air Vehicle & Avionics Systems; Data, Voice, & Advanced Communications Systems; and Systems Engineering & Integration (SE&I).  For further details on these future efforts, see PE 0307581F.\n\nActivities also include studies and analyses to support both current program planning\/execution and future program planning.\n\nJSTARS Recap:\n\nThe JSTARS Recap program was initiated to satisfy the JSTARS Mission Area capability gaps and life-cycle affordability challenges as defined in the Synthetic Aperture Radar\/Moving Target Indicator (SAR\/MTI); JSTARS Mission Area Analysis of Alternative (AoA) and the SAR\/MTI, BMC2 Initial Capabilities Document (ICD). The JSTARS Recap program consists of multiple efforts for the development and integration of all sub-systems necessary to satisfy the requirements documented in the ICD, AOA and, upon completion, the Capability Development Document (CDD). The efforts include, but are not limited to: BMC2 System and Sensor Systems; as well as related OSA development or refinement activities to improve AF weapon system life-cycle affordability. These efforts are detailed below.\n\n1. BMC2 System - The BMC2 System development effort builds upon a broad body of work in OSA by evaluating and applying lessons learned from system designs across many areas such as Air Operations Centers (AOC), AWACS Block 40\/45, and the Open Mission Systems (OMS) Working Group. The BMC2 System will provide an on-board BMC2 solution that meets the Joint\/Air Force Requirements as defined in the AoA, ICD, and CDD, using an evolutionary approach, made possible by an OSA design that firmly defines interfaces and messaging standards, thereby enabling rapid technology insertion based on mission need and funds availability. The BMC2 System development effort will also inform the AF OSA concept and frameworks with regard to applicability and efficacy of on-board BMC2 mission systems.\n\n2. Sensor Systems - The Sensor Systems development effort intends to leverage the government owned, platform-independent, radar OSA enterprise specification to develop a modern radar that meets the Joint\/Air Force Requirements as defined in the AoA, ICD, and CDD. JSTARS Recap is the first planned Major Defense Acquisition Program (MDAP) to leverage this body of work. JSTARS Recap also takes into considerations lessons learned from the Dismount Detection Radar (DDR) Quick Reaction Capability (QRC) program, which was a pathfinder for OSA radar in a small, pod configured for surface surveillance missions. The JSTARS Recap Sensor Systems development effort will not only satisfy the requirements of the JSTARS Recap, but also intends to provide critical feedback to an OSA radar concept and framework with regard to applicability and efficacy in a wide area surface surveillance mission. Other sensor systems may include, but are not limited to, Electro-Optical\/Infrared (EO\/IR) and multi\/hyper-spectral.\n\n\n\nBeginning in FY 2012, PE 0604283F funds the development of the Three-Dimensional Expeditionary Long-Range Radar (3DELRR) which will replace the current legacy AN\/TPS-75 radar.  3DELRR will be the principal United States Air Force (USAF) long-range, ground-based sensor for detecting, identifying, tracking, and reporting aerial targets for the Joint Force Air Component Commander (JFACC) through the Theater Air Control System (TACS).  3DELRR will respond to the operational need to detect and report highly maneuverable, small radar cross section targets to enable battlefield awareness while at the same time mitigating the reliability, maintainability, and sustainability issues plaguing the AN\/TPS-75 radar system.  The 3DELRR will provide air controllers with a precise, real-time air picture of sufficient quality to conduct control of individual aircraft under a wide range of environmental and operational conditions.  It will replace the aging USAF AN\/TPS-75 radar system as the AN\/TPS-75 is incapable of detecting some current and emerging threats.  In addition, as the AN\/TPS-75 is reaching the end of its service life, it is more difficult and costly to maintain.  The United States Marine Corps (USMC) is considering 3DELRR as a potential replacement for the AN\/TPS-59, at the end of its service life, to support the Marine Air-Ground Task Force (MAGTF) Commander through the Marine Air Command and Control System (MACCS).  \n\n3DELRR will address system sustainability, transportability and operational availability shortfalls while providing long-range surveillance, detection, and tracking of Air Breathing Targets (ABTs) and, potentially, Theater Ballistic Missiles (TBMs).  This capability will support the USAF contribution to the primary roles of the Airspace Control Authority (ACA) and the Area Air Defense Commander (AADC) and enhance the USAF contributions to the Integrated Air and Missile Defense (IAMD) mission area. This new radar will provide the USAF Control and Reporting Center (CRC) and, if purchased by the USMC, the Tactical Air Operations Center (TAOC), with real-time data to display air activity.  \n\nThe Pre-Engineering & Manufacturing Development (Pre-EMD) efforts of the 3DELRR Program began in FY 2012 and continued through FY 2013.  Acquisition activities included, but were not limited to: full and open source selection to award up to three competing contracts; requirements refinement; completion of the preliminary design development; continued software and hardware subsystem-level development; modeling and simulation to support the system development; implementation of mitigation techniques to combat existing and emerging system threats (including cyber warfare), test planning, and implementation of the program protection plan. A Preliminary Design Review (PDR) and Capability Demonstration C Event were conducted during this timeframe to ensure success in the development of a preliminary system design.  Activities also included studies and analyses to support both current program planning and execution, and future program planning, as well as Milestone (MS) B documentation and preparation for a MS B review."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "114.417"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "100.507"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-13.910"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.147"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-13.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.559"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-9.204"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY13: -13M Congressional Directed Reduction was excess to need for the 3DELRR Program\nFY13: +10M Congressional Add was for SAR\/MTI Alternatives \nFY13: -1.559M SBIR Bill\nFY13: -9.204M Other Adjustment was for Sequestration"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "645363"
                    },
                    "ProjectTitle": {
                        "val": "MP-RTIP"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "8.805"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.805"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2013, PE 0604283F includes Congressional funding added for the Joint Surveillance Target Attack Radar System (JSTARS) Recapitilization (Recap).\nThis program is in Budget Activity 04, Advanced Component Development and Prototypes (ACD&P). Efforts are necessary to evaluate integrated technologies, representative modes, or prototype systems in a high fidelity and realistic operating environment.\n\nIn FY 2015, Project 645363, MP-RTIP efforts were transferred to PE 0307581F, NextGen JSTARS, Project 650003, JSTARS Recapitalization, in order to consolidate efforts and continue development of the JSTARs Recap."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Joint Surveillance Target Attack Radar System (JSTARS) Recapitalization (Recap) will provide a unique blend of Battle Management Command and Control (BMC2) and Intelligence, Surveillance, and Reconnaissance (ISR) that enables the central tenant of Air Forces doctrine \"Centralized Control and Decentralized Execution\". Air Battle Managers onboard the JSTARS use its wide area ground surveillance radar to build situational awareness and identify targets which are passed to strike assets or crossed cued with ISR platforms. The capability to perform this dual mission at the tactical edge both reduces the time to execute the kill chain and improves ISR collections across the range of military options.\n\nThis program element enhances the warfighter's ability to achieve the joint vision of combat operations. It develops advanced battle management aids and information fusion technologies to enable rapid decisions by automating tracking and addressing time-critical targets. Concept exploration, program definition\/risk reduction efforts, and studies support continuous improvements in development of BMC2 capabilities, network centric operational capabilities, and interoperability with joint service, allied, and coalition systems.\n\nThe JSTARS Recap Program efforts in this program element include: BMC2 System and Sensor Systems. It may also include the furtherance of other related activities to include, but not be limited to, Open System Architecture (OSA) development and\/or refinement for sensor systems and BMC2. Future JSTARS Recap efforts not in this program element include Air Vehicle & Avionics Systems; Data, Voice, & Advanced Communications Systems; and Systems Engineering & Integration (SE&I).  For further details on these future efforts, see PE 0307581F.\n\nActivities also include studies and analyses to support both current program planning\/execution and future program planning.\n\nJSTARS Recap:\n\nThe JSTARS Recap program was initiated to satisfy the JSTARS Mission Area capability gaps and life-cycle affordability challenges as defined in the Synthetic Aperture Radar\/Moving Target Indicator (SAR\/MTI); JSTARS Mission Area Analysis of Alternative (AoA) and the SAR\/MTI, BMC2 Initial Capabilities Document (ICD). The JSTARS Recap program consists of multiple efforts for the development and integration of all sub-systems necessary to satisfy the requirements documented in the ICD, AOA and, upon completion, the Capability Development Document (CDD). The efforts include, but are not limited to: BMC2 System and Sensor Systems; as well as related OSA development or refinement activities to improve AF weapon system life-cycle affordability. These efforts are detailed below.\n\n1. BMC2 System - The BMC2 System development effort builds upon a broad body of work in OSA by evaluating and applying lessons learned from system designs across many areas such as Air Operations Centers (AOC), AWACS Block 40\/45, and the Open Mission Systems (OMS) Working Group. The BMC2 System will provide an on-board BMC2 solution that meets the Joint\/Air Force Requirements as defined in the AoA, ICD, and CDD, using an evolutionary approach, made possible by an OSA design that firmly defines interfaces and messaging standards, thereby enabling rapid technology insertion based on mission need and funds availability. The BMC2 System development effort will also inform the AF OSA concept and frameworks with regard to applicability and efficacy of on-board BMC2 mission systems.\n\n2. Sensor Systems - The Sensor Systems development effort intends to leverage the government owned, platform-independent, radar OSA enterprise specification to develop a modern radar that meets the Joint\/Air Force Requirements as defined in the AoA, ICD, and CDD. JSTARS Recap is the first planned Major Defense Acquisition Program (MDAP) to leverage this body of work. JSTARS Recap also takes into considerations lessons learned from the Dismount Detection Radar (DDR) Quick Reaction Capability (QRC) program, which was a pathfinder for OSA radar in a small, pod configured for surface surveillance missions. The JSTARS Recap Sensor Systems development effort will not only satisfy the requirements of the JSTARS Recap, but also intends to provide critical feedback to an OSA radar concept and framework with regard to applicability and efficacy in a wide area surface surveillance mission. Other sensor systems may include, but are not limited to, Electro-Optical\/Infrared (EO\/IR) and multi\/hyper-spectral."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "BMC2 System"
                                    },
                                    "Description": {
                                        "val": "Multiple efforts to define reference architecture, demonstrate prototypes, and develop an Open System Architecture BMC2 system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.777"
                                            },
                                            "Text": {
                                                "val": "Technology risk reduction and program office support to initiate a new program as a result of the JSTARS mission area AoA.  Included studies, analysis, market research, Open System Architecture interface definition, and risk reduction."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Systems"
                                    },
                                    "Description": {
                                        "val": "Multiple efforts to define reference architecture, demonstrate prototypes, and develop an Open System Architecture Radar Wide Area Surveillance system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.028"
                                            },
                                            "Text": {
                                                "val": "Technology risk reduction and program office support to initiate a new program as a result of the JSTARS mission area AoA.  Included studies, analysis, market research, Open System Architecture interface definition, and risk reduction."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0307581F, BPAC 650003"
                                    },
                                    "Title": {
                                        "val": "JSTARS Recap"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "73.088"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "73.088"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "334.137"
                                        },
                                        "BudgetYearThree": {
                                            "val": "640.589"
                                        },
                                        "BudgetYearFour": {
                                            "val": "536.459"
                                        },
                                        "BudgetYearFive": {
                                            "val": "376.198"
                                        },
                                        "CostToComplete": {
                                            "val": "287.000"
                                        },
                                        "TotalCost": {
                                            "val": "2247.471"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # TBD"
                                    },
                                    "Title": {
                                        "val": "JSTARS Recap APAF Production"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "111.214"
                                        },
                                        "BudgetYearFive": {
                                            "val": "272.277"
                                        },
                                        "CostToComplete": {
                                            "val": "3925.464"
                                        },
                                        "TotalCost": {
                                            "val": "4309.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The JSTARS Recap Acquisition Strategy is designed to enable maximum competition for each major sub-system through the EMD phase. Each major sub-system has a capable industry base large enough to make competition an effective tool in achieving the goal of system affordability."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "BMC2 System"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.777"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.777"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sensor Systems"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.028"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.028"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_04_PE_0604283F_BPAC_645363_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "646002"
                    },
                    "ProjectTitle": {
                        "val": "Three Dimensional Expeditionary Long Range Radar"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "28.740"
                        },
                        "PriorYear": {
                            "val": "91.702"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "120.442"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2014, Project 646002, Three-Dimensional Expeditionary Long-Range Radar (3DELRR), efforts were transferred to PE 06027455F, Battle Management Command and Control (BMC2) Sensor Development, Project 646002, in order to provide this program its own Program Element."
                        },
                        "ProjectMissionDescription": {
                            "val": "Beginning in FY12, PE 0604283F funds the development of the Three-Dimensional Expeditionary Long-Range Radar (3DELRR) which will replace the current legacy AN\/TPS-75 radar.  3DELRR will be the principal United States Air Force (USAF) long-range, ground-based sensor for detecting, identifying, tracking, and reporting aerial targets for the Joint Force Air Component Commander (JFACC) through the Theater Air Control System (TACS).  3DELRR will respond to the operational need to detect and report highly maneuverable, small radar cross section targets to enable battlefield awareness while at the same time mitigating the reliability, maintainability, and sustainability issues plaguing the AN\/TPS-75 radar system.  The 3DELRR will provide air controllers with a precise, real-time air picture of sufficient quality to conduct control of individual aircraft under a wide range of environmental and operational conditions.  It will replace the aging USAF AN\/TPS-75 radar system as the AN\/TPS-75 is incapable of detecting some current and emerging threats.  In addition, as the AN\/TPS-75 is reaching the end of its service life, it is more difficult and costly to maintain.  The United States Marine Corps (USMC) is considering 3DELRR as a potential replacement for the AN\/TPS-59, at the end of its service life, to support the Marine Air-Ground Task Force (MAGTF) Commander through the Marine Air Command and Control System (MACCS).  \n\n3DELRR will address system sustainability, transportability and operational availability shortfalls while providing long-range surveillance, detection, and tracking of Air Breathing Targets (ABTs) and, potentially, Theater Ballistic Missiles (TBMs).  This capability will support the USAF contribution to the primary roles of the Airspace Control Authority (ACA) and the Area Air Defense Commander (AADC) and enhance the USAF contributions to the Integrated Air and Missile Defense (IAMD) mission area. This new radar will provide the USAF Control and Reporting Center (CRC) and, if purchased by the USMC, the Tactical Air Operations Center (TAOC), with real-time data to display air activity.  \n\nThe Pre-Engineering & Manufacturing Development (Pre-EMD) efforts of the 3DELRR Program began in FY12 and continued through FY13.  Acquisition activities included, but were not limited to: full and open source selection to award up to three competing contracts; requirements refinement; completion of the preliminary design development; continued software and hardware subsystem-level development; modeling and simulation to support the system development; implementation of mitigation techniques to combat existing and emerging system threats (including cyber warfare), test planning, and implementation of the program protection plan. A Preliminary Design Review (PDR) and Capability Demonstration C Event were conducted during this timeframe to ensure success in the development of a preliminary system design.  Activities also included studies and analyses to support both current program planning and execution, and future program planning, as well as Milestone (MS) B documentation and preparation for a MS B review."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "3DELRR Technology Development (TD); Pre-EMD Period"
                                    },
                                    "Description": {
                                        "val": "TD phase and Pre-EMD efforts associated with delivering a new long-range ground-based sensor."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "91.702"
                                            },
                                            "Text": {
                                                "val": "The pre-EMD period of the 3DELRR Program continued through FY13.  Acquisition activities during FY13 included but were not limited to, a full and open source selection, managing up to three concurrent prime contracts, completion of the preliminary design development, continuation of software and hardware subsystem-level development to support the system development, implementation of mitigation techniques to combat existing and emerging system threats (including cyber warfare), test planning, and implementation of the program protection plan. A combined System Requirements and Function Review (SRFR), Preliminary Design Review (PDR), and Capability Demonstration C Event ensured the program achieved a preliminary system design.  Activities also included studies and analyses to support both current program planning and execution and future program planning as well as continued development of MS B documentation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA04: PE 0207455F"
                                    },
                                    "Title": {
                                        "val": "Three Dimensional Long Range Radar"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "54.191"
                                        },
                                        "BudgetYearOne": {
                                            "val": "88.825"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "88.825"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "98.250"
                                        },
                                        "BudgetYearThree": {
                                            "val": "68.613"
                                        },
                                        "BudgetYearFour": {
                                            "val": "24.790"
                                        },
                                        "BudgetYearFive": {
                                            "val": "35.734"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA04: Line Item # 646002"
                                    },
                                    "Title": {
                                        "val": "Three Dimensional Long Range Radar"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "73.393"
                                        },
                                        "BudgetYearFive": {
                                            "val": "162.656"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Three-Dimensional Expeditionary Long-Range Radar (3DELRR) Project will provide full capability via limited competition to further advance command and control (C2) capabilities supporting Battlefield Management."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "3DELRR Modeling & Simulation"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT\/Lincoln Laboratory"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.220"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.115"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.335"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.275"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "3DELRR System Threat Assessment"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.317"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.408"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.725"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.636"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "3DELRR Pre-EMD Period"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "19.996"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "82.492"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "102.488"
                                                    },
                                                    "TargetValue": {
                                                        "val": "122.157"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "3DELRR System Engineering - A"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT\/Lincoln Laboratory"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.929"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.173"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.102"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.827"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "3DELRR System Engineering - B"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Naval Research Laboratory"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.016"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.106"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.122"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.181"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "3DELRR  System Engineering - C"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Carnegie Mellon University"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pittsburgh, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.177"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.177"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.538"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "3DELRR 46th Test Wing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "46th TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Walton Beach, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.100"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.110"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.210"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.400"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "3DELRR Joint Interoperability Test Command"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.015"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.015"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "3DELRR Program Management Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.162"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.106"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.268"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.765"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_04_PE_0604283F_BPAC_646002_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "3DELRR Tech Development (TD) Phase"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "3DELRR System Requirement Functional Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "3DELRR Preliminary Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "3DELRR Capability Demonstration C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}