{
    "id": "75c9f124bcfcbe5b039785f7f910114c6921263a",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602716A"
        },
        "ProgramElementTitle": {
            "val": "HUMAN FACTORS ENGINEERING TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.161"
            },
            "CurrentYear": {
                "val": "21.328"
            },
            "BudgetYearOne": {
                "val": "23.783"
            },
            "BudgetYearOneBase": {
                "val": "23.783"
            },
            "BudgetYearTwo": {
                "val": "23.822"
            },
            "BudgetYearThree": {
                "val": "23.784"
            },
            "BudgetYearFour": {
                "val": "24.139"
            },
            "BudgetYearFive": {
                "val": "24.768"
            }
        },
        "ProgramElementNote": {
            "val": "FY15 increases for Soldier sensory performance, training effectiveness and Soldier system architecture research."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) conducts applied research on aspects of human factors engineering that impact the capabilities of individual and teams of Soldiers operating in complex, dynamic environments.  The results of the research will enable maximizing the effectiveness of Soldiers and their equipment for mission success.  The aspects of human factors that will be studied include sensing, perceptual and cognitive processes, ergonomics, biomechanics and the tools and methodologies required to manage interaction within these areas and within the Soldiers' combat environment.  Project H70 research is focused on decision-making; human robotic interaction; crew station design; improving Soldier performance under stressful conditions such as time pressure, information overload, information uncertainty, fatigue, on-the-move and geographic dispersion; and enhancing human performance modeling tools.   \n\nWork in this project leverages basic research performed in PE 0601102A (Defense Research Sciences), and complements and is fully coordinated with PE 0602601A (Combat Vehicle and Automotive Advanced Technology), PE 0602786A (Warfighter Technology), PE 0602120A (Sensors and Electronic Survivability), PE 0602784A (Military Engineering Technology), PE 0602783A (Computer and Software Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0602785 (Manpower\/Personnel\/Training Technology), PE 0603005A (Combat Vehicle and Automotive Technology), PE 0603710A (Night Vision Advanced Technology), PE 0603015A (Next Generation Training and Simulation), and PE 0603007A (Manpower, Personnel, and Training Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.872"
                },
                "CurrentYear": {
                    "val": "21.339"
                },
                "BudgetYearOne": {
                    "val": "20.988"
                },
                "BudgetYearOneBase": {
                    "val": "20.988"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.161"
                },
                "CurrentYear": {
                    "val": "21.328"
                },
                "BudgetYearOne": {
                    "val": "23.783"
                },
                "BudgetYearOneBase": {
                    "val": "23.783"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.711"
                },
                "CurrentYear": {
                    "val": "-0.011"
                },
                "BudgetYearOne": {
                    "val": "2.795"
                },
                "BudgetYearOneBase": {
                    "val": "2.795"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.049"
                    },
                    "CurrentYear": {
                        "val": "-0.011"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.113"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.795"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.795"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.549"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H70"
                    },
                    "ProjectTitle": {
                        "val": "Human Fact Eng Sys Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.161"
                        },
                        "CurrentYear": {
                            "val": "21.328"
                        },
                        "BudgetYearOne": {
                            "val": "23.783"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.783"
                        },
                        "BudgetYearTwo": {
                            "val": "23.822"
                        },
                        "BudgetYearThree": {
                            "val": "23.784"
                        },
                        "BudgetYearFour": {
                            "val": "24.139"
                        },
                        "BudgetYearFive": {
                            "val": "24.768"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on human factors to maximize the effectiveness of Soldiers in concert with their equipment.  The resulting data are the basis for weapon systems and equipment design standards, guidelines, handbooks, and Soldier training as well as manpower requirements to improve equipment operation and maintenance.  Application of this research will yield reduced workload, fewer errors, enhanced Soldier protection, user acceptance, and allows the Soldier to extract the maximum performance from the equipment.  \n\nMajor efforts research sources of stress, potential stress moderators, and intervention methods, and identify and quantify human performance measures and methods to address current and future warrior performance issues.  Individual efforts exploit adaptive learning methods and strategies, enhance and validate human performance modeling tools; investigate integration of advanced concepts in crew stations designs, optimizes interfaces for information systems and improves human robot interaction (HRI) in a full mission context.\n\nEfforts in this program element support the Army science and technology Soldier portfolio.\n\nResults of these efforts are transitioned to the Research, Development, and Engineering Centers, the Program Executive Offices (PEO) & Program Managers, U.S. Army Training and Doctrine Command (TRADOC), U.S. Army Medical Command (MEDCOM), Manpower and Personnel Integration (MANPRINT) G1, U.S. Army Test and Evaluation Command (ATEC), etc.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the U.S. Army Research Laboratory (ARL), Aberdeen, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interfaces for Collaboration and Decision Making"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY14, the title of this effort is renamed from Adaptive Learning Methods and Strategies to Interfaces for Collaboration and Decision Making to more accurately reflect the current nature of the project.  This effort looks at the study of how networks influence, and are influenced by, human behavior in the context of military decision making. The studies, which range from computational modeling, to networked simulations in a laboratory environment, to large-scale simulation exercises, will investigate the effects of technology on information flow, cognitive workload, team collaboration, organizational effectiveness, situational awareness, and decision making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.238"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to focus efforts on the data rich environment of command and control (C2) planning and execution; enhanced FY12 methods\/tools by investigating mission context data aggregation and alert capabilities; investigated and designed user personalization alternatives and techniques for decision-specific queries, summarization, and extraction; refined human-in-the-loop evaluation methods; and established initial evaluation criteria for human decision making and collaboration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.359"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Concentrate on influencing network-enabled operations at the Company level; assess mission command work\/information flow, network knowledge requirements, cognitive workload, situation awareness, and unit performance; develop and validate a cognitive work analysis\/computational model of the Company Intelligence Support Team and its relationship to Company planning, execution and Commander's decision-making; assess networked handheld decision support tools; continue development and validation of key models (Social Network Analysis, Command, Control and Communication Techniques for Reliable Assessment of Concept Execution (C3TRACE), and Chemical Warfare Agents) of the evolving mission command work domain; support Mission Command Battle Lab network simulation exercises."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.361"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.361"
                                            },
                                            "Text": {
                                                "val": "Will examine communication capabilities of small team operations at the \"edge\" of the battlefield, with a focus on the effectiveness of different types of interfaces and (information) presentation techniques; and enhance experimental platforms for studying mission command network operations in civil-military scenarios.  Goals are to develop techniques for improved information sharing, more effective use of available information, and new and enhanced metrics and methods leading to a better understanding of how human-network interactions impact distributed team performance.  Research will be conducted via human-system information flow modeling, lab, simulation, and field experimentation using novel information and collaboration technologies in realistic networked environments with teams ranging from squads to command headquarters sizes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Performance Modeling"
                                    },
                                    "Description": {
                                        "val": "Enhance human performance modeling tools to reduce workload and human errors and increase user acceptance of developing technologies allowing the Soldier to extract the maximum performance from the equipment.  Collect and analyze empirical data on human perception (vision and hearing) to support human and system performance models used for equipment design and training.  Efforts are coordinated with PE 0602786\/project H98."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.960"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed a theory-based decision quality metric for the Command, Control, and Communications module for future evaluations of decision effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.531"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Collect and analyze empirical data to support human and system performance models used for equipment design and training; continue to investigate the effects of physical and cognitive stress on Soldier performance, and transition results to Soldier performance models; investigate Soldier load physical and cognitive algorithms developed in FY13 and their application to the human performance models; and examine human performance as a function of cognitive stress, weapon system dynamics, load distribution, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.521"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.521"
                                            },
                                            "Text": {
                                                "val": "Will develop Human System Integration (HSI) tools and methodologies to quantify the usability of systems developed to support team environments.  These tools will provide quantitative data that can be used to support acquisition and design trade off decisions.  Research will be conducted using findings from human sciences, algorithm development, field trials with military use cases, and feedback from the research, military, analyst, and system design and development communities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Brain-Computer Interaction"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY14, this effort is renamed from Interfaces for Vehicle and Mobility Systems to Brain-Computer Interaction Technologies to more accurately reflect the nature of the project, a 6.2 program in neuroscience.  Investigate the use of neurophysiological and behavior-based technologies for enhancing the interaction between Soldiers and systems such as autonomous systems and advanced crew stations. Implement guidelines for: algorithms for characterizing Soldier brain activity in operational contexts; real-time techniques to integrate neurally-based information into systems designs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.040"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Utilized cognitive state modeling and simulation efforts to enhance Soldier-system performance by investigating cognitive state and performance levels using emerging brain-computer neuro-technologies for future applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.280"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop mitigation techniques for enhancing Soldier-system performance that can be triggered by on-line brain-computer neuro-technologies that predict deficits in Soldier cognitive state and performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.278"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.278"
                                            },
                                            "Text": {
                                                "val": "Will develop and mature brain-computer interaction technology for image analysis that is capable of adapting to the user for increased joint Soldier-system performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Soldier Performance"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY14, this effort is renamed from Improved Man Machine Interfaces to Dismounted Soldier Performance in order to more accurately reflect the nature of the project.  Investigate equipment design standards and human performance measures and create guidelines for maneuver team information systems solutions that improve situational understanding and decision cycle time; identify, mature, and quantify human performance limitations to address future warrior performance issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.697"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Examined measures and methods to assess the effects and impact of recoil and recoil mitigation devices on Soldier shooting performance; and conducted applied research and analysis on the effects of physical and cognitive loads on Soldier performance for step-wise improvements in equipment design that will contribute incrementally to lightening the Soldier load."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.360"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research and analysis on the effects of physical and cognitive loads on Soldier performance for step-wise improvements in equipment design that will contribute incrementally to lightening the Soldier load; characterize effects of weapon recoil on shooting performance by refining multivariate techniques\/analyses regarding marksmanship performance; and transition results to Army Marksmanship Unit."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.354"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.354"
                                            },
                                            "Text": {
                                                "val": "Will expand applied research and analysis on the effects of physical and cognitive loads on Soldier performance to more operationally relevant environments; determine and mature  guidelines for equipment developers and the Research and Development Centers that will lighten the Soldier physical, sensory and cognitive burden and enhance Soldier and small team performance; apply techniques developed for quantifying the effects of weapon recoil on shooter performance to a broader area of research (such as the effects of small arms equipment on marksmanship performance); and transition results to the U.S. Army Marksmanship Unit."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human-Robot Interaction (HRI)"
                                    },
                                    "Description": {
                                        "val": "Develop human-centered design requirements and technologies for supervision and Soldier interaction with multiple semi-autonomous unmanned vehicles in urban and unstructured environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.120"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported FY13 capstone field assessments by designing experiments to measure and assess local situational awareness for assisted mobility and Soldier monitoring technologies; and conducted modeling and simulation studies to examine manned-unmanned teaming concepts to create measures and methods for assessing current and future technology capabilities needed to provide manned-unmanned teaming capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.577"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to focus on human-robot interaction by examining such issues as Soldier-robot interaction modes, communication, situation awareness, trust and transparency in coordination with the ARL autonomous systems enterprise partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.247"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.247"
                                            },
                                            "Text": {
                                                "val": "Will continue to focus on human-robot interaction by examining such issues as Soldier-robot interaction modes, communication, situation awareness, trust and transparency in coordination with the ARL Autonomous Systems Enterprise partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding Socio-cultural Influence"
                                    },
                                    "Description": {
                                        "val": "Investigate and model cognitive aspects of socio-cultural influences on Soldier\/Commander decision making and communication to enhance Soldier performance with systems, within teams and in the mission context. Extend models of individual and teams to societal levels to support regional understanding, training, mission rehearsal, and influence.  This work complements and is coordinated with PE 0602784\/project T41 (Socio-Cultural Modeling) and PE 0602785\/project 790 (Leader Development)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.157"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed the potential impact to Soldier\/Commander decision making and communication using the FY12-developed cognitive framework and began validation and verification of models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.221"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop proof-of-concept decision support tools that effectively present relevant socio-cultural information to the Soldier\/Commander to enhance Soldier\/Commander decision making in diverse environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.022"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.022"
                                            },
                                            "Text": {
                                                "val": "Will validate cognitive framework and proof of concept decision support tools; develop guiding principles for the presentation of socio-cultural information using validated cognitive framework; initiate extension of cognitive framework to encompass societal-level perspective leveraging historical OSD-investments; and determine experiment requirements for validation of extension."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Incorporating MANPRINT Considerations Early in the Acquisition Process"
                                    },
                                    "Description": {
                                        "val": "Develop system-relevant human performance and human-system interaction requirements for inclusion early in acquisition to ensure that human-system capabilities and limitations are properly reflected and that their associated cost, benefits, and risks are considered during analysis of alternatives when making trade-offs among effectiveness, suitability, and life-cycle costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.949"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed methodologies (e.g., predictive, model-based methods, methods to harvest human system integration lessons learned from current system acquisition programs) to incorporate MANPRINT considerations in the system acquisition process pre-Milestone A and B; applied promising methodologies to test case scenarios for selected acquisition programs; and developed measures to assess the return on investment (ROI) for applying chosen methodologies earlier in the acquisition process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Apply promising methodologies to test case scenarios for selected acquisition programs; and calculate the return on investment realized by incorporating MANPRINT considerations early in the acquisition process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training Effectiveness Research"
                                    },
                                    "Description": {
                                        "val": "Novel technologies and their implementation in Army systems may result in demands on Soldiers that exceed their knowledge, skill, or memory capacity.  When demands cannot be remediated by human systems integration, training may enable the demands to be met.  This effort will identify human operator tasks in complex, intelligent, and emerging systems critical to mission employment of new technologies.  The aspects (particularly knowledge and skill) of those tasks will be determined through experimentation and analysis to inform development of training and simulation technologies, fundamental research on the effectiveness of training regimes, and simultaneous task combinations that must be trained."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will investigate emerging technologies and target those likely to place significant demands on human operators, in particular intelligent, decision-aiding, and autonomous systems for which transparency and trust are crucial; conduct analyses of two emerging or projected technologies in the context of mission performance to determine combinations of tasks, such as, those resulting from use of the emerging technology and those from legacy systems, those requiring understanding of dynamic system models, required for mission performance; and conduct research on task combinations to determine parameters that may inform the development of training technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier System Architecture"
                                    },
                                    "Description": {
                                        "val": "Soldier performance is affected by mission demands, environment, human characteristics, equipment, and technology.  System development requires considering tradeoffs among these factors and sufficient data about them on which to base analyses. This effort will identify and develop human performance measures of effectiveness and performance (MOEs and MOPs) critical to performing individual and team tasks in a mission text.  Empirical data will be mined from existing sources or collected where gaps exist to inform the interaction among factors affecting Soldier mission performance for emerging technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to identify relative contributions and interactions of factors critical to Soldier and team system performance; work within Human Systems community to identify and prioritize critical human performance MOEs and MOPs; conduct research to support development of high priority measures not supported by sufficient empirical data involving interaction among factors such as mission demands, environment, human characteristics, equipment and technology; and propose modifications to individual measures to account for small team performance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}