{
    "id": "7aae7e22685848293d1f1bb89b2f013e359acc84",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DLA_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603720S"
        },
        "ProgramElementTitle": {
            "val": "Microelectronics Technology Development and Support  (DMEA)"
        },
        "R1LineNumber": {
            "val": "57"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "86.881"
            },
            "PriorYear": {
                "val": "56.637"
            },
            "CurrentYear": {
                "val": "82.700"
            },
            "BudgetYearOne": {
                "val": "72.144"
            },
            "BudgetYearOneBase": {
                "val": "72.144"
            },
            "BudgetYearTwo": {
                "val": "69.161"
            },
            "BudgetYearThree": {
                "val": "71.702"
            },
            "BudgetYearFour": {
                "val": "72.512"
            },
            "BudgetYearFive": {
                "val": "73.433"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Department has found it critical to National Security to maintain an ability to produce legacy microelectronics long after they are available from commercial foundries which move to more advanced technology levels based upon the global market. The Defense Microelectronics Activity (DMEA) uniquely accomplishes this mission for the Department by providing both a trusted and assured supply of microelectronics parts that are no longer available from, or bid by, commercial sources but are essential to combat operations. This is a critical capability in an atmosphere of increasing worldwide supply chain risks with threats to defense microelectronics. The threats include risks, such as, counterfeiting, Trojan horses, unreliability and rapid obsolescence coming from an unpredictable and unsecure supply chain. As fiscal pressures force the Department to maintain its weapon systems longer than originally planned and their extended combat use increases attrition, the need for DMEA’s unique capabilities increases.\n\nMicroelectronics is a crucial technology and central for all operations within the Department. Yet, as vital as this technology is to Department operations, the defense market represents less than 0.1% share of the total global semiconductor market. The Department frequently requires legacy microelectronics long after commercial foundries have moved on to advanced technology levels. As such, the semiconductor industry does not respond to the Department’s unique needs of ultra-low volumes, long availability time frames, or its high-level security concerns. In these cases, DMEA procures a license to produce technologies in-house that are no longer commercially manufactured or are unavailable due to no-bids owing to low volume requirements. These licenses enable DMEA to be the Department’s microelectronics supplier of last resort, providing the Department with a long-term, trusted, and assured source.\n\nDMEA provides increasingly rare microelectronics design and fabrication skills to ensure that the Department is provided with systems capable of ensuring technological superiority over potential adversaries. DMEA provides decisive, quick turn solutions for defense, intelligence, special operations, cyber and combat missions as well as microelectronic components that are unobtainable in the commercial market. DMEA’s knowledge of varying military requirements across a broad and diverse range of combatant environments and missions—along with its unique technical perspective—allows it to develop, manage and implement novel microelectronic solutions to enhance mission capability. DMEA can then use these cutting-edge technology capabilities and products in the solutions it develops for its military clientele. After many years of performing analogous efforts, the technical experience, mission knowledge, and practical judgment that are gained from preceding efforts are often incorporated into subsequent technology maturation projects. DMEA’s capabilities make it a key tool in the intelligent and rapid development and application of advanced technologies to identified military needs.\n\nWorking alongside industry, DMEA has created a model partnership that provides this capability for the Department. DMEA’s unique flexible foundry supports the Department with a wide variety of integrated circuits using various processes that were developed by commercial manufacturers and which are now assured to remain in one location for as long as they are needed. To obtain these processes, DMEA works closely with U.S. semiconductor industry partners to acquire process licenses. These Government-held licenses allow for the transfer to DMEA of industry-developed intellectual property (IP) and the related processes for Department needs. These licenses ensure no commercial conflicts by including industry’s right to bid first on resulting production volumes. DMEA always looks to industry first to see if it can provide the required components. If not, only then does DMEA provide the necessary prototypes and low volume production. A critical element required to make this business model work effectively is protection of the industry partners’ valuable IP and processes. DMEA is Government owned and operated, providing the structure and confidence that an industry partner’s IP is protected from potential competitors. This strategic and cooperative industry partnership approach allows DMEA to use industry-developed IP and processes by acquiring, installing, and applying them toward meeting the immediate and long-term needs of the Department. This unique capability is essential to all major weapon systems, combat operations, and support needs. As such, DMEA serves the Department, other US Agencies, industry and Allied nations.\n\nDMEA assists hundreds of programs every year. DMEA has provided its unique engineering assistance and capabilities to older systems, current systems, and even to programs not yet in the production phase. This includes the F-18 Super Hornet, F-22 Raptor, F-35, RQ-4 Global Hawk, MQ-9 Reaper, AEGIS Advanced Surface Missile System, Advanced Medium-Range Air-to-Air Missile (AMRAAM), Evolved Sea Sparrow Missile (ESSM), among many other programs. DMEA assists the Combatant Commands (COCOMs) including Special Ops, Cyber, Intelligence, and the Radiation-Hard communities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "62.234"
                },
                "CurrentYear": {
                    "val": "82.700"
                },
                "BudgetYearOne": {
                    "val": "72.144"
                },
                "BudgetYearOneBase": {
                    "val": "72.144"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "56.637"
                },
                "CurrentYear": {
                    "val": "82.700"
                },
                "BudgetYearOne": {
                    "val": "72.144"
                },
                "BudgetYearOneBase": {
                    "val": "72.144"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.597"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.121"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.378"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.902"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Sequestration: -$5.378M\n\nThe Microelectronics Technology Development and Support (MTDS) PE budget decreased in FY2015 due solely to the imposition of sequestration reductions at 13.5%.  Reductions were made in both the MTDS Project and the Trusted Foundry Project.  The MTDS Project sequestration reductions will delay and complicate the recapitalization and modernization of DMEA’s infrastructure.  Trusted Foundry Project sequestration reductions will impact the availability of leading edge technologies and other key specialty processes and the line of trusted catalog components, including FPGAs, that are required by DoD programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "53.689"
                        },
                        "PriorYear": {
                            "val": "23.299"
                        },
                        "CurrentYear": {
                            "val": "47.968"
                        },
                        "BudgetYearOne": {
                            "val": "44.946"
                        },
                        "BudgetYearOneBase": {
                            "val": "44.946"
                        },
                        "BudgetYearTwo": {
                            "val": "40.479"
                        },
                        "BudgetYearThree": {
                            "val": "41.966"
                        },
                        "BudgetYearFour": {
                            "val": "42.437"
                        },
                        "BudgetYearFive": {
                            "val": "42.870"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "With the increase in worldwide asymmetrical operations requiring quick turn, ultra-low volumes and complete trust along with the extension of life for the major weapon systems in all Services, DMEA’s unique-in-the-world capability has experienced significant growth in utilization over the last six years. Although DMEA’s Technology Development budget has remained steady (with a minor economic growth factor) during that time, DMEA’s support for the Department has increased 19.5% per annum over the same period. In order to fund these steadily growing requirements, DMEA has delayed or foregone many basic infrastructure updates, scheduled equipment replacements, and the acquisition and implementation of the IP that is needed to continue to support the Department. This increased budget for DMEA Technology Development extends DMEA’s current capabilities to meet the increased demand and keep pace with the rapid pace of microelectronic technologies.\n\nThe Microelectronics Technology Development and Support funds provide DMEA with the core resources to execute its primary mission of providing an in-house ability to quickly develop and execute appropriate solutions to keep a system operational, elevate the sophistication level or to meet new threats. These solutions include producing high mix, low volume, unique microelectronics that are endemic to military requirements and are not commercially available. These funds provide for the development and support necessary to ensure rapid prototyping, insertion, and support of microelectronics technologies into fielded systems, particularly as the technologies advance. DMEA maintains critical microelectronics design and fabrication skills to ensure that the Department is provided with systems capable of ensuring technological superiority over potential adversaries. DMEA provides an in-house capability to support these strategically important microelectronics technologies within the Department with distinctive resources to meet the Department’s requirements across the entire spectrum of technology development, acquisition, and long-term support. This includes producing components to meet the Department’s requirements for ultra-low volume, an extended availability timeframe, and a trusted, assured, and secure supply of microelectronics. These funds provide basic infrastructure updates as well as an in-house technical staff of skilled and experienced microelectronics personnel working in state-of-the-practice facilities providing technical and application engineering support for the implementation of advanced microelectronics research technologies from reverse engineering through design, fabrication, test, assembly, integration and installation. These funds also provide for the recapitalization and modernization of aging microelectronic infrastructure, acquisition and implementation of design and test tools, the development of advanced techniques to reverse engineer circuits, the adaptation of tools and processes to detect increasingly sophisticated counterfeit microelectronics in the defense supply chain, the development of trusted field programmable gate arrays (FPGAs), and the extension of the process technologies that are necessary to keep pace with the needs of defense customers as weapon system support requirements migrate toward current state-of-the-art technologies. DMEA’s capabilities make it a key resource in the intelligent and rapid application of advanced technologies to add needed performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems. DMEA designs, develops, and supports vital classified assets for ongoing and time-sensitive specialized intelligence operations and missions of the Department and the Special Operations Commands. DMEA will comply with DoD Strategic Objective 3.5-2D for any demonstration programs at DMEA.\n\nToday’s weapon systems experience extended field operations and\/or are required to remain in service beyond planned replacements, driving the need for growth in DMEA’s unique capabilities. This need, along with the continual contraction of commercial resources, makes DMEA the only available resource allowing these systems to remain operational. As such, DMEA and its capability are considered a National Critical Asset."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technology Development Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.299"
                                            },
                                            "Text": {
                                                "val": "DMEA designed, developed, and demonstrated microelectronics concepts, advanced technologies, and applications to solve operational problems. DMEA applied advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems. DMEA accredited 14 new trusted sources and the ARMS foundry provided a contingency means to ensure DoD can acquire critical trusted integrated circuits in a variety of process technologies and geometry node-sizes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "47.968"
                                            },
                                            "Text": {
                                                "val": "DMEA will continue to design, develop, and demonstrate microelectronics concepts, advanced technologies, and applications to solve operational problems. DMEA will apply advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems. The increased missions seen in the last several years by Combatant Commands (COCOMs) and Special Operations have caused those organizations to dramatically increase their demands for DMEA’s unique capability to provide quick technical solutions to immediate operational needs. To meet these increases, DMEA will add capacity and capability by recapitalizing and modernizing aging microelectronic infrastructure, extending and upgrading process IP, developing advanced techniques to reverse engineer circuits, adapting tools and processes to detect increasingly sophisticated counterfeit microelectronics to ensure a secure supply chain, and developing trusted field programmable gate arrays (FPGAs), all to meet quick turn solutions on which COCOMs and Special Operations can rely."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "44.946"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "44.946"
                                            },
                                            "Text": {
                                                "val": "DMEA will continue to design, develop, and demonstrate microelectronics concepts, advanced technologies, and applications to solve operational problems. DMEA will apply advanced technologies to add performance enhancements in response to the newest asymmetric threats and to modernize aging weapon systems. The increased missions seen in the last several years by Combatant Commands (COCOMs) and Special Operations have caused those organizations to dramatically increase their demands for DMEA’s unique capability to provide quick technical solutions to immediate operational needs. To meet these increases, DMEA will add capacity and capability by recapitalizing and modernizing aging microelectronic infrastructure, extending and upgrading process IP, developing advanced techniques to reverse engineer circuits, adapting tools and processes to detect increasingly sophisticated counterfeit microelectronics to ensure a secure supply chain, and developing trusted field programmable gate arrays (FPGAs), all to meet quick turn solutions on which COCOMs and Special Operations can rely.  However, the proposed annual reductions to DMEA’s budget will delay and complicate the recapitalization and modernization of DMEA’s infrastructure.  DMEA modernization is critical to keep pace with the evolving long-term technical support requirements of DoD’s major weapon systems.  Delaying modernization will negatively impact DMEA’s historically impressive responsiveness and result in troubled weapon systems staying in mission incapable status for prolonged periods of time.  The inability of programs to resolve their technical issues “surgically” at DMEA, may force them to adopt higher level solutions at higher cost. Therefore, as vital as this DMEA infrastructure is currently, as the overall Department funding is reduced, the capability and responsiveness provided by this organization becomes more essential.   These proposed reductions will not only cause the deferral of all further increases in workload, but will likely reduce the ability to provide specialized support to current clients."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2"
                    },
                    "ProjectTitle": {
                        "val": "Trusted Foundry"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "33.192"
                        },
                        "PriorYear": {
                            "val": "33.338"
                        },
                        "CurrentYear": {
                            "val": "34.732"
                        },
                        "BudgetYearOne": {
                            "val": "27.198"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.198"
                        },
                        "BudgetYearTwo": {
                            "val": "28.682"
                        },
                        "BudgetYearThree": {
                            "val": "29.736"
                        },
                        "BudgetYearFour": {
                            "val": "30.075"
                        },
                        "BudgetYearFive": {
                            "val": "30.563"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department and the National Security Agency (NSA) require uninterruptible access to state-of-the-art design and manufacturing processes to produce custom integrated circuits designed specifically for military purposes. Under DODI 5200.44, Application Specific Integrated Circuits (ASICs) in critical\/essential systems need to be procured from Trusted sources in order to avoid tampered or sabotaged parts. Worldwide competition from foreign, state-subsidized manufacturing facilities (foundries) is making fabless semiconductor companies the norm in the U.S. Sophisticated off-shore design and manufacturing facilities with economic incentives of state subsidies have resulted in outsourcing of electronics component and integrated circuit services to offshore facilities. These trends threaten the integrity and worldwide leadership of the U.S. semiconductor industry by eliminating many domestic on-shore suppliers and reducing access to Trusted fabrication sources for advanced technologies. These trends are of acute concern to the defense and intelligence community. Secure communications and cryptographic applications, among other defense applications depend heavily upon high performance semiconductors where a generation of improvement can translate into a significant force multiplier and capability advantage. Important defense technology investments and demonstrations carry size, weight, power, and performance goals that can only be met through the use of the most sophisticated semiconductors.\n\nThe Trusted Foundry program provides the Department and NSA with access to the Trusted state-of-the-art microelectronics design and manufacturing capabilities necessary to meet the confidentiality, integrity, availability, performance and delivery needs of their customers. The program also provides the Services with a competitive cadre of accredited Trusted suppliers that can meet the needs of their mission critical\/essential systems for Trusted integrated circuit components. The NSA Trusted Access Program Office, has successfully contracted with commercial sources to satisfy their state-of-the-art semiconductor requirements. It is imperative for a wide range of technologies in ongoing and future Department\/ and NSA systems that access to Trusted suppliers continues. Most importantly, Trusted Foundry access is absolutely necessary to meet secure communication and cryptographic needs requiring state-of-the-art semiconductor technologies\n."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Trusted Foundry"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "33.338"
                                            },
                                            "Text": {
                                                "val": "Co-funded with the NSA a new contract to provide Trusted access to state-of-the-art microelectronics technologies for DoD and NSA needs. Continued the development of a capability for the reverse engineering of application-specific integrated circuits (ASICs) and refined methods for improved efficiency, accuracy, and applicability to multiple processes. Enhanced the cadre of trusted suppliers for the critical trusted components and services needed for appropriate defense systems. Enhanced Trusted\nFoundry products to include key specialty processes requested by DoD programs, such as high voltage, extreme environments, and embedded non-volatile memory. Enhanced trusted design activities to encompass new processing capabilities. Expanded a line of trusted catalog components that can be purchased by Defense contractors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.732"
                                            },
                                            "Text": {
                                                "val": "Continue the development of a capability for the reverse engineering of application-specific integrated circuits (ASICs) and continuously refine the utilized methods for efficiency, accuracy, and applicability to multiple processes. Enhance the cadre of trusted suppliers for the critical trusted components and services needed for appropriate defense systems. Enhance Trusted Foundry products to include newly available leading edge technologies and other key specialty processes required by DoD programs. Enhance trusted design activities to encompass new processing capabilities. Expand a line of trusted catalog components, possibly including Field Programmable Gate Arrays (FPGAs), that can be purchased by Defense contractors.  Continue activities that ensure the DoD has Trusted Access to leading edge semiconductor technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.198"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.198"
                                            },
                                            "Text": {
                                                "val": "Continue the development of a capability for the reverse engineering of application-specific integrated circuits (ASICs) and continuously refine the utilized methods for efficiency, accuracy, and applicability to multiple processes.  Enhance the cadre of trusted suppliers for the critical trusted components and services needed for appropriate defense systems.  Enhance Trusted Foundry products to include newly available leading edge technologies and other key specialty processes required by DoD programs.  Expand a line of trusted catalog components, possibly including FPGAs that can be purchased by Defense contractors.  Continue activities that ensure the DoD has Trusted Access to leading edge semiconductor technologies.  However, the proposed annual reductions to DMEA’s budget will delay and complicate the availability of leading edge technologies and other key specialty processes and the line of trusted catalog components, including FPGAs, required by DoD programs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}