{
    "id": "862cb9d01636b377d6452446210810b44e275d59",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA5_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604214N"
        },
        "ProgramElementTitle": {
            "val": "AV-8B Aircraft - Engine Dev"
        },
        "R1LineNumber": {
            "val": "88"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "287.345"
            },
            "PriorYear": {
                "val": "16.128"
            },
            "CurrentYear": {
                "val": "33.325"
            },
            "BudgetYearOne": {
                "val": "25.372"
            },
            "BudgetYearOneBase": {
                "val": "25.372"
            },
            "BudgetYearTwo": {
                "val": "48.325"
            },
            "BudgetYearThree": {
                "val": "22.693"
            },
            "BudgetYearFour": {
                "val": "17.358"
            },
            "BudgetYearFive": {
                "val": "17.701"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The program provides for AV-8B Design, Development, Integration and Test of various platform improvements such as: Engine Life Management Program (ELMP), Escape Systems, Joint Mission Planning System (JMPS), and Block upgrades to various mission systems, communications systems, navigation equipment, weapons carriage and countermeasures, and the Obsolescence Replacement (OR)\/Readiness Management Plan (RMP) including structural, hydraulic, electrical, environmental, and mechanical systems.  The JMPS is required as part of the DON directed migration to a common Navy and Marine Corps mission planning system.  OR\/RMP represents all engineering activities for development and design to support aircraft safety flight clearances, concept explorations, and developments to support POM objectives.  The program's Evolutionary Acquisition Strategy includes Design, Development, Integration and Test activities under the consolidated effort of Block Developments: H6.1, H6.2 and follow-on block upgrades, to include a block upgrade that will be required to implement Link 16 capability.  The H6.1 update will provide enhancements and software corrections that improve the AV-8B platform combat effectiveness, survivability, and relevance through avionics processor upgrades, mission planning updates, and Litening Operational Flight Program.  A H6.2 update, accomplished by the Common Avionics Program, provides AV-8B a self-contained Global Positioning System (GPS) navigation capability that is required to access preferred airspaces.  AV-8B funding supports peculiar flight test requirements. The Link 16 integration effort, which will require an Operational Flight Program (OFP) upgrade beyond H6.2, will provide interoperability, combat identification, situational awareness, and information sharing. Connection to the Link-16 network is vital to the AV-8B's ability to operate within some Command and Control situations and Operational Plans, as designed today, as well as provide a tactical capability for the more effective and safe prosecution of both airborne and ground targets. Continued AV-8B combat relevance through 2030 is critical to the MAGTF's ability to generate aviation combat power throughout the transition to F-35B. J-series, K-series, TTNT, and other emerging datalink technology messages are required to support current and future mission threads. Linked performance on par with current tactical platforms as well as design to communicate with F-35 is required for the AV-8B to remain tactically relevant to sundown.  The ELMP is a comprehensive plan to increase safety of flight and operational readiness of the AV-8B F402-RR-408 Engine and accessories.  PMA-257 will accomplish this mission by conducting Engineering Project Description investigations and performing a series of planned Endurance Tests to derive engineering improvements to the engine.  The OR\/RMP is required to ensure the AV-8B air vehicle's sustained mission  availability, and safe and reliable operational readiness until end of service.  Air vehicle sustainment requires component and system analyses, technical planning, identification, prioritization, and diagnosis of emergent  problems and the allocation of resources for the development, testing and flight clearance of engineering solutions in the areas of flight, crew safety, and escape systems and structural integrity, obsolescence, systems reliability and maintainability, inventory preservation, alternative mission development, or other emergent material or equipment conditions affecting AV-8B systems readiness.  Activities include research\/analysis for system safety deficiency corrections, fuel system safety improvements, structural analyses, monitoring and integrity analysis, component obsolescence analyses and mitigation development, explorations for aging equipment, reliability improvement analyses and design developments.   FY15 continues development efforts and associated obsolescence and readiness requirements for ELMP, RMP and Operational Flight Program updates."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.789"
                },
                "CurrentYear": {
                    "val": "35.825"
                },
                "BudgetYearOne": {
                    "val": "15.000"
                },
                "BudgetYearOneBase": {
                    "val": "15.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.128"
                },
                "CurrentYear": {
                    "val": "33.325"
                },
                "BudgetYearOne": {
                    "val": "25.372"
                },
                "BudgetYearOneBase": {
                    "val": "25.372"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-16.661"
                },
                "CurrentYear": {
                    "val": "-2.500"
                },
                "BudgetYearOne": {
                    "val": "10.372"
                },
                "BudgetYearOneBase": {
                    "val": "10.372"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-2.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.738"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "5.462"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.462"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.910"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.910"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.670"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Directed Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-15.254"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Cost: FY13 reduction reflects sequestration, Congressional general reductions and reduction for excess Flight Control Computer funding. \n\nTechnical: All H6.1 and H6.1.1 OFP capabilities have been consolidated into a single Fleet release of H6.1 on H6.1.1 schedule. \n\nSchedule: \nAcquisition Milestones for H6.1.1 have been removed due to consolidating all H6.1 and H6.1.1 capabilities into a single release of H6.1, H6.1DT\/IT, H6.1 software delivery.\n\nH6.1: IOC date has moved to 2Q FY15; development completion date has moved to 2Q 2014; DT\/IT completion date has moved to 1Q FY15; software delivery date has moved to 2Q FY15. \n\nH6.2: IOC date has moved to 4Q FY17; development completion date has moved to 4Q FY16; DT\/IT completion date has moved to 3Q FY17; and software delivery date has moved to 4Q FY17.\n\nRadar Display Computer (RDC) IOC has moved to 4Q FY15 due to negotiated contract delivery schedule.\n\nRMP flight test (RMP FT) completion has moved to 4Q FY16 due to availability of test aircraft for fatigue life expended data acquisition. The extended flight test time period accounts for FY15 test of RMP brake temperature monitoring system and GR-9 component compatibility flight test.\n\nLow Pressure Compressor (LPC-1) Qual Test deferred to 4Q FY14 due to material availability and additional requirements to complete test. \n\nLow Pressure Compressor (LPC-1) Qual Test Report has moved to 4Q FY14 due to test completion delay."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0652"
                    },
                    "ProjectTitle": {
                        "val": "AV-8B"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "287.345"
                        },
                        "PriorYear": {
                            "val": "16.128"
                        },
                        "CurrentYear": {
                            "val": "33.325"
                        },
                        "BudgetYearOne": {
                            "val": "25.372"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.372"
                        },
                        "BudgetYearTwo": {
                            "val": "48.325"
                        },
                        "BudgetYearThree": {
                            "val": "22.693"
                        },
                        "BudgetYearFour": {
                            "val": "17.358"
                        },
                        "BudgetYearFive": {
                            "val": "17.701"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program provides for AV-8B Design, Development, Integration and Test of the following improvements:  The Engine Life Management Program (ELMP),Operational Flight Programs (OFPs)and Avionics Integration, Escape System, and Readiness Management Plan (RMP). The ELMP is a comprehensive plan to increase safety of flight and operational readiness of the AV-8B F402-RR-408 Engine and Gas Turbine Starter, as well as other critical engine components. The Program Office will accomplish this mission through the Component Improvement Program, which entails Engineering Project Description investigations and a series of planned Endurance Tests to derive safety and reliability improvements to the engine and engine components. The Joint Mission Planning System is required as part of the Department of Navy directed migration to a common Navy and Marine Corps mission planning system. H6.1 provides enhancements and software corrections, and H6.2 (Common Avionics Program) provides GPS navigation capabilities. HX OFP will integrate Link 16 capability. Other specific efforts include Airborne Variable Message Format Terminal. The program is working closely with the Common Avionics program and the Allies (Spain and Italy) on all efforts. RMP represents all engineering activities for development and design to support aircraft safety, flight clearance and concept exploration for resolution of emergent safety, service life, escape systems, obsolescence, and readiness issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Development of RMP Engineering Change Proposals"
                                    },
                                    "Description": {
                                        "val": "Develop obsolescence solutions to improve safety, structural integrity, and systems reliability of the AV-8B aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.757"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Development efforts began for the obsolescence mitigation for Readiness Management Plan (RMP).  Efforts were initiated for the Environmental Control System (ECS) Cold Air Unit redesign to correct a catastrophic failure mode and the Fatigue Tracking Users Program for analysis of aircraft fatigue life expended (FLE) to achieve full service life.  Funds supported emergent and ongoing efforts for system analyses, identification, and diagnosis of problems and the development and testing of engineering solutions in the areas of flight and crew safety, structural integrity, obsolescence, and systems reliability, and other material and equipment conditions affecting AV-8B systems readiness.  Additionally, the program conducted studies concerning improvements and analysis of issues including obsolescence and structural fatigue as well as conducting component obsolescence analyses including alternatives explorations and development for obsolete aging equipment, to include aircrew and environmental systems, flight controls and other safety deficiency solutions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.841"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extensions to AV-8B End of Service date require extensive obsolescence mitigation efforts to preclude aircraft on ground.  The program begun in PB13 will continue to address known, predicted, and emergent obsolescence equipment issues.  Systems engineering will support ongoing and emergent analysis and design\/development efforts required to identify Engineering Change Proposal (ECP) requirements to correct systems safety, structural integrity, and readiness issues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.265"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.265"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extensions to AV-8B End of Service date require extensive obsolescence mitigation efforts to preclude aircraft on ground.  The program begun in PB14 will continue to address known, predicted, and emergent obsolescence equipment issues.  Systems engineering will support ongoing and emergent analysis and design\/development efforts required to identify ECP requirements to correct systems safety, structural integrity, and readiness issues. Begin design of Brake Temperature monitoring system to prevent brake fires and improve safety. Begin the development of Improved Main Landing Gear strut servicing indication system to improve safety and reliability. Conduct system engineering study and design work fro Outrigger Landing Gear service indicating system to improve safety and reliability. Begin system engineering analyses and design for GR-9 component compatibility."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "F402-RR-408 Engine Safety and Reliability Enhancements"
                                    },
                                    "Description": {
                                        "val": "Improve Safety and Reliability of the F402-RR-408 Engine for the AV-8B Harrier."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.058"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Component Improvement Program (CIP) conducted investigations to develop improvements and develop design solutions for correction of deficiencies and issues resulting from safety, obsolescence and structural fatigue for the engine and accessories.  The Enhanced Variable Inlet Control Systems and several Gas Turbine Starter evaluations and improvements were accomplished. Continued redesign and obsolescence mitigation efforts through redesign and procurement of Test Cell Facilities and Support Equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.916"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The CIP will conduct investigations to develop improvements and develop design solutions for correction of deficiencies and issues resulting from safety, obsolescence and structural fatigue for the engine and accessories."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.649"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.649"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The engineering CIP will conduct investigations to develop improvements and develop design solutions for correction of deficiencies and issues resulting from safety, obsolescence and structural fatigue for the engine and accessories."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational Flight Program (OFP) and Avionics Weapons Systems Development and Integration"
                                    },
                                    "Description": {
                                        "val": "Develop Airborne Variable Message Format Terminal (AVT), formerly Strikelink\/A.  Aircraft OFP updates, mission planning updates, Litening Pod software updates,support aircraft avionics development efforts, and Link 16 integration efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.313"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completion of AVT testing, future capability expansion studies and analyses, peculiar flight test requirements, and aircraft Operational Flight Program (OFP)\/Litening Pod software updates and developmental test as part of the H6.1 block upgrade."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.568"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funds will provide for future capability expansion studies and analyses, peculiar flight test requirements, and aircraft OFP\/Litening Pod software updates and developmental test as part of the H6.1 and H6.2 block upgrades."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.458"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.458"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funds will provide for future capability expansion studies and analyses, peculiar flight test requirement, and aircraft OFP\/Litening Pod software updates and developmental test as part of the H6.2 upgrade. Begin Global Positioning System performance test in preparation for H6.2 upgrade development testing, which will require use of ranges and telemetry, and associated telemetry analysis. Begin developmental testing of second Mission Systems Computer processor card that will be used in H6.2."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APN\/0514"
                                    },
                                    "Title": {
                                        "val": "AV-8B Series Modification"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "74.933"
                                        },
                                        "CurrentYear": {
                                            "val": "96.881"
                                        },
                                        "BudgetYearOne": {
                                            "val": "65.472"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "65.472"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "41.295"
                                        },
                                        "BudgetYearThree": {
                                            "val": "38.059"
                                        },
                                        "BudgetYearFour": {
                                            "val": "35.248"
                                        },
                                        "BudgetYearFive": {
                                            "val": "36.005"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "All efforts under obsolescence replacement Readiness Management Program provide investigations and analysis of testing and flight clearance authorization necessary to assess overall system capability and integration of projects. Funding for the Engine Life Management Program will be placed on a cost-type contract to Rolls Royce to address safety of flight issues, top readiness degraders, engine removal and mission failure drivers in order to improve Fleet readiness and reduce cost of ownership. It is also developed to assess life management program issues and design fixes for any service revealed deficiencies. The program's Evolutionary Acquisition Strategy includes Design, Development, Integration and Test activity under the consolidated effort of Block Developments: H2.0, H4.0, H5.0, H6.0, H6.1, H6.2 (Common Avionics) and following systems. The development and integration of Joint Mission Planning System occurred concurrently with H2.0. H4.0 Block improvements included the Tactical Aircraft Moving Map Capability. H5.0 Block Upgrade provided Dual Mode Laser Guided Bomb, Litening Centerline\/Station 4 (improvement of current weapons carriage capability). H6.0 Block Upgrade provided ALE-47 countermeasures system integration, and weapon carriage expansion. The program is working closely with the Allies (Spain and Italy) and the Common Avionics program on H6.1 and H6.2 efforts. The H6.1 update will provide enhancements and software corrections that improve the AV-8B platform combat effectiveness, survivability, and relevance through avionics processor upgrades and Litening Common Operational Flight Program. The H6.2 update is being accomplished by the Common Avionics Program and provides a Global Positioning System Navigation capability for AV-8B. Link 16 integration will require an H.X Operational Flight Program subsequent to H6.2 and will provide the AV-8B with Link 16 capability."
                        },
                        "PerformanceMetrics": {
                            "val": "Achieve Engine Life Management Program Rolls-Royce Component Improvement Program contract award and SAFRON (formerly Goodrich) contract award 1Q FY15."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604214N_0652_FILE1.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}