{
    "id": "8e835c96ede368309359e31affd4585e408b30ba",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DTRA_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601000BR"
        },
        "ProgramElementTitle": {
            "val": "DTRA Basic Research Initiative"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "93.819"
            },
            "PriorYear": {
                "val": "40.818"
            },
            "CurrentYear": {
                "val": "45.837"
            },
            "BudgetYearOne": {
                "val": "37.778"
            },
            "BudgetYearOneBase": {
                "val": "37.778"
            },
            "BudgetYearTwo": {
                "val": "38.436"
            },
            "BudgetYearThree": {
                "val": "39.119"
            },
            "BudgetYearFour": {
                "val": "39.824"
            },
            "BudgetYearFive": {
                "val": "40.500"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Threat Reduction Agency (DTRA) safeguards America and its allies from Weapons of Mass Destruction (WMD) (chemical, biological, radiological, nuclear, and high-yield explosives) by providing capabilities to reduce, eliminate, counter the threat, and mitigate its effects.  The Basic Research Initiative program provides for the discovery and development of fundamental knowledge and understanding by research performers drawn primarily from academia and world-class research institutions in government and industry.  This leverages the Department of Defense’s (DoD) $2 billion plus annual investment in basic research by ensuring a motivation within the scientific community to conduct research benefiting WMD-related defense missions and by improving Agency knowledge of other research efforts of potential benefit to DTRA nonproliferation, counter proliferation, and consequence management efforts.  \n\nThese efforts are closely coordinated with the Chem-Bio Technology portfolio, which executes a basic research program under the joint Chem-Bio Defense Program.  Agency research interests are coordinated with those of the Defense Advanced Research Projects Agency and Service basic research programs through the Defense Basic Research Advisory Group.  DTRA reviews research interests annually to focus on technology areas not clearly addressed by other basic research efforts.\n\nThe DTRA’s Basic Research portfolio supports several National and Department initiatives directly related to countering WMD including: Office of Science and Technology Policy (OSTP) Nuclear Defense Research and Development Roadmap, FY2013-2017; Defense Budget Priorities and Choices for FY14 (2013); Countering Weapons of Mass Destruction Science and Technology Priority Steering Council Roadmap (2012); National Military Strategy (2011); and the 2010 Quadrennial Defense Review.  In general, these documents direct capability enhancements, projects and S&T that support countering WMD and reducing global nuclear dangers. Specifically they include: accelerating the development of standoff radiological\/nuclear detection capabilities; researching countermeasures and defenses to non-traditional agents; enhancing nuclear forensics; securing vulnerable materials; developing new verification technologies; developing an in-depth understanding of the capabilities, values, intent, and decision making of potential foes, whether they are states, networks, or individuals; defeating WMD agents; researching biologically-based or inspired materials for DoD applications; and leveraging science, technology, and innovation through domestic and international partnerships and agreements.  Basic research supporting all of these needs is included in this program element under Project RU-Fundamental Research for Combating WMD. Details are provided in the R-2a exhibit."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "45.071"
                },
                "CurrentYear": {
                    "val": "45.837"
                },
                "BudgetYearOne": {
                    "val": "46.662"
                },
                "BudgetYearOneBase": {
                    "val": "46.662"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.818"
                },
                "CurrentYear": {
                    "val": "45.837"
                },
                "BudgetYearOne": {
                    "val": "37.778"
                },
                "BudgetYearOneBase": {
                    "val": "37.778"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.253"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-8.884"
                },
                "BudgetYearOneBase": {
                    "val": "-8.884"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.059"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-3.628"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.566"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.567"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.567"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Reductions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-9.451"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-9.451"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease in FY 2013 from the previous President's Budget submission is predominately due to Congressional reductions.  The decrease from FY 2014 to FY 2015 reflects a reduced effort in combating WMD basic research resulting in reductions to the number of active basic research awards."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RU"
                    },
                    "ProjectTitle": {
                        "val": "Fundamental Research for Combating WMD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "93.819"
                        },
                        "PriorYear": {
                            "val": "40.818"
                        },
                        "CurrentYear": {
                            "val": "45.837"
                        },
                        "BudgetYearOne": {
                            "val": "37.778"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.778"
                        },
                        "BudgetYearTwo": {
                            "val": "38.436"
                        },
                        "BudgetYearThree": {
                            "val": "39.119"
                        },
                        "BudgetYearFour": {
                            "val": "39.824"
                        },
                        "BudgetYearFive": {
                            "val": "40.500"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the discovery and development of fundamental knowledge and understanding by research performers drawn primarily from academia and world-class research institutions in government and industry.  This leverages the Department of Defense’s (DoD) $2 billion annual investment in basic research by ensuring a motivation within the scientific community to conduct research benefiting Weapons of Mass Destruction (WMD)-related defense missions and by improving Agency knowledge of other research efforts of potential benefit to Defense Threat Reduction Agency (DTRA) nonproliferation, counter proliferation and consequence management efforts. \n\nThese efforts are closely coordinated with the Chem-Bio Technology Portfolio, which executes a basic research program under the joint Chem-Bio Defense Program.  Agency research interests are coordinated with those of Defense Advanced Research Projects Agency and Service basic research programs through the Defense Basic Research Advisory Group.  DTRA reviews research interests annually to focus on technology areas not clearly addressed by other basic research efforts.\n\nThe DTRA’s Basic Research Initiative program element Project RU (Fundamental Research for Combating WMD) supports several National and Department initiatives directly related to countering WMD including: Office of Science and Technology Policy (OSTP) Nuclear Defense Research and Development Roadmap, FY2013-2017; Defense Budget Priorities and Choices for FY14 (2013); Countering Weapons of Mass Destruction (WMD) Science and Technology Priority Steering Council Roadmap (2012); National Military Strategy (2011); and the 2010 Quadrennial Defense Review.  In general, these documents direct capability enhancements, projects, and Science &Technology (S&T) that support countering WMD and reducing global nuclear dangers.  Specifically they include: accelerating the development of standoff radiological\/nuclear detection capabilities; researching countermeasures and defenses to non-traditional agents; enhancing nuclear forensics; securing vulnerable materials; developing new verification technologies; developing an in-depth understanding of the capabilities, values, intent, and decision making of potential adversaries, whether they are individuals, networks, or states; defeating WMD agents; researching biologically-based and inspired materials for DoD applications; and leveraging science, technology, and innovation through domestic and international partnerships and agreements. Specific activities for Project RU can be described as follows: Sensing and Recognition – Generation of information that provides knowledge of the presence, identity, and\/or quantity of material or energy in the environment that may be significant; Network Sciences – Enhance fundamental knowledge of theory, representations, and mapping to improve the WMD-related robustness, resiliency, recovery of, and informational and operational utility associated with and derived from, complex disparate but interdependent networks; Protection Sciences – Advance knowledge for protection of personnel, resources, sensitive systems and infrastructure from WMD; Sciences to Defeat WMD – Phenomena that improves success of defeat actions (use of weapons) including explosives, accessing and defeating target WMDs such as bio agents and weapons modeling; Sciences to Secure WMD – Improve understanding of phenomena for verification and compliance with treaties, including test detection. Discover revolutionary control methods to monitor and secure components, materials, and weapons, as well as disrupt proliferation pathways; and Cooperative Research with Global Partners – Research to reduce the global threat of WMD in collaboration with a broad range of international partners. Finally, this project supports and administers the Cooperative Biological Engagement Program for academic engagements, which has the core goals to secure dangerous pathogens, promote open and active disease reporting and response, advance transparent research to understand pathogens, and develop potential countermeasures.\n\nThe increase from FY 2013 to FY 2014 is due to the relative net impact of Congressional reductions in FY 2013 and increased investment in Fundamental Research in FY 2014 to maintain zero real growth in funding per the Defense Planning Guidance for activities related to the discovery and development of fundamental knowledge for the benefit of Counter WMD-related defense missions.  The decrease from FY 2014 to FY 2015 reflects a reduced effort in combating WMD basic research resulting in reductions to the number of active basic research awards."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Project RU: Fundamental Research for Combating WMD"
                                    },
                                    "Description": {
                                        "val": "This project provides for the discovery and development of fundamental knowledge and understanding by research performers drawn primarily from academia and world-class research institutions in government and industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.818"
                                            },
                                            "Text": {
                                                "val": "- Managed over 200 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio directly addressed the DoD CWMD Science and Technology (S&T) priority and supported the DoD S&T Priorities on Autonomy, Data to Decisions, Electronic Protection and Engineered Resilient Systems.\n- Supported the development of the future Science, Technology, Engineering and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conducted an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives and to foster collaboration and build relationships within the scientific community.\n- Conducted an annual external panel review of the basic research program, which was opened to DoD research stakeholders, to assess the focus and scope of the program with respect to the CWMD challenges, and to assess the coordination of CWMD basic research across DoD mission space and across the broader basic research community to avoid unintended duplication and ensure successful partnerships.\n- Transitioned a new nanomaterial-based method of detecting nuclear radiation that could be significantly less expensive with reduced size, weight, and power to applied research.\n- Transitioned new models for understanding power and communication networks that could produce cost-effective methods to protect and recover from WMD effects such as Electromagnetic Pulse to applied research.\n- Transitioned two new explosive formulations shown during small scale tests to be more effective than state of the art at destroying biological weapons to applied research."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.837"
                                            },
                                            "Text": {
                                                "val": "- Manage over 200 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio is expected to continue the CWMD grand challenge for the DoD.\n- Support the development of the future Science, Technology, Engineering and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conduct an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives and to foster collaboration and build relationships within the scientific community.\n- Conduct an annual external panel review of the basic research program, that will be open to DoD research stakeholders, to assess the focus and scope of the program with respect to the CWMD challenges, and to assess the coordination of CWMD basic research across DoD mission space and across the broader basic research community to avoid unintended duplication and ensure successful partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.778"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.778"
                                            },
                                            "Text": {
                                                "val": "- Manage over 150 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio directly addresses the DoD C-WMD S&T priority and supports the DoD S&T Priorities on Autonomy, Data to Decisions, Electronic Protection, and Engineered Resilient Systems.\n- Support the development of the future Science, Technology, Engineering and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conduct an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives and to foster collaboration and build relationships within the scientific community.\n- Conduct an annual external panel review of the basic research program, which will be open to DoD research stakeholders, to assess the focus and scope of the program with respect to the CWMD challenges, and to assess the coordination of CWMD basic research across DoD mission space and across the broader basic research community to avoid unintended duplication and ensure successful partnerships."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "23\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Technologies"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.499"
                                        },
                                        "CurrentYear": {
                                            "val": "0.516"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Procurement methods include competitive selection awards through the Defense Threat Reduction Agency Broad Agency Announcement and collaborative funding through other organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance is measured via a combination of statistics including the number of publications generated, number of students trained in sciences and engineering supporting Department of Defense educational goals, number of research organizations participating, and percentage of participating universities on the US News & World Report “Best Colleges” list."
                        }
                    }
                }
            ]
        }
    }
}