{
    "id": "93452473bee15f026db6b7e94094965463d8d6c0",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0804767D8Z"
        },
        "ProgramElementTitle": {
            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2)"
        },
        "R1LineNumber": {
            "val": "174"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "74.789"
            },
            "PriorYear": {
                "val": "56.325"
            },
            "CurrentYear": {
                "val": "38.909"
            },
            "BudgetYearOne": {
                "val": "44.005"
            },
            "BudgetYearOneBase": {
                "val": "44.005"
            },
            "BudgetYearTwo": {
                "val": "43.084"
            },
            "BudgetYearThree": {
                "val": "43.917"
            },
            "BudgetYearFour": {
                "val": "44.904"
            },
            "BudgetYearFive": {
                "val": "44.904"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "These programs support readiness of the joint force by creating a Joint Training Environment to replicate the complex, and ever changing operational environment.   These investments directly support the new defense strategy and enhance joint warfighting readiness by building training capabilities that support the operational readiness of the force. The elements associated with this coordinated effort consist of:\n\n- Joint National Training Capability (JNTC)\n- Joint Simulation System (JSS)\n- Joint Knowledge Development & Distribution Capability (JKDDC)\n- U.S. Forces Korea Training & Exercise Support (USFK)\n- Air Force JNTC\n- Navy JNTC\n\nJNTC:  Investment in the Joint National Training Capability (JNTC) program will enable Service and Combatant Commands (CCMD)  to train as they operate.  This investment will develop a cloud-enabled joint training environment, building on previous development of Scenario Management Tools for planning and executing joint training.  In 2016, this investment will enable access at the point of need (Service and CCMD trainers) for planning and executing joint training.  This investment will increase the relevance and realism of training by providing training capabilities which replicate the contemporary and future operating environment.  This program also enables the Department of Defense (DOD) to be responsive to the warfighters’ pace of changing operational concepts, threat environments, and best practices.\n\nJSS:  The Joint Simulation System (JSS) will decompose, harvest, and reuse DoD investment in joint simulations to develop cloud-enabled modular services (CEMS), reaching Initial Operating Capability in FY16.  JSS will enhance existing Joint Conflict and Tactical Simulation (JCATS) and Joint Theater Level Simulation (JTLS) to meet CCMDs’ training requirements.  JSS will provide design and development of web-based applications used as services in CEMS environment.\n\nJKDDC:  Joint Knowledge Development & Distribution Capability (JKDDC) Joint Knowledge Online (JKO) is the DOD unique and authoritative source for online joint training.  JKDDC JKO is tasked to develop a Joint Individual Training Toolkit of web-enabled individual and small group training products and services.  Products and services are developed in response to OSD(P&R) CE2T2 Program Goals & Objectives guidance, CJCS High Interest Training Items, Joint Staff J7 training priorities, and JKDDC JKO Stakeholder (CCMDs, Services, and Combat Support Agencies) prioritized training requirements.  JKDDC JKO supports a career-long joint learning continuum, joint professional military education, and tailored common training standards to Service members for tasks that are jointly executed, resulting in trained, capable, and interoperable joint forces.  JKO research and development will improve:  \n-  Small Group Scenario Trainer (SGST) desk top modeling and simulation based training: These capabilities train and prepare tens of thousands of military and civilian personnel deploying to CCMD theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. Specifically, C\/JTF ‘battle staffs’ will be adequately trained, as individuals and the staffs collectively, based on SGST development and implementation throughout the joint training enterprise.  \n-  JKO mobile “pilot” courseware training device development:  This facilitates the global distribution of web-based joint training content on portable, hand-held platforms.  \n-  JKO Learning Management System (LCMS): JKO LCMS development is required to deliver JKO courses and track\/report students’ completions more efficiently.  \n-  Develop the future virtual worlds learning environment.  It will provide training and learning to promote adaptability and agility in the workforce through an interactive, immersive virtual gaming environment.\n      \nUSFK:  The U.S. Forces Korea (USFK) Training & Exercise Support program is developing simulations capable of satisfying all joint exercise training requirements in the Korean Theater of Operations.  Interoperability with the Republic of Korea-developed Korean Simulation System is a critical and unique requirement of this USFK RDT&E program.  This solution will be capable of interoperating in a common battle space that realistically represents the operating environment to all levels of training audiences, tactical to strategic, in Korean theater exercises.  While supporting USFK’s specific requirements, this solution will contain enhancements that will benefit other combatant commander training programs that use the aging Joint, Live, Virtual, and Constructive (JLVC) simulations and the emerging JLVC 2020 simulations.\n\nAir Force JNTC:  The Air Force JNTC funding is providing a focused upgrade to developing models for space based capabilities and integrated them into the JLVC environment.  The Air Force is also supporting development of cross domain solutions allowing for the linking of systems with differing security requirements, which significantly extend the breadth of the training audiences to additional joint and coalition participants.  \n\nNavy JNTC:  These funds enable Navy to develop unique maritime capabilities that integrate LVC elements into a seamless joint training environment. Navy program activities include conducting research, development, test and evaluation, and cross-service architecture certification on joint-capable systems, developing cross-domain architectures for US and Coalition Forces as well as ensuring sister service modeling\/simulation and instrumentation efforts follow a common unified standard."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "77.475"
                },
                "CurrentYear": {
                    "val": "43.247"
                },
                "BudgetYearOne": {
                    "val": "44.008"
                },
                "BudgetYearOneBase": {
                    "val": "44.008"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "56.325"
                },
                "CurrentYear": {
                    "val": "38.909"
                },
                "BudgetYearOne": {
                    "val": "44.005"
                },
                "BudgetYearOneBase": {
                    "val": "44.005"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-21.150"
                },
                "CurrentYear": {
                    "val": "-4.338"
                },
                "BudgetYearOne": {
                    "val": "-0.003"
                },
                "BudgetYearOneBase": {
                    "val": "-0.003"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-4.300"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-15.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.082"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.932"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.136"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.038"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Travel Efficiencies"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Immersive Simulation terminated as part of Secretary of Defense ten percent efficiency reduction and also reflects a reduction in the CE2T2 fiscal guidance topline."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "758"
                    },
                    "ProjectTitle": {
                        "val": "Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "39.166"
                        },
                        "PriorYear": {
                            "val": "24.381"
                        },
                        "CurrentYear": {
                            "val": "19.290"
                        },
                        "BudgetYearOne": {
                            "val": "28.003"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.003"
                        },
                        "BudgetYearTwo": {
                            "val": "29.656"
                        },
                        "BudgetYearThree": {
                            "val": "32.822"
                        },
                        "BudgetYearFour": {
                            "val": "33.514"
                        },
                        "BudgetYearFive": {
                            "val": "33.514"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Investment in the Joint National Training Capability (JNTC) program will enable Service and Combatant Commands (CCMD)  to train as they operate.  This investment will develop a cloud-enabled joint training environment, building on previous development of Scenario Management Tools for planning and executing joint training.  In 2016, this investment will enable access at the point of need (Service and CCMD trainers) for planning and executing joint training.  This investment will increase the relevance and realism of training by providing training capabilities which replicate the contemporary and future operating environment.  This program also enables the Department of Defense (DOD) to be responsive to the warfighters’ pace of changing operational concepts, threat environments, and best practices."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint National Training Center (JNTC)"
                                    },
                                    "Description": {
                                        "val": "Initially established in 2003, JNTC continues to develop and integrate advanced training technologies into a seamless joint training environment.  JNTC establishes the overarching joint framework and context necessary for CCMDs and Services to achieve a joint training environment through an integrated network of training sites and nodes.  JNTC provides the common standards, architecture, and development processes required to link joint training programs.  By leveraging existing training programs or initiating specific actions, JNTC is developing credible opposing force capabilities and expanded access to assets typically unavailable to the training audience by developing and integrating modeled and simulated representations of these capabilities.  This furthers the integration of joint training objectives into Service training events, while capturing the objective data necessary to provide a complete and accurate after action review.  This program develops and enhances current and future joint training enterprise capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.381"
                                            },
                                            "Text": {
                                                "val": "• Continued development and refinement of the Joint, Live, Virtual, and Constructive (JLVC) 2020 modeling and simulation strategy, roadmap, and conceptual design working with the Services, CCMDs, coalition partners, agencies, and the DOD modeling and simulation community to build a relevant post Operation Enduring Freedom joint training environment.  \n• Conducted JLVC 2020 Integration Event #1.\n• Documented the “as-is” Joint Training Enterprise Architecture (JTEA) in DOD Architecture Framework (DODAF) artifacts.  Coordinated future joint training environment to-be framework with Enterprise stakeholders.\n•  Researched and defined the future joint training enterprise communications and information services construct of the Joint Training Enterprise Architecture and developed a systems engineering plan supporting the architecture development effort. This aligned the joint training enterprise with the mandated DOD Joint Information Enterprise project to comply with Department guidance and provide agile and adaptive joint training capabilities supporting warfighter requirements while reducing overall operating and sustainment costs.\n• Continued planning, research, and development of a prototype cloud computing and virtualization environment supporting the Joint Training Enterprise Architecture.\nIn coordination with the Services and Combatant Commands, began development of a Joint Training Enterprise Architecture concept of operations document to describe how the future Joint Training Environment will support Joint Force Development in 2020.\n• Developed modular mix and match integration of simulation activity and master scenario event list events to simplify and reduce manpower through automation within the JLVC modeling and simulation federation.\n• Continued to enhance joint logistics modeling within the JLVC modeling and simulation federation to increase realism of logistics planning and execution in training by providing simulated in transit visibility of logistics.\n• Virtual Collective Training Environment completed Phase 2, Proof of Concept.  The primary objectives of this phase were to refine the requirements established in Phase 1, develop and deliver additional architectural products, perform the bulk of the project’s systems engineering and software development, and conduct a proof of concept demonstration.  This demonstration investigated Virtual World Framework capabilities, assessed these capabilities against mission requirements, and conducted a comparative analysis.  The fundamental questions answered were how well virtual world technologies satisfy collective joint training requirements; how these technologies can be quickly adapted to meet new training requirements, and what the overall cost is to employ these technologies compared to current practices within collective joint training.\n• Continued Joint Training Enterprise Network Test Bed systems certification, product evaluation, network problem replication and troubleshooting off the production network.  The test bed significantly mitigated risk to the operational network, permitted simultaneous test and evaluation without impact to exercise events, and permitted fielding capabilities at a much quicker rate than waiting for windows of availability on the production network. \n• Expanded the visibility, accessibility, and reuse of modeling and simulation data by developing an initial operating capability that provides consumers the ability to search for and download order of battle data from different sources.\n• Evaluated the potential of standard web-based services combined with Virtual World type technologies to support joint training using emulated command and control systems.\n• Researched services in the area of system-of-system interoperability in joint training and experimentation including command and control, sensor, and robotic to simulation interoperability.\n• Evaluated and developed methods supporting initialization, orchestration and composition of LVC systems using Coalition Battle Management Services.\n• Developed JLVC 2020 Capability Release 0.3 system architecture drawings.\n• Continued developing the cloud-capable computing environment for JLVC 2020.\n• Continued developing JLVC 2020 virtualized test environment.\n• Supported Special Operations (MOBILE UNIT) with procurement of hardware and software for two Air Force Synthetic Environment for Reconnaissance and Surveillance (AFSERS) ISR stations, provided Engineering, Software, and Subject Matter Experts (SME).\n• Supported multiple training events by providing AFSERS\/Multi-User Simulation Environment engineering to comply with Combat Air Forces Distributed Missions Operations (DMO) Standards for AFSERS integration with the DMO Network & Air Reserve Component Network.\n• Provided engineering services and software modifications to Air Base Simulator, integration, and test to address LVC support to logistic community systems integration into JNTC exercises.\n• Developed a connection to Joint Information Operations Range (JIOR) to facilitate low-cost TS\/SCI links; integration into the Air and Space Collaborative Environment Information Operations Suite and Space System Generator.\n• Continued to support the development and enhancements to Joint Simulation Bus (JBUS), a common, cost effective, and extensible LVC interface solution for command and control, communication, computers, collaboration and integration (C5I), and legacy simulation interfaces used in the LVC federation, and Service training environments.  Researched and developed, and integrated additional JBUS capabilities to disparate training systems developed and fielded by Services, joint, agency, and partner nations into the joint training environment using common solutions and joint standards.\n• Prototyped a tech solution to integrate constructive A2\/AD and IO\/ISR capabilities that support CCMD exercise and Service training requirements, provide improved ability to train realistically and efficiently as well as development of adaptive training architecture for high-end A2\/AD, cyber and IO at the operational and tactical level and integration into the joint training environment.  Addressed shortfalls in the simulation architectures ability to train for operations to deter and defeat aggression, IO\/ISR, and A2\/AD and provide full integration of Navy training systems into the joint training environment.  \n• Continued development on Joint After Action Review Resource Library (JAAR-RL) Version 3.0.  Continued test and integration of new data collection, after action review, and analysis tools based on JAAR-RL.  \n• Developed an “initial emulated cyber environment” using a suite of emulation tools, devices, CCMD scenario products (recorded\/modified playback of previous CCMD scenarios), and Network Effects Simulation System software application technology to test and analyze joint warfighting capabilities under degraded cyber conditions within a lab setting.\n• Developed a high fidelity virtual environment for the Cyber Community that realistically emulates real-world networks for joint and Service training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.290"
                                            },
                                            "Text": {
                                                "val": "• Continue development and refinement of the JLVC 2020 strategy, roadmap, and conceptual design working with the Services, CCMDs, coalition partners, agencies, and DOD modeling and simulation community to deliver a future joint training environment reliant on cloud-enabled modular services with an initial capability in fiscal year 2016, and an operational capability in fiscal year 2019.  This environment will be aligned with DOD plans for the implementation of the Joint Information Environment, to include the proof of concept for the Joint Force Development special purpose processing node.\n• Conduct JLVC 2020 Integration Events #2 and #3 to prepare for initial limited operational capability in fiscal year 2015.\n• Continue to build the Joint Training Enterprise Architecture decomposing modeling and simulation, networking and information technology applications into a cloud-enabled modular service supporting CCMD and Service joint training requirements.\n• Begin engineering and technical management support to facilitate agreement among Enterprise stakeholders on way ahead for the “to be” joint training environment.\n• Virtual Collective Training Environment will complete development of the prototype system:  Phase 3 will focus on development and delivery of a prototype Virtual Worlds Framework (VWF) capability (Capability Release 1).  Capability Release 1 will be realized through the Command and Control Systems in Virtual Environments Modeling and Simulation Coordination Office High Level Task initiative.  Command and Control Systems in Virtual Environments will integrate the VWF into the emerging next generation joint training environment to create an adaptive virtual environment that enables joint force development for Commanders, staffs, units, and personnel.  Command and Control Systems in Virtual Environments will employ cloud-enabled modular simulation services that will provide joint warfighters the ability to rapidly access and compose training applications and capabilities to meet specific joint requirements, and then deliver that capability how, when, and where required. \n• Based on discovery identified with the initial cloud capabilities research, continue development on next phase of cloud-enabled modular services in support of delivering wargaming, environment, presentation, and interface services supporting Joint Force Development and the JLVC 2020 training capability.  This effort will contribute to the long range joint training environment design, development, and fielding strategy.\n• Based on discovery identified with the initial data strategy on reuse of modeling and simulation data by developing and initial operating capability that provides consumers the ability to search for and down-load order of battle data from different sources, expand development into geospatial services.\n• Based on discovery identified with research on web-based services using Virtual World type technologies to support joint training using emulated command and control systems, expand research to support additional joint training use cases through a storefront and virtual training interface homepage.\n• Based on discovery identified with system of systems interoperability, continue research to establish a web-based semantic and pragmatic data exchange standard that promotes interoperability between command and control, sensor, and robotic to simulation systems.\n• Continue developing virtual frameworks, advanced web gaming, scenario excursion tools, and emerging systems interoperability services interfacing technologies to create a globally integrated JLVC 2020 virtual environment that can be stimulated by cloud-based modular services to support home based training.\n• Develop a prototype JLVC 2020 virtual environment that will reduce exercise planning in a cost-effective, integrated enterprise architecture solution that reduces or eliminates waste and redundancy in existing training architectures and mitigates risk.  Prototype system to shadow a fiscal year 2015 exercise\/event for a return on investment evaluation.\n• Conduct research and develop a standard that allows the seamless exchange of JLVC 2020 System Interoperability Service information and data between sensors, robotics, command and control, and joint training systems.  System Interoperability Service will enable meaningful data exchange between sensors, robotics, command and control, and modeling and simulation systems, and migration of legacy systems into a cloud-based “service-oriented’ environment.\n• Conduct research and validate use of web technologies to achieve interoperability at the data-dynamic-pragmatic-semantic-syntactic levels.\n• Perform engineering analysis of industry and government products that can be used to enable joint training in a cloud environment.  Development of an implementation plan by industry, academia, and practitioners for JLVC 2020 Capability Release 1.0 and 2.0 concepts to include cloud, widgets, and web-based services.\n• Continue to develop the JLVC 2020 technical infrastructure that will provide the Joint Training Enterprise Architecture\/Joint Information Environment type infrastructure and software necessary to host the JLVC 2020 simulation and related web-based services in the DOD “cloud” computing environment that targets a full operational capability enabled in 2019.\n• Continue to develop a prototype of the JLVC 2020 cloud-enabled technical infrastructure and cloud-enabled joint modeling and simulation training solution on the Defense Information Systems Agency’s Defense Enterprise Computing Center Rapid Access Computing Environment.\n• Continue developing the joint training cloud “storefront” web services for customer access and leverage existing Defense Information Systems Agency Defense Enterprise Computing Center and target the Joint Information Environment-cloud (FY16) for hosting JLVC 2020 joint training services and tools.  \n• Develop connection to Joint Information Operations Range (JIOR) to facilitate low-cost TS\/SCI links; integrate Air and Space Collaborative Environment Information Operations Suite and Space System Generator.  This capability expands the current space representation in the Air and Space Collaborative Environment Information Operations Suite to include interactions in the TS\/SCI realm.\n• Modify existing USAF logistic simulations to integrate with GEOBASE C2 to provide geospatial capabilities for efficient decision making across the full mission spectrum.  This capability will provide logistics simulation integration that provides geospatial capabilities for efficient decision-making across the full mission spectrum.\n• Add fidelity to GPS Environment Generator modeling capabilities to include common-use precision guided munitions by providing location, health, and operational status of each satellite in the GPS.  This provides the ability to degrade GPS signals replicating jamming, forcing exercise participants to develop procedures to work in this degraded environment.\n• Continue development of the prototype solution to include operation and management of the pilot joint CDIS Enterprise cloud services capability demonstrated during the JS J7, USN, and USAF pilot project, until transitioning to the Joint Training Enterprise Architecture (JTEA) in FY18.  This effort will include day-to-day operation, software updates, rule set coordination and implementation, Defense Information Assurance Security Accreditation Working Group representation, and Joint CDIS Working Group representation until successfully transitioned to the JTEA.\n• Continue development and enhancements to JBUS, a common, cost-effective, and extensible LVC interface solution for C5I and legacy simulation interfaces used in the LVC federation and Service training environments.  The goal of this effort is to identify and implement common technical solutions to integrate joint, service, agency, and partner training systems in order to achieve full interoperability of these devices in a robust and extensible integrating architecture that meets the war-fighters training objectives.\n• Integrate constructive A2\/AD and IO\/ISR capabilities that support CCMD exercise and Service training requirements, provide improved ability to train realistically and efficiently, as well as development of adaptive training architecture for high-end A2\/AD, cyber, and IO at the operational and tactical level, and integration into the joint training environment.  \n• Develop a common database GUI for the MTWS in order to access the common database repository, support joint, coalition, and Service (Title 10) training events within the JLVC 2020, populate common database repository with GeoFidelis Infrastructure data and custom-built USMC terrain.  This innovative leverages an established DOD process of working towards an integrated automated ingestion process for modeling and simulation correlated terrain databases and 3-D modeling for training programs.  \n• Develop (JAAR-RL), Version 3.X Capability - Provides an After Action Review capability that is a virtualized, web enabled suite of Enterprise Services supporting the JTEA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.003"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.003"
                                            },
                                            "Text": {
                                                "val": "• Continue development and refinement of the JLVC 2020 modeling and simulation strategy, roadmap, and conceptual design working with the Services, CCMDs, coalition partners, agencies, and the DOD modeling and simulation community to deliver a future modeling and simulation training environment reliant on cloud-enabled modular services with an initial capability in fiscal year 2016, and an operational capability in fiscal year 2019.\n• Conduct JLVC 2020 Integration Events #2 and #3 to prepare for initial limited operational capability release in fiscal year 2015.\n• Continue to build the Joint Training Enterprise Architecture decomposing modeling and simulation, networking and information technology applications into a cloud-enabled modular service supporting Combatant Command and Service joint training requirements.\n• Consolidate joint force development information technology systems into an integrated capability and make available as part of the joint training enterprise.\n• Alignment of the joint training environment with the DOD mandated Joint Information Environment, advancing the target architecture for the joint force development special purpose processing node based on lessons learned from the proof of concept. \n• Virtual Collective Training Environment will complete development of the prototype system: Phase 3 will focus on development and delivery of a prototype VWF capability (Capability Release 1).  \n• Continue development on next phase of cloud-enabled modular services in support of delivering modeling and simulation services supporting Joint Force Development and JLVC 2020 modeling and simulation capability.  This effort will contribute to the long range modeling and simulation development and training strategy.\n• Based on discovery identified with the initial data strategy on reuse of modeling and simulation data by developing an initial operating capability that provides consumers the ability to search for and download order of battle data from different sources, expand development into geospatial services.\n• Based on discovery identified with research on web-based services using Virtual World type technologies to support joint training using emulated command and control systems, expand research to support additional joint training use cases.\n• Continue research and prototyping to establish a standard that promotes interoperability between command and control, sensor, and robotic to simulation systems.\n• Continue enhancement of classified networks and expansion of space representation in the Air and space Collaborative Environment Information Operations.Continue to upgrade existing Simulation\/ C2Technology InfrastructureContinue development of a Cross Domain Information Sharing (CDIS) Enterprise Network Architecture including cloud services capabilities.\n• Continue development and enhancement to the JBUS used in the LVC federation and Service training environments.\n• Continue Marine Air-Ground Task Force Tactical Warfare Simulation (MTWS) Graphical User Interface (GUI) for common database repository in support of joint, coalition, and Service training events.\n• Continue development of JAAR-RL 3.X capability allowing for a virtualized, web enabled After Action Review."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24.756"
                                        },
                                        "CurrentYear": {
                                            "val": "26.028"
                                        },
                                        "BudgetYearOne": {
                                            "val": "25.732"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.732"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "26.541"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.080"
                                        },
                                        "BudgetYearFour": {
                                            "val": "26.065"
                                        },
                                        "BudgetYearFive": {
                                            "val": "26.488"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z-"
                                    },
                                    "Title": {
                                        "val": "JNTC Procurement Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.322"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow? \n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Achieve a ten percent increase per year in Joint Training Data Scenario production builds \/ downloads from FY 14 through FY 16.\n• Reduction in joint training environment Operation & Sustainment costs achieving a threshold goal of 30% reduction by FY 19. \n• Provide enhanced cyber capabilities meeting 45% of CCMD exercises cyber requirements.\n• Joint training enterprise event preparation time is reduced by 15%."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "761"
                    },
                    "ProjectTitle": {
                        "val": "Joint Simulations Systems (JSS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.208"
                        },
                        "PriorYear": {
                            "val": "3.017"
                        },
                        "CurrentYear": {
                            "val": "3.098"
                        },
                        "BudgetYearOne": {
                            "val": "2.193"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.193"
                        },
                        "BudgetYearTwo": {
                            "val": "2.333"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.849"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Simulation System (JSS) will decompose, harvest, and reuse DoD investment in joint simulations to develop cloud-enabled modular services (CEMS), reaching Initial Operating Capability in FY16.  JSS will enhance existing Joint Conflict and Tactical Simulation (JCATS) and Joint Theater Level Simulation (JTLS) to meet CCMDs’ training requirements.  JSS will provide design and development of web-based applications used as services in CEMS environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Simulation System (JSS)"
                                    },
                                    "Description": {
                                        "val": "This effort provides warfighters with joint simulations and tools that enhance and enable Joint training across Services, CCMDs, agencies and coalition partners.  These joint simulations and tools are part of an overall JLVC baseline of training capabilities resident in the Joint Force Trainer Toolkit (JFTT).  The JFTT is a set of training enablers, and “certified systems” that are interoperable and acceptable for usage within the joint training environment.  The joint simulations and tools provided by JSS are critical enablers that support the delivery of trained, capable, and interoperable Joint Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.017"
                                            },
                                            "Text": {
                                                "val": "• Continued the integration, verification, validation, accreditation, and delivery of a stable and reliable software version of the JLVC Federation version 6.0 to support current CCMD and Service joint training requirements.  \n• Developed civilian infrastructure network models and simulations to increase realism to the training audience.\n• Developed modeling and simulation web-services, cloud computing, and virtualization to comply with DOD guidance.\n• Continued JLVC 2020 prototyping of cloud-enabled modular services.  Prototyped future architecture for joint modeling and simulation involving decoupling simulation processes that can be shared by multiple simulations within the Joint Training Enterprise Architecture to decrease operating and sustainment costs and produce agile and adaptable training capabilities that meet future Warfighting training requirements.\n• Developed terrain service prototype (static and streaming) to demonstrate how the cloud-based modular service concept can be applied to Joint training.\n• Developed enhancements in the JLVC modeling and simulation federation to address hybrid warfare and Anti-Access\/Area Denial (A2\/AD) defense training capabilities to comply with Chairman Joint Chiefs of Staff (CJCS) training priorities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.098"
                                            },
                                            "Text": {
                                                "val": "• Federate A2\/AD and hybrid threats modeling and simulation capabilities.\n• Develop hybrid threat effects on civilian population and A2\/AD modeling to comply with CJCS training priorities.\n• Continue JLVC 2020 prototyping of cloud-enabled modular services.  Continue prototyping of a future architecture for joint modeling and simulation involving decoupling simulation processes that can be shared by multiple simulations within the Joint Training Enterprise Architecture to decrease operating and sustainment costs and produce agile and adaptable training capabilities that meet future Warfighting training requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.193"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.193"
                                            },
                                            "Text": {
                                                "val": "• Federate A2\/AD and hybrid threats modeling and simulation capabilities.\n• Develop hybrid threat effects on civilian population and A2\/AD modeling to comply with CJCS training priorities.\n• Continue JLVC 2020 prototyping of cloud-enabled modular services.  Continue prototyping of a future architecture for joint modeling and simulation involving decoupling simulation processes that can be shared by multiple simulations within the Joint Training Enterprise Architecture to decrease operating and sustainment costs and produce agile and adaptable training capabilities that meet future Warfighting training requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JSS O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.007"
                                        },
                                        "CurrentYear": {
                                            "val": "0.957"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.953"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.953"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.943"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.944"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures\n• Provide the JLVC Federation version 6.0 to enable Services, CCMDS, agencies and coalition partners to deploy trained, capable, and interoperable joint forces. \n• JLVC version 6.0 is delivered on time with less than ten priority one and two problem trouble reports.  \n• JLVC version 6.0 has an exercise availability rating of 95%.\n• Enhance joint model and simulation capabilities to meet 65% of CCMD training requirements in hybrid threats and Anti-Access\/Area-Denial functional areas.\n• One major software release to implement emerging technologies supporting enterprise architecture development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "769"
                    },
                    "ProjectTitle": {
                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.375"
                        },
                        "PriorYear": {
                            "val": "4.656"
                        },
                        "CurrentYear": {
                            "val": "3.986"
                        },
                        "BudgetYearOne": {
                            "val": "4.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.000"
                        },
                        "BudgetYearThree": {
                            "val": "4.000"
                        },
                        "BudgetYearFour": {
                            "val": "4.092"
                        },
                        "BudgetYearFive": {
                            "val": "4.092"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Joint Knowledge Development & Distribution Capability (JKDDC) Joint Knowledge Online (JKO) is the DOD unique and authoritative source for online joint training.  JKDDC JKO is tasked to develop a Joint Individual Training Toolkit of web-enabled individual and small group training products and services.  Products and services are developed in response to OSD(P&R) CE2T2 Program Goals & Objectives guidance, CJCS High Interest Training Items, Joint Staff J7 training priorities, and JKDDC JKO Stakeholder (CCMDs, Services, and Combat Support Agencies) prioritized training requirements.  JKDDC JKO supports a career-long joint learning continuum, joint professional military education, and tailored common training standards to Service members for tasks that are jointly executed, resulting in trained, capable, and interoperable joint forces.  JKO research and development will improve:  \n-  Small Group Scenario Trainer (SGST) desk top modeling and simulation based training: These capabilities train and prepare tens of thousands of military and civilian personnel deploying to CCMD theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. Specifically, C\/JTF ‘battle staffs’ will be adequately trained, as individuals and the staffs collectively, based on SGST development and implementation throughout the joint training enterprise.  \n-  JKO mobile “pilot” courseware training device development:  This facilitates the global distribution of web-based joint training content on portable, hand-held platforms.  \n-  JKO Learning Management System (LCMS): JKO LCMS development is required to deliver JKO courses and track\/report students’ completions more efficiently.  \n-  Develop the future virtual worlds learning environment.  It will provide training and learning to promote adaptability and agility in the workforce through an interactive, immersive virtual gaming environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                                    },
                                    "Description": {
                                        "val": "JKDDC JKO technology initiatives principally include Small Group Scenario Trainer (SGST) desk top modeling and simulation based training, mobile “pilot” courseware training devices, JKO Learning Content Management System (LCMS), and OSD requested virtual worlds prototype.  These capabilities facilitate the training and preparation of tens of thousands of military and civilian personnel deploying to CCMD theaters of operation prior to serving in their assigned C\/JTF billets.  Specifically, C\/JTF “battle staffs” will be adequately trained, as individuals and the staffs collectively, based on SGST development and implementation throughout the joint training enterprise.  JKO mobile “pilot” courseware training device development facilitates the global distribution of web-based joint training content on portable, hand-held platforms for joint warriors.  The JKO LCMS development is required to deliver JKO courses and track\/report students’ completions more efficiently.  The future virtual worlds learning environment will provide training and learning to promote adaptability and agility in the workforce with the capability to tailor and adapt instructional material to fit the learner's strengths and weaknesses, learning style, and level of proficiency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.656"
                                            },
                                            "Text": {
                                                "val": "• Crafted and began implementing a comprehensive plan to develop mobile “pilot” training device capabilities focused on JKO’s entire Joint Individual Training Toolkit.  Plan components included existing JKO courseware conversion to portable, hand-held devices, emerging training courseware requirements interoperable with portable, hand-held devices, and the leveraging of other DOD agencies, interagency, and multinational training courseware ported to mobile training devices.\n• Developed and deployed 32 mobile “pilot” training products on JKO managed mobile content delivery\/tracking platform.\n• Developed and delivered four JKO Learning Content Management System (LCMS) releases resulting in a more effective and efficient online training management application that is interoperable with DOD personnel management systems.\n• Developed a future virtual worlds learning prototype that provided training and learning environments (software agents) that are consistent with the Virtual Worlds Framework (VWF).  The Combating Trafficking in Persons prototype course available via JKO “pilot” mobile technology demonstrated how online training could be delivered via the VWF."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.986"
                                            },
                                            "Text": {
                                                "val": "• Assess, refine, and continue implementing comprehensive plan to develop mobile “pilot” training device capabilities focused on JKO’s entire Joint Individual Training Toolkit.  Plan components include existing JKO courseware conversion to portable, hand-held devices, emerging training courseware requirements interoperable with portable, hand-held devices, and the leveraging of other DOD agencies, interagency, and multinational training courseware ported to mobile training devices.  Refined plan will include eBook, Podcast, job aids, and video capabilities in addition to current courseware capabilities.\n• Develop and deliver two JKO Learning Content Management System (LCMS) releases resulting in a more effective and efficient online training management application that is interoperable with DOD personnel management systems.  Requirements are derived from CCMD user feedback and emerging DOD training priorities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "• Assess, refine, and continue implementing comprehensive plan to develop mobile “pilot” training device capabilities focused on JKO’s entire Joint Individual Training Toolkit.  Plan components include existing JKO courseware conversion to portable, hand-held devices, emerging training courseware requirements interoperable with portable, hand-held devices, and the leveraging of other DOD agencies, interagency, and multinational training courseware ported to mobile training devices.  Refined plan will include eBook, Podcast, job aids, and video capabilities in addition to current courseware capabilities.\n• Develop and deliver two JKO Learning Content Management System (LCMS) releases resulting in a more effective and efficient online training management application that is interoperable with DOD personnel management systems.  \n• Requirements are derived from CCMD user feedback and emerging DOD training priorities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JKDDC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.348"
                                        },
                                        "CurrentYear": {
                                            "val": "6.036"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.031"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.031"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.038"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.928"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.030"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.774"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Staff prescribed performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Augment the ability to provide cultural context training for CCMD’s Joint Mission Essential Task functional areas by one geographic area of responsibility, and two mission areas per year.\n• Provide small group training focused on Joint Exercise Life Cycle specified mission areas for pre-requisite in exercise augmentation, or post exercise remediation training for three exercise response cells per year.\n• Add context sensitive remediation to five existing Joint Distributed Learning courses per year.\n• Provide a systematic, steady-state process for integrating cultural context, small group training, and intelligent remediation requirements into the Joint Training System Phase I of the initiative, resulting in improved training and readiness for the warfighter.\n• Provide cost model for evaluating level of effort, additional conditions and standards for cultural context, small group training, and intelligent remediation to Joint Mission Essential Task training solutions for the Joint Training System Phase II, resulting in improved readiness, while providing improved training to the warfighter, will be in place by year five of the initiative."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "770"
                    },
                    "ProjectTitle": {
                        "val": "U.S. Forces Korea Training and Exercise Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "17.553"
                        },
                        "PriorYear": {
                            "val": "6.497"
                        },
                        "CurrentYear": {
                            "val": "6.121"
                        },
                        "BudgetYearOne": {
                            "val": "4.483"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.483"
                        },
                        "BudgetYearTwo": {
                            "val": "1.378"
                        },
                        "BudgetYearThree": {
                            "val": "1.378"
                        },
                        "BudgetYearFour": {
                            "val": "1.410"
                        },
                        "BudgetYearFive": {
                            "val": "1.410"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The U.S. Forces Korea (USFK) Training & Exercise Support program is developing simulations capable of satisfying all joint exercise training requirements in the Korean Theater of Operations.  Interoperability with the Republic of Korea-developed Korean Simulation System is a critical and unique requirement of this USFK RDT&E program.  This solution will be capable of interoperating in a common battle space that realistically represents the operating environment to all levels of training audiences, tactical to strategic, in Korean theater exercises.  While supporting USFK’s specific requirements, this solution will contain enhancements that will benefit other combatant commander training programs that use the aging Joint, Live, Virtual, and Constructive (JLVC) simulations and the emerging JLVC 2020 simulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "USFK Training & Exercise"
                                    },
                                    "Description": {
                                        "val": "This program provides Joint Training Environment support to the 2015 stand-up of KORCOM as a sub-unified command under PACOM.  This program develops a jointly accredited, supported, and funded federation of constructive models and simulations which are capable of satisfying all joint exercise training requirements in the Korean Theater of Operations, and which is interoperable with the Republic of Korea developed Korean Simulation System.  While supporting U.S. Forces Korea specific training requirements, this solution also is inextricably linked to the JLVC 2020 modeling and simulation capability via Cloud-Enabled Modular Services which will provide a simulated common, interoperable battlespace which realistically represents the operating environment to all levels of training audiences, tactical to strategic, in Korean theater exercises and across the CCMDs, Services, and coalition Partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.497"
                                            },
                                            "Text": {
                                                "val": "Researched, developed, tested and evaluated for USFK, Republic of Korea (JLVC 6.x modeling and simulation federation and Korean simulations) bridge.\n• Continued development and integration of Marine Air-Ground Task Force Tactical Warfare Simulation High Level Architecture 1516 Laissez-Faire to engineer interoperability with the Korean modeling and simulation federation and the JLVC 6.x modeling and simulation federation.\n• Researched, developed, and tested the Marine Air-Ground Task Force Tactical Warfare Simulation aggregated composable models.\n• Completed Joint Exercise Control Suite Cross Federation testing tool.\n• Completed initial development of refugee and civilian traffic modeling and simulations into the JLVC 6.x modeling and simulation federation.\n• Completed initial development of U.S. Forces Korea civilian infrastructure modeling and simulations into the JLVC 6.x modeling and simulation federation.\n• Completed initial development of targeting networks and visualization modeling and simulations into the JLVC 6.x modeling and simulation federation to enable visualization of intended targeting effects.\n• Continued Air Force Modeling and Simulation Training Toolkit database support.\n• Completed Joint Conflict and Tactical Simulation Low Overhead Driver High Level Architecture 1516 Modular Federated Object Model migration.\n• Continued Joint Land Component Constructive Training Capability database support.\n• Completed initial Navy Continuous Training Environment Modular Federation Object Model and Dynamic Data Model implementation.\n• Developed initial Modular Federation Object Model design.\n• Initial Marine Air-Ground Task Force Tactical Warfare Simulation Modular Federation Object Model migration completed.\n• Completed coalition-releasable Joint Semi-Automated Forces baseline.\n• Continued Korean Battle Simulation Center Terrain support.\n• Completed initial Defense Training Network Guard for JLVC 6.x modeling and simulation federation.\n• Continued enterprise architecture subject matter expertise research and analysis to facilitate delivery of state of the art USFK training capability. \n• Started development of the Joint Terrain Data Services specific dataset and server to meet USFK exercise training requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.121"
                                            },
                                            "Text": {
                                                "val": "• Enhance Army, Air Force, Navy, and Marine Corps Live, Virtual, and Constructive capabilities and fully integrate these into the JLVC 2020 modeling and simulation capability to meet USFK theater specific, CCMD, Service, and coalition training requirements.\n• Achieve full interoperability of joint service and ROK modeling and simulations, capable of supporting large (e.g. 1M entities), high-intensity combat scenarios by 2016.\n• Document the future “to be” Joint Training Environment in the DOD Architecture Framework (DODAF) artifacts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.483"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.483"
                                            },
                                            "Text": {
                                                "val": "• Enhance Army, Air Force, Navy, and Marine Corps Live, Virtual, and Constructive capabilities and fully integrate these into the JLVC 2020 modeling and simulation capability to meet USFK theater specific, CCMD, Service, and Coalition training requirements.\n• Achieve full interoperability of joint service and ROK modeling and simulations, capable of supporting large (e.g. 1M entities), high-intensity combat scenarios by 2016."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "U.S. Forces Korea Training & Exercise Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.307"
                                        },
                                        "CurrentYear": {
                                            "val": "0.309"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.299"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.299"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.304"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.304"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Develop software for interoperability of JLVC 6.x simulations, with initial integration of the Army’s Multi-Resolution Federation (MRF), along with a validated approach for Cross Domain Information Sharing technologies, and Korea Battle Simulation Center (KBSC) simulations, to provide a joint training enterprise, realistic warfighter training environment, to meet the training requirements of the USFK."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "754"
                    },
                    "ProjectTitle": {
                        "val": "Immersive Simulation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "11.750"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.750"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "A state of the art simulated close combat environment will enable enhanced decision-making by squads and platoons, increasing their military effectiveness, reducing friendly and non-combatant casualties and increasing lethality against foes.  It will contribute to combat team proficiency and decision making across the full range of military operations, from irregular to conventional.  This training capability will increase survival and success rates in first and subsequent combat actions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immersive Simulation"
                                    },
                                    "Description": {
                                        "val": "Accelerate fielding of immersive training systems and capabilities inclusive of integrated hardware with virtual enhancements, modular systems and video capture within individual and collective tracking systems.\n\nAccelerate development of autonomous behavior capabilities through development of Opposing Force and Blue Force Behavior, Common SAF in Synthetic Environment, and enhancement of current software (Virtual Battlespace 2).  These expenditures will improve 119 behaviors models, establish 50 new entities, 50 new visual models\/year, 50 BLUEFOR Behaviors, improve Avatar capability and enhance interactions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.750"
                                            },
                                            "Text": {
                                                "val": "•  Highly Detailed Scenarios.  Develop scenario data that is sufficiently detailed to satisfy training requirement.  Develop training scenarios that replicate the contemporary operating environment.  Develop a comprehensive set of IW tasks, conditions and standards to enable training relevant to ethical and tactical decision making. Develop specific scenario requirements that support mission-specific rehearsal, including representation of second and third order effects of ethical and tactical decisions made under conditions simulating combat stress.\n •  Geo-typical Data Repositories. Develop standardized repositories for geo-typical data such as terrain features, vegetation, population appearance, cultural behaviors (i.e., correct form of greeting in a specific location), language and dialect. \n•  External Enablers Representation.  Identify and create processes to leverage a pool of expertise for each external capability to be represented. Develop training standards for controllers representing external enablers. Enhance automated responses for required external enablers. Establish habitual relationships with organizations representing and or providing external enablers at the tactical level, in order to enhance interoperability, maintain currency and ensure validity of the scenario.\n•  Natural Verbal and Non-Verbal Communication.  Develop a broader selection of gestures available through a range of interface devices. Further develop Voice over Internet Protocol (VOIP) technology for use with live, virtual and gaming technologies. Further develop natural gesture recognition capabilities. Further develop natural voice recognition capabilities.\n•  Autonomous Behavior. Develop methodology to characterize and organize entity behaviors. Expand library of scripted behaviors and supporting animations (including individuals, cells and units) to allow limited interactions with trainees. Develop improved game engine and virtual Semi-Automated Forces (SAF) behaviors in order enhance tactical and ethical decision making. Develop a detailed response library for certain conditions and behaviors. Develop virtual human with capability to perceive and understand the environment.\n•  Sensory Stimulation.  Further develop and integrate current olfactory systems for both live and virtual environments. Further develop and integrate current hap tic feedback devices for both live and virtual environments. Further develop and integrate higher resolution display technologies for both live and virtual environments. Further develop and integrate enhanced audio technologies for both live and virtual environments. Integrate all sensory stimulation capabilities in order to maximize overall effectiveness within the training environment. Conduct research into best methods to stimulate the senses in a training environment. Conduct research into the effectiveness and value of sensory stimulation in a training environment.\n•  Interactions. Conduct research to determine optimal level of interaction within the training environment, with respect to the training requirements. Develop tools to eliminate the capability gaps in Sensory Stimulation, Natural Verbal and Non-Verbal Communication Methods, Visual Representation of Terrain, and Visual Representation of Individuals.\n•  Visual Representation of Terrain.  Develop a central repository of correct textures, models and objects. Leverage technology advancements from the commercial gaming industry to improve visualization engines.\n•  Visual Representation of Individuals.  Develop a library of common body 3D frameworks to represent a variety of visual characteristics. Develop and utilize body-mapping technology to enable live role-players to drive avatar movement. Develop and utilize facial mapping technology to enable live role players to provide realistic avatar facial expressions. Develop a library of cut scenes and pre-recorded video segments for common human motions and movements. Develop and maintain a database of highly realistic animations. Leverage commercial gaming technology to allow rapid generation of unique avatars. Leverage technology resident in the entertainment industry to enhance immersive training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Program terminated as part of Secretary of Defense efficiency cuts."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "701"
                    },
                    "ProjectTitle": {
                        "val": "Air Force JNTC"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.955"
                        },
                        "PriorYear": {
                            "val": "2.041"
                        },
                        "CurrentYear": {
                            "val": "2.234"
                        },
                        "BudgetYearOne": {
                            "val": "2.716"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.716"
                        },
                        "BudgetYearTwo": {
                            "val": "2.794"
                        },
                        "BudgetYearThree": {
                            "val": "2.794"
                        },
                        "BudgetYearFour": {
                            "val": "2.858"
                        },
                        "BudgetYearFive": {
                            "val": "2.858"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Air Force JNTC funding is providing a focused upgrade to developing models for space based capabilities and integrated them into the JLVC environment.  The Air Force is also supporting development of cross domain solutions allowing for the linking of systems with differing security requirements, which significantly extend the breadth of the training audiences to additional joint and coalition participants."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AF JNTC"
                                    },
                                    "Description": {
                                        "val": "Air Force continues to develop joint enablers that drive realistic\/effective training by producing a deployable Electronic Warfare training capability for Europe which replicates double digit Surface-to-Air Missiles and advance Anti-Aircraft Artillery threats for U.S. and coalition forces.  In addition, Air Force assists in the development of Joint Cross Domain Information Sharing (JCDIS) Enterprise Network Architecture, which includes engineering, development, and deployment which will enable joint and coalition participants to train while classified information is segregated and protected, as required.  Air Force is creating cyber-contested environments in the distributed mission operations setting to challenge the joint exercise\/training audience.  Finally, comprehensive space effects are being integrated into the JLVC federation of models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.041"
                                            },
                                            "Text": {
                                                "val": "• Developed a Cyber Simulator to create a LVC environment to train\/exercise offensive\/defensive tactical cyber operators.\n• Modified current JLVC Federations to simulate Blue Cyber effects on adversary networks.  Enhanced exercise environment simulate the execution of operational and strategic plan\/orders in a constructive environment to better train cyber warriors. \n• Developed a Multinational Aviation Live Virtual Constructive Training System (MALTS).  This portable theater electronic warfare system presents aircrews with a highly realistic threat system.  Provides the opportunity for aircrews to neutralize\/suppress Red Integrated Air Defense Systems (IADS).\n• Continued Multi-Level Security (MLS).  MLS enables virtual and constructive entities of various classification levels to be accessed by users with different security clearances and needs-to-know, and prevents users from obtaining access to information for which they lack authorization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.234"
                                            },
                                            "Text": {
                                                "val": "Continue Cyber Simulator.  Expand the capability to create a LVC environment to train\/exercise offensive\/defensive tactical cyber operators.\nContinue Blue Cyber Effects.  Expand the capability to train cyber personnel on Blue cyber-attack on adversary networks.\nContinue Multinational Aviation Live Virtual Constructive Training System (MALTS).  Continue development of a deployable electronic warfare range to train\/exercise aircrew capabilities.  \nContinue Multi-Level Security (MLS).  MLS enables virtual and constructive entities of various classification levels to be accessed by users with different security clearances and needs-to-know, and prevents users from obtaining access to information for which they lack authorization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.716"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.716"
                                            },
                                            "Text": {
                                                "val": "Continue Cyber Simulator.  Expand the capability to create a LVC environment to train\/exercise offensive\/defensive tactical cyber operators.\nContinue Blue Cyber Effects.  Expand the capability to train cyber personnel on Blue cyber-attack on adversary networks.\nContinue Multinational Aviation Live Virtual Constructive Training System (MALTS).  \nContinue development of a deployable electronic warfare range to train\/exercise aircrew capabilities.  \nContinue Multi-Level Security (MLS).  MLS enables virtual and constructive entities of various classification levels to be accessed by users with different security clearances and needs-to-know, and prevents users from obtaining access to information for which they lack authorization."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "Air Force JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.722"
                                        },
                                        "CurrentYear": {
                                            "val": "13.774"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.043"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.043"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.064"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.824"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.908"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.849"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Multinational Aviation LVC Training System (MALTS) is the deployable Electronic Warfare (EW) system which will replicate opposing forces double digit surface to air missiles and advanced AAA threats for Europe and Africa.  This EW system is a critical cornerstone for Joint Forcible Entry Operations and for overcoming A2\/AD challenges expected in the theaters.\n• As the increased\/enhanced EW training capability is used in LVC events, observations regarding better ways to use it, better ways to train, better ways to provide feedback to the training audience should be recorded and briefed back to the Warrior Preparation Center senior leadership.\n\nAssisting Joint Staff and the Navy in developing Joint Cross Domain Information Sharing (JCDIS) Enterprise Network Architecture, which includes engineering, development, and deployment which will enable joint and coalition participants to train while classified information is segregated and protected, as required.\n• Will install additional JCDIS enclave communications solutions at applicable Air Force Distributed Training Centers (multiple Training Programs) and supporting technical facilities.\n\nAir Force is creating cyber-contested environments in the distributed mission operations setting to challenge the joint exercise\/training audience.\n• Adding cyber-contested environments will enhance existing LVC development environment to support exercises and training.\n\nAir Force is developing comprehensive space effects which are being integrated into the JLVC federation of models.\n• Integrating a fully operational Space Based Infrared System Missile Warning Simulator will allow space operators to actively participate in Distributed Mission Operations-Space LVC missile warning and Infrared special events."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "772"
                    },
                    "ProjectTitle": {
                        "val": "Navy JNTC"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.532"
                        },
                        "PriorYear": {
                            "val": "3.983"
                        },
                        "CurrentYear": {
                            "val": "4.180"
                        },
                        "BudgetYearOne": {
                            "val": "2.610"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.610"
                        },
                        "BudgetYearTwo": {
                            "val": "2.923"
                        },
                        "BudgetYearThree": {
                            "val": "2.923"
                        },
                        "BudgetYearFour": {
                            "val": "3.030"
                        },
                        "BudgetYearFive": {
                            "val": "3.030"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These funds enable Navy to develop unique maritime capabilities that integrate LVC elements into a seamless joint training environment. Navy program activities include conducting research, development, test and evaluation, and cross-service architecture certification on joint-capable systems, developing cross-domain architectures for US and Coalition Forces as well as ensuring sister service modeling\/simulation and instrumentation efforts follow a common unified standard."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Joint National Training Center"
                                    },
                                    "Description": {
                                        "val": "Develops unique maritime capabilities that integrate LVC elements into a seamless joint training environment.  Using a scientific and phased approach and focusing on modeling ground, air, space, and maritime capabilities, researches new technologies and methods that provide a crucial technology-based foundation supporting all JNTC T2 operations.  \n\nNavy JNTC RDT&E efforts Joint Semi Automated Forces (JSAF) modeling and simulation development and JNTC\/JLVC Navy Federation Object Model (FOM) Integration directly support the Unified Command Plan (UCP) and are aligned with the DOD information operations (IO) Roadmap."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.983"
                                            },
                                            "Text": {
                                                "val": "• Continued alignment of Navy LVC training standards with JLVC training standards, particularly next generation JLVC architecture.\n• Provided capabilities that support Ballistic Missile Defense (BMD) training - tailored to the Navy's DDG\/CG onboard BMD capability.  This effort involves continuous integration and development of numerous BMD models at the Missile Defense Agency (MDA) as well as the communication links\/data paths that allow us to provide this training to DDG\/CG even while at sea.\n• Addressed additional Coalition Partner Integration, Aegis BMD 5.0, Aegis Ashore Team Trainer, Integrated Undersea Surveillance System\/Surveillance Towed Array Sensor System integration, Combined Armed Forces - Distributed Mission Operations (DMO) integration, Cooperative Engagement Capability, and Naval Integrated Fires Capability - Counter Air.\n• Navy developed significant improvements to JSAF's representation of a realistic threat environment to address high priority training gaps.  These threat environment improvements included a more tactically-realistic electronic signals environment; unmanned Intelligence, Surveillance and Reconnaissance platform representation and employment, support and stimuli for U.S. signals collection models, training systems and combat systems, Electronic Attack representation, and an improved threat common operational picture representation for two-sided event support.\n• Continued to invest in capabilities that mitigate joint training gaps in joint exercises and home station training.\n• Extended and integrated virtual and augmented reality into training to facilitate the mastery of tasks not easily addressed in live training.\n• Continued the development of JSAF’s representations to Opposing Forces (O), Anti-Submarine Warfare (ASW), Electronic Warfare (EW), Signals Intelligence (SIGINT), Electronic Intelligence (ELINT), Communications Intelligence (COMINT), Integrated Air and Missile Defense (IAMD), MDA, and BMD capabilities in support of the Fleet, Joint and Coalition missions.\n• Continued development in support of Korea Battle Simulation Center (KBSC) integration, including releasable parametrics and KBSC specific enhancements.\n• Improved knowledge of and capabilities to build the capacity and competence of U.S., allied and partner forces for internal and external defense.\n• Delivered annual version of the Navy Training Baseline to include priority joint requirements.\n• Delivered annual version of the Navy Training FOM and Interoperability Guide."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.180"
                                            },
                                            "Text": {
                                                "val": "• Continue alignment of Navy LVC training standards with JLVC training standards, particularly next generation JLVC and Joint Training Enterprise Architectures.\n• Continue development of BMD training capabilities, including Aegis Ashore and numerous EUCOM\/CENTCOM BMD models.\n• Integration of new cyber and information operations training systems, including STALLION IO trainer and unmanned aircraft systems (UAS) streaming video generation and distribution.\n• Integration of additional Coalition Partner nation capabilities including Japanese PATRIOT and Air Defense Ground Environment.\n• Continue to invest in capabilities that mitigate joint training gaps in joint exercises and home station training.\n• Extend and integrate virtual and augmented reality into training to facilitate the mastery of tasks not easily addressed in live training.\n• Continue the development of JSAF’s representations to OPFOR, ASW, EW, SIGINT, ELINT, COMINT, IAMD, MDA, and BMD capabilities in support of the fleet, joint and coalition missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.610"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.610"
                                            },
                                            "Text": {
                                                "val": "• Continue alignment of NAVY LVC training standards with JLVC training standards.\n• Limited development of BMD training capabilities, however, efforts to integrate Aegis Ashore and upgrade numerous EUCOM\/CENTCOM BMD models will be minimal.\n• Minimal efforts related to integration of additional Coalition Partner nation capabilities. \n• Continue the development of JSAF’s representations to OPFOR, ASW, EW, SIGINT, ELINT, COMINT, IAMD, MDA, and BMD capabilities in support of the fleet, and joint missions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "Navy JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.103"
                                        },
                                        "CurrentYear": {
                                            "val": "7.352"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.992"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.992"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.627"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.626"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.667"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.631"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n• Navy will produce one JSAF software release to include documentation; will design and implement upgrades to JSAF consistent with approved requirements and CRs and document the effects of JSAF capabilities (robustness) and stability.  Will design, implement, test, and integrate JSAF enhancements in accordance with requirements.\n\n• Navy will produce one Navy Training Federation Object Model (FOM) (NTF) release to include applicable documentation updates for the Guidance, Rational, and Interoperability Manual (GRIM) and Federation Agreement document (FAD). Will implement JSAF capability enhancements to support evolving joint and Coalition training requirements.\n\n• Navy will deliver a JSAF\/JNTC-JLVC FOM interoperability Guide.\n\n• Navy will facilitate integration by providing dedicated support to the effort, improving the quality of participation and documentation of Navy efforts in the JNTC.  Refine and mature the Navy Training Federation Object Model (NTF), it is improving interoperability and integration with other services and the Joint community.  Provides a standardized FOM for integration across the Navy training simulations.\n\n• Navy’s current JLVC and other federation simulation distribution are accomplished by tying simulation data to multicast groups.  This is neither a scalable solution nor is it an effective one as federates are not able to publish and subscribe with fine enough precision.  The Simulation Aware Software Router will address this shortcoming, and additionally provide a flexible solution for federating heterogeneous networks and on-the-wire protocols without forcing all federates onto a single, uniform, lowest common denominator solution for each training event.  Ultimately, a simulation aware router will allow simulation users to optimize the network for both simulation scalable traffic and for voice and Command, Control, Communications, (Computers), Intelligence (C4I) traffic."
                        }
                    }
                }
            ]
        }
    }
}