{
    "id": "94694bef9a2ef9bc86f7c065d41188ae40b98d16",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0605100D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Mission Environment Test Capability (JMETC)"
        },
        "R1LineNumber": {
            "val": "138"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "10.215"
            },
            "PriorYear": {
                "val": "21.055"
            },
            "CurrentYear": {
                "val": "27.878"
            },
            "BudgetYearOne": {
                "val": "27.162"
            },
            "BudgetYearOneBase": {
                "val": "27.162"
            },
            "BudgetYearTwo": {
                "val": "27.253"
            },
            "BudgetYearThree": {
                "val": "28.263"
            },
            "BudgetYearFour": {
                "val": "29.902"
            },
            "BudgetYearFive": {
                "val": "32.418"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Mission Environment Test Capability (JMETC) program was established for the purpose of implementing the Department’s strategy to move to an enterprise-centric, distributed test capability that results in acquisition systems fielded with enhanced joint capabilities, reduced program costs, and improved acquisition timelines.  The JMETC program implements the infrastructure capabilities defined in the DoD’s “Testing in a Joint Environment Roadmap” to provide acquisition program managers a robust nation-wide capability to “test like we fight.”  JMETC provides a persistent, distributed test and evaluation (T&E) capability; supporting system development, interoperability testing, and cyber testing; that otherwise would not be readily available to Service\/Component acquisition programs.  USD (AT&L) directed TRMC to take responsibility for operations and resources of the National Cyber Range (NCR) beginning October 1, 2012. The Director of TRMC assigned NCR to JMETC.  The JMETC program is funded within the RDT&E Management Support Budget Activity because it is intended to provide test capability in support of RDT&E programs.  JMETC creates a common corporate capability to link live systems with virtual and constructive representations in order to generate a realistic joint mission test environment for the system(s) being tested.  To support the DoD guidance on cyber defense and attack operations, the JMETC environment includes a distributed cyberspace interoperability testing capability for systems under test.  JMETC is a widely applicable, persistent, service provider for the Department’s acquisition and net-centric programs.  Key JMETC products include readily available connectivity over existing networks, standardized data transport solutions, tools and utilities for planning and conducting distributed integrations, DoD corporate distributed testing expertise, and a reuse repository.  This common integration capability, through the use of the Test and Training Enabling Architecture (TENA), provides compatibility between JMETC and the Joint National Training Capability (JNTC), streamlining reuse of technical resources across the test and training communities.  In turn, this integration capability enables combined test and training exercises.\n \n       By linking distributed facilities, JMETC allows acquisition programs to efficiently evaluate their warfighting capability in a realistic joint mission environment.  This enables a customer-defined joint mission test environment for systems engineering and testing, extensible to training and experimentation, in a timely and cost effective manner.\n \n       JMETC’s institutional funding builds, maintains, and operates the JMETC infrastructure and pays for persistent availability of national connectivity for testing; data communications middleware; identification and development of interface standards; common software tools and components; and a reuse repository.  It also funds JMETC program management, facilities, equipment, operating costs, and special studies and analysis related to distributed test capabilities and infrastructure.  Key attributes of the JMETC include:  persistency; interoperability; reuse; various combinations of distributed capabilities (reconfigurable infrastructure to meet customer requirements to include distributed cyber testing); modeling and simulation (M&S) linkage; Live-Virtual-Constructive (LVC) test resource integration; and distributed test support to satisfy both Service and Joint needs.  System engineering, training, and experimentation all benefit from a corporate JMETC developed for T&E.\n       \nThe Test Resource Management Center (TRMC) is the Department’s lead for the JMETC program and oversees both its development and its operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.380"
                },
                "CurrentYear": {
                    "val": "31.000"
                },
                "BudgetYearOne": {
                    "val": "31.557"
                },
                "BudgetYearOneBase": {
                    "val": "31.557"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.055"
                },
                "CurrentYear": {
                    "val": "27.878"
                },
                "BudgetYearOne": {
                    "val": "27.162"
                },
                "BudgetYearOneBase": {
                    "val": "27.162"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.675"
                },
                "CurrentYear": {
                    "val": "-3.122"
                },
                "BudgetYearOne": {
                    "val": "-4.395"
                },
                "BudgetYearOneBase": {
                    "val": "-4.395"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.022"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.589"
                    },
                    "CurrentYear": {
                        "val": "-3.100"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.492"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.228"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY 2015 Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.395"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.395"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "•  Strategic efficiency reductions in management headquarters funding and staffing for better alignment and to provide support to a smaller military force."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "100"
                    },
                    "ProjectTitle": {
                        "val": "Joint Mission Environment Test Capability (JMETC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.215"
                        },
                        "PriorYear": {
                            "val": "21.055"
                        },
                        "CurrentYear": {
                            "val": "27.878"
                        },
                        "BudgetYearOne": {
                            "val": "27.162"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.162"
                        },
                        "BudgetYearTwo": {
                            "val": "27.253"
                        },
                        "BudgetYearThree": {
                            "val": "28.263"
                        },
                        "BudgetYearFour": {
                            "val": "29.902"
                        },
                        "BudgetYearFive": {
                            "val": "32.418"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Mission Environment Test Capability (JMETC) program was established for the purpose of implementing the Department’s strategy to move to an enterprise-centric, distributed test capability that results in acquisition systems fielded with enhanced joint capabilities, reduced program costs, and improved acquisition timelines.  The JMETC program implements the infrastructure capabilities defined in the Department of Defense’s “Testing in a Joint Environment Roadmap” to provide acquisition program managers a robust nation-wide capability to “test like we fight.”  JMETC provides a persistent, distributed test and evaluation (T&E) capability; supporting system development, interoperability testing, and cyber testing; that otherwise would not be readily available to Service\/Component acquisition programs.  Under Secretary Defense for Acquisition, Technology and Logistics (USD(AT&L)) directed Test Resource Management Center (TRMC) to take responsibility for operations and resources of the National Cyber Range (NCR) beginning October 1, 2012. The Director of TRMC assigned NCR to JMETC.  The JMETC program is funded within the RDT&E Management Support Budget Activity because it is intended to provide test capability in support of RDT&E programs. \n   JMETC creates a common corporate capability to link live systems with virtual and constructive representations in order to generate a realistic joint mission test environment for the system(s) being tested.  JMETC is a widely applicable, persistent, service provider for the Department’s acquisition and net-centric programs.  Key JMETC products include readily available connectivity over existing networks, standardized data transport solutions, tools and utilities for planning and conducting distributed integrations, Department of Defense (DoD) corporate distributed testing expertise, and a reuse repository.  This common integration capability, through the use of the Test and Training Enabling Architecture (TENA), provides compatibility between JMETC and the Joint National Training Capability (JNTC), streamlining reuse of technical resources across the test and training communities.  In turn, this integration capability enables combined test and training exercises.\n\n   By linking distributed facilities, JMETC allows acquisition programs to efficiently evaluate their warfighting capability in a realistic joint mission environment.  This enables a customer-defined joint mission test environment for systems engineering and testing, extensible to training and experimentation, in a timely and cost effective manner.\n\n    JMETC’s institutional funding builds, maintains, and operates the JMETC infrastructure and pays for persistent availability of national connectivity for testing; data communications middleware; identification and development of interface standards; common software tools and components; and a reuse repository.  Additionally, in FY 2013 funding was added to the JMETC program to provide improved cyber test capability.  Also, in FY 2013, responsibility for the National Cyber Range (NCR) was given to the Test Resource Management Center (TRMC) and subsequently put under the JMETC management team.  The NCR was funded in FY 2013 through funds provided by Defense Advanced Research Projects Agency (DARPA), Director, Operational Test & Evaluation (DOT&E), Assistant Secretary of Defense (Research & Engineering)(ASD(R&E)) reprogramming, and the TRMC investment programs.  JMETC program funding also provides JMETC program management, facilities, equipment, operating costs, and special studies and analysis related to distributed test capabilities and infrastructure.  Key attributes of the JMETC include:  persistency; interoperability; reuse; various combinations of distributed capabilities (reconfigurable infrastructure to meet customer requirements); modeling and simulation (M&S) linkage; Live-Virtual-Constructive (LVC) test resource integration; and distributed test support to satisfy both Service and Joint needs.  System engineering, training, and experimentation all benefit from a corporate JMETC developed for T&E.\n\t\n   The Test Resource Management Center (TRMC) is the Department’s lead for the JMETC program, the National Cyber Range, and oversees both their development and operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Mission Environment Test Capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.055"
                                            },
                                            "Text": {
                                                "val": "- Joint Mission Environment Test Capability (JMETC)\n\n- Continued to expand the JMETC persistent infrastructure to 72 sites with an additional 15 planned.  Increased our network connectivity to industry and academia with the addition of peering points to MITRE Corporation, Georgia Tech Research Institute (GTRI) and Lockheed Martin Corporation.\n\n- Supported 48 distinct customer distributed live-virtual-constructive (LVC) test activities to Department of Defense (DoD) acquisition programs and events as follows:  MQ-4C Triton (formerly referred to as Broad Area Maritime Surveillance [BAMS]) Environment Integration; Air Force Systems Interoperability Tests (AFSIT)(five test events); Aegis Accelerated Mid-Term Interoperability Improvement Program (AMIIP) (later to be called Aegis Performance Assessment Verification (PAV) and Multi-site Test Bed (MST); Joint Integrated Air and Missile Defense Organization’s (JIAMDO) Correlation\/De-correlation Interoperability Test (C\/DIT); JIAMDO Joint Tactical Air Picture Mission Environment – 12A (JTAP – ME); Joint Interoperability Test Command (JITC) Joint Interoperability Tests (four actual test events); Air Ground Integrated Layer Exploration (AGILE) Fire VII and VIII; E-2D tests; Joint Track Manager Capability \/Composite Track Management (JTMC-D\/CTM); Distributed Common Ground System – Army (DCGS-A); Air Intercept Missile (AIM-9X); Joint Distributed Infrared Countermeasures (IRCM) Ground Test System (JDIGS); US Naval Air Systems Command (NAVAIR) Integrated Warfare Capability (IWC); Marine Corps Virtual Rapid Prototyping Laboratory (VRPL); Interoperability Test and Evaluation Capability (InterTEC) System Integration Test; Aegis Performance Assessment Verification (PAV), and the Integrated Cyber Event (ICE).\n\n- Continued to provide general distributed test planning and execution support to the following customers; MQ-4C Triton, Joint Tactical Networking Center (JTNC) formerly the Program Executive Office (JPEO), JTMC-D\/CTM, Aegis PAV and Multi-site Test Bed (MST) (formerly AMIIP), AFSIT, NAVAIR IWC events, InterTEC development and fielding, and numerous other smaller test activities.\n\n- Continued planning support to new and on-going acquisition program customers, particularly MQ-4C Triton, Apache Block III, P-8A Poseidon (Increment 3), Unmanned Carrier Launched Airborne Surveillance and Strike (UNCLASS), F-35, F-22, Small Diameter Bob II, Air Intercept Missile (AIM-9X), Integrated Defensive Electronic Countermeasures (IDECM), Army Network Integration Event\/Brigade Modernization (NIE), JTNC Joint Reference Implementation Laboratory (JRILs), Common Aviation Command and Control System (CAC2S), Joint Operational Test Approach (JOTA-2) Mode V IFF, Dismounted Detection Radar (DDR), Electromagnetic Rail Gun, Three-Dimensional Expeditionary Long Range Radar (3DELRR), Counter Remote Controlled Improvised Explosive Device (IED) Electronic Warfare (CREW), and Advanced Anti-Radiation Guided Missile (AARGM).\n\n- Enhanced the User Interface and content of the web-based JMETC Reuse Repository to store distributed test tools, utilities, lessons learned, and test metadata making all available to the DoD test community.\n\n- Supported JIAMDO in the successful renegotiation of the International Agreement between the United States and United Kingdom for C\/DIT.\n\n- Collaborated and supported the JTNC program in the development of a Radio Frequency (RF) over Fiber capability to digitize and extend an RF signal over the JMETC network, enabling remote radio play in geographically separated networks.  The design and development for this project has been completed and initial, early testing of the device with various waveforms has shown that this project will achieve it designed goals.  This capability will result in a significance cost avoidance (estimated in the millions of dollars) to the JTNC program.\n\n- Assisted and supported customers with distributed test tools and expertise for planning and executing their distributed events.\n\n- National Cyber Range:\n\n- Received responsibility for the National Cyber Range in Orlando, FL, a cyber test facility, a majority of which is a fully accredited Secure Compartmentalized Information Facility (SCIF).   The facility is comprised of an array of servers, networking, storage devices and an integrated tool suite.  During the year, the NCR was accredited by the Defense Intelligence Agency to operate at the Top Secret, Sensitive Compartmented Intelligence level of security, making the NCR fully test capable through the range of classification levels.  The NCR provides the ability to rapidly design, deploy and sanitize large scale, high fidelity test and training environments in which extremely malicious threats can be unleashed on operationally, representative systems and networks to assess the impact on the network, networked weapon systems, and the associated mission.   Considerable technological advancements were incorporated into the integrated tool suite which is highlighted by the significant level of automation and the ability to support up to four concurrent events, executed in completely isolated testbeds, at different levels of classification.\n\n- The NCR supported users in FY 2013 included Office of the Director, Operational Test and Evaluation, US Pacific Command, US Cyber Command, other Defense Agencies, and DoD development programs.  Their objectives have included testing for vulnerabilities, scalability, malware propagation, and effective defenses.  Even though the primary focus has been on functionalizing, refining and accrediting the capabilities, the NCR conducted 8 events through August of FY 2013, has another 8 events scheduled into FY 2014, and is planning additional tests to be executed after the end of the calendar year.  An event normally consists of a week for integration and set-up, a week or two of testing, and a week for analysis.\n\n- Cyber Test and Evaluation\n\n- Initiated the Cyber Range Interoperability Standards (CRIS) effort, developing a common lexicon, developing a standard cyber test process, and beginning the effort to prioritize needed standards which will result in efficiencies through improved interoperability and scalability.  This effort was executed through participation by representatives from across the cyber range community.\n\n- Worked with the Deputy Assistant Secretary Defense Developmental Test & Evaluation (DASD DT&E), Army Threat Systems Management Office, and the Air Force 46th Test Squadron to conduct an Integrated Cyber Event (ICE).  This cyber test event proved that the infrastructure is adequate to test a command and control system.  However, it also pointed out the significant need for improvements in areas such as red and blue environments, cyber test instrumentation, and a cyber visualization capability.\n\n- Deployed the first of several production Regional Service Delivery Points (RSDP).  This first system resides at the Threat System Management Office (TSMO) and will provide enterprise resources for computing, storage, and common services.  Funded the development of the second Regional Service Delivery Point (RSDP) which will provide increased capacity for cyber test and training.   The RSDPs will also promote efficiencies by providing enterprise services, such as realistic traffic generation, visualization tools, instrumentation, and other tools.\n\n- Developed Cyber T&E Use Cases, a set of operational and system architecture driven products, that helps identify potential threat vectors and test concepts needed to identify Cyber T&E infrastructure requirements for testing representative C2 Systems, Combat Systems, Weapon Systems, and Business IT Systems.\n\n- Initiated planning for significant distributed test infrastructure enhancements that will support multiple, concurrent classification up to and including TS\/\/SCI with a focus on leveraging the RSDP capabilities and incorporating both kinetic and non-kinetic assets to address growing interoperability and cyber T&E requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.878"
                                            },
                                            "Text": {
                                                "val": "- Joint Mission Environment Test Capability (JMETC):\n\n- Continue to provide distributed test support for 15-20 major customer events such as Apache Block III Link-16 Interoperability test, Joint Tactical Networking Center (JTNC) Joint Reference Implementation Laboratory (JRIL), MQ-4C Triton , Army Integrated Air and Missile Defense (IAMD), JIAMDO projects, Joint Interoperability Tests (JITS), AGILE Fire, NAVAIR Integrated Warfare Capability (IWC), Marine Corps Virtual Rapid Prototyping Laboratory (VRPL), and numerous smaller test activities, as well as, continuous interconnectivity between distributed test resources for day-to-day exchange of test operations data.\n\n- Continue planning support to new and on-going acquisition programs including;  Apache Block III, Army Network Integration Event (NIE)\/Brigade Modernization, Counter Remote Controlled Improvised Explosive Device (IED) Electronic Warfare (CREW), JTNC JRIL, F-35, Small Diameter Bomb (SDB)II, MQ-4C Triton, CVN-78, P-8A Poseidon, Advanced Anti-Radiation Guided Missile (AARGM), Integrated Defensive Electronic Countermeasures (IDECM), Unmanned Carrier Launched Airborne Surveillance & Strike (UCLASS), Common Aviation Command and Control System (CAC2S),Joint Space Operations Center (JSpOC) Mission Space (JMS), Marine Corps Combat Operations Center (CoC), and Tactical Mobile(TacMobile).\n\n- Continue planning and begin implementation of distributed test infrastructure enhancements that will support multiple, concurrent classification up to and including TS\/\/SCI with a focus on leveraging the RSDP capabilities and incorporating both kinetic and non-kinetic assets to address growing interoperability and cyber T&E requirements.\n\n- Continue collaboration with the Training community by providing distributed test planning support to the Joint Staff J7, the Joint Staff J6 Command, Control, and Interoperability (C2I), and to other customers for their distributed test events.\n\n- Continue strategic planning efforts to engage new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter (NR-KPP) and Cybersecurity requirements.\n\n- Continue coordination efforts to integrate DoD\/Service\/Industry\/Academia distributed test and evaluation infrastructure to the JMETC infrastructure.\n\n- Continue to enhance the User Interface and content of the web-based JMETC Reuse Repository to store distributed test tools, utilities, lessons learned, and test metadata making all available to the DoD test community.\n\n- Continue to assist customers with the use of distributed test tools and troubleshooting of local network infrastructures.  Provide remote and on-site support for the planning and execution of distributed events.\n\n- National Cyber Range:\n\n- Continue to sustain the National Cyber Range’s (NCR) capabilities to meet growing customer requirements.  The NCR will support test planning and execution for TRITON, P-8A, Army Intelligence and Information Warfare Directorate, Naval Intelligence, Defense Information Systems Agency, National Assessment Group, Director Operational Test and Evaluation, and other acquisition programs. \n\n- Complete the NCR tools study to evaluate NCR tools for expansion for enterprise use with a focus on Regional Service Delivery Points (RSDPs).\n\n- Develop a plan of action and milestone (POA&M) to implement a wireless cyber test capability at the NCR. \n\n- Cyber Test and Evaluation:\n\n- Continue the planning, alignment, and coordination to establish and improve the test infrastructure for cyber tests and assessments by leveraging other TRMC investments (i.e., Central Test & Evaluation Investment Program (CTEIP) and Test and Evaluation\/Science and Test (T&E\/S&T)) and capabilities of existing cyber ranges (DoD\/Services\/Industry\/Academia).\n\n- Continue to identify, assess, and develop cyber test tools as enterprise solutions to capability gaps.\n\n- Deploy the 2nd RSDP which will provide enterprise compute, storage, and common services resources.\n\n- Continue to lead the Cyber Range Interoperability Standards (CRIS) working group to identify keys areas in which establishment and adoption of standards across cyber ranges will result in efficiencies and improved scalability.\n\n- Complete the Cyber T&E Roadmap and begin the time-phased process of integrating capabilities across four (4) communities of interest (COI) – testing, experimentation, training, and mission rehearsal – in support of Test and Evaluation (T&E)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.162"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.162"
                                            },
                                            "Text": {
                                                "val": "- Joint Mission Environment Test Capability (JMETC)\n\n- Continue to provide distributed test support for major customer events such as the Joint Tactical Networking Center (JTNC), Joint Reference Implementation Laboratory (JRIL), MQ-4C Triton, Army Integrated Air and Missile Defense (AIAMD), Joint Interoperability Tests (JITs), AGILE Fire, NAVAIR Integrated Warfare Capability (IWC), and numerous smaller test activities, as well as, continuous interconnectivity between distributed test resources for day-to-day exchange of test data.\n\n- Continue planning support to new and on-going acquisition programs including: Program Executive Office, Intelligence, Surveillance, and Sensor Systems (PEO IEW&S) (multiple programs),  JTNC JRIL, F-35, Small Diameter Bomb (SDB) II, MQ-4C Triton,P-8A Poseidon, Advanced Anti-Radiation Guided Missile (AARGM), Integrated Defensive Electronic Countermeasures (IDECM), Unmanned Carrier Launched Airborne Surveillance & Strike (UCLASS), Common Aviation Command and Control System (CAC2S, Joint Space Operations Center (JSpOC) Mission Space (JMS), Tactical Mobile (TacMobile), and Marine Corps Tactical Operations Center (CoC)\n\n- Continue implementation of distributed test infrastructure enhancements that will support multiple, concurrent classifications up to and including TS\/\/SCI with a focus on leveraging the RSDP capabilities and incorporating both kinetic and non-kinetic assets to address growing interoperability and cyber T&E requirements.  \n\n- Continue strategic planning efforts to engage new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter (NR-KPP) and Cybersecurity requirements.\n\n- Continue coordination efforts to integrate DoD\/Service\/Industry\/Academia distributed test and evaluation infrastructure to the JMETC infrastructure.\n\n- Continue to assist customers with the use of distributed test tools and troubleshooting of the end-to-end network infrastructures.  Continue providing remote and on-site support for the planning and execution of distributed events.\n\n- National Cyber Range:\n\n- Continue to sustain the NCR capabilities and processes to support customer demand. Assess improvements needed in encryption, and increase capacity to support increased demand.  \n\n- Cyber Test and Evaluation:\n\n- Continue the planning, alignment, and coordination to establish and improve the test infrastructure for cyber tests and assessments by leveraging other TRMC investments (i.e., CTEIP and T&E\/S&T) and capabilities of existing cyber ranges (DoD\/Services\/Industry\/Academia).\n\n- Continue to implement distributed test infrastructure enhancements that will support multiple, concurrent classification up to and including TS\/\/SCI with a focus on leveraging the RSDP capabilities and incorporating both kinetic and non-kinetic assets to address growing interoperability and cyber T&E requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "- Expansion of initial capability to support acquisition program test requirements, providing distributed capability to test systems and demonstrating required joint capability.\n - Successful use of integration software compatible with the JNTC and Joint Training infrastructure.\n - Number of test sites\/locations that are reused to support distributed tests using the JMETC infrastructure."
                        }
                    }
                }
            ]
        }
    }
}