{
    "id": "97278c0448aa5008a2f1051e96c3c9f6684af5ad",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V3B_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0708610F"
        },
        "ProgramElementTitle": {
            "val": "Logistics Information Technology (LOGIT)"
        },
        "R1LineNumber": {
            "val": "241"
        },
        "MdapCode": {
            "val": "221"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "27.070"
            },
            "CurrentYear": {
                "val": "60.410"
            },
            "BudgetYearOne": {
                "val": "109.685"
            },
            "BudgetYearOneBase": {
                "val": "109.685"
            },
            "BudgetYearTwo": {
                "val": "90.179"
            },
            "BudgetYearThree": {
                "val": "3.563"
            },
            "BudgetYearFour": {
                "val": "3.632"
            },
            "BudgetYearFive": {
                "val": "3.701"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2015, Project 675207, Logistics IT System Modernization includes New Start efforts (Transformation - Supply Chain Management Initiative)."
        },
        "ProgramElementMissionDescription": {
            "val": "The Expeditionary Combat Support System (ECSS) program was canceled 11 December 2012.  The cancellation of ECSS has driven the Air Force to re-evaluate its strategy to enable logistics Information Technology (IT) capabilities.  The Air Force still requires an integrated logistics capability that provides timely, accurate and reliable information to decision makers at all levels of command and across the full range of military operations.  The Air Force is transitioning from ECSS to a hybrid approach of core legacy system remediation \/ modification and transformation, to include transitioning to a common IT hosting environment. This approach moves away from a large scale Enterprise Resource Planning (ERP) capability and uses firm requirements, smaller scale development efforts and shorter delivery schedules to achieve FY 2017 statutory Financial Improvement and Audit Readiness (FIAR) and operational requirements.\n\t\nLogistics Transformation: Logistics transformation will be accomplished through capability initiatives to include Maintenance, Repair and Overhaul (MRO), Supply Chain Management (SCM), Product Lifecycle Management (PLM), Advanced Planning and Scheduling (APS) and Field Maintenance.  \n\n-- MRO will create an integrated capability that plans, schedules, and executes organic depot maintenance support functions critical to agile planning, optimized workload assignment, resource allocation and throughput, thereby increasing depot maintenance support to the warfighter.  \n\n-- SCM includes Air Force Wholesale Supply, Item Master, Retail Supply, and related initiatives.  Wholesale Supply encompasses centralized planning and management of items and equipment such as: repairables, consumables, Nuclear Weapons-Related Materiel (NWRM) and cryptographic items.  Item Master provides the capability to manage comprehensive, accurate, and reliable item data.  Retail Supply comprises business operations and inventory for the Air Force Base Supply community.    \n\n-- The PLM capability will enable Air Force engineering\/logistics communities to define, track, protect and manage product data for Air Force weapon systems and equipment. \n\n-- APS will provide an integrated, accurate and timely supply chain planning capability to project inventory allocations that facilitate improved decision-making throughout the Demand Planning, Inventory Planning, Supply Planning, Exception Management, and Analytics processes.  \n\n-- Field Maintenance will improve Air Force base-level maintainers' ability to plan, schedule, execute and maintain oversight capabilities that support timely and accurate asset\/resource management related to weapons systems inventory, status and usage reporting.\n\nRemediation\/Modification Efforts:  The remediation and modification of core logistics systems is necessary for the Air Force to meet statutory Financial Improvement Audit Readiness (FIAR) by 2017 and align with the Joint Chiefs of Staff J-4 Concept for Logistics and the Air Force Logistics Board's approved Enterprise Logistics Strategy (ELS).  Systems contained in these business areas include, but are not limited to, the Air Force Equipment Management System (AFEMS), Integrated Maintenance Data System (IMDS), Reliability and Maintainability Information System (REMIS), Combat Ammunitions System (CAS), Enhanced Maintenance Operations Center (EMOC), Aircraft Structural Integrity Management Information System (ASIMIS), Integrated Logistics System-Supply (ILS-S), Cargo Movement Operations System (CMOS), Stock Control System (SCS), Purchase Request Process System (PRPS), Automated Logistics Management Support System (ALMSS), Depot Maintenance Accounting and Production System (DMAPS), Cryptologic Depot Accountability System (CDAS), Commercial Asset Visibility-Air Force (CAV-AF), Enhanced Technical Information System (ETIMS), and Weapon System Management Information System (WSMIS).\n\nActivities for legacy system remediation\/modification and transformation will apply Business Process Re-Engineering (BPRE) and the Air Force Service Development and Delivery Process (SDDP)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "119.327"
                },
                "CurrentYear": {
                    "val": "95.238"
                },
                "BudgetYearOne": {
                    "val": "115.300"
                },
                "BudgetYearOneBase": {
                    "val": "115.300"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "27.070"
                },
                "CurrentYear": {
                    "val": "60.410"
                },
                "BudgetYearOne": {
                    "val": "109.685"
                },
                "BudgetYearOneBase": {
                    "val": "109.685"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-92.257"
                },
                "CurrentYear": {
                    "val": "-34.828"
                },
                "BudgetYearOne": {
                    "val": "-5.615"
                },
                "BudgetYearOneBase": {
                    "val": "-5.615"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.102"
                    },
                    "CurrentYear": {
                        "val": "-0.068"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-42.000"
                    },
                    "CurrentYear": {
                        "val": "-34.760"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-43.230"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.228"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.697"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.615"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.615"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY15 is due to higher Air Force priorities.     \n\nFY13: PE is reduced by $4.697M due to sequestration.  PE is reduced by $43.23M for above threshold reprogramming for higher Air Force priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675207"
                    },
                    "ProjectTitle": {
                        "val": "Logistics IT System Modernization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.249"
                        },
                        "CurrentYear": {
                            "val": "60.410"
                        },
                        "BudgetYearOne": {
                            "val": "109.685"
                        },
                        "BudgetYearOneBase": {
                            "val": "109.685"
                        },
                        "BudgetYearTwo": {
                            "val": "90.179"
                        },
                        "BudgetYearThree": {
                            "val": "3.563"
                        },
                        "BudgetYearFour": {
                            "val": "3.632"
                        },
                        "BudgetYearFive": {
                            "val": "3.701"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2015, Project 675207, Logistics IT System Modernization includes New Start efforts (Transformation - Supply Chain Management Initiative)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Expeditionary Combat Support System (ECSS) program was canceled 11 December 2012.  The cancellation of ECSS has driven the Air Force to re-evaluate its strategy to enable logistics Information Technology (IT) capabilities.  The Air Force still requires an integrated logistics capability that provides timely, accurate and reliable information to decision makers at all levels of command and across the full range of military operations.  The Air Force is transitioning from ECSS to a hybrid approach of core logistics system remediation \/ modification and transformation, to include transitioning to a common IT hosting environment. This approach moves away from a large scale Enterprise Resource Planning (ERP) capability and uses firm requirements, smaller scale development efforts and shorter delivery schedules to achieve FY 2017 statutory Financial Improvement and Audit Readiness (FIAR) and operational requirements.\n\t\nLogistics Transformation: Logistics transformation will be accomplished through capability initiatives, to include Maintenance, Repair and Overhaul (MROi), Supply Chain Management (SCM), Product Lifecycle Management (PLM), Advanced Planning and Scheduling (APS) and Field Maintenance.  \n\n-- MRO will create an integrated capability that plans, schedules, and executes organic depot maintenance support functions critical to agile planning, optimized workload assignment, resource allocation and throughput, thereby increasing depot maintenance support to the warfighter.  \n\n-- SCM includes Air Force Wholesale Supply, Item Master, Retail Supply, and related initiatives.  Wholesale Supply encompasses centralized planning and management of items and equipment such as: repairables, consumables, Nuclear Weapons-Related Materiel (NWRM) and cryptographic items.  Item Master provides the capability to manage comprehensive, accurate, and reliable item data.  Retail Supply comprises business operations and inventory for the Air Force Base Supply community.   \n\n-- The PLM capability will enable Air Force engineering\/logistics communities to define, track, protect and manage product data for Air Force weapon systems and equipment. \n\n-- APS will provide an integrated, accurate and timely supply chain planning capability to project inventory allocations that facilitate improved decision-making throughout the Demand Planning, Inventory Planning, Supply Planning, Exception Management, and Analytics processes.  \n\n-- Field Maintenance will improve Air Force base-level maintainers' ability to plan, schedule, execute and maintain oversight capabilities that support timely and accurate asset\/resource management related to weapons systems inventory, status and usage reporting.\n\nRemediation\/Modification Efforts:  The remediation and modification of core logistics systems is necessary for the Air Force to meet statutory Financial Improvement Audit Readiness (FIAR) by 2017 and align with the Joint Chiefs of Staff J-4 Concept for Logistics and the Air Force Logistics Board's approved Enterprise Logistics Strategy (ELS).  Systems contained in these business areas include, but are not limited to, the Air Force Equipment Management System (AFEMS), Integrated Maintenance Data System (IMDS), Reliability and Maintainability Information System (REMIS), Combat Ammunitions System (CAS), Enhanced Maintenance Operations Center (EMOC), Aircraft Structural Integrity Management Information System (ASIMIS), Integrated Logistics System-Supply (ILS-S), Cargo Movement Operations System (CMOS), Stock Control System (SCS), Purchase Request Process System (PRPS), Automated Logistics Management Support System (ALMSS), Depot Maintenance Accounting and Production System (DMAPS), Cryptologic Depot Accountability System (CDAS), Commercial Asset Visibility-Air Force (CAV-AF), Enhanced Technical Information Management System (ETIMS), and Weapon System Management Information System (WSMIS).\n\nActivities for legacy remediation\/modification and transformation will apply Business Process Re-Engineering (BPRE) and the Air Force Service Development and Delivery Process (SDDP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automated Logistics Management Support System (ALMSS) Financial Improvement Audit Readiness (FIAR)"
                                    },
                                    "Description": {
                                        "val": "Modify ALMSS software to support FIAR."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "Modify ALMSS software to support FIAR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue to modify ALMSS software to support FIAR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Ammunition System (CAS) Software Upgrade"
                                    },
                                    "Description": {
                                        "val": "In the FY14 PB, CAS Software Upgrade and CAS FIAR Compliance were separate projects; in the FY15 PB they will merge into one effort.  Modify CAS software to an object oriented\/modular design, provide a more sustainable and scalable baseline, and improve operational performance.  Modify CAS software to support Financial Improvement and Audit Readiness (FIAR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "Modify CAS software to an object oriented\/modular design, provide a more sustainable and scalable baseline, and improve operational performance. Modify CAS software to support FIAR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "Continue to modify CAS software to an object oriented\/modular design, provide a more sustainable and scalable baseline, and improve operational performance. Modify CAS software to support FIAR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cryptologic Depot Accountability System (CDAS) Financial Improvement Audit Readiness (FIAR)"
                                    },
                                    "Description": {
                                        "val": "Modify CDAS software to support Financial Improvement Audit Readiness (FIAR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.280"
                                            },
                                            "Text": {
                                                "val": "Modify CDAS software to support FIAR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Continue to modify CDAS software to support FIAR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cargo Movement Operations System (CMOS) Financial Improvement Audit Readiness (FIAR)"
                                    },
                                    "Description": {
                                        "val": "Modify CMOS software to support Financial Improvement and Audit Readiness (FIAR).\n\nThis effort is not a new start; all post-ECSS FIAR remediation and modification efforts for AF logistics IT systems were documented in the FY13 and FY14 justification materials for PE 0708610F under the Mission Description and Budget Item Justification sections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Modify CMOS software to support FIAR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Depot Maintenance Accounting and Production System (DMAPS) Financial Improvement Audit Readiness (FIAR)"
                                    },
                                    "Description": {
                                        "val": "Modify DMAPS software to support Financial Improvement and Audit Readiness (FIAR).  \n\nThis effort is not a new start; all post-ECSS FIAR remediation and modification efforts for AF logistics IT systems were documented in the FY13 and FY14 justification materials for PE 0708610F under the Mission Description and Budget Item Justification sections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.410"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.410"
                                            },
                                            "Text": {
                                                "val": "Modify DMAPS software to support FIAR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Logistics Systems-Supply (ILS-S) Financial Improvement Audit Readiness (FIAR)"
                                    },
                                    "Description": {
                                        "val": "Modify software to support Financial Improvement and Audit Readiness (FIAR). FY14\/15 effort broken down into multiple releases to primarily address the following requirements. \n\nRelease 3 (R3) - Expand orders management to include all orders \nRelease 4 (R4) - Comply with Rehabilitation Act Section 508 \nRelease 5 (R5) - Modify process for managing in-transit and inventory requirements"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.475"
                                            },
                                            "Text": {
                                                "val": "Continued modification of software to support FIAR (funded under Project 675208)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.913"
                                            },
                                            "Text": {
                                                "val": "Continue modification of software to support FIAR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.715"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.715"
                                            },
                                            "Text": {
                                                "val": "Complete modification of software to support FIAR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Logistics Systems-Supply (ILS-S) Software Modification - Re-Platform"
                                    },
                                    "Description": {
                                        "val": "Previous ILS-S Software Upgrade effort was divided into two separate efforts: ILS-S Software Modification - Wrapper and ILS-S Software Modification - Re-Platform. The ILS-S Software Modification - Re-platform effort is to migrate the Standard Base Supply System (SBSS) source code and data from the current UNISYS mainframe Common Business-Oriented Language (COBOL) based SBSS environment to a mid-tier Java environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.340"
                                            },
                                            "Text": {
                                                "val": "Migrate the SBSS source code and data from the current UNISYS mainframe COBOL based SBSS environment to a mid-tier Java environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.088"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.088"
                                            },
                                            "Text": {
                                                "val": "Continue to migrate the SBSS source code and data from the current UNISYS mainframe COBOL based SBSS environment to a mid-tier Java environment.  Begin functional requirements analysis and testing of the entire ILS-S application (1.3 million lines of code), which will require additional Subject Matter Experts, software developers, software tools, and hardware\/licenses to test the environments.  Certification and accreditation support as well as hardware\/software maintenance support is also required."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Purchase Repair Purchase System (PRPS) Financial Improvement Audit Readiness (FIAR)"
                                    },
                                    "Description": {
                                        "val": "Modify software to support Financial Improvement and Audit Readiness (FIAR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.140"
                                            },
                                            "Text": {
                                                "val": "Modify software to support FIAR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continue to modify software to support FIAR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Force Equipment Management System (AFEMS) Financial Improvement Audit Readiness (FIAR)"
                                    },
                                    "Description": {
                                        "val": "Modify AFEMS software to support Financial Improvement and Audit Readiness (FIAR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.356"
                                            },
                                            "Text": {
                                                "val": "Modified AFEMS software to support FIAR. (Funded under Project 675208.)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.208"
                                            },
                                            "Text": {
                                                "val": "Continue to modify AFEMS software to support FIAR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.337"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.337"
                                            },
                                            "Text": {
                                                "val": "Complete modification of AFEMS software to support FIAR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhance Technical Information Management System (ETIMS) Software Upgrade"
                                    },
                                    "Description": {
                                        "val": "Modify ETIMS software to incorporate Joint Computer-Aided Acquisition and Logistics Support (JCALS) functionality. Effort previously titled: ETIMS Software Upgrade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.190"
                                            },
                                            "Text": {
                                                "val": "Modified ETIMS software to incorporate JCALS functionality. (Funded under Project 675208.)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.504"
                                            },
                                            "Text": {
                                                "val": "Complete modification of ETIMS software to incorporate JCALS functionality."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.780"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.780"
                                            },
                                            "Text": {
                                                "val": "Modify ETIMS software code to incorporate functionality deferred during its initial fielding."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Maintenance Operations Center (EMOC) Software Upgrade"
                                    },
                                    "Description": {
                                        "val": "Modify EMOC software to support one-way interface from G081, which is an Air Mobility Command (AMC) maintenance data system designator for the Core Automated Maintenance System for Mobility.  This provides the ability to view an aircraft at an expeditionary base in a display comprised of selected aircraft from multiple Integrated Maintenance Data System (IMDS) Enterprise Location Codes (ELC).  Effort previously titled:  IMDS EMOC Software Upgrade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.560"
                                            },
                                            "Text": {
                                                "val": "Begin EMOC software upgrade to support one-way interface from G081 that provides ability to view aircraft at an expeditionary base in a display comprised of selected aircraft from multiple IMDS Enterprise Location Codes (ELC)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.568"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.568"
                                            },
                                            "Text": {
                                                "val": "Complete EMOC software upgrade to support one-way interface from G081 that provides ability to view aircraft at an expeditionary base in a display comprised of selected aircraft from multiple IMDS Enterprise Location Codes (ELC)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Maintenance Data System - Central Database (IMDS CDB) Software Upgrade"
                                    },
                                    "Description": {
                                        "val": "Modify IMDS CDB Software to comply with statutory\/regulatory technical improvements (Internet Protocol version 6 [IPV6], IUID, etc), and enable an infrastructure migration to reduce annual operating costs of critical maintenance documentation system.  \n\nThis effort is not a new start; all post-ECSS FIAR remediation and modification efforts for AF logistics IT systems were documented in the FY13 and FY14 justification materials for PE 0708610F under the Mission Description and Budget Item Justification sections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.220"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.220"
                                            },
                                            "Text": {
                                                "val": "Modify software to meet statutory\/regulatory requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Maintenance Data System - Central Database (IMDS CDB) Maintenance Scheduling Application Tool (MSAT) Software Upgrade"
                                    },
                                    "Description": {
                                        "val": "Modify IMDS Centralized Database (CDB) Maintenance Scheduling Application Tool (MSAT) software to enable the subsumption of MSAT functionality into IMDS CDB, reducing the number of core logistics systems required to document base level maintenance. Effort previously titled: IMDS MSAT Software Upgrade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.680"
                                            },
                                            "Text": {
                                                "val": "Modify IMDS Centralized Database (CDB) Maintenance Scheduling Application Tool (MSAT) software to enable the subsumption of MSAT functionality into IMDS CDB, reducing the number of core logistics systems required to document base level maintenance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.020"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.020"
                                            },
                                            "Text": {
                                                "val": "Complete modification and field IMDS CDB release that incorporates the functionally currently provided by MSAT."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Maintenance Data System - Central Database (IMDS CDB) Financial Improvement Audit Readiness (FIAR)"
                                    },
                                    "Description": {
                                        "val": "Modify software to support Financial Improvement and Audit Readiness (FIAR).\n\nThis effort is not a new start; all post-ECSS FIAR remediation and modification efforts for AF logistics IT systems were documented in the FY13 and FY14 justification materials for PE 0708610F under the Mission Description and Budget Item Justification sections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.280"
                                            },
                                            "Text": {
                                                "val": "Modify software to support FIAR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reliability and Maintainability Information System (REMIS) Software Upgrade"
                                    },
                                    "Description": {
                                        "val": "Modify REMIS software to transition system into a single open architecture baseline and comply with statutory\/regulatory technical improvements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Began efforts to modify REMIS software to transition system into a single open architecture baseline. (Funded under Project 675208.)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.749"
                                            },
                                            "Text": {
                                                "val": "Continue to modify REMIS software to transition system into a single open architecture baseline."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.298"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.298"
                                            },
                                            "Text": {
                                                "val": "Continue to modify REMIS system into a single open architecture baseline, then transition to deferred enhancements and potential subsumption of other maintenance systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reliability and Maintainability Information System (REMIS) Financial Improvement Audit Readiness (FIAR)"
                                    },
                                    "Description": {
                                        "val": "Modify software to support Financial Improvement and Audit Readiness (FIAR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Modify REMIS software to support FIAR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Complete modification of REMIS software to support FIAR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stock Control System (SCS) Financial Improvement Audit Readiness (FIAR)"
                                    },
                                    "Description": {
                                        "val": "Modify SCS software to support Financial Improvement and Audit Readiness (FIAR).\n\nThis effort is not a new start; all post-ECSS FIAR remediation and modification efforts for AF logistics IT systems were documented in the FY13 and FY14 justification materials for PE 0708610F under the Mission Description and Budget Item Justification sections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.860"
                                            },
                                            "Text": {
                                                "val": "Modify SCS software to support FIAR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.508"
                                            },
                                            "Text": {
                                                "val": "Continue modification of SCS software to support FIAR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transformation Capability Initiative - Supply Chain Management (SCM)"
                                    },
                                    "Description": {
                                        "val": "SCM includes multiple initiatives including Wholesale Supply, Item Master, Retail Supply, and Government Furnished Property (GFP) and will encompass centralized planning and management of items and equipment such as: reparables, consumables, Nuclear Weapons-Related Materiel (NWRM) and cryptographic items; a centralized item data capability, comprise business operations and inventory for the Air Force Base Supply community to provide total asset visibility, develop efficient inventory management, minimize the potential for human errors, improve warfighter support, and improve financial auditability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "SCM will initiate SDDP activities and will focus on preliminary system design to address Inventory Planning, Demand Planning, Supply Planning and Exception Management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.842"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.842"
                                            },
                                            "Text": {
                                                "val": "SCM will perform Service Development and Delivery Process (SDDP) activities and will focus on preliminary system design to address Wholesale Supply Order Management; and Item Master Centralized Repository, Item Enhancement, and Item Expansion specifically for commodities requirements.  Activities include initial program office personnel stand up, contract Advisory and Assistance Services (A&AS) support for PMO, functional experts and Subject Matter Expert (SME) travel to meetings to complete requirements, concept exploration (i.e., early systems engineering and planning to mature concepts) potential solutions (materiel and non-materiel) to functional requirements prior to MDD utilizing a \"sandbox\" approach, environment hosting, and developmental licenses. Program office personnel will assess potential solutions for required order management and centralized data repository capabilities, refine requirements, and develop functional and allocated baselines of the end-item system configuration.  This will include the need for modification of the existing legacy systems as well as new interfaces to the SCM tool."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transformation Capability Initiative - Advanced Planning and Scheduling (APS) Enterprise Supply Chain Planning and Execution (ESCAPE)"
                                    },
                                    "Description": {
                                        "val": "APS ESCAPE will provide supply chain planning information in support of timely and accurate planning decisions and inventory allocations and will facilitate decision making throughout the Demand Planning, Inventory Planning, Supply Planning, Exception Management, and Analytics processes.\n\nThis effort is not a new start; titled \"ESCAPE Capability Initiative\" in FY14 Exhibit R-2A for this PE (part of the Log IT Transformation activities)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.676"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.676"
                                            },
                                            "Text": {
                                                "val": "ASP ESCAPE will complete SDDP Step 3 activities and will focus on preliminary system design to address Inventory Planning, Demand Planning, Supply Planning and Exception Management. Activities include initial program office personnel stand up, Contract A&AS support for PMO, functional experts and SME travel to meetings to complete requirements, RICE development and integration activities, testing activities for the first year, environment hosting, and developmental licenses. Program office personnel will assess potential solutions for needed supply planning\ncapabilities, refine requirements, and develop functional and allocated baselines of the system configuration. This will include the need for modification of the existing legacy systems as well as new interfaces to the APS ESCAPE tool."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transformation Capability Initiative - Maintenance, Repair and Overhaul (MRO)"
                                    },
                                    "Description": {
                                        "val": "The MRO Initiative (MROi) transformation effort will create an integrated, quality capability for planning, scheduling, and executing organic depot maintenance to support agile planning, optimized workload assignment and resource allocation.  Integration of these maintenance support capabilities will be applied at both the maintenance center level and down to the lowest complexity of individual repair items.  MRO will standardize and consolidate legacy system-driven processes, support a more efficient workforce and improve depot operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.801"
                                            },
                                            "Text": {
                                                "val": "MROi will initiate SDDP activities and will focus on preliminary system design to develop standardized work control processes supporting the planning, scheduling, and execution of depot maintenance tasks for commodities.  Activities will include initial program management office (PMO) personnel stand up, contract A&AS support for PMO, functional experts and SME travel to meetings to complete requirements, RICE development and integration activities, testing activities for the first year, environment hosting, and developmental licenses.  Program office personnel will assess potential solutions for a needed depot maintenance capability, refine requirements, and develop functional and allocated baselines of the maintenance system configuration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.311"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "32.311"
                                            },
                                            "Text": {
                                                "val": "MROi will continue system design activities to develop standardized work control processes and prepare for initial fielding to depot maintenance shops.  Will continue PMO personnel support, contract A&AS support for PMO, functional experts and SME travel to meetings to complete requirements, RICE development and integration activities, testing activities, environmental hosting, and developmental licenses.  Program office personnel will begin implementation activities for the depot maintenance capability.  Will include integration with engineering for configuration management of MRO master configurations as well as assistance request processes and integration with Supply capabilities for material requisitions, receipt of material, and ability to assess inventory availability across the enterprise.  Continue modification of the existing legacy systems as well as new interfaces to the MROi tool."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Logistics, Installations, Maintenance Support - Enterprise View (LIMS-EV) Modernization"
                                    },
                                    "Description": {
                                        "val": "Expand Logistics, Installations and Mission Support - Enterprise View (LIMS-EV) Secure Internet Protocol Router Network (SIPRNet) capabilities development effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.228"
                                            },
                                            "Text": {
                                                "val": "Global Combat Support System Air Force Data Services (GCSS AF DS) PMO purchased and installed hardware and software for the SIPR GCSS-AF infrastructure for LIMS-EV on the Defense Information System Agency (DISA) Defense Enterprise Computing Center (DECC) in Ogden, UT.  LIMS-EV SIPRNet Spiral 1 will enhance the LIMS-EV Fleet Asset Status capability to provide the warfighter with total asset visibility of all assets available on a web-based virtual map and enhanced Munitions View to integrate AF munitions inventory to planned vs. actual operational requirements.(Funded under Project 675208.)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.611"
                                            },
                                            "Text": {
                                                "val": "Continue LIMS-EV SIPRNet Spiral activities to further develop secure capabilities for the LIMS-EV Vehicle View to provide a fleet-wide view of all Air Force Vehicles, including vehicles in classified locations, throughout the world that cannot be viewed in an unclassified environment.  The LIMS-EV SIPRNet Spiral activities will continue into FY15 under PE 0708611F, Support Systems Development (SSD)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA - FY15 efforts funded under PE 0708611F."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transformation Capability Initiative - Product Lifecycle Management (PLM)"
                                    },
                                    "Description": {
                                        "val": "PLM capability will enable AF engineering\/logistics communities to define, track, protect and manage product data for AF weapon systems and equipment enabling collaboration connecting field users with center engineers, OEMs with equipment specialists, and internal and external stakeholders and modernize the means used to manage PLM information from cradle to grave.\n\nThis effort is not a new start; titled \"PLM Capability Initiative\" in FY14 Exhibit R-2A for this PE (part of the Log IT Transformation activities)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.820"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.820"
                                            },
                                            "Text": {
                                                "val": "PLM will initiate SDDP activities in support of configuration management of product data and associated engineering processes. PLM will continue SDDP activities and focus on preliminary system design to address a searchable engineering drawings capability, a single solution engineering technical assistance request (ETAR) tracking system, and Engineering Change Request\/Notice Capability.  Activities include initial program office personnel stand up, contract A&AS support for PMO, functional experts and SME travel to meetings to complete requirements, concept exploration (i.e., early systems engineering and planning to mature concepts) potential solutions (materiel and non-materiel) to functional requirements prior to MDD utilizing a \"sandbox\" approach, environment hosting, and developmental licenses.  Program office personnel will assess potential solutions for needed engineering capabilities, refine requirements, and develop functional and allocated baselines of the system configuration.  This will include the need for modification of the existing legacy systems as well as new interfaces to the PLM tool."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Structural Integrity Management Information System (ASIMIS) Software Upgrade"
                                    },
                                    "Description": {
                                        "val": "ASIMIS modification to rehost and modernize the system in a web-based format."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.899"
                                            },
                                            "Text": {
                                                "val": "Begin data migration and data recompilation activities to move data from mainframe to web-based architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.912"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.912"
                                            },
                                            "Text": {
                                                "val": "Continue data migration and data recompilation activities to move data from mainframe to web-based architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapon System Management Information System (WSMIS) Software Upgrade"
                                    },
                                    "Description": {
                                        "val": "Upgrade the WSMIS Requirements\/Execution Availability Logistics Module (REALM) to incorporate functional requirements previously on hold.  The system requires upgrades to software and hardware to bring the system back to operational status and meet approved functional requirements and mandates (i.e. Section 508 compliance)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.015"
                                            },
                                            "Text": {
                                                "val": "Complete upgrade of REALM to incorporate functional requirements previously on hold."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF:BA03:Line Item # 834430"
                                    },
                                    "Title": {
                                        "val": "Global Combat Support System-Air Force (GCSS-AF)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "3.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.974"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.974"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "67.463"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.264"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.393"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.525"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Air Force Program Executive Office - Business Enterprise Systems (AFPEO-BES) is evaluating systems under the business capability lifecycle management process to approve milestone decisions for each core logistics system remediation\/modification project.\n\nThese projects will use Firm Fixed Price contracts to the maximum extent possible as the programs establish new contracts or task orders.  To improve the efficiency of the contracting process and reduce contract cycle time, the core logistics system program offices plan to use the existing NETCENTS-2 contract vehicle utilizing Best Value acquisition methodology where possible."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675207_0.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675207_1.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675207_2.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675207_3.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675207_4.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675207_5.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675207_6.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675207_7.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675207_8.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675207_9.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675207_10.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675208"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Combat Support System (ECSS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.821"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Expeditionary Combat Support System (ECSS) program was canceled 11 December 2012.  The cancellation of ECSS has driven the Air Force to re-evaluate its strategy to enable logistics Information Technology (IT) capabilities.  The Air Force still requires an integrated logistics capability that provides timely, accurate and reliable information to decision makers at all levels of command and across the full range of military operations.  The Air Force is transitioning from ECSS to a hybrid approach of core legacy system remediation \/ modification and transformation. This approach moves away from a large scale Enterprise Resource Planning (ERP) capability and uses firm requirements, smaller scale development efforts and shorter delivery schedules to achieve FY 2017 statutory Financial Improvement and Audit Readiness (FIAR) and operational requirements.\n\t\nThe ECSS program planned to complete its Milestone B in April 2011, as reported in the February 2011 Critical Change Report (CCR).  However, the program schedule deteriorated throughout 2011, which resulted in the ECSS Milestone B decision being delayed past April 2012, exceeding the one-year schedule threshold for program milestones.  Based on the programmatic challenges detailed in the January 2012 ECSS Major Acquisition Information System Quarterly Report, the Senior Official determined that a Critical Change occurred.  Based on information that was ascertained during the Critical Change process, the Air Force lost confidence in the program's ability to deliver any logistics capability to the warfighter.  As a result of the Air Force's recommendation, the Under Secretary of Defense (Acquisition, Technology and Logistics) terminated the ECSS program in December 2012.  \n\nRemediation, modernization and transformation efforts are being accomplished under project 675207, Logistics Information Technology System Modernization."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Logistics Information Technology (Log IT) FIAR Remediation \/ Modification Activities"
                                    },
                                    "Description": {
                                        "val": "The remediation and modification of core logistics systems to meet statutory Financial Improvement Audit Readiness (FIAR) by 2017 and align with the Joint Chiefs of Staff J-4 Concept for Logistics and the Air Force Logistics Board's approved Enterprise Logistics Strategy (ELS).  Systems contained in these business areas include, but are not limited to, the Air Force Equipment Management System (AFEMS), Integrated Maintenance Data System (IMDS), Item Management Control System (IMCS), Reliability and Maintainability Information System (REMIS), Combat Ammunitions System (CAS), Training Business Area (TBA), Enhanced Maintenance Operations Center (EMOC), Aircraft Structural Integrity Management Information System (ASIMIS), Integrated Logistics System-Supply (ILSS), Cargo Movement Operations System (CMOS), Stock Control System (SCS), Purchase Request Process System (PRPS), Automated Logistics Management Support System (ALMSS), Depot Maintenance Accounting and Production System (DMAPS), Cryptologic Depot Accountability System (CDAS), and Commercial Asset Visibility-Air Force (CAV-AF)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.821"
                                            },
                                            "Text": {
                                                "val": "The remediation and modification of core logistics systems to meet FIAR and align with the JCS J-4 Concept for Logistics and AF Logistics Board's ELS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF:BA03:Line Item # 834430"
                                    },
                                    "Title": {
                                        "val": "Global Combat Support System-AF Family of Systems (GCSS-AF FOS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.769"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "OPAF funding for ECSS in BA03 Line Item 834430, Global Combat Support System-AF Family of Systems (GCSS-AF FOS) does not continue after FY13.  OPAF funding continues under this Line Item for Logistics Information Technology (Log IT) efforts."
                        },
                        "AcquisitionStrategy": {
                            "val": "The ECSS program planned to complete its Milestone B in April 2011, as reported in the February 2011 Critical Change Report (CCR).  However, the program schedule deteriorated throughout 2011, which resulted in the ECSS Milestone B decision being delayed past April 2012, exceeding the one-year schedule threshold for program milestones.  Based on the programmatic challenges detailed in the January 2012 ECSS Major Acquisition Information System Quarterly Report, the Senior Official determined that a Crticial Change occurred.  Based on information that was ascertained during the Critical Change process, the Air Force lost confidence in the program's ability to deliver any logistics capability to the warfighter.  As a result of the Air Force's recommendation, the Under Secretary of Defense (Acquisition, Technology and Logistics) terminated the ECSS program in December 2012."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0708610F_BPAC_675208_0.jpg"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}