{
    "id": "9b666222ce89d93c3d2ec7062cb760a549db2d5f",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602709A"
        },
        "ProgramElementTitle": {
            "val": "NIGHT VISION TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "48.069"
            },
            "CurrentYear": {
                "val": "43.403"
            },
            "BudgetYearOne": {
                "val": "38.445"
            },
            "BudgetYearOneBase": {
                "val": "38.445"
            },
            "BudgetYearTwo": {
                "val": "37.134"
            },
            "BudgetYearThree": {
                "val": "37.755"
            },
            "BudgetYearFour": {
                "val": "38.757"
            },
            "BudgetYearFive": {
                "val": "37.540"
            }
        },
        "ProgramElementNote": {
            "val": "FY 13 decreases attributed to Congressional General Reductions (-101 thousand); SBIR\/STTR transfers (-903 thousand); and Sequestration reductions (-4.171 million)"
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) conducts applied research and investigates core night vision and electronic sensor components and software to improve the Army's capability to operate in all battlefield conditions. Technologies pursued in this PE have the potential to provide the Army with new, or enhanced, capabilities to detect and identify targets farther on the battlefield, operate in obscured conditions, and maintain a higher degree of situational awareness (SA). Project H95 advances infrared (IR) Focal Plane Array (FPA) technologies, assesses and evaluates sensor materials, designs advanced multi-function lasers for designation and range finding, and develops modeling and simulation for validating advanced sensor technologies. In FY11 through FY16 the Army investment in advanced IR FPA technologies is augmented to ensure a world-wide technological and competitive IR sensor advantage for the United States. \n\nWork in this PE is fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602705A (Electronics and Electronic Devices), PE 0602712A (Countermine Technology) and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "53.244"
                },
                "CurrentYear": {
                    "val": "43.426"
                },
                "BudgetYearOne": {
                    "val": "38.199"
                },
                "BudgetYearOneBase": {
                    "val": "38.199"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "48.069"
                },
                "CurrentYear": {
                    "val": "43.403"
                },
                "BudgetYearOne": {
                    "val": "38.445"
                },
                "BudgetYearOneBase": {
                    "val": "38.445"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.175"
                },
                "CurrentYear": {
                    "val": "-0.023"
                },
                "BudgetYearOne": {
                    "val": "0.246"
                },
                "BudgetYearOneBase": {
                    "val": "0.246"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.101"
                    },
                    "CurrentYear": {
                        "val": "-0.023"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.903"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.246"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.246"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.171"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H95"
                    },
                    "ProjectTitle": {
                        "val": "Night Vision And Electro-Optic Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.069"
                        },
                        "CurrentYear": {
                            "val": "43.403"
                        },
                        "BudgetYearOne": {
                            "val": "38.445"
                        },
                        "BudgetYearOneBase": {
                            "val": "38.445"
                        },
                        "BudgetYearTwo": {
                            "val": "37.134"
                        },
                        "BudgetYearThree": {
                            "val": "37.755"
                        },
                        "BudgetYearFour": {
                            "val": "38.757"
                        },
                        "BudgetYearFive": {
                            "val": "37.540"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research and develops component technologies that enable improved Reconnaissance, Surveillance, Target Acquisition (RSTA) and situational awareness (SA) at an affordable price. Component technologies include novel focal plane arrays (FPAs), processing and electronics improvements, and modeling and simulation to predict performance and to determine operational effectiveness. This research focuses on dual band infrared (IR) FPAs necessary to search, identify and track mobile targets in all day\/night visibility and battlefield conditions and to improve standoff detection in ground-to-ground and air-to-ground operations. This project designs, fabricates and validates very large format IR FPAs needed for sensors to simultaneously provide wide area coverage and the high resolution for situational awareness, persistent surveillance and plume\/gunflash detection. In addition this project develops multispectral and hyperspectral algorithms for on-chip hyperspectral functionality, which offer the ability to perform detection, identification and signature identification at extended ranges as well as the ability to detect targets in \"deep hide\". Reducing size, weight and power (SWaP) is a key research objective for all efforts. In FY11 through FY16 the Army investment in advanced IR FPA technologies is augmented to ensure a world-wide technological and competitive IR sensor advantage for the United States. \n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Soldier, Ground and Air portfolios.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Aided Target Recognition (AiTR) Evaluation Center of Excellence"
                                    },
                                    "Description": {
                                        "val": "This effort researches a Defense-wide virtual\/distributed capability to interactively process both real and generated 3-Dimension multispectral scenes from sensor simulations. Automatic target recognition (ATR) and aided target recognition (AiTR) algorithms are evaluated against realistic operational scenarios in aided or fully autonomous reconnaissance, surveillance and target acquisition (RSTA) missions to include roadside threats\/explosively formed projectiles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated and evaluated adaptable target tracking algorithms for their ability to perform target handoff\/distribution from one sensor system to another without losing a target; investigated new processing techniques for developing target detection and tracking algorithms that will allow for less processing power for smaller processors in SWaP constrained platform environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.819"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and evaluate target tracking algorithms through image based detection and confirmation processing to reduce false alarms and lost target tracks for persistent surveillance and airborne sensor systems; investigate signal processing and algorithms for threat detection and tracking that minimizes power consumption, enabling the use of smaller processors in SWaP constrained environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.811"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.811"
                                            },
                                            "Text": {
                                                "val": "Will investigate algorithmic correlation approaches to further reduce false alarms in image based detection and confirmation processing for vehicle systems; design and develop improved technology for multifunction display capability; continue to investigate signal processing and algorithms for threat detection and tracking that minimizes power consumption, enabling the use of reduced power processors in SWaP constrained environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Modeling and Simulation Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, verifies and validates engineering models, measurement techniques and realistic simulations concurrently with the development and transition of core sensor technologies. The goal of sensor modeling and simulation technology is to improve the fidelity and adaptability of in-house simulation capabilities for the purposes of 1) Warfighter training 2) sensor system analysis 3) identifying and addressing phenomenology associated with imaging technologies and 4) perception lab-based model target task calibration of imaging technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.983"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Incorporated, researched and validated an integrated engineering sensor model that included the capability to predict the performance of multiple imaging systems such as multi-waveband image fusion, hyperspectral sensing, polarization sensing, active-passive image fusion (including laser radar), real-time image processing and models against stationary and moving targets or platforms; refined and completed development of a capability to more accurately assess combatant\/non-combatant sensor performance criteria."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.223"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Expand the engineering models, measurements and simulations to address new and emerging sensor capabilities, modalities and target threats; research and incorporate additions to the predictive engineering sensor performance model to include sub-pixel targets, cooperative sensors, measures of persistence and Three-Dimentional (3D) target rendering; provide calibrated, IR target signatures (human, IED, vehicles) to simulations used for sensor development, training and wargaming; develop and perform perception testing procedures to refine combatant\/non-combatant sensor performance related to activity and motion and to document effects of 3D target rendering and displays on human decision; design, implement and publish laboratory measurement standards for new technologies including color\/false color imaging, fused imaging across Electro-Optic\/Infrared (EO\/IR) bands and 3D displays."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.222"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.222"
                                            },
                                            "Text": {
                                                "val": "Will research and incorporate sensor performance model and measurement techniques to validate the optimal implementation of target and background signatures in simulation; compare laboratory and field measurements to determine if any errors are introduced by methodology; validate and measure imagery post processing algorithms and subsequent effects on human performance; research phenomenology and application of imaging sensor modalities across the waveband spectrum, to include 3D imaging and displays."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Multifunction Laser Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technology for a new class of multi-wavelength laser modules which will replace multiple laser systems and reduce the size, weight and cost of current devices such as laser designators, laser rangefinders (LRFs), pointers, markers, warning systems and illuminators.  The goal is to achieve a single housing, electronics board, power supply and telescope for all applications to provide a drastic reduction in the SWaP of multi-function laser system, as well as reduction in the logistics inherent in deploying multiple systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated and validated novel breadboard multi-wavelength laser modules for output energy, beam divergence and boresight over MIL-SPEC temperature range; increased the laser efficiency by optimizing the laser resonator configurations and increasing the laser diode pumping efficiency; improved operation over wide operating range; designed a brassboard laser with the goal of minimizing laser SWaP for applications such as designation\/marking, LRF and illumination."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate technology for a single source of multifunction, eye-safe fiber lasers operating in the Short Wave Infrared Band (SWIR, 1.5 to 2.0 microns); design a single laser for multiple applications in a compact package to perform laser range finding, day\/night pointing, and 3D LIDAR imaging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.276"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.276"
                                            },
                                            "Text": {
                                                "val": "Will design a multifunction SWIR laser breadboard that performs range finding, day-night pointing, and 3D Light Detection and Ranging (LIDAR); extend the laser operating wavelength to Long Wave Infrared (LWIR) by examining alternative laser technology including quantum cascade lasers; research methods for electronically tuning waveband throughout the LWIR band; research and improve laser diode drivers and associated electronics to improve efficiency and power consumption."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Performance Small Pixel Uncooled Focal Plane Array (FPA)"
                                    },
                                    "Description": {
                                        "val": "This effort increases the working performance of both uncooled Longwave Infrared (LWIR) and Shortwave Infrared (SWIR) technologies. Through design and improved fabrication techniques this work increases detector resolution to high definition formats (LWIR-1920x1200 pixels, SWIR- 1280x720 pixels), improves sensitivity and image quality to increase recognition and identification ranges while reducing SWaP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.728"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improved the uncooled LWIR FPA design to include a second revision of the ROIC and pixel design to meet the performance goals of increased sensitivity and prevent image degradation; fabricated and evaluated multiple lots to validate performance; designed, fabricated and tested a brassboard camera system including support electronics to operate at higher frame rates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.007"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete full performance characterization of the HD 1920 x 1080 pixel uncooled LWIR FPA camera; fabricate the final lot of HD uncooled LWIR FPA and demonstrate in a camera for long range target identification; characterize a high performance uncooled hyperspectral SWIR FPA (1280 x 720 pixel) for detection of difficult targets in high cluttered background."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Structures for Cooled Infrared (IR) Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort researches detector materials and substrates for infrared (IR) sensors. The emphasis is on reducing material defects and increasing the reliability by means of new ways to prepare and treat the substrates and new designs and methods of growing the structures. The goal is to develop cost effective components for high definition Army IR sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.374"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed an advanced imprint technology to deposit small indium bumps suitable for high definition format FPAs; typified performance of emerging III-V and HgCdTe on alternate substrate FPAs; investigated novel techniques for steep sidewalled plasma etching and passivation thus enabling megapixel III-V and II-VI FPAs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.763"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate indium bump process for high definition format FPAs; research advanced steep sidewalled plasma etching for dual band structures for high definition FPAs, which will provide more pixels on target, increased resolution and higher quality images, thus enabling a reduction in defects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.762"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.762"
                                            },
                                            "Text": {
                                                "val": "Will investigate new growth methods for improving the uniformity and reducing the cost of very LWIR (wavelength greater than 11 microns) III-V and II-VI materials; investigate new techniques for passivating LWIR III-V small pixel structures; mitigate effects of initial substrate condition and processing on resulting performance; design and validate read-out circuits appropriate for these FPAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Digital Readout Integrated Circuit (ROIC)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs new Digital Readout Integrated Circuit (DROIC) technology (digital-in-pixel) enabling the affordable very large format and multiband IR FPAs. The digital-in-pixel results in increased signal storage available to collect incoming signal information from the scene, compared to traditional analog techniques. DROIC is an important component in reducing the overall IR sensor cost and SWaP by allowing much smaller FPA pitch. The increased storage improves dynamic range for targeting, situational awareness and persistent surveillance applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.029"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated and evaluated high definition, 1280x720 pixel, digital-in-pixel ROIC implementing innovative on-chip signal processing designs with 20 micron pitch unit cell; characterized performance to include dynamic range and signal\/noise; conducted design review of ROIC for the 1280x720 FPA with reduced, 12 micron pitch, unit cell resulting in the reduction in overall infrared (IR) sensor cost and SWaP due to much smaller FPA pitch."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.609"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research and develop a high-definition, digital-in-pixel ROIC with on-chip signal processing for a 12 micron, 1280x720 pixel array; validate the DROIC performance (e.g. high dynamic range and low noise) using a well characterized 640x480, 20 micron pixel array."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced IR Detector (\"nBn\") Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and improves a new barrier detector structure that makes midwave IR FPAs easier and more affordable to manufacture and allows operation at higher temperatures resulting in much more affordable sensor systems and also significant reductions in SWaP of system optics, housings and cryogenic coolers. In addition the barrier detector approach allows for very small pixel pitch (8 micron) enabling FPAs of very large format, 5000x5000 pixel, for persistent surveillance applications that were not possible prior to emergence of this barrier FPA technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated 2000x2500 pixel FPA with a 10 micron pitch implementing successes from design studies of a variety of potential manufacturing methodologies; evaluated resulting FPA structure and investigated techniques to increase yield by reducing defect formation; continued investigation of growth of semi-conductor material layers (nBn) on larger diameter (approximately 4-6 inches) GaSb and GaAs wafers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research and develop 2000x2500 8 micron pitch and 4000x4000 10 micron pitch FPAs, resulting in a higher resolution, smaller size array; validate resulting FPA structures and investigate techniques to increase yield by reducing defect formation; conduct comparison studies between single very-large-format versus multiple large-format FPAs by examining FPA pitch size, FPA format, butting issues and IR system interfaces and performance relationships; begin research on very small pitch (5-6 micron) ROIC and FPA designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.389"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.389"
                                            },
                                            "Text": {
                                                "val": "Will research and develop nBn large format FPAs (up to 3000x3000, 8-micron pitch) with a cutoff wavelength at or greater than 5 microns and operating at temperatures at or exceeding 130 Kelvin with a goal to achieve repeated performance comparable to indium antimonide; develop processing and hybridization for 8 micron pixel FPAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strained Layer Superlattices (SLS) Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and improves III-V material (materials formed by a combination of elements from group III and V of the periodic table) thin film crystal growth of IR FPAs using a very flexible Strained Layer Superlattice (SLS) structure. This will allow high performance multi band infrared FPAs to be produced at much lower costs than the existing II-VI FPAs (Mercury Cadmium Telluride) and can leverage commercial product research and production lines, including cell phone chips, to improve uniformity related to performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.941"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated design of 1280x720 pixel with reduced pixel pitch, 12 micron, dual band MWIR\/LWIR FPAs on alternate substrates; evaluated and fabricated these FPAs using analog ROICs; established new growth processes on alternative Gallium Arsenide (GaAs) substrates to reduce defects in the SLS FPA; correlated material performance of growth on GaSb versus GaAs allowing reduction in lattice mismatch defects which increases yield and reduces FPA costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.369"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate 1280x720, 12 micron pitch, dual-band midwave\/longwave infrared focal plane arrays on 4 inch GaSb and GaAs substrates; resolve the substrate flatness and detector passivation issues; begin material growth and assess the material quality on 6 inch GaSb and GaAs substrates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.141"
                                            },
                                            "Text": {
                                                "val": "Will verify fabrication techniques for a 1280x720, 12 micron pitch, dual-band MWIR\/LWIR FPA on analog readout integrated circuits with increased quantum efficiency and reduced noise equivalent differential temperature; hybridize 16 bit digital ROIC with characterized 640x480, 20 micron pitch LWIR FPA; extend cutoff wavelength device designs to 11.5 and 13.5 microns."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wide Field of View Displays and Processing for Head Mounted Display Systems"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs optical filters, objective lenses and personal display viewing optics that will enable ultra-low profile, lightweight sensors and virtual displays for both individual head mounted and vehicle based, multi-user vision systems using the latest developments in holograms for small package optics that can be readily reconfigured (i.e. ultra-small\/light optical zoom). Additional work in this effort investigates image processing as part of the optical design strategy and designs novel approaches for color filtering image processing for low light sensors in order to provide a color low-light imaging capability to the US Warfighter. This effort is fully coordinated with PE 0603710A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.226"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated and designed state-of-the-art technology alternatives for large format waveguide based color heads-up displays; investigated and designed light weight waveguide head mounted displays; investigated and designed high definition, sparse color, low light image sensor\/color filter architectures and color image processing algorithms. Validated operation of low latency\/power color processing algorithms on dedicated processing hardware platform; performed laboratory based proof-of-concept validation of key performance metrics with clear path for SWaP scalability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.303"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design waveguide optical components with multiple approaches including time domain switchable materials for head mounted and vehicle mounted applications; design and develop color low light solid state silicon focal plane to determine optimum color filter array spectral requirements, mature patterned interference filter coating technology for sub-10 micron pixel spacing and conduct experiments on tactical target low light color phenomenology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.912"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.912"
                                            },
                                            "Text": {
                                                "val": "Will integrate waveguide optical components into head wearable form factors for limited data collections and Soldier perception testing; validate ability of large area waveguide virtual displays to provide the space stabilized display in scenes with jitter; fabricate and integrate color low light solid state silicon focal plane as a test platform; determine optimum color filter array spectral requirements; improve patterned interference filter coating technology for sub-10 micron pixel spacing; conduct experiments on tactical target low light color phenomenology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Solid State Low Light Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort develops true starlight and very low light sensing, solid state focal plane technology with reduced power and production cost for Soldier vision enhancement for deficient visibility conditions. The objective of this effort is an all solid state near-IR sensor for replacement of current Image Intensifier (I2) vacuum tube technology."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.168"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop an all solid state low light imaging architecture with sensor, processor and display in a monolithic stacked design to replace analog vacuum tube based image intensifier; develop ultra-low dark current, high quantum efficiency silicon focal plane array fabrication processes in a US micro-electronic foundry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.872"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.872"
                                            },
                                            "Text": {
                                                "val": "Will optimize pixel size and develop back-side illuminated silicon processes for near IR resolution comparable to current I2 technology; develop through silicon via processing capability for 3-dimensional stacking of small pixel silicon FPAs; investigate back-end processing techniques for stacking FPAs with electronics and displays; conduct design studies to determine image processing techniques required for low latency night imaging."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensing and Processing"
                                    },
                                    "Description": {
                                        "val": "This effort investigates processing and sensor fusion technology for low cost multi-modal sensors. Processing and sensor fusion technology will enable the capability to see through degraded visual environments and to improve situational awareness through automated recognition of personnel and obstacles."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.060"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.060"
                                            },
                                            "Text": {
                                                "val": "Will investigate incorporation of algorithms for improved situational awareness and mobility in degraded visual environments; develop low power processing techniques for improved imaging through degraded visual environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}