{
    "id": "9d7a61690df7b07698050c74d928308b7809a8fa",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA4_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603713N"
        },
        "ProgramElementTitle": {
            "val": "Ocean Engineering Tech Dev"
        },
        "R1LineNumber": {
            "val": "57"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "101.642"
            },
            "PriorYear": {
                "val": "6.370"
            },
            "CurrentYear": {
                "val": "7.696"
            },
            "BudgetYearOne": {
                "val": "7.764"
            },
            "BudgetYearOneBase": {
                "val": "7.764"
            },
            "BudgetYearTwo": {
                "val": "5.372"
            },
            "BudgetYearThree": {
                "val": "5.493"
            },
            "BudgetYearFour": {
                "val": "5.611"
            },
            "BudgetYearFive": {
                "val": "5.737"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Developments in this program will enable the U.S. Navy to overcome deficiencies that constrain underwater operations in the areas of search, location, rescue, recovery, salvage, underwater ship husbandry, construction, and protection of offshore assets.  This program develops medical technology, diver life support equipment, and the vehicles, systems, tools, and procedures to permit manned underwater operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.029"
                },
                "CurrentYear": {
                    "val": "9.196"
                },
                "BudgetYearOne": {
                    "val": "9.887"
                },
                "BudgetYearOneBase": {
                    "val": "9.887"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.370"
                },
                "CurrentYear": {
                    "val": "7.696"
                },
                "BudgetYearOne": {
                    "val": "7.764"
                },
                "BudgetYearOneBase": {
                    "val": "7.764"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.659"
                },
                "CurrentYear": {
                    "val": "-1.500"
                },
                "BudgetYearOne": {
                    "val": "-2.123"
                },
                "BudgetYearOneBase": {
                    "val": "-2.123"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-1.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.048"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.123"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.123"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.611"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Reduced FY13 funding for Sequestration reductions.\n\nAll Projects:  Reduced FY 15 funding due to the Department's decision to reduce contracted services.\n\nProject 0099:  The FY 2015 funding was reduced to properly phase program requirements in accordance with expenditures."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0099"
                    },
                    "ProjectTitle": {
                        "val": "Deep Submergence Bio Med Dev"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "22.382"
                        },
                        "PriorYear": {
                            "val": "3.189"
                        },
                        "CurrentYear": {
                            "val": "3.106"
                        },
                        "BudgetYearOne": {
                            "val": "2.173"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.173"
                        },
                        "BudgetYearTwo": {
                            "val": "4.210"
                        },
                        "BudgetYearThree": {
                            "val": "4.310"
                        },
                        "BudgetYearFour": {
                            "val": "4.394"
                        },
                        "BudgetYearFive": {
                            "val": "4.483"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project:  \n1) Develops advanced biomedical and bioengineering technology for enhancing medical and life support for submarine escape and rescue; \n2) Conducts research for diver health, safety and effectiveness; and \n3) Supports deeper, longer, and more flexible dives. \n\nDeliverables for DISSUB (disabled submarine) include: medical procedures for submarine escape and rescue (including new Submarine Rescue Diving and Recompression System (SRDRS)), life support parameters, medical procedures for life support, exposure guidance for atmospheric contaminants, non-chemical CO2 scrubbing, prevention and treatment of decompression illness, and senior survivor expert decision system. \nDeliverables for diver enhancement include: exposure guidance for diver underwater continuous noise, impulse noise, and underwater blast, exposure guidance for oxygen breathing, collection of operational diving depth\/time profiles to predict decompression risk, enhanced underwater swimming efficiency, enhanced diver thermal protection, and real-time decompression guidance.\nRequirements: NAPDD #587-873, Deep Submergence Biomedical Development, 23 November 1999."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Deep Submergence Bio Med Dev - Diver Health and Safety"
                                    },
                                    "Description": {
                                        "val": "Diver Health and Safety Research: Pulmonary oxygen toxicity exposure limits.  Procedures for assessing and mitigating risk for diving in contaminated water.  Procedure to determine remaining CO2 scrubber duration.  Development of advanced insulation garments for diver thermal protection.  Develop guidance for optimizing thermal control during decompression.  Continue collection of operational dive profiles for advanced modeling.  Novel methods for diver thermal protection.  Improve resistance to O2 toxicity.  Diver anthropometry.  Chemical hardening of diving equipment.  Predictive index of visual and auditory O2 toxicity.  Guidelines for flying after diving.  Guidelines for infra- and ultra-sound diver exposure.  Develop an advanced diver thermal model. Electronic collection of operational dive data.  Diver sound monitor. Investigation of diver in-water maladies, develop\/improve real-time decompression guidance and dive planning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.594"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Executed manned testing to evaluate the effects of CO2 retention on diver cognition.  Evaluated drugs to mitigate Central Nervous System Oxygen toxicity.  Continued evaluation of susceptibility to immersion pulmonary edema.  Executed manned testing of human performance and pulmonary oxygen toxicity investigation and guidance for repeated long duration dives.  Continued enhanced thermal protection efforts for divers.  Developed matrix of probabilistic and deterministic decompression modeling.  Continued real-time decompression guidance and planning efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.553"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate development of a Flexible Portable Double Lock Recompression Chamber.  Determine condensation requirements in very high pressure air supplies.  Initiate development of recompression treatments for blow up from 300 feet. Evaluate Underwater Breathing Apparatus (UBA) breathing resistance under various conditions.  Evaluate human performance during long dives.  Continue to evaluate probabilistic and deterministic decompression modeling."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.087"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.087"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete efforts initiated in FY14.  No new projects initiated in FY15."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deep Submergence Bio Med Dev - Submarine Rescue"
                                    },
                                    "Description": {
                                        "val": "Submarine Rescue: Decompression procedures for pressurized SRDRS operators.  Use of perfluorocarbons to accelerate decompression in submarine rescue.  Adjunctive therapies for treating DISSUB survivors.  Guidance for food, water, clothing, medical supplies to enhance survival of submarine crews awaiting rescue.  Flexible computer generated decompression schedules for wide range of conditions in a DISSUB.  Develop DISSUB triage procedures. DISSUB survival trial.  Develop oxygen metabolizer for closed vehicles.  Treatment guidance for decompression sickness and arterial gas embolism in submarine escape and rescue.  Interventions for toxicological problems with rescued submariners.  Minimizing decompression sickness and arterial gas embolism with Submarine Escape and Immersion Suit (SEIS) training. Use of pharmacologic agents to reduce decompression risk in submarine rescuees.  Development of toxic gas analyzer for use in pressurized DISSUB."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.595"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluation of prescribed drugs to decrease the incidence of oxygen convulsions when breathing high levels of oxygen during DISSUB survivor decompression.  Evaluation of a survival-prolonging drug on rates of decompression illness in DISSUB survivors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.553"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop Oxygen prebreathe schedules for saturation dropout for DISSUB decompression sickness prediction.  Complete prescribed drug efforts from FY13."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.086"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.086"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate human performance during long acute exposure of submariners to mild elevation of carbon dioxide levels (DISSUB)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Integrated thrust area teams (e.g., decompression research) are established with university, commercial, and in-house Navy labs to jointly execute biomedical R&D. Peer review of research proposals accomplished by independent Technical Advisory Board.  Annual review of progress by Executive Review Board (CNO\/NAVSEA\/ONR\/BUMED).  Program management by 0-6 Undersea Medical Officer.  Contracting by competitive process using BAA and leveraging ONR capabilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews"
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0603713N_0099_FILE1.JPG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0394"
                    },
                    "ProjectTitle": {
                        "val": "Shallow Depth Diving EQ"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "79.260"
                        },
                        "PriorYear": {
                            "val": "3.181"
                        },
                        "CurrentYear": {
                            "val": "4.590"
                        },
                        "BudgetYearOne": {
                            "val": "5.591"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.591"
                        },
                        "BudgetYearTwo": {
                            "val": "1.162"
                        },
                        "BudgetYearThree": {
                            "val": "1.183"
                        },
                        "BudgetYearFour": {
                            "val": "1.217"
                        },
                        "BudgetYearFive": {
                            "val": "1.254"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Submarine Rescue manned under PMS 391.  Efforts through FY15 focus on the Submarine Rescue Diving and Recompression System (SRDRS) to provide a new rapidly deployed emergency submarine rescue capability.  SRDRS provides a new capability of pressurized transportation of rescuees from a stricken submarine directly to the decompression system replacing the Deep Submergence Rescue Vehicles and Mother Submarines. SRDRS includes an air transportable rapid Assessment\/Underwater Work System (AUWS), a Pressurized Rescue Module (PRM) or Rescue Capable System (RCS), and a Submarine Decompression System (SDS).  The AUWS is a manned system that provides intervention system capability.  To reduce operational risk, an initiative is in process to transition from AUWS to an unmanned Remote Operated Vehicle (ROV).  Intervention assets support clearing disabled submarine seating surfaces, delivery of emergency life support stores, and disabled submarine assessment.  The Submarine Rescue System-Rescue Capable System (SRS-RCS) completed OPEVAL in FY08 and is rescue ready.  The Submarine Rescue System-Submarine Decompression System (SRS-SDS) is scheduled for Initial Operational Capability (IOC) in FY15.  SRDRS Full Operational Capability (FOC) is scheduled for FY15.  The SRDRS will provide a global rapid response capability to support submarine rescue missions with an increase in capability at a fraction of the cost of the currently available systems.\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\nShallow Depth Diving Equipment managed under SEA00C - This project develops systems to support submarine escape and rescue missions, and conventional diver operations.  Diver operations include ship husbandry, salvage\/recovery, and submarine rescue operations to support national, as well as Navy, needs around the world.  Modern certifiable diving systems that ensure diver safety and allow maximum work efficiency will replace currently antiquated systems.  R&D will be performed in the areas of contaminated water diving, diver thermal protection, and diver sound protection."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Shallow Depth Diving EQ - SRDRS"
                                    },
                                    "Description": {
                                        "val": "Continue design, fabrication, and acceptance testing of the prototype Submarine Decompression System and support equipment.  Continue integration of all SRDRS components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.067"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plan to complete Submarine Decompression Chambers 1 and 2 repairs and modifications.  Plan to complete design\/development\/fabrication of Submarine Decompression System Primary Elements including:  Pressurized Flexible Manways 1, 2, and 3; Deck Transfer Lock; Mission and Auxiliary Support Equipment, Submarine Decompression System Ship Interface Templates; and Modified Transfer Lock 1 and 2 Mods and Base Ship Interface Templates.  Plan to complete material audits for:  Submarine Decompression Chambers 1 and 2; Morgan Breathing System 2000; Pressurized Flexible Manways 1, 2, and 3; and Deck Transfer Lock.  Plan to complete System Integration Audit for the Submarine Decompression System.  Plan to complete Development Testing for Deck Transfer Lock; Pressurized Flexible Manways 1, 2, and 3; Submarine Decompression Chambers 1 and 2; and the Ship Interface Template Sets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.536"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plan to complete design\/development\/fabrication of Pressurized Rescue Module System 6 atmospheres absolute (ata) efforts.  Plan to complete material audits for:  Vital System Monitoring Network and Pressurized Rescue Module System to 6ata. \nPlan to complete integration audit with the Submarine Rescue System.  Plan to complete Submarine Decompression System Element Integration Testing at Oceaneering and Deliver Submarine Decompression System to Undersea Rescue Command to begin integration with the Submarine Rescue System.  Plan to complete Submarine Rescue System Integration for Unmanned Testing.  Begin Operational Testing and Post Delivery Shakedown efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.233"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.233"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plan to complete Submarine Rescue System Integration for Manned Testing and Sea Trials.  Achieve Submarine Rescue System, Transfer Under Pressure Certification and continue Operational Testing and Post Delivery Shakedown efforts.  Plan to reach Submarine Rescue Diving and Recompression System (SRDRS) Full Operational Capability (FOC)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Shallow Depth Diving EQ - Diving"
                                    },
                                    "Description": {
                                        "val": "Continued research on contaminated water diving and research on diver thermal protection, CO2 monitors, and diver sound protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued research on Underwater Breathing Apparatus (UBA)\/CO2 monitors, completed prototype development of free diver heating system (FDHS) and began development of a double-lock flexible recompression chamber."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.054"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of a double-lock flexible recompression chamber and improvements to a free diver heating system (FDHS).  Complete development of a prototype Underwater Breathing Apparatus (UBA)\/CO2 monitor and qualification testing of quick disconnects for use in high pressure oxygen environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.358"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.358"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of a double-lock flexible recompression chamber.  Complete testing of production models of the free diver heating system (FDHS)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Submarine Rescue system (SRS) segment of the SRDRS is largely based on the use of Commercial-Off-the-Shelf (COTS) technology and maximum use of Non-Developmental Items (NDI).  The SRS segment is being procured using performance based specifications.  Many of the SRS contracts were awarded competitively and were based on technical capability and cost considerations (best value).  Program management of SRDRS is accomplished through the use of Program Executive Officer, Submarines (PEO SUB) leadership.  This change was enacted in February 2003 realigning the responsibility from SEA00C to PEOSUB. The Prototype system provides full operational capability and no additional procurement is planned.  The system is designed to be Government Owned\/Commercially Operated\/Commercially Maintained (GO\/CO\/CM)."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews and Critical Design Reviews."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0603713N_0394_FILE1.JPG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}