{
    "id": "9fc43ae8bdbbed9f852e44a0285c1e68a3fe5ef8",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602435N"
        },
        "ProgramElementTitle": {
            "val": "Ocean Wrfghtg Env Applied Res"
        },
        "R1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "54.912"
            },
            "CurrentYear": {
                "val": "45.685"
            },
            "BudgetYearOne": {
                "val": "45.388"
            },
            "BudgetYearOneBase": {
                "val": "45.388"
            },
            "BudgetYearTwo": {
                "val": "43.941"
            },
            "BudgetYearThree": {
                "val": "45.963"
            },
            "BudgetYearFour": {
                "val": "46.790"
            },
            "BudgetYearFive": {
                "val": "46.918"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE provides the unique, fundamental programmatic instrument by which basic research on the natural environment is transformed into technological developments that provide new or enhanced warfare capabilities for the Battlespace Environment (BSE).  The objectives of this program are met through measuring, analyzing, modeling and simulating, and applying environmental factors affecting naval material and operations in the BSE.  This program provides for BSE technological developments that contribute to meeting top joint warfare capabilities established by the Joint Chiefs of Staff, with primary emphasis on Joint Littoral Warfare and Joint Strike Warfare. \n\nThis PE fully supports the Director of Defense Research and Engineering's Science and Technology Strategy and is coordinated with other DoD Components through the Defense Science and Technology Reliance process.  Work in this program is related to and fully coordinated with efforts in accordance with the on-going Reliance joint planning process.  There is close coordination with the US Air Force and US Army under the Reliance program in the BSE categories of Lower Atmosphere, Ocean Environments, Space & Upper Atmosphere, and Terrestrial Environments.  Within the Naval Transformation Roadmap, the investment will contribute toward achieving each of the \"key transformational capabilities\" required by Sea Strike, Sea Shield, and Sea Basing.  Moreover, environmental information, environmental models, and environmental tactical decision aids that emerge from this investment will form one of the essential components of FORCEnet (which is the architecture for a highly adaptive, human-centric, comprehensive maritime system that operates from seabed to space).  The Navy program includes efforts that focus on, or have attributes that enhance, the affordability of warfighting systems.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.635"
                },
                "CurrentYear": {
                    "val": "45.685"
                },
                "BudgetYearOne": {
                    "val": "46.279"
                },
                "BudgetYearOneBase": {
                    "val": "46.279"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "54.912"
                },
                "CurrentYear": {
                    "val": "45.685"
                },
                "BudgetYearOne": {
                    "val": "45.388"
                },
                "BudgetYearOneBase": {
                    "val": "45.388"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "5.277"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.891"
                },
                "BudgetYearOneBase": {
                    "val": "-0.891"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.794"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.537"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.891"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.891"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.393"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "15.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Ocean Wrfghtg Env Applied Res"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "41.162"
                        },
                        "CurrentYear": {
                            "val": "45.685"
                        },
                        "BudgetYearOne": {
                            "val": "45.388"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.388"
                        },
                        "BudgetYearTwo": {
                            "val": "43.941"
                        },
                        "BudgetYearThree": {
                            "val": "45.963"
                        },
                        "BudgetYearFour": {
                            "val": "46.790"
                        },
                        "BudgetYearFive": {
                            "val": "46.918"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides technologies that form the natural environment technical base on which all systems development and advanced technology depend.\nFurthermore, this technical base provides developments that may be utilized in the Future Naval Capabilities programs: Organic Mine Countermeasures (MCM) and\nAutonomous Operations. This project contains the National Oceanographic Partnership Program (NOPP) (Title II, subtitle E, of Public Law 104-201) and efforts aimed\nat understanding and predicting the impacts of underwater sound on marine mammals.\n\nMajor efforts of this project are devoted to: gaining real-time knowledge of the BSE, determining the natural environment needs of regional warfare, providing the on-scene commander with the capability to exploit the environment to tactical advantage and, developing atmospheric research related to detection of sea-skimming missiles and strike warfare. This project provides natural environment applied research for all fleet operations and for current or emerging systems. Major developments are routinely transitioned to the Fleet Numerical Meteorology and Oceanography Center and to the Naval Oceanographic Office where they are used to provide timely information about the natural environment for all fleet operations.\n\nJoint Littoral Warfare efforts address issues in undersea, surface, and air battlespace. Efforts include ocean and atmospheric analysis and prediction for real-time description of the operational environment, shallow water acoustics, multiple-influence sensors for undersea surveillance and weapon systems, and influences of the natural environment on MCM and Anti-Submarine Warfare (ASW) systems. Joint Strike Warfare efforts address issues in air battlespace dominance. Efforts include influences of the natural environment on air operations, electromagnetic (EM)\/electro-optic (EO) systems used in intelligence, surveillance, reconnaissance, targeting, bomb damage assessment, and detection of missile weapon systems. They also include improvements in tactical information management about the BSE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Coastal Geosciences\/Optics"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to determine the sources, distribution, and natural variability (concentration and properties) of optically important matters in the coastal ocean in support of Naval Mine, Undersea, and Special Warfare. Research investments in this activity support the development and testing of expendable and autonomous bioluminescence sensors, the continued development of extended range underwater imaging technologies, and algorithm development and testing for application to ocean color remote sensing from aircraft and space in order to characterize key features of the coastal battle space such as bathymetry, shallow-water bottom types, and the distribution of ocean water optical properties.\n\nFunding increase from FY 2013 to FY 2014 due to programs assigned to NRL-Base.\n\nThe funding decrease from FY 2014-FY 2015 in R2 Activity Coastal Geosciences\/Optics is due to the completion of the development of a next generation atmospheric correction algorithm, the completion of the development of new data storage topologies and ensemble methods for irregular, multi-resolution, geophysical data, and the effort to quantify the effect that different sensor viewing angles and gain factors have on optical data measurements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.557"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to refine algorithms that fuse sediment information extracted from operational sonar with historical sediment databases.\n- Continued development of a Benthic Unattended Generator to power an autonomous ocean environmental profiler and provided demonstration.\n- Continued experiments (and data collection) to test user performance as a function of display clutter.\n- Continued effort to understand and predict how power harvesting from the seabed is controlled by sediment geochemistry, microbiology, properties, and energetics.\n- Continued effort to develop and evaluate an integrated multi-sensor suite, including a small microflow cytometer, to characterize optical and biological properties of subsurface particle layers in coastal waters using unmanned underwater glider technology.\n- Continued effort to develop an intelligent decluttering algorithm (or system of algorithms) that accounts for both global and local clutter metrics in complex, multivariate displays.\n- Continued effort to develop a next generation atmospheric correction algorithm which will greatly enhance ocean passive retrievals including ocean color and visibility, bathymetry and sea surface temperature.\n- Continued development of riverine expert system for environmental characterization.\n- Continued an effort to create a unified framework for measuring, recording, aggregating and presenting the uncertainty of data, models, and processes to support current and future efforts to add certainty measures to environmental products.\n- Continued development of new data storage topologies and ensemble methods for irregular, multi-resolution, geophysical data.\n- Continued the effort to detect and recognize targets beneath foliage using new polarimetric analysis techniques applied to ultra wideband(UWB) synthetic aperture radar (SAR) imagery.\n- Continued the effort to quantify the effect that different sensor viewing angles and gain factors have on optical data measurements, to determine how these differences relate to natural variability, and to establish temporal and spatial coherence scales in support of blending data products from multiple sensors.\n- Completed an effort to create a unified framework for measuring, recording, aggregating and presenting the uncertainty of data, models, and processes to support current and future efforts to add certainty measures to environmental products.\n- Initiated studies for rapidly relocatable prediction models for riverine, estuarine and nearshore environments.\n- Initiated the development of methods to retrieve water depth, bottom type and water constituents in complex coastal waters, inland waterways, and denied areas using multispectral imagery (MSI) by extending techniques used for coarser resolution hyperspectral imagery to account for larger (MSI) data sets. \n- Initiated the development of a new capability for the Navy to forecast the temporal and spatial evolution of bottom roughness along sandy coasts by developing a seafloor boundary layer model to predict spectral description of seafloor and sediment transport and then two-way coupling it to an ocean wave model.\n- Initiated development of the BMFC (Benthic Microbial Fuel Cell) into a functionally capable technology practical for powering Navy devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.701"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013 less those noted as completed above.\n- Complete effort to develop a next generation atmospheric correction algorithm which will geratly enhance ocean passive retrievals including ocean color and visibility, bathymetry and saa surface temperature.\n- Complete development of new data storage topologies and ensemble methods for irregular, multi-resolution, geophysical data.\n- Complete the effort to quantify the effect that different sensor viewing angles and gain factors have on optical data measurements, to determine how these differences relate to natural variability, and to establish temporal and spatial coherence scales in support of blending data products from multiple sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.627"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.627"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014 less those noted as completed above.\n- Complete the development of methods to retrieve water depth, bottom type and water constituents in complex coastal waters, inland waterways, and denied areas using multispectral imagery (MSI) by extending techniques used for coarser resolution hyperspectral imagery to account for larger (MSI) data sets. \n- Complete the development of a new capability for the Navy to forecast the temporal and spatial evolution of bottom roughness along sandy coasts by developing a seafloor boundary layer model to predict spectral description of seafloor and sediment transport and then two-way coupling it to an ocean wave model.\n- Complete the effort to detect and recognize targets beneath foliage using new polarimetric analysis techniques applied to ultra wideband (UWB) synthetic aperture radar (SAR) imagery."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Mammals and Biology"
                                    },
                                    "Description": {
                                        "val": "This activity consolidates and expands research conducted in previous years in Coastal Geosciences\/Optics and the Physical Oceanography Activities and expands these efforts. The sensitivity of Marine Mammals to sound produced by Naval operations and training will continue. This program is to assure that Navy decisions can be based on scientifically defensible positions. The goal of this activity is to support: (1) marine mammal research related to understanding impacts of sound (especially sonar) on marine mammal behavior, hearing, physiology, distributions and ecology; (2) development and testing of new technologies for the detection of marine mammals at sea; (3) research on the bio-acoustic properties, use of sound for detection of, and effects of sound on fish and lesser marine organisms; and (4) research on optically important biota in the coastal ocean in support of Naval Mine, Undersea, and Special Warfare (including oceanic bioluminescence and the development and testing of bioluminescence sensors). The marine mammals research conducted in this PE represents part of a total effort executed in coordination with complementary research performed in PE 0602747N. The emphasis of efforts within PE 0602435N are Marine Mammals and Biology thrusts that include Integrated Ecosystem Research\/Sensor and Tag Development, Controlled Exposure Experiments (captive, free-ranging European waters), part of the Monitoring & Detection thrust (DCL algorithm development), and effects of chronic stress (free-ranging animal studies).\n\nFunding decreases from FY2014 to FY2015 due to completion of studies to examine sensitivity of fish to anthropogenic sound and completion of bioluminescence studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.059"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued at-sea demonstration of radar and acoustics systems to monitor marine mammals in fleet activities.\n- Continued multi-investigator, coordinated field research to test responses of marine mammals (especially beaked whales) to controlled sound exposures.\n- Continued development of new technologies for detection and localization of marine mammals, including (but not restricted to) gliders equipped with passive acoustic sensors, radar and thermal imagery.\n- Continued research examining hearing sensitivity of marine mammals (including temporary and permanent threshold shifts).\n- Continued research efforts examining distributions and abundances of marine mammals relative to prey fields and basic oceanographic parameters.\n- Continued development of and evaluated models that predict time- and space-dependent sound fields produced by anthropogenic noise sources and mammal responses to the noise.\n- Continued development and testing of multi-frequency acoustic technologies for detection, identification and enumeration of fish.\n- Continued research to examine sensitivity of fish to anthropogenic sound.\n- Continued research leading to better predictability of bioluminescent and pigment-bearing planktonic organisms.\n- Continued research on the physiology and stress of marine mammals in the wild."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.771"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013 unless completed above.\n- Complete research to examine sensitivity of fish to anthropogenic sound.\n- Complete research leading to better predictability of bioluminescent and pigment-bearing planktonic organisms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.653"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.653"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014 less those noted as completed above."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Meteorology"
                                    },
                                    "Description": {
                                        "val": "The marine atmosphere affects most aspects of naval operations. This activity develops observing technologies, models, Numerical Weather Prediction (NWP) systems and Tactical Decision Aids (TDA) that describe the atmospheric environment and its impacts on naval sensors and operations. This activity focuses on uniquely marine aspects of atmospheric science such as air-sea interaction, coupled ocean-atmosphere modeling, EM and EO propagation, coastal meteorology, Tropical Cyclone (TC) prediction, and the use of remote sensing to obtain quantitative observations of atmospheric properties. Aspects of the atmospheric environment of particular interest include near-surface phenomena that affect refractivity, marine boundary layer dynamics that affect clouds, rain, visibility and fog, and processes that control TC structure, track, and intensity. Objectives of this activity are improved NWP systems and TDAs that provide NOWCAST and forecast skill at global, regional, and tactical scales for operational support, sensor and system development, and performance prediction.\n\nFunding increase from FY 2013 to FY 2014 reflects increased emphasis across Marine Meteorology efforts including ramp up of some efforts initiated in FY 2012.\n\nFunding increase from FY 2014 to FY 2015 due to increased  research towards developing a predictive capability for the impact of clouds, aerosols, and  moisture gradients in littoral areas on electromagnetic and electro-optic propagation in support of new Naval sensors and weapons as part of Electromagnetic Maneuver Warfare. Also, to increase capability to assimilate non- traditional data sources such as those from autonomous systems and remote sensing for prediction of conditions in denied and degraded areas. Also an improved application for probabilistic prediction of air and sea conditions for ship routing and operational planning that enables increased energy efficiency and operational effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued the design, assembly, testing and delivery of a threat detection technology for Tier 1 environmental analysis of aerosols. \n- Continued development of a capability to accurately map the vertical distribution of clouds and cloud properties through the utilization and fusion of multiple satellite remote sensing data sets in synergy with improved numerical weather prediction (NWP) modeled cloud fields. \n- Continued development and testing of a space-based, land surface assimilation system that utilizes satellite observations and mature atmospheric data assimilation systems, to be incorporated into the Navy's operational numerical weather prediction (NWP) systems. \n- Completed development, testing and validation of next-generation TC prediction system that can analyze, initialize, and predict TC track, structure and intensity, using a high-resolution mesoscale model coupled to the ocean waves and currents.  The development included advanced data assimilation and moveling techniques as well as new methods of retrieving observations from remote sensing.\n- Completed an effort to develop an explicit, interactive cloud-radiation modeling approach to simulate primary cloud dynamics for NWP, and lay the foundation for interactive studies of greenhouse gases and anthropogenic and natural aerosols that have been proven to be critical for climate change.\n- Initiated the development of the ability to accurately detect, monitor and forecast the 3-D areal extent of global airborne dust, volcanic ash, and smoke and improve aerosol optical depth analyses and forecasts through the use of a suite of satellite sensors and the Navy Atmospheric Aerosol Prediction System (NAAPS). \n- Initiated the development of a Hybrid Ensemble 4D-VAR Data Assimilation (DA) scheme for regional models based on the global data assimilation techniques, in order to simultaneously estimate regional and global model initial conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.311"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013 less those noted as completed above. \n- Complete development of a capability to accurately map the vertical distribution of clouds and cloud properties through the utilization and fusion of multiple satellite remote sensing data sets in synergy with improved numerical weather prediction (NWP) modeled cloud fields.\n- Complete development and testing of a space-based, land surface assimilation system that utilizes satellite observations and mature atmospheric data assimilation systems, to be incorporated into the Navy's operational numerical weather prediction (NWP) systems. \n- Complete the development and validation of the Advanced Propagation Model to account for atmospheric effects on EM radiation, in particular, by the addition of the capability to describe high frequency radio frequencies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.120"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.120"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014 less those noted as completed above.\n- Complete the design, assembly, testing and delivery of a threat detection technology for Tier 1 environmental analysis of aerosols. \n- Complete the development of the ability to accurately detect, monitor and forecast the 3-D areal extent of global airborne dust, volcanic ash, and smoke and improve aerosol optical depth analyses and forecasts through the use of a suite of satellite sensors and the Navy Atmospheric Aerosol Prediction System (NAAPS).\n- Complete the development of a Hybrid Ensemble 4D-VAR Data Assimilation (DA) scheme for regional models based on the global data assimilation techniques, in order to simultaneously estimate regional and global model initial conditions. \n- Complete the design, assembly, testing and delivery of a threat detection technology for Tier 1 environmental analysis of aerosols."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National Oceanographic Partnership Program (NOPP)"
                                    },
                                    "Description": {
                                        "val": "This activity focuses on US Navy investments in the NOPP. NOPP, established by the US Congress (Public Law 104-201) in Fiscal Year 1997, is a unique collaboration among 15 federal agencies involved in conducting, funding, or utilizing results of ocean research. NOPP's value to the Navy derives from the capacity of the partnership to enable and ensure multi-agency efforts where such collaboration enhances efficiency or effectiveness, and\/or reduces costs. Major areas of investment by NOPP include: development of an integrated coastal ocean observation system and development of sensors, communications and data acquisition, storage and processing tools required to affect it, modernization of ocean research and observation infrastructure, and marine mammal-related research.\n\nFunding increase from FY 2013 to FY 2014 due to the initiation for the Arctic Remote Sensing program and the Advancing Air\/Ocean\/Land\/ Ice global Coupled Prediction on Emerging Computational Architectures program.\n\nFunding increase from FY 2014 to FY 2015 due to an effort to develop a  significantly improved capability to simulate and predict the coupled global air-ocean-wave-land-sea ice system at eddy-resolving spatial scales in a computationally efficient, massively parallel architecture towards real-time operational environmental prediction. Focus is on mathematical reformulation and computational software re-engineering of geophysical fluid dynamical systems to gain better scalability without loss of accuracy on heterogeneous petaflop architectures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.449"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of sensors for sustained, autonomous measurement of chemical or biological parameters in the ocean.\n- Continued marine mammal program on methods for detection and tracking of marine mammals and mapping their habitat.\n- Continued real-time forecasting system of winds, waves and surge in TCs.\n- Continued effort to develop global ocean models with sufficient resolution to accurately simulate tides and internal waves to improve the fidelity of ocean prediction systems.\n- Continued development of improving wind-wave predictions: global to regional scales.\n- Completed marine mammal program on noise mitigation.\n- Completed development of sensors for sustained, autonomous measurement of chemical or biological parameters in the ocean.\n- Completed marine mammal program on methods for detection and tracking of marine mammals and mapping their habitat.\n- Completed real-time forecasting system of winds, waves and surge in TCs.\n- Initiated study of arctic processes.\n- Initiated development of global and climate prediction studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.749"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013 less those noted as completed above.\n- Initiate an Arctic remote sensing program.\n- Initiate an Advancing Air\/Ocean\/Land\/Ice Global Coupled Prediction on Emerging Computational Architectures program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.820"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.820"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014 less those noted as completed above. \n- Complete a study on Improving Wind Wave Predictions: Global to Regional Scales. \n- Complete a project to develop an high resolution version of HYCOM with tides."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ocean Acoustics"
                                    },
                                    "Description": {
                                        "val": "This activity is dedicated to the determination of the impact of the natural ocean environment on acoustic wave phenomena in support of naval undersea warfare and underwater force protection operations. This activity studies underwater acoustic propagation, scattering from ocean boundaries, and ambient noise issues that impact the development and employment of acoustic systems. The Littoral Zone (LZ) has been the ocean environment of greatest interest. Aspects of this environment, that greatly impact underwater acoustic systems, are the shallow water included in the Littoral Zone, the consequent closeness and physical significance of the ocean bottom, and the complexities inherent to rapid changes of the ocean structure. The objectives of this program are met through measuring, analyzing, modeling and simulating, and exploiting ocean acoustic factors to gain advantage over potential adversaries using undersea acoustic systems. Results of this activity support acoustic sensor and system development, performance prediction, and tactical decision aids.\n\nFunding decrease from FY 2013 to FY 2014 is due to the completion of efforts associated with acoustic noise shielding and acoustic propagation models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.663"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of an integrated hydrodynamic\/acoustic propagation modeling capability for littoral regions to predict acoustic ASW system performance in dynamic environments.\n- Continued development of a TDA that can predict the dynamic oceanographic characteristics of shallow-water internal waves and their effects on underwater acoustic signals.\n- Continued development of a validated, physics-based processing algorithm that diagnoses acoustic performance directly from oceanographic data.\n- Continued development of a set of physics-based environmental acoustic metrics to evaluate the predictions of TDAs that are used in planning asset allocation and placement of distributed Autonomous Undersea Vehicles (AUVs) in a time evolving scenario.\n- Continued development of improved performance predictions for sonar surveillance systems that utilize horizontal line arrays operating in shelf-break environments and relate horizontal-array signal gain and coherence length to the statistics and scale lengths of transverse environmental inhomogeneities.\n- Continued development of an ocean magnetic prediction system for magnetic fields generated by high amplitude internal waves, internal bores, and internal solitary waves.\n- Continued effort to exploit acoustic noise shielding effects of complex geologic structures on ocean basin margins to enhance performance of buried passive acoustic sensors.\n- Continued effort to improve representation of ocean uncertainty in acoustic propagation models using a multiscale ocean data assimilation algorithm.\n- Initiated development of a coupled algorithm to assimilate in-situ acoustic data into an acoustic model used for autonomous system decision support.\n- Initiated enhancements to the accuracy of acoustic performance predictions through stochastic algorithms dealing with environmental uncertainty."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.290"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013 unless completed above.\n- Complete effort to exploit acoustic noise shielding effects of complex geologic structures on ocean basin margins to enhance performance of buried passive acoustic sensors.\n- Complete effort to improve representation of ocean uncertainty in acoustic propagation models using a multiscale ocean data assimilation algorithm."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.508"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.508"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014 unless completed above.\n- Complete enhancements to the accuracy of acoustic performance predictions through stochastic algorithms dealing with environmental uncertainty."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physical Oceanography"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to develop naval tactical uses of knowledge of the physics of the ocean within the BSE. This is achieved through the development of predictive models of the water mass structure, waves, currents, and air-sea interactions and developing measurement\/observation technology. Other applications utilize knowledge of the interaction of the water column hydrodynamics and the acoustics to predict the undersea transmission characteristics and sources of uncertainty in these statistics. Utilizing knowledge of the ocean surface physics, the physical oceanography program seeks to exploit the combination of remotely sensed data, in-situ data, and adaptively sampled data to optimize predictions of ocean currents and water column structure. These predictions, custom databases, adaptive sampling schemes and data programs serve ASW, Naval Special Warfare (NSW), Sea-Basing, and mine warfare needs.\n\nFunding increase from FY 2014 to FY 2015 due to the implementation and integration of coastal forecast models into the TOPSIDE command and control and mission planning system.  These models will have a data assimilation to utilize the data sets featured in the data fusion section of the software.  The system is of interest to Naval Special Warfare and to Naval Oceanographic Office for their Glider Operations Center."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.164"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to employ ocean models to complete 3-D acoustic simulations of space-time coherence of the acoustic field, which is a primary characteristic related to detection performance of acoustic systems.\n- Continued development of mass conserving baroclinic finite element models using discontinuous Galerkin methods.\n- Continued to extend current theory dealing with tidal variations in sound-speed to sound-speed events with strong range dependence.\n- Continued the development of a data assimilative nearshore modeling capability using measurements to guide hydrodynamic forecasts including data sampling strategies and model sensitivity to data.\n- Continued new ocean mixed-layer algorithms for generation of synthetic profiles which has led to the operational implementation of a new Navy Ocean Sound Speed Prediction (NOSSP) system at the Naval Oceanographic Office.\n- Continued the integration of hyperspectral imagery into underwater autonomous vehicles and derive river environmental properties through a combination of models and observations.\n- Continued the development and implementation of new techniques for parameterizing fluxes of mass and energy across the airsea interface in coupled ocean-atmosphere models, to improve operational predictions of the BSE.\n- Continued development and testing of acoustic communications, disposable environmental instruments, and Unmanned Undersea Vehicles (UUV) and gliders for NSW mission support.\n- Continued developing Delft3-D-Coupled Ocean Atmosphere Mesoscale Prediction System (COAMPS) to include new options for riverine input and transport and behavior of contaminants in support of NSW mission planning.\n- Continued the development of synthetic aperture radar (SAR) and hyperspectral imagery exploitation for NSW and Marine Expeditionary Forces as well as the support of new riverine units.\n- Continued studies of the monitoring and evaluation of ocean currents and water mass properties near topographic control points in marginal seas.\n- Continued to develop improved ocean wave prediction, especially shoaling waves, based on the extensive basic research measurement programs in this area over the past decade.\n- Continued development of predictive capability of internal wave affects on the battlespace, including affects on acoustic transmission.\n- Continued the development of the coupled Delft3-D-COAMPS model within the larger naval forecast system for use in NSW mission planning.\n- Continued the development of adaptive sampling algorithms for minimizing acoustic uncertainty using persistent, reconfigurable sampling by UUVs.\n- Continued on-board processing of METOC data on gliders\/UUV for exfiltration consistent with operational concept of operations.\n- Continued the custom installation of adaptive sampling algorithms for minimizing acoustic uncertainty using persistent, reconfigurable sampling by UUVs using Naval Oceanographic (NAVO) modeling systems.\n- Continued an effort to utilize data from new mooring technologies in combination with AUV data to develop practical methodologies to identify and extract the AUV-data spectral content that is not accurately represented in operational systems currently assimilating these data.\n- Continued an effort to quantitatively determine how the optical properties of the upper ocean's organic constituents modify physical processes, such as the depth penetration of shortwave radiation into the ocean, and integrate a representation of bio-optical variability into the coupled ocean\/atmosphere modeling framework.\n- Continued the development of ensemble methods to explore the propagation of uncertainty through the ocean-atmosphere coupled system and into the ocean state. \n- Completed an effort to utilize data from new mooring technologies in combination with AUV data to develop practical methodologies to identify and extract the AUV-data spectral content that is not accurately represented in operational systems currently assimilating these data.\n- Completed an effort to quantitatively determine how the optical properties of the upper ocean's organic constituents modify physical processes, such as the depth penetration of shortwave radiation into the ocean, and integrate a representation of bio-optical variability into the coupled ocean\/atmosphere modeling framework.\n- Initiated the development of the Navy's first high-resolution fully coupled relocatable ice-ocean-atmosphere (IOA) prediction system by building coupling software to couple the CICE ice model into the COAMPS system, evaluating the results and then demonstrating the capability. \n- Initiated the effort to extend the predictability of currents, waves and density structure in the coastal ocean by building a coupled 4D-VAR data assimilation capability for coupled ocean-wave models and use this ability to define prediction sensitivity to targeted observations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.863"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013 less those noted as completed above.\n- Complete the development of ensemble methods to explore the propagation of uncertainty through the ocean-atmosphere coupled system and into the ocean state."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.660"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.660"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014 less those noted as completed above.\n- Complete the development of the Navy's first high-resolution fully coupled relocatable ice-ocean-atmosphere (IOA) prediction system by building coupling software to couple the CICE ice model into the COAMPS system, evaluating the results and then demonstrating the capability.\n- Complete the effort to extend the predictability of currents, waves and density structure in the coastal ocean by building a coupled 4D-VAR data assimilation capability for coupled ocean-wave models and use this ability to define prediction sensitivity to targeted observations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "All Science and Technology model improvements undergo a rigorous validation verification and evaluation against quantifiable metrics before being accepted for transition into operations.  In Marine Meteorology, for example, typical improvements over the past decade have amounted to a gain in skill of one forecast-day (i.e., the 4-day forecast is now as skillful as the 3-day forecast of a decade ago), and tropical cyclone forecast track error has been reduced by 50%.  It is expected that future increases in skill will continue at or above this pace."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "13.750"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.750"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "AGOR Mid-life Refit"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "13.750"
                                        },
                                        "Text": {
                                            "val": "FY13 funding will support the overhaul, re-fit and upgrade of Navy research vessel THOMAS G THOMPSON (AGOR 23). In FY13 funds will be awarded to the University of Washington to initiate a six-month detailed engineering design effort by a naval architect, followed by a competitive selection for a shipyard to implement the design plans. The THOMPSON will enter the shipyard in November 2014 to begin the refit.\n\nDeliverables will support new environmental compliance requirements regarding ballast water treatment, marine sanitation, engine exhaust, incinerator exhaust, air conditioning refrigerants, and oily-water separation.  Additional deliverables will overcome obsolescence of diesel engine and electrical system components, and enhance the ship safety with piping replacements in the ship's firemain and ballast water systems."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}