{
    "id": "a4365224a100fb5331f96e5de57939d8168b2afd",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603699D8Z"
        },
        "ProgramElementTitle": {
            "val": "Emerging Capabilities Technology Development"
        },
        "R1LineNumber": {
            "val": "53"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "43.377"
            },
            "PriorYear": {
                "val": "20.859"
            },
            "CurrentYear": {
                "val": "53.967"
            },
            "BudgetYearOne": {
                "val": "33.706"
            },
            "BudgetYearOneBase": {
                "val": "33.706"
            },
            "BudgetYearTwo": {
                "val": "34.784"
            },
            "BudgetYearThree": {
                "val": "33.384"
            },
            "BudgetYearFour": {
                "val": "32.622"
            },
            "BudgetYearFive": {
                "val": "41.306"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Emerging Capabilities Technology Development (ECTD) Program Element (PE) reflects a shift in focus throughout the Office of the Deputy Assistant Secretary of Defense for Rapid Fielding (DASD RF) on producing risk-reducing prototypes and demonstrations coordinated through interagency and Service partnerships.  The ECTD will support the Department's Countering Emerging Threats priority area through longer-term, mission-focused capability development.  The office will execute projects in collaboration with government labs, academia, and industry that target specific mission capability gaps across the Combatant Commands.\n\nIn FY 2015, Disruptive Demonstrations (Project P369) funding will be transferred from PE 0603699D8Z (Emerging Capabilities Technology Development) to PE 0603289D8Z (Advanced Innovative Analysis & Concepts)."
        },
        "ProgramElementMissionDescription": {
            "val": "This funding develops emerging capabilities and prototypes in support of near and mid-term irregular warfare and stability operations.  The framework is guided by the Office of the Assistant Secretary of Defense, Research and Engineering, the DASD RF, and the Rapid Reaction Technology Office science and technology objectives and focus areas.  With an emphasis on interagency and service partnerships, initiatives are developed to pursue risk-reducing prototypes and demonstrations in order to produce capability options that anticipate and inform formal joint and interagency requirements and acquisition processes.  Individual projects generally span a two to four year period, typically at a cost of less than $4.000 million, and are demonstrated and fielded in spirals within the project timeline.  During FY 2014, the ECTD Program enhanced its focus on rapid prototyping of high-payoff technologies.  This program element has evolved from exclusive support of force transformation activities to the activities described above, which are more closely aligned with departmental goals."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "24.662"
                },
                "CurrentYear": {
                    "val": "61.971"
                },
                "BudgetYearOne": {
                    "val": "45.706"
                },
                "BudgetYearOneBase": {
                    "val": "45.706"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.859"
                },
                "CurrentYear": {
                    "val": "53.967"
                },
                "BudgetYearOne": {
                    "val": "33.706"
                },
                "BudgetYearOneBase": {
                    "val": "33.706"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.803"
                },
                "CurrentYear": {
                    "val": "-8.004"
                },
                "BudgetYearOne": {
                    "val": "-12.000"
                },
                "BudgetYearOneBase": {
                    "val": "-12.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-3.239"
                    },
                    "CurrentYear": {
                        "val": "-8.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.033"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.522"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Efficiency Savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-12.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.009"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.004"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015:  Decrease of $12.000 million is the net of Disruptive Demonstrations (P264) funding transfer to new PE 0603289D8Z, Advanced Innovative Analysis and Concepts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P795"
                    },
                    "ProjectTitle": {
                        "val": "Emerging Capabilities Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "43.377"
                        },
                        "PriorYear": {
                            "val": "20.859"
                        },
                        "CurrentYear": {
                            "val": "34.967"
                        },
                        "BudgetYearOne": {
                            "val": "33.706"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.706"
                        },
                        "BudgetYearTwo": {
                            "val": "34.784"
                        },
                        "BudgetYearThree": {
                            "val": "33.384"
                        },
                        "BudgetYearFour": {
                            "val": "32.622"
                        },
                        "BudgetYearFive": {
                            "val": "41.306"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This funding develops emerging capabilities and prototypes in support of near and mid-term irregular warfare and stability operations.  The framework is guided by the Office of the Assistant Secretary of Defense, Research and Engineering (ASD(R&E)), the Deputy Assistant Secretary of Defense for Rapid Fielding, and the Rapid Reaction Technology Office science and technology objectives and focus areas.  With an emphasis on interagency and service partnerships, initiatives are developed to pursue risk-reducing prototypes and demonstrations in order to produce capability options that anticipate and inform formal joint and interagency requirements and acquisition processes.  Individual projects generally span a two to four year period, typically at a cost of less than $4.000 million, and are demonstrated and fielded in spirals within the project timeline.  During FY 2014, the Emerging Capabilities Technology Development Program enhanced its focus on rapid prototyping of high-payoff technologies.  This program element has evolved from exclusive support of force transformation activities to the activities described above, which are more closely aligned with departmental goals."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Overwatch"
                                    },
                                    "Description": {
                                        "val": "Overwatch is an overarching ground capability development effort which is leveraging technology and new concepts to develop prototypical capabilities to fill ground combat and interagency capability gaps.  It contains multiple initiatives seeking to cultivate and leverage emerging technologies and concepts to counter the current and future challenges characteristic of the irregular warfare environment.  Projects are oriented toward increasing warfighter effectiveness on the battlefield and\/or the development\/enhancement of “whole of government” irregular warfare capabilities.\n  \nThe capability development effort furthers interagency capabilities by pursuing concept experimentation\/validation, interoperability enhancements, and command and control development.  Ground capabilities focus on command and control, force protection, situational awareness, and networked, cooperative engagement for application in denied areas or low-cost, small footprint operations.  These solutions include completed operational assessments, equipment prototypes, or validated concepts which can be used to inform and drive formal procurement processes and\/or policy decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.264"
                                            },
                                            "Text": {
                                                "val": "QuickNETS was assessed for continuing requirements, while NexTech, Advanced Countermeasure Prototype, Buoyant Body Armor, Spectral Management, Intelligent Small Unit Power (ISUP), and Humanitarian Assistance\/Disaster Relief (HA\/DR)-Test Center continued development of prototypes.  Development, testing, and safety certification of the Advanced Mortar Protection Systems (AMPS) was completed and initial fielding began in FY 2013 in support of Operation Enduring Freedom.  New starts included Multi-modal Hostile Fire Detection System (MHFDS) and Remote Weapon System (RWS) Auto Prioritization, Targeting, and Operator Cueing (RAPTOR), a semi-autonomous crew-served weapon system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.936"
                                            },
                                            "Text": {
                                                "val": "Fielding of AMPS with U.S. Forces-Afghanistan (USFOR-A) in support of Operation Enduring Freedom will be completed in FY 2014.  Intelligent Small Unit Power (ISUP), Advanced Countermeasure Prototype – Helo Active Protection System (ACP-HAPS), Spectral Management and Buoyant Body Armor prototypes will be assessed for continuing requirements and\/or closed\/transitioned.  Additionally, Buoyant Body Armor, ACP-HAPS, and Spectral Management will test and demonstrate.  Walking Papers, Multi-modal Hostile Fire Detection System (MHFDS), RAPTOR, NexTech, and HA\/DR-Test Center will continue project developments.  New projects for FY 2014 will include:  Augmented Reality Clip-On (ARCO), which provides a software implementation to interconnect with a host device to display real-time points of interest as a heads-up display (HUD) on a suite of night vision goggles (NVGs); Wide Field of View Enhanced Binocular Night Vision Device (WFOV eBNVD), which develops NVG prototypes to increase the operator’s field of view by 250 percent and provide enhanced depth perception; and the Net-Zero Engagement project, which will identify more cost effective ways of engaging in unstable and transitioning states.  Other new projects for FY 2014 under consideration include: Multi-Medium Identification System (MMIDS), which will test and evaluate the effectiveness of a novel detector for threat and illicit material detection\/identification in objects and conveyance in a variety of environments; and Enhanced Expeditionary Engagement Capability (E3C) which will provide warfighter input to the development of a precision-guided 81mm mortar.  Additional projects will be developed and informed by Assistant Secretary of Defense (Research & Engineering), Deputy Assistant Secretary of Defense Rapid Fielding (DASD RF), Rapid Reaction Technology Office (RRTO) objectives and focus areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.800"
                                            },
                                            "Text": {
                                                "val": "HA\/DR-Test Center will transition to an operational entity under United States Pacific Command (USPACOM).  Multi-modal Hostile Fire Detection System, RAPTOR, NexTech, ARCO, WFOV-eBNVD, and the Net-Zero Engagement projects will continue development of prototypes.  Potential new starts for FY 2015 include Shock Impact and Explosive Limits Dosimetry (SHIELD), which will develop a new helmet liner designed to identify and classify potential over-pressure situations leading to traumatic brain injuries. Additional projects will be developed and informed by ASD (R&E), DASD RF and RRTO objectives and focus areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Irregular Warfare\/Stiletto"
                                    },
                                    "Description": {
                                        "val": "The Maritime Irregular Warfare portfolio investigates gaps and develops irregular warfare capabilities in the maritime domain, with a particular focus on prototype concepts and systems.  Projects explore the development of counter evolved non-state capabilities such as semi- and fully-submersible vehicles, countering unmanned swarms, maritime non-lethal weapons systems, and low cost littoral fire support, among other capabilities.  This expanded effort to address maritime capability gaps builds on and leverages the Stiletto dedicated maritime demonstration vessel.  Stiletto is a maritime demonstration platform designed to assist in the assessment of prototypes and the rapid transition of emerging technologies across the range of military operations to higher Technology Readiness Levels.  Stiletto, an 88-foot long boat, is an experimental, all carbon fiber craft that was purposefully designed to rapidly acquire, integrate, and employ new capabilities to explore the military utility of emerging technologies and concepts of operation for special and expeditionary forces.  The Stiletto program, managed in partnership with the Naval Surface Warfare Center’s Combatant Craft Division and the Naval Air Warfare Center Aircraft Division’s Warfare Innovation Cell, streamlines the experimentation process and helps facilitate the rapid demonstration, exploration, and risk reduction of emerging technologies and capabilities.  The demonstration process also encourages system developers to engage directly with the warfighter in the maritime environment to rapidly adapt technologies around warfighter needs.  The Stiletto vessel is home-ported in Norfolk, Virginia."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.264"
                                            },
                                            "Text": {
                                                "val": "In FY 2013, Naval Underwater Threat Interrogation and Covert Assessment System (NAUTICAS) prototype development continued with the Navy and Joint Improvised Explosive Device Defeat Organization (JIEDDO), moving from the lab environment to a real world, controlled environment, and testing within the Continental United States.  The Inflatable Catamaran project continued its development to improve the existing design and construction processes for the Special Forces’ inflatable hull component of the Combatant Craft Light (CCL Mk 1) inflatable catamaran with an initial operating capability in FY 2016.  The improved hull form will increase durability, reliability and maintainability.  The new design will provide significantly increased speed, range, payload, and improved riding, supporting missions such as Maritime Area Denial.  The Common Maritime Technology Working Group (CMTWG) identified the lead organizations for Stiletto Capability Demonstrations and produced an analysis of common small craft technology needs in FY 2013.  CMTWG worked within its membership to bring an advanced Multi-Fuel Engine into the Navy catalog.  The Maritime Irregular Warfare focus area supported three Stiletto Capability Demonstrations of emerging Intelligence, Surveillance, and Reconnaissance (ISR), Command and Control, and maritime Unmanned Vehicle Aerial Vehicle (UAV) launch and recovery capabilities on the boat in FY 2013, supporting Navy Expeditionary Combat Command (NECC), Trident Spectre 2013, and the UK Ministry of Defence.  Technology Demonstration periods also occurred throughout the year to support industry partners with emerging and innovative capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.942"
                                            },
                                            "Text": {
                                                "val": "NAUTICAS testing will be completed in FY 2014.  The Navy and JIEDDO worked toward a successful prototype system that will lead to the development of an operationally deployable prototype.  The Maritime Irregular Warfare portfolio will continue to develop and demonstrate state-of-the-art capabilities in anticipation of future needs, such as the Spar Tactical Sensor Mast deployable ocean sensor system and advanced unmanned surface and undersea systems focused on ASD(R&E), DASD RF, and RRTO objectives and focus areas.  Projects will focus on partnerships with the US Navy, US Coast Guard, US Army Watercraft Systems, US Special Operations Command (USSOCOM), US Southern Command (USSOUTHCOM), the Intelligence Community, and other operational users.  The CMTWG and Stiletto Maritime Demonstration Program will continue, and will focus maritime efforts on unmanned, autonomous capabilities and electronic warfare\/electronic protection.  Inflatable Catamaran Hull and Frame Development will complete testing towards its main objectives in FY 2014 and transition those capabilities to the Navy’s Combatant Craft Light Mark 1 program. The new design will provide significantly increased speed, range, payload, and improved riding, supporting missions such as Maritime Area Denial.  New Maritime Irregular Warfare projects for FY 2014 include development of the Spar Tactical Sensor Mast deployable ocean sensor system with the US Navy Director of Expeditionary Warfare and other interagency partners, which will increase situational awareness in limited access areas; and an effort to focus on maritime disablement technologies and prototypes to counter emerging threats.  Emerging capabilities will continue to be demonstrated on Stiletto during three Capability Demonstrations with operational commands and interagency partners, as well as joint operational demonstrations and exercises including Trident Warrior and Trident Spectre.  Stiletto’s FY 2014 Capability Demonstrations will focus on demonstrating integrated situational awareness capabilities to support expeditionary, coastal and riverine operations; mobile capabilities to support USSOCOM’s maritime activities; and maritime UAV launch and recovery demonstrations to support stakeholders including the UK Ministry of Defence and Naval Special Warfare.  Technology Demonstration opportunities will continue to be offered to non-traditional businesses to help mature their systems and increase engagement with the warfighter in the development process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.032"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.032"
                                            },
                                            "Text": {
                                                "val": "The Maritime Irregular Warfare portfolio will continue to develop and demonstrate state-of-the-art capabilities in anticipation of future needs, such as the Spar buoy deployable ocean sensor system, maritime disablement prototypes, and advanced unmanned surface and undersea systems focused on Assistant Secretary of Defense for Research & Engineering (ASD(R&E)), Deputy Assistant Secretary of Defense for Rapid Fielding (DASD RF), and Rapid Reaction Technology Office (RRTO) objectives and focus areas.  Projects will focus on partnerships with the US Navy, US Coast Guard, US Army Watercraft Systems, US Special Operations Command (USSOCOM), US Southern Command (USSOUTHCOM), the Intelligence Community, and other operational users.  Emerging capabilities will continue to be demonstrated on Stiletto during three Capability Demonstrations with operational commands and interagency partners, as well as joint operational demonstrations and exercises.  Technology Demonstration opportunities will continue to be offered to non-traditional businesses to help mature their systems and increase engagement with the warfighter in the development process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hybrid Airship"
                                    },
                                    "Description": {
                                        "val": "In 2008, the Department undertook an airship project called “Pelican”; with National Aeronautics and Space Administration (NASA) Ames Research Center providing technical and contractual oversight.  Pelican served as a non-deployable technology demonstrator that integrated several innovative technologies into a rigid aeroshell, variable buoyancy (RAVB) air vehicle.  The project’s goal was to mitigate long-term technical risks by integrating and demonstrating a suite of technologies with the potential to assist the development of future heavy-lift, airship programs.  The technology may enable the development of a nascent class of air vehicle which will reduce the energy use per ton-mile of airlift operations, permit high-payload operations directly into and out of austere regions with little infrastructure and enable long-endurance manned or unmanned air operations.  The key technologies demonstrated include: a buoyancy control system called Control of Static Heaviness (COSH), a rigid, lightweight-composite internal structure, a low-speed\/hover control system and ground handling capabilities that allow operations without a traditional airship’s ground handling crew.  This project and its inherent technical progress were also monitored by the United States Air Force Research Laboratory (AFRL) and United States Transportation Command."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.381"
                                            },
                                            "Text": {
                                                "val": "In January 2013, Pelican met its project demonstration objectives within parameters accepted by NASA.  FY 2013 funding was provided to produce technical data on Pelican’s subsystems that can be shared and used to guide future design and investment.  In March 2013, a report was submitted documenting project Pelican’s development.  In addition to a detailed analysis of the various subsystems, the report contained a theoretical scalability analysis as well as embedded lessons learned and development challenges.  The analytically detailed information gained from Project Pelican’s complete body of testing will help the DoD determine the best path forward with regard to airships in general and RAVB technology in particular.\n\nIn September 2013, project Pelican officially concluded with the submission of the final report on data and analyses conducted in FY 2013.  No follow-on work or funding is planned by the Department."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, and Reconnaissance (ISR)\/Thunderstorm\/Space"
                                    },
                                    "Description": {
                                        "val": "This portfolio examines and explores emerging technologies and prototypes to complement the US Air Force (USAF), the National Reconnaissance Office (NRO), and other interagency initiatives in ISR.  In addition, the portfolio addresses the National Space Strategy objectives to preserve and protect the space environment with a focus on developing applications for employment by the tactical user.  The flagship project for this portfolio is Thunderstorm, an enduring multi-Intelligence technology demonstration for the Office of Secretary of Defense, interagency partners, Combatant Commands (COCOMs), Services, academia, government laboratories and commercial vendors.  Thunderstorm demonstrations provide an opportunity to evaluate and assess the capabilities of new, prototype, emerging and transformational ISR technologies, and related information collection, processing, exploitation, and dissemination (PED) capabilities in mission-related, geographically, and operationally relevant environments prior to full-scale employment.  Thunderstorm demonstration objectives, performance measures, lessons learned, post-demonstration assessments and data evaluation serve to inform future DoD ISR concepts of operations and remote PED capabilities.  Thunderstorm aims to identify new capabilities and\/or new ways to employ existing capabilities that enhance our ability to “Deter, Predict, and Interdict” threats while assessing how to bridge capability gaps that cross multiple Departments and Agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.883"
                                            },
                                            "Text": {
                                                "val": "Thunderstorm Spirals 13-1 and 13-2 characterized maritime threat behavior in open water in the Gulf of Mexico through the littorals and the transition into the Texas land space.  Both spirals capitalized on the lessons learned from previous spirals.  In partnership with Joint Interagency Task Force South (JIATF-S), Customs and Border Protection (CPB), United States Coast Guard (USCG), United States Navy (USN), National Geo-Spatial Intelligence Agency (NGA), National Reconnaissance Office (NRO), United States Southern Command (USSOUTHCOM), United States Northern Command (USNORTHCOM) and the Texas Department of Public Safety, Spiral 13-1 technologies were utilized to detect and discriminate suspicious behavior in the open water, littoral and maritime-to-land transition space.  The highlight of this Spiral was the capability to share information in near real-time among eight data nodes.  Spiral 13-2 built upon lessons learned from Spiral 13-1, placed emphasis on the maritime-to-land transition activity and the ability to prosecute suspicious actors as they quickly meld themselves into urban or rural populations.  This information was gathered and then shared in near real time to the data nodes.  In FY 2013, Thunderstorm spirals demonstrated 28 emerging capabilities in operationally realistic environments with a broad range of potential operational users providing support.\n\nIn the space arena, a classified project in partnership with the NRO successfully demonstrated the ability to use commercial-off-the-shelf (COTS) Satellite Communications (SATCOM) equipment for transferring large data files from theater to the U.S.  The project used a COTS SATCOM High Data Rate Modem to improve the bandwidth throughput by 100 percent.  This was a prototype demonstration and this concept of operations will be adapted to other satellites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.967"
                                            },
                                            "Text": {
                                                "val": "Thunderstorm Spirals 14-1, 14-2 and 14-3 planning began in late FY 2013.  All three FY 2014 Spirals will capitalize on the lessons learned from previous spirals with special emphasis on information sharing; barriers to information sharing and evaluating prototype technologies.  Spiral 14-1 is a stand-alone threat convergence analysis designed to explore existing and nascent technology in an effort to expose threats to our national security; specifically those described as “Black Swan” events.  Spiral 14-1 is intended to be a precursor to FY 2015 Spirals.  Spiral 14-1 will be conducted in March 2014.  Spiral 14-2 is a Distributed Tabletop effort that is directly associated with the 14-3 Field Demonstration and focuses on Countering Chemical and Biological Weapons of Mass Destruction (WMD). Spiral 14-2 Distributed Tabletop exercise will be conducted in February 2014. The Spiral 14-3 Field Demonstration will take place in the southeast United States in the Spring\/Summer 2014.  Key operational partners include the JIATF-S, USCG, Defense Threat Reduction Agency (DTRA), CBP, Federal Bureau of Investigation (FBI), USN Intelligence Community (IC),  Office of Naval Intelligence (ONI), NRO, NGA, Homeland Security Investigations (HSI), Joint Program Executive Office (JPEO) for Chemical and Biological  Defense, and Special Operations Command (SOCOM).\n\nIn the space arena, projects focus on increasing satellite utility, prototypes, developing transformational satellite capabilities for the tactical user and efforts to improve space situational awareness.  With the high value and long lead time to replace space assets, the goal is to preserve and protect these capabilities.\n In FY 2014, a project is underway to assess emerging technologies for managing the space environment.  Specifically, the project will provide a critical overview of credible technologies, prototypes, and concepts for understanding, observing, and managing the space environment through space debris mitigation, commercial space situational awareness capabilities, and space-based orbital servicing.  Other projects under consideration for FY 2014 include Flume, a software system that aims to enhance the speed of ISR data link communications for Global Hawk, and Multi-INT Activity Learning and Inferencing for Space Threat Prediction (MALISTP), a software system that produces indications and warnings of threats to space assets, attribute estimation, change detection, and proximity analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.349"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.349"
                                            },
                                            "Text": {
                                                "val": "Planning will continue for subsequent Thunderstorm spirals building on the experience garnered from previous spirals.  The details of Thunderstorm FY 2015 have yet to be determined but will likely reflect lessons learned from Thunderstorm FY 2014 as well as real world exigencies.\n\nSpace projects will focus on new and emerging space technology with the goal of expanding capabilities to move large amounts of data quickly; and improve multi-intelligence sensing, processing, exploitation and dissemination.  Efforts to manage the space environment through space debris mitigation, space situational awareness, and threat prediction will continue in FY 2015."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Science and Technology Support to Information Operations (IO)"
                                    },
                                    "Description": {
                                        "val": "This portfolio will apply the Rapid Reaction Technology Office (RRTO) business model of relatively low cost, short duration, high-impact, gap filling investments to complement DoD, the Department of State (DoS), and Department of Homeland Security (DHS) initiatives in the development of capabilities in the areas of Information Operations, Strategic Communication, and Public Diplomacy.  Projects of particular interest include efforts to fill gaps in tools and capabilities that support the National Counterterrorism Strategy and the Countering Violent Extremism (CVE) Abroad Framework by developing influence assessment capabilities, measures of effectiveness, social media analysis, and counter-narrative capabilities.  Specific support to United States Combatant Commands (COCOM) needs will be coordinated through the Director for Information Operations in the Office of the Under Secretary of Defense for Policy, Special Operations and Low Intensity Conflict (SO\/LIC) and the Joint Staff."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.879"
                                            },
                                            "Text": {
                                                "val": "Projects funded in FY 2013 supported Information Operations and CVE needs in partnership with SO\/LIC, DoS’s Center for Strategic Counterterrorism Communications (CSCC), U.S. Agency for International Development (USAID), and multiple Combatant Commands.  USNORTHCOM’s NETp-1 project transitioned to its next phase, incorporating Commander Joint Task Force (CJTF) – Horn of Africa (HOA), United States Southern Command (USSOUTHCOM), and the Joint Information Operations Warfare Center as transition partners.  DoS’s CVE Messaging Impact project continued prototype development, with participation from USCENTCOM and contributions from the Countering Terrorism Technical Support Office (CTTSO).  The Information Operations Assessment Foundation helped form the DoD framework for Information Operations Assessment by supporting SO\/LIC and the Joint Staff to identify and adapt best practices from DoD as well as commercial marketing experience in influence assessment.  The first set of mobile applications in support of USCENTCOM was delivered and began to be operationally assessed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.326"
                                            },
                                            "Text": {
                                                "val": "Projects will focus on developing technologies and capabilities in the areas of influence assessment, measurement of effectiveness, social network analysis, advanced communications technologies, and other areas identified through partnerships with other DoD, COCOM, and interagency stakeholders to support DoD efforts in cyber science and technology development and Building Partner Capacity.  The Information Operations Assessment Foundation project will be completed in FY 2014 and transition the assessment framework to the Joint Information Operations Warfare Center.  The NETp-1 project in its second phase will transition in FY 2014 to the Joint Staff-J8 for use in both influence assessment and Theater Campaign Planning.  New projects in FY 2014 include an enhancement to the CVE Messaging Impact tools that will meet the needs of USSOCOM, DoS’s CSCC, and USAID; a Digital Dashboard to assess the effectiveness of mobile applications deployed by USCENTCOM; and potential development of a Common Operating Picture to improve understanding of the information environment in the littorals in support of the Marine Corps Information Operations Command."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.725"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.725"
                                            },
                                            "Text": {
                                                "val": "Projects will focus on developing technologies and capabilities in the areas of influence assessment, measurement of effectiveness, social network analysis, advanced communications technologies, and other areas identified through partnerships with other DoD, COCOM, and interagency stakeholders to support DoD efforts in Cyber science and technology development and Building Partner Capacity.  Priority will be placed on DoD, Joint Staff, and interagency S&T needs identified in a forthcoming Information Operations Strategy from Office of the Undersecretary of Defense (Policy)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Prototyping"
                                    },
                                    "Description": {
                                        "val": "This portfolio will focus on cost-effective, limited duration projects to design, develop and deliver prototypes of cutting-edge land, sea, air and space systems to meet the Department's goal to drive innovation in aviation, space, maritime and ground combat systems in a fiscally constrained environment through advanced rapid prototyping.  These prototypes will be delivered to joint and Service users to evaluate operational capabilities under realistic conditions and against current adversaries or anticipated threats.  Potential venues for prototype assessment include assets such as the Stiletto Maritime Demonstration Program, Thunderstorm integration exercises and the Joint Experimental Range Complex (JERC) in Yuma, Arizona.  (The JERC experimentation venue is supported in part by the Rapid Reaction Technology Office’s Rapid Reaction Fund.)  Knowledge and experience gained through those demonstrations will help develop new warfighting concepts and inform requirements and technical feasibility of future acquisition programs.  These initial prototype efforts will help reduce the cost of future acquisition programs and stimulate efforts beyond traditional defense industrial base activities.  Development of advanced prototypes will involve partnerships with industry and academia and permit operational users to gain insight into future technology-enabled strategies and tactics.  Advanced rapid prototyping provides a mechanism to guard against technological surprise, preserve industrial base capabilities, impose asymmetric strategic costs on potential adversaries, and explore innovative, technology-enabled military capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.796"
                                            },
                                            "Text": {
                                                "val": "Rapid prototyping will be a new focus area in FY 2014.  Plans for FY 2014 include pursuing development of concepts and designs that will result in ready-to-field prototype systems in one to three years.  Candidate efforts will address the Department’s Science and Technology priorities, including unmanned air, ground, and underwater systems; low-cost space access; advanced rotorcraft capabilities; directed energy; energy efficient engine technology; electronic warfare; global access Intelligence, Surveillance, Reconnaissance (ISR) systems; dismounted soldier systems; vehicle active protection; and installation\/base efficiency, sustainment and protection.  New prototype efforts in FY 2014 include: Advanced Countermeasure Prototype Phase III – Forward Operating Base (FOB) and Convoy Active Protection System (ACP Phase III: F&C APS) which will provide an active protection system against rocket propelled grenades for ground assets—FOBs and vehicles; and establishment of a focus on Electromagnetic Environmental Understanding, which will allow tactical units to automatically identify and exploit electromagnetic spectrum or signals of interest.  A project under consideration in this focus area is Quantum Weak Value Amplifier (QWVA), which will amplify electromagnetic signals of interest.  Other potential new prototype efforts in FY 2014 include Small Fast Interceptor, a classified program addressing Anti-Access\/Area Denial (A2\/AD) capability gaps, and North American Arctic Next Generation Over-the-Horizon Radar (Arctic OTHR), which will demonstrate and mature advanced bi-static and multi-static OTHR concepts and techniques to support development of a persistent, scalable, wide-area Arctic surveillance capability in both the air and maritime domains.  Advanced prototype efforts will leverage joint or Service partnerships and involve operational commands in the evaluation of field-ready prototypes in realistic military environments.  Additional new efforts will examine and find possible leverage points to improve the state of the art for rapid prototyping.  Potential efforts may include improved materials, reduced prototyping costs and\/or improved cycle times for prototyping activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.800"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2015 will build on prototyping developments started in FY 2014.  Efforts will span the development of a broad range of prototypes and may focus on near, mid-term, or long term strategic needs.  Candidate efforts will address the Department’s Science and Technology priorities and specifically address the Assistant Secretary of Defense (Rearch & Engineering) initiative on Agility and Innovation, including unmanned air, ground, and underwater systems; low-cost space access; advanced rotorcraft capabilities; directed energy; energy efficient engine technology; electronic warfare; global access Intelligence, Surveillance, Reconnaissance (ISR) systems; dismounted soldier systems; vehicle active protection; and installation\/base efficiency, sustainment and protection.  Five to eight advanced prototype efforts will start in FY 2015 leveraging joint or Service partnerships and involving operational commands in the evaluation of field-ready prototypes in realistic military environments.  Ongoing efforts will include projects in the Electromagnetic Environmental Understanding and A2\/AD capability gap areas.  Additional new efforts will examine and find possible leverage points to improve the state of the art for rapid prototyping.  Potential efforts may include improved materials, reduced prototyping costs and\/or improved cycle times for prototyping activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Disruptive Demonstrations"
                                    },
                                    "Description": {
                                        "val": "The Disruptive Technology Demonstrations project is a technology initiative to address pre-conflict-centric capability needs and anticipatory concerns while maintaining low cost, small footprint operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.188"
                                            },
                                            "Text": {
                                                "val": "Completed project analysis, application investigations, remote payload delivery prototypes and study investigations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2015, generic performance metrics applicable to Emerging Capabilities includes attainment of DoD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology (S&T) program\" and the metrics for this objective is to transition 40 percent of completing demonstrations program per year.  In addition, project completions and success are monitored against schedules and deliverables stated in the proposals and statements of work.  The metrics include items such as target dates, production measures, fielding dates, and demonstration goals and dates.  In FY 2013, Emerging Capabilities Technology Development had 100 percent of its completing projects successfully transition."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P369"
                    },
                    "ProjectTitle": {
                        "val": "Disruptive Technology Demonstrations"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "19.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2015, Disruptive Demonstrations (P369) funding will be transferred from the ECTD Program Element to PE 0603289D8Z (Advanced Innovative Analysis & Concepts)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Disruptive Technology Demonstrations project is a technology initiative to address pre-conflict-centric capability needs and anticipatory concerns while maintaining low cost, small footprint operations.  The program objectives are to develop disruptive anticipatory products, processes and services suited for quick deployment to fulfill emerging pre-conflict requirements.  Disruptive technology and process demonstrations will leverage low cost, commercial, and often low-technology options to provide game-changing and innovative warfighting capabilities. Demonstrations will include protection capabilities in an era of increased theft of Defense-related Intellectual Property (IP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Disruptive Technology Demonstrations"
                                    },
                                    "Description": {
                                        "val": "The Disruptive Technology Demonstrations project is a technology initiative to address pre-conflict-centric capability needs and anticipatory concerns while maintaining low cost, small footprint operations. Prior FY accomplishments include:\n- Identified alternative, game-changing capabilities leveraging existing Department of Defense Capabilities in partnership with USPACOM. \n- Analyzed, demonstrated, and transitioned innovative alternative uses of existing Service programs of record.\n- Built threat models at an all-source level to address an urgent Combatant Command requirement.\n- Evaluated four near-term, game-changing options to address an urgent Combatant Command requirement.\n- Evaluated cost-effective forward base defense architectures.\n\nDue to nature of these efforts, specific descriptions and detailed plans are available at higher classification levels."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "Disruptive Technology Demonstrations will focus on addressing anticipatory concerns, and small footprint, low-cost operations, among others.  Utilizing low cost, commercial, existing Programs of Record, or low technology options outside the typical DoD acquisition business model, this initiative will demonstrate capabilities with the potential to disrupt and change warfighting that are suitable for rapid fielding and acquisition.  Disruptive demonstrations can be stand-alone technology, new processes, services, or concept demonstrations.  Projects will be selected in the execution year based on evolving iterative requirements from Joint and Service participants.  \n\nThese include demonstrations to examine and characterize DoD networks; cognitive Intelligence, Surveillance, and Reconnaissance (ISR) projects to enhance metrics of Theater Security Cooperation Plan (TSCP) activities; Command and Control (C2) tools during pre-conflict periods; and enhanced Operations Security (OPSEC) procedures to protect acquisition and operational data. Additional plans include:\n- Complete high-fidelity model development of four prototype to address urgent Combatant Command needs to support land-based defense assessments.\n- Evaluate performance of alternative uses of Service systems in response to a Joint Chiefs of Staff tasking to support land-based defense assessments.\n- Evaluate undersea capability options, and develop necessary models to respond to a Combatant Command tasking to support land-based defense assessments.\n- Leverage previously developed hypervelocity projectile models to evaluate Powder Gun defense in partnership with the Navy and Army; inputs risks and performance drivers into Land-based Railgun and Powder Gun test plans to support land-based defense assessments. \n- Expand development of and end-to-end Railgun and Powdergun engagement models that can be integrated with higher-fidelity threat models, to support land-based defense assessments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The primary acquisition strategy for funding Disruptive Technology Demonstrations will be through the use of Military Inter-Departmental Purchase Requests (MIPRS).  The specifics of each MIPR will be dependent upon the development center, laboratory, contractor or agency requirements and needs.  If an Inter-Agency agreement is required, compliance and coordination of the agreement will be completed in coordination with the receiving activity and Federal Acquisition Regulation 17.5."
                        },
                        "PerformanceMetrics": {
                            "val": "FY 2015 performance Metrics for Disruptive Demonstrations will be displayed in PE 0603289D8Z (Advanced Innovative Analysis & Concepts)."
                        }
                    }
                }
            ]
        }
    }
}