{
    "id": "b277addf2a897f16c57858a5960f5614e4d90cc0",
    "meta": {
        "filename": "dod-2015_RDTE_2015_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2015.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605126J"
        },
        "ProgramElementTitle": {
            "val": "Joint Integrated Air & Missile Defense Organization (JIAMDO)"
        },
        "R1LineNumber": {
            "val": "142"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "150.938"
            },
            "PriorYear": {
                "val": "63.151"
            },
            "CurrentYear": {
                "val": "42.772"
            },
            "BudgetYearOne": {
                "val": "43.176"
            },
            "BudgetYearOneBase": {
                "val": "43.176"
            },
            "BudgetYearTwo": {
                "val": "35.671"
            },
            "BudgetYearThree": {
                "val": "28.164"
            },
            "BudgetYearFour": {
                "val": "28.003"
            },
            "BudgetYearFive": {
                "val": "30.425"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  It provides the CJCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "55.902"
                },
                "CurrentYear": {
                    "val": "42.772"
                },
                "BudgetYearOne": {
                    "val": "48.176"
                },
                "BudgetYearOneBase": {
                    "val": "48.176"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "63.151"
                },
                "CurrentYear": {
                    "val": "42.772"
                },
                "BudgetYearOne": {
                    "val": "43.176"
                },
                "BudgetYearOneBase": {
                    "val": "43.176"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "7.249"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.000"
                },
                "BudgetYearOneBase": {
                    "val": "-5.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Change"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "7.249"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "JIAMDO-Core:  The Joint Staff plans to reduce dependence upon contracted advisory and assistance service efforts and increase leverage upon organic (military and federal civilian) labor.\n\nJIAMDO-Homeland:  Programs will be near development completion and conducting Military Utility Assessment, which requires live assets and integration development."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Core"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "33.781"
                        },
                        "PriorYear": {
                            "val": "26.175"
                        },
                        "CurrentYear": {
                            "val": "19.414"
                        },
                        "BudgetYearOne": {
                            "val": "20.178"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.178"
                        },
                        "BudgetYearTwo": {
                            "val": "15.871"
                        },
                        "BudgetYearThree": {
                            "val": "9.434"
                        },
                        "BudgetYearFour": {
                            "val": "9.765"
                        },
                        "BudgetYearFive": {
                            "val": "10.725"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team. JIAMDO also provides direct support to U.S. Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Core"
                                    },
                                    "Description": {
                                        "val": "Provides overall staff support for JIAMDO operations in the area of ballistic missile defense, air and cruise missile defense, and homeland defense.  This includes performing analyses, demonstrations, and programmatic assessments of technology, operations, requirements, and weapons systems.  In coordination with Services and COCOMs, JIAMDO Core also leads the definition, assessment, development, and approval of Joint AMD Operational Concepts, Operational Architectures, and capability requirements to guide the Department's joint\/interagency\/combined fully integrated and net-centric capable air defense (including defense against cruise missiles, unmanned aerial vehicles, and ballistic missiles).  JIAMDO Core also:\n• Develops and integrates joint exercises, simulations, war-games, force resource allocations, and interoperability initiatives\n• Manages relevant Congressional interaction and CCMD interface through a cadre of liaisons collocated with major headquarters\n• Directly supports and sponsors homeland air surveillance related demonstration and analysis activities\n• Runs the AMD Working Group focusing COCOM, Joint Staff, and Service collaboration efforts in the generation of joint concepts and development of the integrated AMD architecture and roadmap\n• Develops US positions for, and serves as the US representative to the NATO Air Defense Committee\n\nJIAMDO Core also enables strategic planning development, infrastructure, security, travel, administrative and other support activities.  Funding pays for: Contractor Systems Engineering and Technical Assistance (SETA) support for Air & Cruise Missile Defense (ACMD), Ballistic Missile Defense (BMD), Homeland Air Security (HAS) strategic planning, senior level briefings and JIAMDO white papers, leased office space including all upkeep services, all travel costs for government and contractor support personnel, including support for Combatant Commander liaison personnel travel, multiple levels of security including lease support for a Joint Worldwide Intelligence Communications System (JWICS) communications line, and Special Compartmented Information (SCI) terminals (due to the classified nature and the diverse content of work in the JIAMDO portfolio), 24-hour physical security force and alarm monitoring and maintenance, daily on-site security personnel to meet DOD, National Industrial Security Program Operating Manual (NISPOM), and other security regulations, for all administrative and support functions, all associated Information Technology (IT) support, copier purchase and maintenance, as well as basic office supplies and furniture, telephones, telephone lines, classified telephones, and classified\/unclassified data connections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.175"
                                            },
                                            "Text": {
                                                "val": "Performed Ballistic Missile Defense directed studies and program support activities including:  contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply.  Program reduced dependence on contracted advisory and assistance services, and leveraged organic (military and federal civilian) labor to achieve planned mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.414"
                                            },
                                            "Text": {
                                                "val": "Perform Ballistic Missile Defense directed studies and program support activities including:  contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply.  Program will reduce dependence on contracted advisory and assistance services, and intends to leverage organic (military and federal civilian) labor to achieve planned mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.178"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.178"
                                            },
                                            "Text": {
                                                "val": "Perform Ballistic Missile Defense directed studies and program support activities including:  contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply.  Program will reduce dependence on contracted advisory and assistance services, and intends to leverage organic (military and federal civilian) labor to achieve planned mission."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Conduct two Protection Functional Capability Boards per month.\n(2) Conduct two Air and Missile Defense Working Groups per month.\n(3) Conduct quarterly Change Control Boards.\n(4) Support U.S. Representative to NATO Air Defense Council (NADC) to include 2 overseas NADC meetings per year.\n(5) Develop and maintain electronic library of current Joint and Service AMD Publications.\n(6) Develop and maintain operational architecture compliance with DoD Architectural Framework (DODAF) standards.\n(7) Ensure 100% of all government employee travel is in accordance with the Joint Federal Travel Regulation\/Joint Travel Regulation.\n(8) Maintain all unclassified\/classified LANs on a daily basis in accordance with TJS Office of the Chief Information Officer guidance\/policy.\n(9) Ensure all computers, NIPRNET\/SIPRNET, are refreshed according to OCIO policy\/guidance."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P002"
                    },
                    "ProjectTitle": {
                        "val": "Homeland"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "39.347"
                        },
                        "PriorYear": {
                            "val": "14.957"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Homeland"
                                    },
                                    "Description": {
                                        "val": "Develop Homeland Surveillance technologies to enable Joint Integrated Air and Missile Defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.957"
                                            },
                                            "Text": {
                                                "val": "Perform technology development efforts.  Specific details of this project are classified."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "Details of this project are classified."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "Black Dart"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.833"
                        },
                        "PriorYear": {
                            "val": "4.111"
                        },
                        "CurrentYear": {
                            "val": "3.107"
                        },
                        "BudgetYearOne": {
                            "val": "3.200"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.200"
                        },
                        "BudgetYearTwo": {
                            "val": "2.444"
                        },
                        "BudgetYearThree": {
                            "val": "3.000"
                        },
                        "BudgetYearFour": {
                            "val": "3.000"
                        },
                        "BudgetYearFive": {
                            "val": "3.300"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JIAMDO Black Dart"
                                    },
                                    "Description": {
                                        "val": "Provides funding to support administration and execution of Black Dart demonstrations.  Black Dart is a unique joint, interagency demonstration focusing on rapid development and implementation of Counter - Unmanned Aircraft Systems (CUAS) technology from readily-available commercial and governmental products."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.111"
                                            },
                                            "Text": {
                                                "val": "Developed kinetic and non-kinetic solutions to the UAS threat set.  Provided analysis and coordination with the OSD JT&E Counter-UAS interagency, and incorporated Defense Advanced Research Projects Agency (DARPA) to further expand Black Dart scope."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.107"
                                            },
                                            "Text": {
                                                "val": "Continue to develop innovative material and non-material solutions that enhance all phases of the Joint Engagement Sequence versus the UAS threat.  Refine kinetic and non-kinetic negation systems and capabilities.  Develop detailed threat scenarios based on direct input from CCMDs to provide specific recommendations on material and non-material solutions to warfighter requirements.  Expand interagency participation to demonstrate C-UAS options in both Title 10 and Title 50 operational environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "Continue to increase fidelity of threat representations’ size & performance.  Continue to expand US DoD and Inter-agency system portfolio participation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1)  Complete events within schedule and budget.   Events provide useful data to improve C-UAS capability.  \n(2)  Document gaps, develop and substantiate hardware, software, and employment concepts. \n(3)  Field C-UAS capability."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P004"
                    },
                    "ProjectTitle": {
                        "val": "Joint Distributed Engineering Plant"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.712"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.924"
                        },
                        "BudgetYearOne": {
                            "val": "3.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.000"
                        },
                        "BudgetYearThree": {
                            "val": "2.500"
                        },
                        "BudgetYearFour": {
                            "val": "2.738"
                        },
                        "BudgetYearFive": {
                            "val": "2.900"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DOD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures. JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMD) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS). JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues and for capabilities development and validation in support of the Unified Command Plan (UCP) assigned missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Distributed Engineering Plant (JDEP)"
                                    },
                                    "Description": {
                                        "val": "Conducted a joint test event to assess the interoperability of joint, integrated air and missile defense weapon systems that leveraged COTS Networks to perform Joint Integrated Fire Control.  This effort provided users the means to create family of system (FoS) environments by linking existing capabilities using hardware, software, and operators in a live-fly environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.924"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint distributed test event to assess the interoperability of joint, integrated air and missile defense weapons systems.  Provide users the means to create FoS environments by linking existing capabilities using hardware, software, and operator-in-the-loop.  Link existing Service and Joint combat system engineering and test sites via distributed communications.   Reduce developmental cycle times by leveraging existing facilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint distributed test event to assess the interoperability of joint, integrated air and missile defense weapons systems.  Provide users the means to create FoS environments by linking existing capabilities using hardware, software, and operator-in-the-loop.  Link existing Service and Joint combat system engineering and test sites via distributed communications.   Reduce developmental cycle times by leveraging existing facilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1)  Each JDEP event develops measures of effectiveness (MOE) & measures of performance (MOP) based on a eighteen month test planning and event process.\n(2)  Complete events within schedule and budget. \n(3)  Events provide useful data to improve AMD interoperability, with implemented corrective changes."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P005"
                    },
                    "ProjectTitle": {
                        "val": "Nimble Fire"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "25.032"
                        },
                        "PriorYear": {
                            "val": "10.300"
                        },
                        "CurrentYear": {
                            "val": "9.656"
                        },
                        "BudgetYearOne": {
                            "val": "9.400"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.400"
                        },
                        "BudgetYearTwo": {
                            "val": "8.000"
                        },
                        "BudgetYearThree": {
                            "val": "7.230"
                        },
                        "BudgetYearFour": {
                            "val": "7.000"
                        },
                        "BudgetYearFive": {
                            "val": "7.500"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues.  JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JIAMDO Nimble Fire"
                                    },
                                    "Description": {
                                        "val": "The Department's only joint integrated air and missile defense operator-in-the-loop simulation that is comprised of current and future land, sea, and air weapon systems representing each of the Services AMD capabilities.  Enhances air and missile defense capability through the exploration of joint concepts and capabilities using current and future IAMD systems exercised by highly experienced operators against an integrated threat and providing quantifiable data that supports senior leadership within the Department of Defense, Combatant Commanders, and the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.300"
                                            },
                                            "Text": {
                                                "val": "The environment executed five events in direct support of USMC, USAF, USN, Fleet Forces Command, and Pacific Command.  A sixth event was cancelled ten days prior to execution due to travel restrictions.  Service events are used to support acquisition decisions, develop and refine requirements, and develop tactics, techniques and procedures. The Fleet Forces Command event supported Naval Integrated Fire Control Counter-Air (NIFC-CA) platform wholeness and warfighting CONOPS.  The PACOM event supported Integrated Priorities Lists (IPLs) refinement, coalition Ballistic Missile Defense (BMD), and future operational plans.  Continued to improve the simulation environment with specific enhancements including effects based modeling of Army’s Integrated Battlefield Control System (IBCS) with the Integrated Fire Control (IFC) network, improved electronic warfare modeling, better data link fidelity for Link-16 and Cooperative Engagement Capability (CEC) networks and gateway concepts.  Integrated four adversary simulators, added additional F-35 simulators, and introduced limited blue offensive cyber capabilities and National Technical Means (NTM) to tactical concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.656"
                                            },
                                            "Text": {
                                                "val": "Continue to advance the IAMD mission area through focused improvements to blue force systems and capabilities, increasingly realistic and representative threat environment, and meaningful support of IAMD stakeholders within DoD, Services, and Combatant Commanders.  Specific FY 2014 improvements include the introduction of the Three Dimensional Expeditionary Long-Range Radar (3DELRR), close coordination with USSTRATCOM and Joint Electronic Protection for Air Combat (JEPAC) for improving overall EW modeling, enhancements to IR modeling to include passive kill chains, introduction of Missile Defense Agency Program Office (MDA\/TH)  approved Terminal High Altitude Area Defense (THAAD) simulation, introduction of Sea-Based Terminal (SBT) capability, refinements to adversary simulators, blue offensive cyber, NTM to tactical concepts, and other classified joint force capabilities.  The environment will support a total of six events in FY 2014, executing three operator in the loop events in support of CENTCOM or PACOM and three service or COCOM led events (1x USN, 1x USMC, 1x NORTHCOM).  The NORTHCOM event will support a Homeland technology assessment for the National Capital Region (NCR)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.400"
                                            },
                                            "Text": {
                                                "val": "Continue to upgrade Army simulators.  Enhance Electronic Attack capabilities, data links and composite tracking on all systems.  Integrate four F-35 Joint Strike Fighter cockpits for joint forces.  Support impacts of Electronic Attack, emerging CONOPS\/TTP’s, limited offensive operations, and Integrated Fire Control in PACOM and CENTCOM AORs.  Execute three operator in the loop events."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Complete events within schedule and budget.\n(2) Specific details are classified."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P006"
                    },
                    "ProjectTitle": {
                        "val": "Cruise Missile Combat Identification (CID)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "30.233"
                        },
                        "PriorYear": {
                            "val": "7.608"
                        },
                        "CurrentYear": {
                            "val": "7.671"
                        },
                        "BudgetYearOne": {
                            "val": "7.398"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.398"
                        },
                        "BudgetYearTwo": {
                            "val": "6.356"
                        },
                        "BudgetYearThree": {
                            "val": "6.000"
                        },
                        "BudgetYearFour": {
                            "val": "5.500"
                        },
                        "BudgetYearFive": {
                            "val": "6.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at all major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the U.S.  It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team and provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cruise Missile Combat Identification (CID)"
                                    },
                                    "Description": {
                                        "val": "Develops joint Counterair Combat Identification technology, and positions it for fielding on front-line weapon systems.  Monitors, assesses, and enhances joint AMD Combat ID programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.608"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.671"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.398"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.398"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "Details of this program are classified."
                        }
                    }
                }
            ]
        }
    }
}