{
    "id": "b2ef3cf125e5e3f0c7bce5d72025a2a5b795e3c6",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA7_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0206625M"
        },
        "ProgramElementTitle": {
            "val": "USMC Intelligence\/Electronics Warfare Sys"
        },
        "R1LineNumber": {
            "val": "199"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "88.930"
            },
            "PriorYear": {
                "val": "21.369"
            },
            "CurrentYear": {
                "val": "33.394"
            },
            "BudgetYearOne": {
                "val": "14.179"
            },
            "BudgetYearOneBase": {
                "val": "14.179"
            },
            "BudgetYearTwo": {
                "val": "13.735"
            },
            "BudgetYearThree": {
                "val": "16.697"
            },
            "BudgetYearFour": {
                "val": "20.302"
            },
            "BudgetYearFive": {
                "val": "17.862"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Joint Surveillance Target Attack Radar System (JSTARS) capability is subsumed by Distributed Common Ground\/Surface System - Marine Corps (DCGS-MC) PE 0305208M in FY 2015."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) includes funds for Intelligence Command and Control (C2) which supports the employment of reconnaissance, surveillance, and target acquisition resources and the timely planning and processing of all-source intelligence.  It ensures that all-source tactical intelligence is tailored to meet specific mission requirements.  The systems collect and convert raw intelligence data on the battlefield into processed information and deliver the processed products to the Intelligence Analysis Systems (IAS) for analysis and dissemination."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.966"
                },
                "CurrentYear": {
                    "val": "34.394"
                },
                "BudgetYearOne": {
                    "val": "30.954"
                },
                "BudgetYearOneBase": {
                    "val": "30.954"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.369"
                },
                "CurrentYear": {
                    "val": "33.394"
                },
                "BudgetYearOne": {
                    "val": "14.179"
                },
                "BudgetYearOneBase": {
                    "val": "14.179"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.597"
                },
                "CurrentYear": {
                    "val": "-1.000"
                },
                "BudgetYearOne": {
                    "val": "-16.775"
                },
                "BudgetYearOneBase": {
                    "val": "-16.775"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-1.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.317"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.006"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.006"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-11.769"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.769"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.914"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease of $16.775M in FY15 aligns funding to program schedules and reduces development for technical refresh and technical insertions in the Tactical Signal Intelligence (SIGINT) Collection System (TSCS), Tactical Remote Sensor Systems(TRSS), Intelligence Equipment Readiness (IER) and Intelligence Broadcast Reciever (IBR) programs.  It also reduces development of Advanced Analytics tools in IAS and Cross Domain Solution in Technical Control Analysis Center (TCAC).  The decrease in funding from FY14 to FY15 is the result of JSTARS being subsumed by DCGS-MC (PE 0305208M) and Communication Emitter Sensing and Attacking System (CESAS II) completion of most Engineering and Manufacturing Development (EMD) work in FY14, as well as completion of development for the Common Sensor Radio in the TRSS program and reduced development of Advanced Analytics tools for IAS."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2272"
                    },
                    "ProjectTitle": {
                        "val": "Intel Command and Control (C2) Sys"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "88.930"
                        },
                        "PriorYear": {
                            "val": "21.369"
                        },
                        "CurrentYear": {
                            "val": "33.394"
                        },
                        "BudgetYearOne": {
                            "val": "14.179"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.179"
                        },
                        "BudgetYearTwo": {
                            "val": "13.735"
                        },
                        "BudgetYearThree": {
                            "val": "16.697"
                        },
                        "BudgetYearFour": {
                            "val": "20.302"
                        },
                        "BudgetYearFive": {
                            "val": "17.862"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Intelligence Command and Control (C2) supports the employment of reconnaissance, surveillance, and target acquisition resources and the timely planning and processing of all-source intelligence.  It ensures that all-source tactical intelligence is tailored to meet specific mission requirements.  The systems below collect and convert raw intelligence data on the battlefield into processed information and deliver the processed products to the Intelligence Analysis Systems (IAS) for analysis and dissemination.\n\nSensitive Compartmented Information Communications (SCI COMMS) - is a Super-High Frequency (SHF) multi-band satellite communications terminal, available in a transit case configuration, that provides dedicated tactical communications capability at the Top Secret\/Sensitive Compartmented Information (TS\/SCI) and Secret Collateral levels to USMC intelligence units. TROJAN SPIRIT terminals provide connectivity into Joint Worldwide Intelligence Communications System (JWICS), National Security Agency Network (NSANET) and Secret Internet Protocol Router Network (SIPRNET) via the TROJAN Network Control  Center. Funding supports research, development and testing of incremental product improvements, product interoperability and accreditation for Top Secret\/Sensitive Compartmented Information (TS\/SCI) connectivity.\n\t\t\t\t\t\t\t\t\t\t \t\t\nTechnical Control Analysis Center (TCAC), consisting of the AN\/UYQ-83 TCAC Remote Analysis Workstation (RAWS), AN\/MYQ-9 TCAC Transportable Workstation, Multi-Level Security (MLS) and the One Roof system, is the focal point of Radio Battalions (RADBN), Marine Corps Forces Special Operations Command (MARFORSOC), and Fixed Wing Marine Electronic Attack Squadron (VMAQ) Signals Intelligence (SIGINT) operations.  TCAC automatically collects, stores, retrieves and plays back digital voice signals; fuses and analyzes SIGINT data from tactical, theater and national collectors and databases for dissemination to tactical commanders.  TCAC provides SIGINT analysis applications to deployable Marine Air-Ground Task Force (MAGTF) units capable of directing and managing the technical and operational functions of other RADBN SIGINT\/Electronic Warfare (EW) assets. TCAC provides termination of national, theater and tactical data networks for data exchange with the tactical SIGINT\/EW assets, the Intelligence Analysis System (IAS), national databases, and provides USMC tactical SIGINT collection and analytical data into the Real-Time Regional Gateway (RTRG) and Distributed Common Ground System - Marine Corps (DCGS-MC).  \n\nJoint Surveillance Target Attack Radar (JSTARS) receives near-real-time Moving Target Indicator and Synthetic Aperture Radar (SAR) data from the JSTARS E-8C aircraft.  JSTARS Common Ground Stations (CGS) and Joint Service Workstations (JSWS) process, display, exploit and support evaluation of information received.  In FY15 JSTARS will be subsumed into DCGS-MC (PE 0305208M). \n\nTactical Remote Sensor Systems (TRSS) provides all weather direction, location determination, targeting, and tactical indications and warning of enemy activity in the Marine Air-Ground Task Force (MAGTF) Commander's Area of Interest.  TRSS is an equipment suite consisting of three primary sub-systems:  Unattended Ground Sensors (UGS); Relay Systems; and monitoring systems.  The sensor systems include seismic\/acoustic sensors, electro-magnetic sensors, and infrared (passive) sensors.  The relay systems include SATCOM retransmission systems.  The monitoring system includes the Sensor Monitoring imaging sensors group and Hand-Held Monitors (HHM).  The composition of the three sub-systems are comprised of several individual components.  Upgrading of individual components will occur on an as needed basis. TRSS 6.0 development improves the TRSS sensor management software in order to integrate TRSS sensor systems with theater-provided-equipment sensor systems in OEF and improve system interoperability.\n\nTeam Portable Collection System (TPCS) - is a semi-automated, man\/team portable system providing intercept, collection, Direction-Finding (DF), reporting and collection management to MAGTF Commander. It provides special signals intercept, and DF capability and is modular, lightweight and team transportable. It provides the MAGTF Commander with a modular and scalable carry on\/carry off suite of equipment which allows the system to exploit information from more technically advanced target sets.  TPCS is required to incorporate advanced SIGINT technology in order to allow the MAGTF Commander to maintain technological parity with the adversary.  TPCS is subsumed by the Tactical Signal Intelligence (SIGINT) Collection System in FY14. \t\t\n\t\t\t\t\t\t\t\t\t\t\t\nWide Field of View Persistent Surveillance (WFVPS) is a Marine Corps UUNS (10-335UA) in response to a CENTCOM JUONS (CC-0424) call for a Wide Area Staring Sensor on-board an organic USMC small UAV supporting operations in Afghanistan. There is no additional funding for the WFVPS program beyond FY14.\n\t\nMAGTF Secondary Imagery Dissemination System (MSIDS) Family of Systems (FoS) provides organic tactical digital imagery collection, transmission and receiving capability to the MAGTF Commander.  MSIDS is comprised of components necessary to enable Marines to capture, manipulate, annotate, transmit and receive images in Near Real Time (NRT), internally with subordinate commands that are widely separated throughout the areas of operation and externally with higher and adjacent commands.  MSIDS capability resides with the MAGTF G\/S-2 sections and Ground Reconnaissance Battalions, Light Armored Reconnaissance Battalions, Infantry Battalion Scout Sniper Platoons and Marine Corps Forces Special Operations Command. The MSIDS FoS extends the digital imaging capability to all echelons within the Marine Expeditionary Force (MEF), down to and including battalions and squadrons.  Captured images are capable of being forwarded throughout the MAGTF through the use of Base Station Workstation\/Communication Interface (BW\/CI), Out Station Workstation\/Communication Interface (OW\/CI) or existing C4ISR architecture.  Images can also be transmitted to the Tactical Exploitation Group (TEG) for more detailed processing and analysis.  The Video Exploitation Workstation (VEW) is used to import, manipulate, annotate still and video imager, create intelligence products, lift still frames from video, view multi-format TV signals and provide a field briefing capability. \n\nIntelligence Equipment Readiness (IER) supports rapid prototyping and integration of emerging technologies involving national systems data.  IER provides a responsive capability to alleviate Marine Corps intelligence systems shortfalls created by rapidly evolving technology, missions and threats.  The program provides for rapid technology insertion, training and logistics, and the time sensitive intelligence infrastructure requirements of Marine Corps Operating Forces and the theater and service intelligence organizations supporting those forces.  IER addresses requirements that span the entire Marine Corps Intelligence, Surveillance, and Reconnaissance Enterprise (MCISR-E).\n\t\t\t\t\t\nIntelligence Analysis System, Family of Systems (IAS FoS) provides timely planning and all source fusion, analysis, and dissemination of intelligence across the Intelligence Community of the Marine Air-Ground Task Force (MAGTF). IAS FoS is a scalable system that supports all missions, and provides a tactical intelligence capability tailored to meet specific mission requirements. Advanced analytics provides improved linking of structured and unstructured data sources, data and information discovery, and improved interoperability of data and exchange amongst the existing toolset applications. Funding allows the IAS FoS to stay up-to-date with current technology (COTS\/GOTS) that allows an increase in response time of intelligence analysis process, better quality intelligence products, and timely dissemination for units in all deployed environments.  The FY14 funding increase supports development of initial advanced analytics capability.  The FY15 funding decrease is due to completion of initial advanced analytics development.  \n\nRadio Reconnaissance Equipment Program (RREP) provides the Radio Battalions (RADBNS), Radio Reconnaissance Platoons (RRP), and the Marine Corps Forces Special Operations Command (MARFORSOC) Direct Support Teams (DSTs) with mission unique Signals Intelligence\/Ground Electronic Warfare (SIGINT\/EW) Equipment suites. The SIGINT Suite 3 (SS-3) is comprised of technology and equipment necessary to prosecute advanced signals. RREP will insert a new Electronic Attack (EA) system into the RREP Family of Systems (FoS). The RRP and DST Marines are trained and equipped to support the full spectrum of Marine Expeditionary Unit Special Operations Capable (MEU SOC) mission profiles as well as provide real time, imbedded support to any special operations scenario. This provides the supported Commander greater flexibility in employing his SIGINT assets when the use of conventional RADBN assets are not feasible. RREP is upgrading the SS-3 using an evolutionary development approach that inserts the latest technology into the suite as it becomes mature. This enables the SS-3 to remain a current platform against emerging threats. RREP is subsumed by the Tactical Signal Intelligence (SIGINT) Collection System (TSCS) in FY14. \n\nCounterintelligence (CI) and Human Intelligence (HUMINT) Equipment Program (CIHEP) provides the MAGTF with integrated, standardized, and interoperable information (automated data processing), communication, and specialized equipment to conduct the full spectrum of tactical CI\/Force Protection to include Irregular Warfare, HUMINT, and technical collection operations.  CIHEP provides each CI\/HUMINT Company (CIHCo) with a suite of equipment comprised of commercial-off-the-shelf, government-off-the-shelf, and non-developmental items (COTS\/GOTS\/NDI).  It integrates audio, video, imagery, communications, technical surveillance and computer equipment into lightweight, modular, scalable, deployable packages.  CIHEP enhances the capability to collect, receive, process, and disseminate CI\/HUMINT information from overt, sensitive, technical, tactical, and Force Protection, in the service, joint, and combined forces area of operations.\t\t\t\n\t\nIntelligence Broadcast Receiver (IBR) family conforms to the DoD Integrated Broadcast Service (IBS) objectives of interoperability and commonality across the Services to receive and process near real-time intelligence data.  The Universal Serial Bus (USB) Embedded National Tactical Receiver (ENTR) system, the newest component of the IBR family, is an integral portion of 7 Programs of Record, providing a significant reduction in size and weight.  The USB ENTR provides access to IBS data via Ultra High Frequency (UHF) Satellite Communications (SATCOM) broadcast channels delivering near real-time intelligence information within Combatant Commanders theater of operation allowing intelligence analysis to respond to accelerated operations cycles.  \t\n\nCommunication Emitter Sensing and Attacking System (CESAS) has the mission to disrupt, degrade or deny detected adversarial communication emitters. CESAS covers the High Frequency (HF), Very High Frequency (VHF) and Ultra High Frequency (UHF) frequency ranges against enemy emitters using modern modulation schemes. CESAS allows flexible employment to conduct Electronic Attack (EA) while on the move or in a stationary position, thus optimizing the Commanders' ability to employ this asset for the greatest success of the mission. Decrease of $5.923M from FY14 to FY15 due to completion of most Engineering and Manufacturing Development activities associated with the CESAS II development.\n\t\nTactical Exploitation of National Capabilities (TENCAP) exploits current national reconnaissance systems and programs by examining both technical and operational capabilities, implementing training, and sponsoring concept demonstrations to directly support Marine Corps operating forces.  The goal is to pursue technologies which exploit data from national systems to enhance intelligence support to the Marine Air-Ground Task Force (MAGTF) and\/or the supported Joint Task Force commander.\n\nTactical Signal Intelligence (SIGINT) Collection System (TSCS):  TSCS incorporates Team Portable Collection System (TPCS) and Radio Reconnaissance Equipment Program (RREP) into a single effort beginning in FY14.  It provides modular, lightweight and team\/man transportable\/portable systems and components which provide signal intercept, collection, Direction-Finding (DF), reporting and collection management capability to MAGTF Commander. It provides the MAGTF Commander with a modular and scalable carry on\/carry off suite of equipment which exploits information from more technically advanced target sets.  TSCS uses rapid technology insertion processes and procedures to incorporate advanced SIGINT technology to allow the MAGTF Commander to maintain technological superiority."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "*Technical Control and Analysis Center (TCAC): Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued program management support for the integration of Cyber Analysis Tools into the TCAC FoS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.611"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue program management support for the Integration of Cyber Analysis Tools into the TCAC FoS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.727"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.727"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue program management support for next generation TCAC analysis tools, Cross Domain Solution and Real-Time Regional Gateway (RTRG) expeditionary node into the TCAC Family of Systems (FoS)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Technical Control and Analysis Center (TCAC):  Product Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.854"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiated integration of Cyber Analysis Tools in the TCAC Family of Systems (FoS) and data exchange enhancements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.249"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue integration of TCAC Cyber Analysis tools and Cross Domain Solution into the TCAC Family of Systems (FoS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.760"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.760"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue integration of next generation TCAC analysis tools, Cross Domain Solution and Real-Time Regional Gateway (RTRG) expeditionary node into the TCAC Family of Systems (FoS)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*SCI COMMS: Support - Engineering and Technical Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.877"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funding supported an Analysis of Alternatives (AoA) for the Palletized variant. RDT&E utilized for Bandwidth in order to test for interoperability and accreditation for Top Secret\/Sensitive Compartmented Information (TS\/SCI) connectivity with the TROJAN Network Center."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.056"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funding will support the test and evaluation of all SCI COMMS platforms (Team and Palletized) to include Bandwidth in order to test for interoperability and accreditation for Top Secret\/Sensitive Compartmented Information (TS\/SCI) connectivity with the TROJAN Network Center."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.670"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.670"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funding will provide engineering analysis and technical support that will identify and provide recommendations for resolution of critical technical, test and evaluation, and technology issues."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Joint Surveillance Target Attack Radar System (JSTARS):  Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued engineering, technical and management support and MTI integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.154"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Test and evaluation support for the next generation GMTI exploitation system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "JSTARS will be subsumed into DCGS-MC (PE 0305208M)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Joint Surveillance Target Attack Radar System (JSTARS): Product Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.499"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate integration of next generation Ground Moving Target Indicator (GMTI) exploitation system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "JSTARS will be subsumed into DCGS-MC (PE 0305208M)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Tactical Remote Sensor System (TRSS):  Test and Evaluation - IOT&E"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.150"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued planned test and evaluation events for the TRSS 6.0 baseline."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.417"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue test and evaluation events\/IOT&E for the TRSS Common Sensor Radio (CSR) baseline."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Tactical Remote Sensor System (TRSS):  Product Development - RSMS VER 4.2.2."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.288"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued TRSS evolutionary software upgrade to Sentinel VER 2.0."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Team Portable Collection System (TPCS):  Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.388"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued program support and management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "TPCS is subsumed into the Tactical SIGINT Collection System (TSCS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Team Portable Collection System (TPCS):  Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.870"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed post production testing for Block 0 Modifications and Advanced Network Survey\/Precision Geolocation capability insertions and initiated performance testing for Digital Network Intelligence technology insertion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "TPCS is subsumed into the Tactical SIGINT Collection System (TSCS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Team Portable Collection System (TPCS):  Product Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.923"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued integration of Special Intelligence technologies, Digital Network Intelligence (DNI). Adapted technical documentation structure to support rapid technology insertion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "TPCS is subsumed into the Tactical SIGINT Collection System (TSCS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Tactical Remote Sensor System (TRSS):  Product Development - CSR Integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.762"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue TRSS Common Sensor Radio (CSR) modernization initiative to standardize communication.  This modernization effort is required to develop critical upgrades to TRSS systems to improve the sensor systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Tactical Remote Sensor System (TRSS):  Support - Engineering and Technical"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.625"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued engineering and technical management support for testing and integrating detector upgrades."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.996"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue engineering and technical management support required for developing critical upgrades to TRSS systems. TRSS Common Sensor Radio (CSR) modernization initiative will standardize communication and interoperability with other military equipment\/sensor systems currently in use and being developed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue engineering and technical management support required for developing critical upgrades to TRSS systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Wide Field of View Persistent Surveillance (WFVPS): Product Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.024"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed development of the autotracker."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete program close-out."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*MAGTF Secondary Imagery Dissemination System (MSIDS):  Support - Engineering and Technical"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.371"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued technical and engineering support for product development of hardware and software refresh."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.388"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue technical and engineering support for product development of hardware and software refresh."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Intelligence Equipment Readiness (IER):  Product Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.195"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued autotracker integration into DCGS-MC software baseline."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.560"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete integration of autotracker capability and functionality into DCGS-MC software baseline."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Intelligence Analysis System (IAS):  Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.010"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued program management support of Tier III software and hardware efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.096"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue program management support for integration of advanced analytics tools into the IAS FoS software baseline."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue program management support for integration of advanced analytics tools into the IAS FoS software baseline."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Intelligence Analysis System (IAS):  Product Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.079"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed prototyping, integration and testing Tier III technology refresh.  Supported software development and integration of all IAS FoS related software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.571"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate integration, system testing and evaluation of advanced analytic technologies into the Intelligence Analysis System (IAS) Family of Systems (FoS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.340"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.340"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue integration, system testing, and evaluation of advanced analytic technologies into the Intelligence Analysis System (IAS) Family of Systems (FoS).  Initiate market research, evaluation and development of advanced analytics for transition into the IAS FoS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Radio Recon Equipment Program (RREP):  Support - Program and Technical"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.964"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued program support for technology refresh of basic collection receivers and basic direction finding capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "RREP is subsumed into Tactical SIGINT Collection System (TSCS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Counterintel and Human Intel Equip (CIHEP):  Support - Engineering and Technical"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.181"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued materiel solution analysis, engineering, integration, and technical support for refresh of CIHEP hardware and software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.191"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue engineering, integration and technical support for refresh of CIHEP hardware and software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Communication Emitter Sensing and Attacking System (CESAS):  Product Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.337"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed Analysis of Alternatives, identified a preferred Materiel solution and initiated the CESAS II acquisition program. Successfully completed Systems Requirement Review and initial development including procurement of three Engineering Development Models.  Initiated Life Cycle Cost Estimate."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.585"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of CESAS II.  Accept, integrate and build three Engineering Development Models.  Will conduct Non Developmental Item Integration Review in lieu of CDR and Test Readiness Review.  After successful testing, plan to conduct Systems Verification Review in preparation for Milestone C."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete development of CESAS II."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Communication Emitter Sensing and Attacking System (CESAS):  Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.638"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct CESAS II development test and evaluation.  Test planning, conduct Test Readiness Review (TRR), conduct two phase Development and Environmental Tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete CESAS II development test and evaluation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Tactical Signal Intelligence (SIGINT) Collection System (TSCS): Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.588"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide program support and management for TPCS Modular Case technology refresh, technology insertions to support additional signals of interest, RREP technology refresh of advanced collection kit and workstation.\n\nTPCS and RREP are subsumed into the TSCS line in FY14."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.609"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.609"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide program support and management for TPCS and RREP technology refresh and technology insertions to support additional signals of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Tactical Signal Intelligence (SIGINT) Collection System (TSCS): Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.837"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate test and evaluation efforts for TPCS Modular Case technology refresh, technology insertions to support additional signals of interest, RREP technology refresh of advanced collection kit and workstation.\n\nTPCS and RREP are subsumed into the TSCS line in FY14."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.609"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.609"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue test and evaluation efforts for TPCS and RREP technology refresh and technology insertions to support additional signals of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Tactical Signal Intelligence (SIGINT) Collection System (TSCS): Product Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.853"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate development of TPCS Modular Case technology refresh, technology insertions to support additional signals of interest, RREP technology refresh of advanced collection kit and workstation.\n\nTPCS and RREP are subsumed into the TSCS line in FY14."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.739"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.739"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of TPCS and RREP technology refresh and technology insertions to support additional signals of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Communication Emitter Sensing and Attacking System (CESAS):  Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.834"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted Program initiation activities, including development of Materiel Development Decision Review and PEO Brief, Probability of Program success, Cost Analysis Requirements Document, Acquisition Strategy, and Integrated Master Schedule."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Program support through Milestone C including all acquisition documentation requirements such as Clinger Cohen Act, Acquisition Strategy and IMS, Production and sustainment planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Intelligence Broadcast Receiver (IBR): Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.167"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed Tactical Receive Segment (TRS) software beta testing and program support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.987"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate interoperability software certification for Tactical Receive Segment (TRS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue interoperability software certification for Tactical Receive Segment (TRS)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Tactical Exploitation of National Capabilities (TENCAP): Product Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.458"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided program management and support for the evaluation of emerging national and Intelligence Community technologies applicability to the operating forces. Conducted technical assessments through field user evaluations of innovative technological capabilities for assessment of insertion into the Marine Corps Intelligence, Surveillance, and Reconnaissance Enterprise (MCISRE). Continued to support operational planning and enhanced Operating Force capabilities to utilize technology innovation within the MAGTF ISR architecture. Continued training and education efforts by providing the operating forces with simulation, visualization, and improved mission planning capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.629"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide program management and support for the evaluation of innovative Intelligence Community and national intelligence systems applicability to the Operating Forces. Conduct technical assessments and field utility evaluations for the integration of current and emerging intelligence capabilities into the tactical decision making process. Continue to support operational planning and enhance Operating Force capabilities through development of advanced technologies for the Marine Corps Intelligence, Surveillance, and Reconnaissance Enterprise (MCISRE) architecture. Continue training and education efforts by providing the Operating Forces with supported simulation, visualization, and improved mission planning capabilities. Supports the Congressionally mandated TENCAP office and ongoing activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.225"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.225"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support to program management of the Marine Corps TENCAP program for the evaluation of innovative Intelligence Community and national intelligence systems applicability to the Operating Forces.  Provide Subject Matter Experts and project management support for the execution of technical assessments and field utility evaluations for the integration of current and emerging intelligence capabilities into the tactical decision making process. Continue to support operational planning and enhance Operating Force capabilities through the identification and development of advanced technologies for the Marine Corps Intelligence, Surveillance, and Reconnaissance Enterprise (MCISRE) architecture. Continue training and education efforts by providing the Operating Forces with supported simulation, visualization, and improved mission planning capabilities.  Supports the Congressionally mandated TENCAP office and all associated ongoing activities, to include the interactions with national agencies, the Intelligence Community, research laboratories, private industry, and academia."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "*Tactical Exploitation of National Capabilities (TENCAP):  Technical Assessments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted research and development, advanced technology demonstrations, and integration of emerging technologies into the Marine Corps Intelligence, Surveillance, and Reconnaissance Enterprise (MCISR-E). Conducted technical assessments of innovative national data receipt and dissemination capabilities for insertion into the MCISR-E. Coordinated with national agencies and laboratories, such as the Office of Naval Research, for exploration of collaborative S&T\/R&D efforts to bring evolutionary intelligence capabilities to the Operating Forces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research and development, advanced technology demonstrations, and integration of emerging technologies into Marine Corps Intelligence, Surveillance, and Reconnaissance Enterprise (MCISRE). Conduct technical assessments and field utility evaluations of innovative capabilities for evaluating insertion into the MCISRE. Coordinate with Services, national agencies, laboratories, industry, and academia for exploration of collaborative S&T\/R&D efforts to integrate intelligence capabilities into existing and future Operating Force systems and architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate and assesses emerging intelligence technologies for applicability to USMC needs and requirements.  Conduct technical assessments and field utility evaluations of innovative capabilities for evaluating insertion into the MCISRE.  Conduct research and development, advanced technology demonstrations, and integration of emerging technologies into the Marine Corps Intelligence, Surveillance, and Reconnaissance Enterprise (MCISRE). Coordinate with Services, national agencies, laboratories, industry, and academia for exploration of collaborative S&T\/R&D efforts to integrate intelligence capabilities into existing and future Operating Force systems and architectures."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PMC\/474711"
                                    },
                                    "Title": {
                                        "val": "TPCS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.502"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "4.502"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/700002"
                                    },
                                    "Title": {
                                        "val": "IER SPARES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.001"
                                        },
                                        "CurrentYear": {
                                            "val": "0.138"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.139"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474732"
                                    },
                                    "Title": {
                                        "val": "IER"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.171"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.041"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474752"
                                    },
                                    "Title": {
                                        "val": "IBR"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.707"
                                        },
                                        "CurrentYear": {
                                            "val": "1.134"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.053"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.024"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.028"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.026"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474705"
                                    },
                                    "Title": {
                                        "val": "TRSS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "7.749"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.036"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.035"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.034"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/700003"
                                    },
                                    "Title": {
                                        "val": "TRSS SPARES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.140"
                                        },
                                        "CurrentYear": {
                                            "val": "0.144"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.064"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.065"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.066"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/700005"
                                    },
                                    "Title": {
                                        "val": "MSIDS SPARES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.427"
                                        },
                                        "CurrentYear": {
                                            "val": "0.185"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.100"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474703"
                                    },
                                    "Title": {
                                        "val": "TCAC"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.371"
                                        },
                                        "CurrentYear": {
                                            "val": "0.202"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.226"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.226"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.229"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.939"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.521"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.402"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474707"
                                    },
                                    "Title": {
                                        "val": "SCI COMMS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "11.660"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.210"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.210"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.200"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.200"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.235"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.239"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474713"
                                    },
                                    "Title": {
                                        "val": "RREP"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.871"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "5.871"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474717"
                                    },
                                    "Title": {
                                        "val": "MSIDS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.380"
                                        },
                                        "CurrentYear": {
                                            "val": "4.820"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474719"
                                    },
                                    "Title": {
                                        "val": "JSTARS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.057"
                                        },
                                        "CurrentYear": {
                                            "val": "3.109"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "7.166"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474721"
                                    },
                                    "Title": {
                                        "val": "TSCS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "13.849"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.468"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.468"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.463"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.096"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.232"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.666"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474714"
                                    },
                                    "Title": {
                                        "val": "CESAS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "2.272"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.250"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.250"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.701"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.253"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474761"
                                    },
                                    "Title": {
                                        "val": "IAS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.909"
                                        },
                                        "CurrentYear": {
                                            "val": "8.632"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.122"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.122"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.615"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.970"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.990"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.212"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/700000"
                                    },
                                    "Title": {
                                        "val": "IAS SPARES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.099"
                                        },
                                        "CurrentYear": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.101"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.101"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.104"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.157"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.160"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.163"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/700004"
                                    },
                                    "Title": {
                                        "val": "SCI COMMS SPARES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.100"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.700"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.700"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.800"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/474709"
                                    },
                                    "Title": {
                                        "val": "CIHEP"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.520"
                                        },
                                        "CurrentYear": {
                                            "val": "9.494"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.582"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.582"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.211"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.247"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.352"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.031"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Tactical Signal Intelligence (SIGINT) Collection System (TSCS)(MCPC 120514) incorporates Team Portable Collection System (TPCS)(MCPC 121498) and Radio Reconnaissance Equipment Program (RREP)(MCPC 122498) into a single program beginning in FY 2014."
                        },
                        "AcquisitionStrategy": {
                            "val": "(U) ACQUISITION STRATEGY SCI COMMS:  Procure and continuously improve USMC TROJAN SPIRIT systems to meet evolving Marine Corps operational needs while maintaining interoperability with the Army TROJAN Network and maintaining, as closely as practical, configuration common to the Army TROJAN SPIRIT systems.\n\n(U) ACQUISITION STRATEGY TCAC:  The acquisition of components for the TCAC will maximize the use of existing equipment, NDI\/COTS\/GFE equipment\/software. \n\n(U) ACQUISITION STRATEGY JSTARS:  JSTARS will use ongoing Distributed Common Ground System - Marine Corps (DCGS-MC) contracts for continued development of a future Ground Moving Target Indicator (GMTI) capability. \n\t\t\t\t\n(U) ACQUISITION STRATEGY TRSS:  TRSS makes maximum use of COTS, GOTS and NDI with Firm Fixed Price Production.\n\n(U) ACQUISITION STRATEGY TPCS:  TPCS will make incremental improvements through maximum use of COTS, GOTS and NDI with Firm Fixed Price production.\t\n\n(U) ACQUISITION STRATEGY WFVPS:  FY14 program close-out.\n\n(U) ACQUISITION STRATEGY MSIDS:  MSIDS makes maximum use of COTS, GOTS and NDI with Firm Fixed Price Production.\n\n(U) ACQUISITION STRATEGY IER:  IER makes maximum use of COTS, GOTS and NDI with Firm Fixed Price Production.\n\n(U) ACQUISITION STRATEGY IAS:  IAS makes maximum use of COTS, GOTS and NDI with Firm Fixed Price Production.\n\n(U) ACQUISITION STRATEGY RREP:  RREP makes maximum use of COTS, GOTS and NDI with Firm Fixed Price Production.\n\n(U) ACQUISITION STRATEGY CIHEP:  CIHEP makes maximum use of COTS, GOTS and NDI with Firm Fixed Price Production.\n\n(U) ACQUISITION STRATEGY IBR:  IBR software upgrades are developed at Naval laboratories and integrated into the system.\n\n(U) ACQUISITION STRATEGY TENCAP:  All work will be led in-house and necessary contractor support will be acquired using existing contracts. Research, test and integrate new technology and conduct advanced technology demonstrations to identify the most appropriate programs which are mature for integration of emerging technologies into the Marine Corps Intelligence, Surveillance, and Reconnaissance Enterprise (MCISR-E).  \n\n(U) ACQUISITION STRATEGY CESAS:  CESAS II development will consist of COTS and NDI integration into an existing GOTS architecture. Integration efforts will be conducted at Naval laboratories.\n\n(U) ACQUISITION STRATEGY Tactical Signal Intelligence (SIGINT) Collection System (TSCS): TSCS makes maximum use of COTS, GOTS and NDI with Firm Fixed Price Production."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0206625M_2272_FILE1.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0206625M_2272_FILE2.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0206625M_2272_FILE3.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0206625M_2272_FILE4.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0206625M_2272_FILE6.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0206625M_2272_FILE9.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0206625M_2272_FILE10.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0206625M_2272_FILE14.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0206625M_2272_FILE15.JPG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}