{
    "id": "e101c764cde87d945db85e18ec34c44127d950a4",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA3_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603606A"
        },
        "ProgramElementTitle": {
            "val": "Landmine Warfare and Barrier Advanced Technology"
        },
        "R1LineNumber": {
            "val": "48"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "24.448"
            },
            "CurrentYear": {
                "val": "22.794"
            },
            "BudgetYearOne": {
                "val": "13.074"
            },
            "BudgetYearOneBase": {
                "val": "13.074"
            },
            "BudgetYearTwo": {
                "val": "14.095"
            },
            "BudgetYearThree": {
                "val": "17.056"
            },
            "BudgetYearFour": {
                "val": "16.770"
            },
            "BudgetYearFive": {
                "val": "16.761"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 decrease attributed to Congressional General Reductions (-46 thousand); SBIR\/STTR trabsfers (-582 thousand); and Sequestration reductions (-2.128 million)\nFY15 funding realigned to support higher Army priorities."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures components, subsystems and demonstrates sensor and neutralization technologies that can be used by dismounted forces and on ground and\/or air platforms to detect, identify and then mitigate the effects of landmines, minefields, other explosive hazards and obstacles. This PE also conducts modeling and simulation activities to assess the effectiveness of detection and neutralization concepts. Project 608 supports the maturation and demonstration of enabling component and subsystems for counter explosive hazards and countermine technologies in the areas of countermine and barrier development and Project 683 funds efforts on area denial sensors.  \n\nWork in this PE is fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602622A (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602712A (Countermine Systems), PE 0602784A (Military Engineering Technology), PE 0603004 (Weapons and Munitions Advances Technologies), PE 0603270 (Electronic Warfare Technology) and PE 0603710A (Night Vision Advanced Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.204"
                },
                "CurrentYear": {
                    "val": "22.806"
                },
                "BudgetYearOne": {
                    "val": "24.018"
                },
                "BudgetYearOneBase": {
                    "val": "24.018"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.448"
                },
                "CurrentYear": {
                    "val": "22.794"
                },
                "BudgetYearOne": {
                    "val": "13.074"
                },
                "BudgetYearOneBase": {
                    "val": "13.074"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.756"
                },
                "CurrentYear": {
                    "val": "-0.012"
                },
                "BudgetYearOne": {
                    "val": "-10.944"
                },
                "BudgetYearOneBase": {
                    "val": "-10.944"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.046"
                    },
                    "CurrentYear": {
                        "val": "-0.012"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.582"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-10.944"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.944"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.128"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "608"
                    },
                    "ProjectTitle": {
                        "val": "Countermine & Bar Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.188"
                        },
                        "CurrentYear": {
                            "val": "22.794"
                        },
                        "BudgetYearOne": {
                            "val": "13.074"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.074"
                        },
                        "BudgetYearTwo": {
                            "val": "14.095"
                        },
                        "BudgetYearThree": {
                            "val": "17.056"
                        },
                        "BudgetYearFour": {
                            "val": "16.770"
                        },
                        "BudgetYearFive": {
                            "val": "16.761"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates counter explosive hazard technologies for finding and neutralizing surface and buried threats in varying vegetation, soil, weather and diurnal conditions. Activities include remote\/standoff detection of individual explosive hazards and minefields and neutralization of explosive threats, landmines and minefields. This project also evaluates airborne explosive hazard detection sensors and fabricates them for lightweight plug-and-play use, on manned and Unmanned Aerial Systems (UASs) in mission specific applications. Efforts are supported by modeling and simulation assessments to define potential system effectiveness.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nThis project supports Army science and technology efforts in the Ground, Soldier, Air and Command, Control, Communications and Intelligence portfolios. \n\nWork in this project is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Ft. Belvoir, VA. Minefield neutralization efforts are closely coordinated with Navy\/US Marine Corps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Explosive Hazard Detection for Manned and Unmanned Aerial Systems"
                                    },
                                    "Description": {
                                        "val": "This effort provides manned and unmanned aerial systems (UASs) the capability to detect explosive threats, threat deployment activities, minefields and Home Made Explosives (HME)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.210"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated and integrated a specialized sensor meeting size, weight and power (SWaP) requirements for the Pointer Upgraded Mission Ability (PUMA) small unmanned aerial vehicle (SUAV); matured and integrated baseline algorithm and threat cueing approaches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.399"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate the performance of the specialized sensor integrated on the PUMA SUAV in a relevant environment; validate and test the compatibility of the multi-spectral sensor developed for the Shadow Tactical Unmanned Aerial Vehicle (TUAV) with the communications architecture of the airframe and ground station."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Vehicle Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This project improves detection of buried low metal\/low contrast explosive threats, such as Improvised Explosive Devices (IEDs) and antitank landmines, and increases Rates of Advance (RoA). Improving the signal to noise ratio and acquisition rates reduces susceptibility to electromagnetic interference and improves the interoperability with electronic countermeasures, while continuing to improve detection and reduce false alarms. Currently, Ground Penetrating Radar (GPR) capabilities for detection of explosive threats in an electronic warfare environment are limited by radar receiver technology and detection latency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated a ground vehicle based, three-band infrared sensor prototype and integrated it onto a representative route clearance patrol vehicle; implemented baseline algorithm and threat cueing approaches.  Conducted bench-level tests and collected initial field data with the first multi-channel prototype digital GPR receiver array; incorporated technical improvements into the GPR design; built and began evaluation of a full size four-panel GPR array; began maturation of new target detection algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.378"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and demonstrate performance of initial full size four-panel digital GPR array with greater detection; integrate and demonstrate performance of ground vehicle based, forward looking electro-optical\/infrared sensor; mature sensor fusion algorithms and cueing techniques to enable handoff of potential in-road threats detected in front of the vehicle to the on-board digital GPR for confirmation of threat locations to enable increased rates of advance during route clearance operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.060"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.060"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a digital GPR array in a militarily relevant environment and evaluate detection performance against buried threat devices with and without presence of electronic countermeasures; integrate ground vehicle based, forward looking electro-optical\/infrared sensor on a military vehicle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This effort matures, fabricates and evaluates lab demonstrators based on two different technologies to improve dismounted forces' capability to detect IEDs and landmines. This effort develops an illumination capability and modifies target detection algorithms for integration into current demonstrator digital goggles. This helmet mounted capability will aid the dismounted forces as they execute route clearance missions by improving detection of command initiation wires, trip wires and indicators of IED emplacement such as disturbed earth. A next generation handheld explosive hazard detector technology will also be developed and matured with improved IED detection capabilities and SWaP characteristics. The next generation handheld detector technology may be inserted into the current AN\/PSS-14 Mine Detector as an upgrade or may be a new handheld detector."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.930"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted a forward operational assessment with the modified digital goggle demonstrators integrated during the Threat\/Mine Detection for In Road Obstacles project; collected field data, evaluated performance and addressed Soldier feedback for additional hardware and detection algorithm development. Integrated novel hand held GPR and wideband metal detectors into demonstrators for data collections and explosive hazard detection algorithm improvements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.017"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Collect data in relevant environments using an improved digital night vision goggle with a new counter IED mode demonstrator and optimize target detection algorithms; demonstrate performance low\/no-metal hand held buried explosive hazard detector against realistic IED and mine targets (including both metallic, non-metallic and command wire threat components) by integrating metal detector and ground penetrating radar technologies into a single system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.014"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.014"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate advanced handheld GPR antenna and improved wideband metal detection coils and collect data in field conditions for development of improved target detection algorithms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "683"
                    },
                    "ProjectTitle": {
                        "val": "Area Denial Sensors"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.260"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates surveillance, command and control technology components for alternative area protection systems that minimize the risk of injury or loss to non-combatants from exposure to anti-personnel landmines (APLs). The technology includes distributed personnel surveillance systems and command and control systems to be used with man-in-the-loop overwatch fires. This project uses modeling and simulation to evaluate new concepts and modify doctrine. This project also fabricates components, as well as system architectures and conducts evaluations at the system level in field settings.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nThis project supports Army science and technology efforts in the Ground and Command, Control, Communications and Intelligence portfolios. \n\nWork in this project is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Area Denial Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort provides demonstration of surveillance technology components for area protection systems that minimize the risk of injury or loss to non-combatants from exposure to anti-personnel landmines (APLs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.260"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a remote low power infrared system to search and track personnel with 360 degree coverage; extended algorithms and sensors to include vehicle detection and track; developed a cued day\/night imaging sensor system with algorithms for automated detection and image capture."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}